//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _BTN_CMD_DATA_REG_H_
#define _BTN_CMD_DATA_REG_H_

#define BTN_UM_INT_STS                           0x00000000
#define   HMB_WR_DTAG_RCYC_MASK                  0x20000000
#define   HMB_WR_DTAG_RCYC_SHIFT                         29
#define   HMB_RD_DATA_BACK_MASK                  0x10000000
#define   HMB_RD_DATA_BACK_SHIFT                         28
#define   NVM_RLS_QUE_FULL_MASK                  0x08000000
#define   NVM_RLS_QUE_FULL_SHIFT                         27
#define   NVM_CMD_QUE_FULL_MASK                  0x04000000
#define   NVM_CMD_QUE_FULL_SHIFT                         26
#define   DTAG_LINKLIST_OVERFLOW_MASK            0x02000000
#define   DTAG_LINKLIST_OVERFLOW_SHIFT                   25
#define   DATA_ENTRY_QUEUE_FULL_MASK             0x01000000
#define   DATA_ENTRY_QUEUE_FULL_SHIFT                    24
#define   DATA_ERR_LL_NOT_EMPTY_MASK             0x00400000
#define   DATA_ERR_LL_NOT_EMPTY_SHIFT                    22
#define   RD_DTAG_REQS_PENDING_MASK              0x00200000
#define   RD_DTAG_REQS_PENDING_SHIFT                     21
#define   WR_DTAG_REQS_PENDING_MASK              0x00100000
#define   WR_DTAG_REQS_PENDING_SHIFT                     20
#define   SRAM_PARITYERROR_DET_MASK              0x00040000
#define   SRAM_PARITYERROR_DET_SHIFT                     18
#define   SRAM_ECC_ERROR_DET_MASK                0x00020000
#define   SRAM_ECC_ERROR_DET_SHIFT                       17
#define   AXI_DATA_PARITY_ERROR_MASK             0x00010000
#define   AXI_DATA_PARITY_ERROR_SHIFT                    16
#define   TBL_CTRL_PROCESS_DONE_MASK             0x00004000
#define   TBL_CTRL_PROCESS_DONE_SHIFT                    14
#define   REV_NVM_WR_CMD_RLS_MASK                0x00002000
#define   REV_NVM_WR_CMD_RLS_SHIFT                       13
#define   REV_NVM_RD_CMD_RLS_MASK                0x00001000
#define   REV_NVM_RD_CMD_RLS_SHIFT                       12
#define   BTN_DATA_PROCESS_DONE_MASK             0x00000800
#define   BTN_DATA_PROCESS_DONE_SHIFT                    11
#define   COM_FREE_DTAG_UPDATE_MASK              0x00000400
#define   COM_FREE_DTAG_UPDATE_SHIFT                     10
#define   FW_RDATA_GROUP1_PROC_MASK              0x00000200
#define   FW_RDATA_GROUP1_PROC_SHIFT                      9
#define   FW_RDATA_GROUP0_PROC_MASK              0x00000100
#define   FW_RDATA_GROUP0_PROC_SHIFT                      8
#define   RD_DATA_GROUP1_UPDATE_MASK             0x00000080
#define   RD_DATA_GROUP1_UPDATE_SHIFT                     7
#define   RD_DATA_GROUP0_UPDATE_MASK             0x00000040
#define   RD_DATA_GROUP0_UPDATE_SHIFT                     6
#define   WR_DATA_GROUP1_UPDATE_MASK             0x00000020
#define   WR_DATA_GROUP1_UPDATE_SHIFT                     5
#define   WR_DATA_GROUP0_UPDATE_MASK             0x00000010
#define   WR_DATA_GROUP0_UPDATE_SHIFT                     4
#define   NVM_CMD_QUE3_HAS_CMD_MASK              0x00000008
#define   NVM_CMD_QUE3_HAS_CMD_SHIFT                      3
#define   NVM_CMD_QUE2_HAS_CMD_MASK              0x00000004
#define   NVM_CMD_QUE2_HAS_CMD_SHIFT                      2
#define   NVM_CMD_QUE1_HAS_CMD_MASK              0x00000002
#define   NVM_CMD_QUE1_HAS_CMD_SHIFT                      1
#define   NVM_CMD_QUE0_HAS_CMD_MASK              0x00000001
#define   NVM_CMD_QUE0_HAS_CMD_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 nvm_cmd_que0_has_cmd:1;
        u32 nvm_cmd_que1_has_cmd:1;
        u32 nvm_cmd_que2_has_cmd:1;
        u32 nvm_cmd_que3_has_cmd:1;
        u32 wr_data_group0_update:1;
        u32 wr_data_group1_update:1;
        u32 rd_data_group0_update:1;
        u32 rd_data_group1_update:1;
        u32 fw_rdata_group0_proc:1;
        u32 fw_rdata_group1_proc:1;
        u32 com_free_dtag_update:1;
        u32 btn_data_process_done:1;
        u32 rev_nvm_rd_cmd_rls:1;
        u32 rev_nvm_wr_cmd_rls:1;
        u32 tbl_ctrl_process_done:1;
        u32 rsvd_15:1;
        u32 axi_data_parity_error:1;
        u32 sram_ecc_error_det:1;
        u32 sram_parityerror_det:1;
        u32 rsvd_19:1;
        u32 wr_dtag_reqs_pending:1;
        u32 rd_dtag_reqs_pending:1;
        u32 data_err_ll_not_empty:1;
        u32 rsvd_23:1;
        u32 data_entry_queue_full:1;
        u32 dtag_linklist_overflow:1;
        u32 nvm_cmd_que_full:1;
        u32 nvm_rls_que_full:1;
        u32 hmb_rd_data_back:1;
        u32 hmb_wr_dtag_rcyc:1;
        u32 rsvd_30:2;
    } b;
} btn_um_int_sts_t;

#define BTN_INT_MASK0                            0x00000004
#define   BTN_INT_MASK0_MASK                     0xffffffff
#define   BTN_INT_MASK0_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 btn_int_mask0:32;
    } b;
} btn_int_mask0_t;

#define BTN_MK_INT_STS0                          0x00000008
#define   BTN_MK_INT_STS0_MASK                   0xffffffff
#define   BTN_MK_INT_STS0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 btn_mk_int_sts0:32;
    } b;
} btn_mk_int_sts0_t;

#define BTN_INT_MASK1                            0x0000000c
#define   BTN_INT_MASK1_MASK                     0xffffffff
#define   BTN_INT_MASK1_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 btn_int_mask1:32;
    } b;
} btn_int_mask1_t;

#define BTN_MK_INT_STS1                          0x00000010
#define   BTN_MK_INT_STS1_MASK                   0xffffffff
#define   BTN_MK_INT_STS1_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 btn_mk_int_sts1:32;
    } b;
} btn_mk_int_sts1_t;

#define BTN_INT_MASK2                            0x00000014
#define   BTN_INT_MASK2_MASK                     0xffffffff
#define   BTN_INT_MASK2_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 btn_int_mask2:32;
    } b;
} btn_int_mask2_t;

#define BTN_MK_INT_STS2                          0x00000018
#define   BTN_MK_INT_STS2_MASK                   0xffffffff
#define   BTN_MK_INT_STS2_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 btn_mk_int_sts2:32;
    } b;
} btn_mk_int_sts2_t;

#define BTN_INT_MASK3                            0x0000001c
#define   BTN_INT_MASK3_MASK                     0xffffffff
#define   BTN_INT_MASK3_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 btn_int_mask3:32;
    } b;
} btn_int_mask3_t;

#define BTN_MK_INT_STS3                          0x00000020
#define   BTN_MK_INT_STS3_MASK                   0xffffffff
#define   BTN_MK_INT_STS3_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 btn_mk_int_sts3:32;
    } b;
} btn_mk_int_sts3_t;

#define BTN_CONTROL_REG                          0x00000044
#define   AXI_MAS_XFER_STOP_MASK                 0x80000000
#define   AXI_MAS_XFER_STOP_SHIFT                        31
#define   BTN_DDR_ACCESS_EN_MASK                 0x40000000
#define   BTN_DDR_ACCESS_EN_SHIFT                        30
#define   NCB_WDDR_WAIT_BRSP_MASK                0x00800000
#define   NCB_WDDR_WAIT_BRSP_SHIFT                       23
#define   NVM_WDDR_WAIT_BRSP_MASK                0x00400000
#define   NVM_WDDR_WAIT_BRSP_SHIFT                       22
#define   NCB_WDDR_SZINFO_EN_MASK                0x00200000
#define   NCB_WDDR_SZINFO_EN_SHIFT                       21
#define   NVM_WDDR_SZINFO_EN_MASK                0x00100000
#define   NVM_WDDR_SZINFO_EN_SHIFT                       20
#define   MIX_RD_SINGLE_REQ_MASK                 0x00080000
#define   MIX_RD_SINGLE_REQ_SHIFT                        19
#define   CPU_SRAM_SLVERR_EN_MASK                0x00040000
#define   CPU_SRAM_SLVERR_EN_SHIFT                       18
#define   NVM_WR_WAIT_DONE_DIS_MASK              0x00020000
#define   NVM_WR_WAIT_DONE_DIS_SHIFT                     17
#define   SRAM_ECC_CHECK_EN_MASK                 0x00010000
#define   SRAM_ECC_CHECK_EN_SHIFT                        16
#define   HOST_SECTOR_SIZE_MIX_MASK              0x00002000
#define   HOST_SECTOR_SIZE_MIX_SHIFT                     13
#define   HOST_META_SIZE_MIX_MASK                0x00001000
#define   HOST_META_SIZE_MIX_SHIFT                       12
#define   HOST_META_16BYTE_MASK                  0x00000800
#define   HOST_META_16BYTE_SHIFT                         11
#define   MULTIPLE_NS_ENABLE_MASK                0x00000400
#define   MULTIPLE_NS_ENABLE_SHIFT                       10
#define   HMB_SECTORCRC_EN_MASK                  0x00000200
#define   HMB_SECTORCRC_EN_SHIFT                          9
#define   HMB_DATABUF_EN_MASK                    0x00000100
#define   HMB_DATABUF_EN_SHIFT                            8
#define   DXFR_SRAM_ECC_DIS_MASK                 0x00000080
#define   DXFR_SRAM_ECC_DIS_SHIFT                         7
#define   DATA_CRYPTO_EN_MASK                    0x00000040
#define   DATA_CRYPTO_EN_SHIFT                            6
#define   READ_AUTO_RELEASE_EN_MASK              0x00000010
#define   READ_AUTO_RELEASE_EN_SHIFT                      4
#define   HOST_META_ENBALE_MASK                  0x00000008
#define   HOST_META_ENBALE_SHIFT                          3
#define   HOST_SECTOR_CRC_EN_MASK                0x00000004
#define   HOST_SECTOR_CRC_EN_SHIFT                        2
#define   HOST_SECTOR_SIZE_MASK                  0x00000002
#define   HOST_SECTOR_SIZE_SHIFT                          1
#define   DATA_UNIT_SIZE_MASK                    0x00000001
#define   DATA_UNIT_SIZE_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 data_unit_size:1;
        u32 host_sector_size:1;
        u32 host_sector_crc_en:1;
        u32 host_meta_enbale:1;
        u32 read_auto_release_en:1;
        u32 rsvd_5:1;
        u32 data_crypto_en:1;
        u32 dxfr_sram_ecc_dis:1;
        u32 hmb_databuf_en:1;
        u32 hmb_sectorcrc_en:1;
        u32 multiple_ns_enable:1;
        u32 host_meta_16byte:1;
        u32 host_meta_size_mix:1;
        u32 host_sector_size_mix:1;
        u32 rsvd_14:2;
        u32 sram_ecc_check_en:1;
        u32 nvm_wr_wait_done_dis:1;
        u32 cpu_sram_slverr_en:1;
        u32 mix_rd_single_req:1;
        u32 nvm_wddr_szinfo_en:1;
        u32 ncb_wddr_szinfo_en:1;
        u32 nvm_wddr_wait_brsp:1;
        u32 ncb_wddr_wait_brsp:1;
        u32 rsvd_24:6;
        u32 btn_ddr_access_en:1;
        u32 axi_mas_xfer_stop:1;
    } b;
} btn_control_reg_t;

#define BTN_CTRL_STATUS                          0x00000048
#define   AXI_XFER_STOP_DONE_MASK                0x80000000
#define   AXI_XFER_STOP_DONE_SHIFT                       31
#define   DDR_PIHC_HAZ_CHK_MASK                  0x00800000
#define   DDR_PIHC_HAZ_CHK_SHIFT                         23
#define   DDR_2_REQS_ONLY_MASK                   0x00400000
#define   DDR_2_REQS_ONLY_SHIFT                          22
#define   WR_DU_INFO_DIS_MASK                    0x00200000
#define   WR_DU_INFO_DIS_SHIFT                           21
#define   RD_DU_INFO_DIS_MASK                    0x00100000
#define   RD_DU_INFO_DIS_SHIFT                           20
#define   NCB_WR_REQUEST_TOP_MASK                0x00080000
#define   NCB_WR_REQUEST_TOP_SHIFT                       19
#define   NVM_WR_REQUEST_TOP_MASK                0x00040000
#define   NVM_WR_REQUEST_TOP_SHIFT                       18
#define   FW_PSH_RQUE_WHEN_FULL_MASK             0x00020000
#define   FW_PSH_RQUE_WHEN_FULL_SHIFT                    17
#define   FW_PSH_RLL_WHEN_FULL_MASK              0x00010000
#define   FW_PSH_RLL_WHEN_FULL_SHIFT                     16
#define   BTN_DDR_TEST_MODE_MASK                 0x00008000
#define   BTN_DDR_TEST_MODE_SHIFT                        15
#define   REPORT_POISON_DIS_MASK                 0x00004000
#define   REPORT_POISON_DIS_SHIFT                        14
#define   NCBW_RLL_FULL_ENABLE_MASK              0x00002000
#define   NCBW_RLL_FULL_ENABLE_SHIFT                     13
#define   NVMW_WLL_FULL_ENABLE_MASK              0x00001000
#define   NVMW_WLL_FULL_ENABLE_SHIFT                     12
#define   DISAB_HCRC_SEED_INCR_MASK              0x00000800
#define   DISAB_HCRC_SEED_INCR_SHIFT                     11
#define   FORCE_HCRC_SEED_ZERO_MASK              0x00000400
#define   FORCE_HCRC_SEED_ZERO_SHIFT                     10
#define   MEM_TFPMC1_MASK                         0x000003f8
#define   MEM_TFPMC1_SHIFT                                 3
#define   MEM_LOWPOWER_MODE_MASK                 0x00000004
#define   MEM_LOWPOWER_MODE_SHIFT                         2
#define   MEM_LOWPOWER_EN_MASK                   0x00000002
#define   MEM_LOWPOWER_EN_SHIFT                           1
#define   BTN_CLOCK_GATE_EN_MASK                 0x00000001
#define   BTN_CLOCK_GATE_EN_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 btn_clock_gate_en:1;
        u32 mem_lowpower_en:1;
        u32 mem_lowpower_mode:1;
        u32 mem_tfpmc:7;
        u32 force_hcrc_seed_zero:1;
        u32 disab_hcrc_seed_incr:1;
        u32 nvmw_wll_full_enable:1;
        u32 ncbw_rll_full_enable:1;
        u32 report_poison_dis:1;
        u32 btn_ddr_test_mode:1;
        u32 fw_psh_rll_when_full:1;
        u32 fw_psh_rque_when_full:1;
        u32 nvm_wr_request_top:1;
        u32 ncb_wr_request_top:1;
        u32 rd_du_info_dis:1;
        u32 wr_du_info_dis:1;
        u32 ddr_2_reqs_only:1;
        u32 ddr_pihc_haz_chk:1;
        u32 rsvd_24:7;
        u32 axi_xfer_stop_done:1;
    } b;
} btn_ctrl_status_t;

#define BTN_ERROR_STATUS                         0x0000004c
#define   L2P_RD_DDR_PAR_ERR_MASK                0x40000000
#define   L2P_RD_DDR_PAR_ERR_SHIFT                       30
#define   NCB_RD_DDR_PAR_ERR_MASK                0x20000000
#define   NCB_RD_DDR_PAR_ERR_SHIFT                       29
#define   NVM_RD_DDR_PAR_ERR_MASK                0x10000000
#define   NVM_RD_DDR_PAR_ERR_SHIFT                       28
#define   WMIX_SRAM_PAR_ERR_MASK                 0x01000000
#define   WMIX_SRAM_PAR_ERR_SHIFT                        24
#define   RMIX_SRAM_PAR_ERR_MASK                 0x00800000
#define   RMIX_SRAM_PAR_ERR_SHIFT                        23
#define   BDAT_SRAM_PAR_ERR_MASK                 0x00400000
#define   BDAT_SRAM_PAR_ERR_SHIFT                        22
#define   DPE_SRAM_PAR_ERR_MASK                  0x00200000
#define   DPE_SRAM_PAR_ERR_SHIFT                         21
#define   WBUF_SRAM_PAR_ERR_MASK                 0x00100000
#define   WBUF_SRAM_PAR_ERR_SHIFT                        20
#define   RBUF_SRAM_PAR_ERR_MASK                 0x00080000
#define   RBUF_SRAM_PAR_ERR_SHIFT                        19
#define   DTAG_SRAM_PAR_ERR_MASK                 0x00040000
#define   DTAG_SRAM_PAR_ERR_SHIFT                        18
#define   SRAM_WR_ECC_ERR_MASK                   0x00020000
#define   SRAM_WR_ECC_ERR_SHIFT                          17
#define   SRAM_RD_ECC_ERR1_MASK                   0x00010000
#define   SRAM_RD_ECC_ERR1_SHIFT                          16
#define   HMB_DATA_TAG_ERROR_MASK                0x00000800
#define   HMB_DATA_TAG_ERROR_SHIFT                       11
#define   NVM_RD_HCRC_ERROR_MASK                 0x00000400
#define   NVM_RD_HCRC_ERROR_SHIFT                        10
#define   WR_DATA_ENTRY_ERROR_MASK               0x00000200
#define   WR_DATA_ENTRY_ERROR_SHIFT                       9
#define   RD_DATA_ENTRY_ERROR_MASK               0x00000100
#define   RD_DATA_ENTRY_ERROR_SHIFT                       8
#define   WR_ENTRY_UPDT_Q_FULL_MASK              0x00000080
#define   WR_ENTRY_UPDT_Q_FULL_SHIFT                      7
#define   RD_ENTRY_UPDT_Q_FULL_MASK              0x00000040
#define   RD_ENTRY_UPDT_Q_FULL_SHIFT                      6
#define   WR_ENTRY_LLIST_OVERFLOW_MASK           0x00000020
#define   WR_ENTRY_LLIST_OVERFLOW_SHIFT                   5
#define   RD_ENTRY_LLIST_OVERFLOW_MASK           0x00000010
#define   RD_ENTRY_LLIST_OVERFLOW_SHIFT                   4
#define   BTN_AXI_BUS_PARITY_ERR_MASK            0x00000002
#define   BTN_AXI_BUS_PARITY_ERR_SHIFT                    1
#define   BTN_AXI_POISON_BIT_SET_MASK            0x00000001
#define   BTN_AXI_POISON_BIT_SET_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_axi_poison_bit_set:1;
        u32 btn_axi_bus_parity_err:1;
        u32 rsvd_2:2;
        u32 rd_entry_llist_overflow:1;
        u32 wr_entry_llist_overflow:1;
        u32 rd_entry_updt_q_full:1;
        u32 wr_entry_updt_q_full:1;
        u32 rd_data_entry_error:1;
        u32 wr_data_entry_error:1;
        u32 nvm_rd_hcrc_error:1;
        u32 hmb_data_tag_error:1;
        u32 rsvd_12:4;
        u32 sram_rd_ecc_err:1;
        u32 sram_wr_ecc_err:1;
        u32 dtag_sram_par_err:1;
        u32 rbuf_sram_par_err:1;
        u32 wbuf_sram_par_err:1;
        u32 dpe_sram_par_err:1;
        u32 bdat_sram_par_err:1;
        u32 rmix_sram_par_err:1;
        u32 wmix_sram_par_err:1;
        u32 rsvd_25:3;
        u32 nvm_rd_ddr_par_err:1;
        u32 ncb_rd_ddr_par_err:1;
        u32 l2p_rd_ddr_par_err:1;
        u32 rsvd_31:1;
    } b;
} btn_error_status_t;

#define BTN_SRAM_ECC_ERR_STS                     0x00000050
#define   BTN_SRAM_SB_FIX_CNT_MASK               0x0fff0000
#define   BTN_SRAM_SB_FIX_CNT_SHIFT                      16
#define   BTN_SRAM_ECC_ERR_LOC_MASK              0x0000ffff
#define   BTN_SRAM_ECC_ERR_LOC_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 btn_sram_ecc_err_loc:16;
        u32 btn_sram_sb_fix_cnt:12;
        u32 rsvd_28:4;
    } b;
} btn_sram_ecc_err_sts_t;

#define RD_HCRC_ERR_DATA                         0x00000054
#define   BTN_REV_HCRC_DATA_MASK                 0xffff0000
#define   BTN_REV_HCRC_DATA_SHIFT                        16
#define   BTN_CAL_HCRC_DATA_MASK                 0x0000ffff
#define   BTN_CAL_HCRC_DATA_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 btn_cal_hcrc_data:16;
        u32 btn_rev_hcrc_data:16;
    } b;
} rd_hcrc_err_data_t;

#define DXFR_SRAM_ECC_STS                        0x00000058
#define   DXFR_SRAM_ECC_1BIT_CNT_MASK            0x00000ff0
#define   DXFR_SRAM_ECC_1BIT_CNT_SHIFT                    4
#define   DXFR_SRAM_ECC_2BIT_ERR_MASK            0x0000000f
#define   DXFR_SRAM_ECC_2BIT_ERR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 dxfr_sram_ecc_2bit_err:4;
        u32 dxfr_sram_ecc_1bit_cnt:8;
        u32 rsvd_12:20;
    } b;
} dxfr_sram_ecc_sts_t;

#define INTER_DBG_STS_SELECT                     0x00000060
#define   INTER_DBG_STS_SELECT_MASK              0x0000000f
#define   INTER_DBG_STS_SELECT_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 inter_dbg_sts_select:4;
        u32 rsvd_4:28;
    } b;
} inter_dbg_sts_select_t;

#define SELECTED_INTER_DBG_STS                   0x00000064
#define   SELECTED_INTER_DBG_STS_MASK            0xffffffff
#define   SELECTED_INTER_DBG_STS_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 selected_inter_dbg_sts:32;
    } b;
} selected_inter_dbg_sts_t;

#define BTN_CTAG_POINTERS                        0x0000006c
#define   BTN_CTAG_POINTERS_MASK                 0x0003ffff
#define   BTN_CTAG_POINTERS_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 btn_ctag_pointers:18;
        u32 rsvd_18:14;
    } b;
} btn_ctag_pointers_t;

#define WR_SEMISTRM_CTRL_STATUS                  0x00000070
#define   POP_SRAMCOPY_TAG_DATA_MASK             0x001ff000
#define   POP_SRAMCOPY_TAG_DATA_SHIFT                    12
#define   FW_POP_SRAMCOPY_TAG_MASK               0x00000800
#define   FW_POP_SRAMCOPY_TAG_SHIFT                      11
#define   SRAMCOPY_TAG_OST_NUM_MASK              0x00000300
#define   SRAMCOPY_TAG_OST_NUM_SHIFT                      8
#define   SEMISTRM_DTAG_LL1_EN_MASK              0x00000020
#define   SEMISTRM_DTAG_LL1_EN_SHIFT                      5
#define   SEMISTRM_DTAG_LL0_EN_MASK              0x00000010
#define   SEMISTRM_DTAG_LL0_EN_SHIFT                      4
#define   WAIT_SRAMCOPY_TAG_EN_MASK              0x0000000c
#define   WAIT_SRAMCOPY_TAG_EN_SHIFT                      2
#define   WD_DTAG_HANDLE_TYPE_MASK               0x00000003
#define   WD_DTAG_HANDLE_TYPE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 wd_dtag_handle_type:2;
        u32 wait_sramcopy_tag_en:2;
        u32 semistrm_dtag_ll0_en:1;
        u32 semistrm_dtag_ll1_en:1;
        u32 rsvd_6:2;
        u32 sramcopy_tag_ost_num:2;
        u32 rsvd_10:1;
        u32 fw_pop_sramcopy_tag:1;
        u32 pop_sramcopy_tag_data:9;
        u32 rsvd_21:11;
    } b;
} wr_semistrm_ctrl_status_t;

#define WR_SEMISTRM_LLST0_STATUS                 0x00000074
#define   SEMISTRM_LLIST0_V_CNT_MASK             0x000001ff
#define   SEMISTRM_LLIST0_V_CNT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 semistrm_llist0_v_cnt:9;
        u32 rsvd_9:23;
    } b;
} wr_semistrm_llst0_status_t;

#define WR_SEMISTRM_LLST1_STATUS                 0x00000078
#define   SEMISTRM_LLIST1_V_CNT_MASK             0x000001ff
#define   SEMISTRM_LLIST1_V_CNT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 semistrm_llist1_v_cnt:9;
        u32 rsvd_9:23;
    } b;
} wr_semistrm_llst1_status_t;

#define DTAG_LLIST_CTRL_STATUS                   0x00000080
#define   GC_DTAG_AUTO_RECYC_MASK                0x10000000
#define   GC_DTAG_AUTO_RECYC_SHIFT                       28
#define   RD_STRMBUF_DTAG_FCNT_MASK              0x0e000000
#define   RD_STRMBUF_DTAG_FCNT_SHIFT                     25
#define   DTAG_LL_FREE_ENTRY_CNT_MASK            0x01ff0000
#define   DTAG_LL_FREE_ENTRY_CNT_SHIFT                   16
#define   DATA_TAG_LLIST_FULL_MASK               0x00004000
#define   DATA_TAG_LLIST_FULL_SHIFT                      14
#define   DTAG_LLIST_POP_FAIL_MASK               0x00002000
#define   DTAG_LLIST_POP_FAIL_SHIFT                      13
#define   DTAG_LLIST_POP_VALID_MASK              0x00001000
#define   DTAG_LLIST_POP_VALID_SHIFT                     12
#define   MAX_NUM_SINGLE_LLIST_MASK              0x00000ff0
#define   MAX_NUM_SINGLE_LLIST_SHIFT                      4
#define   RD_STRMBUF_DTAG_ONLY_MASK              0x00000008
#define   RD_STRMBUF_DTAG_ONLY_SHIFT                      3
#define   RD_STRMBUF_DTAG_EN_MASK                0x00000004
#define   RD_STRMBUF_DTAG_EN_SHIFT                        2
#define   RD_DTAG_MIX_EN_MASK                    0x00000002
#define   RD_DTAG_MIX_EN_SHIFT                            1
#define   DATA_TAG_LLIST_EN_MASK                 0x00000001
#define   DATA_TAG_LLIST_EN_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 data_tag_llist_en:1;
        u32 rd_dtag_mix_en:1;
        u32 rd_strmbuf_dtag_en:1;
        u32 rd_strmbuf_dtag_only:1;
        u32 max_num_single_llist:8;
        u32 dtag_llist_pop_valid:1;
        u32 dtag_llist_pop_fail:1;
        u32 data_tag_llist_full:1;
        u32 rsvd_15:1;
        u32 dtag_ll_free_entry_cnt:9;
        u32 rd_strmbuf_dtag_fcnt:3;
        u32 gc_dtag_auto_recyc:1;
        u32 rsvd_29:3;
    } b;
} dtag_llist_ctrl_status_t;

#define DTAG_LLIST_STS_SEL                       0x00000084
#define   NO_0_LLIST_VALID_CNT_MASK              0xff000000
#define   NO_0_LLIST_VALID_CNT_SHIFT                     24
#define   NO_3_LLIST_VALID_CNT_MASK              0x00ff0000
#define   NO_3_LLIST_VALID_CNT_SHIFT                     16
#define   NO_2_LLIST_VALID_CNT_MASK              0x0000ff00
#define   NO_2_LLIST_VALID_CNT_SHIFT                      8
#define   DTAG_LLIST_STS_SEL_MASK                0x0000000f
#define   DTAG_LLIST_STS_SEL_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 dtag_llist_sts_sel:4;
        u32 rsvd_4:4;
        u32 no_2_llist_valid_cnt:8;
        u32 no_3_llist_valid_cnt:8;
        u32 no_0_llist_valid_cnt:8;
    } b;
} dtag_llist_sts_sel_t;

#define DTAG_LLIST_STS_DATA                      0x00000088
#define   DTAG_LLIST_V_COUNT_MASK                0x01ff0000
#define   DTAG_LLIST_V_COUNT_SHIFT                       16
#define   DTAG_LLIST_E_INDEX_MASK                0x0000ff00
#define   DTAG_LLIST_E_INDEX_SHIFT                        8
#define   DTAG_LLIST_S_INDEX_MASK                0x000000ff
#define   DTAG_LLIST_S_INDEX_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 dtag_llist_s_index:8;
        u32 dtag_llist_e_index:8;
        u32 dtag_llist_v_count:9;
        u32 rsvd_25:7;
    } b;
} dtag_llist_sts_data_t;

#define FREE_DTAG_LLIST_PUSH                     0x0000008c
#define   DTAG_LLIST_PUSH_SEL_MASK               0x0f000000
#define   DTAG_LLIST_PUSH_SEL_SHIFT                      24
#define   DTAG_LLIST_PUSH_DATA_MASK              0x00ffffff
#define   DTAG_LLIST_PUSH_DATA_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 dtag_llist_push_data:24;
        u32 dtag_llist_push_sel:4;
        u32 rsvd_28:4;
    } b;
} free_dtag_llist_push_t;

#define FW_ISU_WD_DTAG_BASE                      0x00000090
#define   FW_ISU_WD_DTAG_MXSZ_MASK               0xff000000
#define   FW_ISU_WD_DTAG_MXSZ_SHIFT                      24
#define   FW_ISU_WD_DTAG_BASE_MASK               0x007fffff
#define   FW_ISU_WD_DTAG_BASE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 fw_isu_wd_dtag_base:23;
        u32 rsvd_23:1;
        u32 fw_isu_wd_dtag_mxsz:8;
    } b;
} fw_isu_wd_dtag_base_t;

#define FW_ISU_WD_DTAG_PTRS                      0x00000094
#define   FW_ISU_WD_DTAG_RPTR_MASK               0x0000ff00
#define   FW_ISU_WD_DTAG_RPTR_SHIFT                       8
#define   FW_ISU_WD_DTAG_WPTR_MASK               0x000000ff
#define   FW_ISU_WD_DTAG_WPTR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 fw_isu_wd_dtag_wptr:8;
        u32 fw_isu_wd_dtag_rptr:8;
        u32 rsvd_16:16;
    } b;
} fw_isu_wd_dtag_ptrs_t;

#define FW_WDTAG_RPTR_UPDT_BASE                  0x00000098
#define   FW_WDTAG_RPTR_UPDT_EN_MASK             0x80000000
#define   FW_WDTAG_RPTR_UPDT_EN_SHIFT                    31
#define   FW_WDTAG_RPTR_UPDT_BASE_MASK           0x007fffff
#define   FW_WDTAG_RPTR_UPDT_BASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 fw_wdtag_rptr_updt_base:23;
        u32 rsvd_23:8;
        u32 fw_wdtag_rptr_updt_en:1;
    } b;
} fw_wdtag_rptr_updt_base_t;

#define FW_ISU_FRD_DTAG0_BASE                    0x0000009c
#define   FW_ISU_FRD_DTAG0_MXSZ_MASK             0xff000000
#define   FW_ISU_FRD_DTAG0_MXSZ_SHIFT                    24
#define   FW_ISU_FRD_DTAG0_BASE_MASK             0x007fffff
#define   FW_ISU_FRD_DTAG0_BASE_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 fw_isu_frd_dtag0_base:23;
        u32 rsvd_23:1;
        u32 fw_isu_frd_dtag0_mxsz:8;
    } b;
} fw_isu_frd_dtag0_base_t;

#define FW_ISU_FRD_DTAG0_PTRS                    0x000000a0
#define   FW_ISU_FRD_DTAG0_RPTR_MASK             0x0000ff00
#define   FW_ISU_FRD_DTAG0_RPTR_SHIFT                     8
#define   FW_ISU_FRD_DTAG0_WPTR_MASK             0x000000ff
#define   FW_ISU_FRD_DTAG0_WPTR_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 fw_isu_frd_dtag0_wptr:8;
        u32 fw_isu_frd_dtag0_rptr:8;
        u32 rsvd_16:16;
    } b;
} fw_isu_frd_dtag0_ptrs_t;

#define FW_FRDTAG0_RPTR_UPDT_BASE                0x000000a4
#define   FW_FRDTAG0_RPTR_UPDT_EN_MASK           0x80000000
#define   FW_FRDTAG0_RPTR_UPDT_EN_SHIFT                  31
#define   FW_FRDTAG0_RPTR_UPDT_BASE_MASK         0x007fffff
#define   FW_FRDTAG0_RPTR_UPDT_BASE_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 fw_frdtag0_rptr_updt_base:23;
        u32 rsvd_23:8;
        u32 fw_frdtag0_rptr_updt_en:1;
    } b;
} fw_frdtag0_rptr_updt_base_t;

#define FW_ISU_FRD_DTAG1_BASE                    0x000000a8
#define   FW_ISU_FRD_DTAG1_MXSZ_MASK             0xff000000
#define   FW_ISU_FRD_DTAG1_MXSZ_SHIFT                    24
#define   FW_ISU_FRD_DTAG1_BASE_MASK             0x007fffff
#define   FW_ISU_FRD_DTAG1_BASE_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 fw_isu_frd_dtag1_base:23;
        u32 rsvd_23:1;
        u32 fw_isu_frd_dtag1_mxsz:8;
    } b;
} fw_isu_frd_dtag1_base_t;

#define FW_ISU_FRD_DTAG1_PTRS                    0x000000ac
#define   FW_ISU_FRD_DTAG1_RPTR_MASK             0x0000ff00
#define   FW_ISU_FRD_DTAG1_RPTR_SHIFT                     8
#define   FW_ISU_FRD_DTAG1_WPTR_MASK             0x000000ff
#define   FW_ISU_FRD_DTAG1_WPTR_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 fw_isu_frd_dtag1_wptr:8;
        u32 fw_isu_frd_dtag1_rptr:8;
        u32 rsvd_16:16;
    } b;
} fw_isu_frd_dtag1_ptrs_t;

#define FW_FRDTAG1_RPTR_UPDT_BASE                0x000000b0
#define   FW_FRDTAG1_RPTR_UPDT_EN_MASK           0x80000000
#define   FW_FRDTAG1_RPTR_UPDT_EN_SHIFT                  31
#define   FW_FRDTAG1_RPTR_UPDT_BASE_MASK         0x007fffff
#define   FW_FRDTAG1_RPTR_UPDT_BASE_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 fw_frdtag1_rptr_updt_base:23;
        u32 rsvd_23:8;
        u32 fw_frdtag1_rptr_updt_en:1;
    } b;
} fw_frdtag1_rptr_updt_base_t;

#define DATA_TAG_LLIST_POP                       0x000000b4
#define   DTAG_LLIST_SELECT_MASK                 0x0f000000
#define   DTAG_LLIST_SELECT_SHIFT                        24
#define   DTAG_LLIST_POP_DATA_MASK               0x00ffffff
#define   DTAG_LLIST_POP_DATA_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 dtag_llist_pop_data:24;
        u32 dtag_llist_select:4;
        u32 rsvd_28:4;
    } b;
} data_tag_llist_pop_t;

#define DATA_TAG_LL_INTER_STS                    0x000000b8
#define   DATA_TAG_LL_INTER_STS_MASK             0x0000ffff
#define   DATA_TAG_LL_INTER_STS_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 data_tag_ll_inter_sts:16;
        u32 rsvd_16:16;
    } b;
} data_tag_ll_inter_sts_t;

#define WD_ENTRY_LLIST_CTRL_STATUS               0x000000c0
#define   WDAT_LLIST_FREE_ENTRY_CNT_MASK         0x01ff0000
#define   WDAT_LLIST_FREE_ENTRY_CNT_SHIFT                16
#define   WD_ENTRY_LL_POP_VALID_MASK             0x00001000
#define   WD_ENTRY_LL_POP_VALID_SHIFT                    12
#define   SEPARATE_PAR_WD_ENTRY_MASK             0x00000008
#define   SEPARATE_PAR_WD_ENTRY_SHIFT                     3
#define   HMB_WD_STREAM_EN_MASK                  0x00000004
#define   HMB_WD_STREAM_EN_SHIFT                          2
#define   FW_WD_LL_TEST_EN_MASK                  0x00000002
#define   FW_WD_LL_TEST_EN_SHIFT                          1
#define   WD_ENTRY_LLIST_EN_MASK                 0x00000001
#define   WD_ENTRY_LLIST_EN_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 wd_entry_llist_en:1;
        u32 fw_wd_ll_test_en:1;
        u32 hmb_wd_stream_en:1;
        u32 separate_par_wd_entry:1;
        u32 rsvd_4:8;
        u32 wd_entry_ll_pop_valid:1;
        u32 rsvd_13:3;
        u32 wdat_llist_free_entry_cnt:9;
        u32 rsvd_25:7;
    } b;
} wd_entry_llist_ctrl_status_t;

#define WD_ENTRY_LLIST_STS_SEL                   0x000000c4
#define   WD_ENTRY_LLIST_STS_SEL_MASK            0x0000000f
#define   WD_ENTRY_LLIST_STS_SEL_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 wd_entry_llist_sts_sel:4;
        u32 rsvd_4:28;
    } b;
} wd_entry_llist_sts_sel_t;

#define WD_ENTRY_LLIST_STS_DATA                  0x000000c8
#define   WD_ENTRY_LLIST_V_COUNT_MASK            0x01ff0000
#define   WD_ENTRY_LLIST_V_COUNT_SHIFT                   16
#define   WD_ENTRY_LLIST_E_INDEX_MASK            0x0000ff00
#define   WD_ENTRY_LLIST_E_INDEX_SHIFT                    8
#define   WD_ENTRY_LLIST_S_INDEX_MASK            0x000000ff
#define   WD_ENTRY_LLIST_S_INDEX_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 wd_entry_llist_s_index:8;
        u32 wd_entry_llist_e_index:8;
        u32 wd_entry_llist_v_count:9;
        u32 rsvd_25:7;
    } b;
} wd_entry_llist_sts_data_t;

#define WD_ENTRY_LLIST_POP_SEL                   0x000000cc
#define   WD_ENTRY_LLIST_POP_SEL_MASK            0x0000000f
#define   WD_ENTRY_LLIST_POP_SEL_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 wd_entry_llist_pop_sel:4;
        u32 rsvd_4:28;
    } b;
} wd_entry_llist_pop_sel_t;

#define WD_ENTRY_LLIST_POP_DAT0                  0x000000d0
#define   WD_ENTRY_LLIST_POP_DAT0_MASK           0xffffffff
#define   WD_ENTRY_LLIST_POP_DAT0_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 wd_entry_llist_pop_dat0:32;
    } b;
} wd_entry_llist_pop_dat0_t;

#define WD_ENTRY_LLIST_POP_DAT1                  0x000000d4
#define   WD_ENTRY_LLIST_POP_DAT1_MASK           0xffffffff
#define   WD_ENTRY_LLIST_POP_DAT1_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 wd_entry_llist_pop_dat1:32;
    } b;
} wd_entry_llist_pop_dat1_t;

#define FW_WD_LLIST_TEST_SEL                     0x000000d8
#define   FW_WD_LLIST_TEST_SEL_MASK              0x00000007
#define   FW_WD_LLIST_TEST_SEL_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 fw_wd_llist_test_sel:3;
        u32 rsvd_3:29;
    } b;
} fw_wd_llist_test_sel_t;

#define FW_WD_LLIST_TEST_DAT0                    0x000000dc
#define   FW_WD_LLIST_TEST_DAT1_MASK             0xffffffff
#define   FW_WD_LLIST_TEST_DAT1_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 fw_wd_llist_test_dat1:32;
    } b;
} fw_wd_llist_test_dat0_t;

#define FW_WD_LLIST_TEST_DAT1                    0x000000e0
#define   FW_WD_LLIST_TEST_DAT1_e0_MASK          0xffffffff
#define   FW_WD_LLIST_TEST_DAT1_e0_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 fw_wd_llist_test_dat1_e0:32;
    } b;
} fw_wd_llist_test_dat1_t;

#define FW_WD_LLIST_TEST_DAT2                    0x000000e4
#define   FW_WD_LLIST_TEST_DAT2_MASK             0xffffffff
#define   FW_WD_LLIST_TEST_DAT2_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 fw_wd_llist_test_dat2:32;
    } b;
} fw_wd_llist_test_dat2_t;

#define WD_ENTRY_LL_INTER_STS                    0x000000f4
#define   WD_ENTRY_LL_INTER_STS_MASK             0x0000ffff
#define   WD_ENTRY_LL_INTER_STS_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 wd_entry_ll_inter_sts:16;
        u32 rsvd_16:16;
    } b;
} wd_entry_ll_inter_sts_t;

#define RD_ENTRY_LLIST_CTRL_STATUS               0x00000100
#define   RDAT_LLIST_FREE_ENTRY_CNT_MASK         0x01ff0000
#define   RDAT_LLIST_FREE_ENTRY_CNT_SHIFT                16
#define   RD_ENTRY_LL_POP_VALID_MASK             0x00001000
#define   RD_ENTRY_LL_POP_VALID_SHIFT                    12
#define   FW_RD_LL_TEST_BUSY_MASK                0x00000010
#define   FW_RD_LL_TEST_BUSY_SHIFT                        4
#define   FW_RD_LL_TEST_EN_MASK                  0x00000002
#define   FW_RD_LL_TEST_EN_SHIFT                          1
#define   RD_ENTRY_LLIST_EN_MASK                 0x00000001
#define   RD_ENTRY_LLIST_EN_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 rd_entry_llist_en:1;
        u32 fw_rd_ll_test_en:1;
        u32 rsvd_2:2;
        u32 fw_rd_ll_test_busy:1;
        u32 rsvd_5:7;
        u32 rd_entry_ll_pop_valid:1;
        u32 rsvd_13:3;
        u32 rdat_llist_free_entry_cnt:9;
        u32 rsvd_25:7;
    } b;
} rd_entry_llist_ctrl_status_t;

#define RD_ENTRY_LLIST_STS_SEL                   0x00000104
#define   RD_ENTRY_LLIST_STS_SEL_MASK            0x0000000f
#define   RD_ENTRY_LLIST_STS_SEL_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 rd_entry_llist_sts_sel:4;
        u32 rsvd_4:28;
    } b;
} rd_entry_llist_sts_sel_t;

#define RD_ENTRY_LLIST_STS_DATA                  0x00000108
#define   RD_ENTRY_LLIST_V_COUNT_MASK            0x01ff0000
#define   RD_ENTRY_LLIST_V_COUNT_SHIFT                   16
#define   RD_ENTRY_LLIST_E_INDEX_MASK            0x0000ff00
#define   RD_ENTRY_LLIST_E_INDEX_SHIFT                    8
#define   RD_ENTRY_LLIST_S_INDEX_MASK            0x000000ff
#define   RD_ENTRY_LLIST_S_INDEX_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 rd_entry_llist_s_index:8;
        u32 rd_entry_llist_e_index:8;
        u32 rd_entry_llist_v_count:9;
        u32 rsvd_25:7;
    } b;
} rd_entry_llist_sts_data_t;

#define FW_PUSH_RD_ENTRY0_BASE                   0x0000010c
#define   FW_PUSH_RD_ENTRY0_MXSZ_MASK            0xff000000
#define   FW_PUSH_RD_ENTRY0_MXSZ_SHIFT                   24
#define   FW_PUSH_RD_ENTRY0_BASE_MASK            0x007fffff
#define   FW_PUSH_RD_ENTRY0_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 fw_push_rd_entry0_base:23;
        u32 rsvd_23:1;
        u32 fw_push_rd_entry0_mxsz:8;
    } b;
} fw_push_rd_entry0_base_t;

#define FW_PUSH_RD_ENTRY0_PTRS                   0x00000110
#define   FW_PUSH_RD_ENTRY0_RPTR_MASK            0x0000ff00
#define   FW_PUSH_RD_ENTRY0_RPTR_SHIFT                    8
#define   FW_PUSH_RD_ENTRY0_WPTR_MASK            0x000000ff
#define   FW_PUSH_RD_ENTRY0_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 fw_push_rd_entry0_wptr:8;
        u32 fw_push_rd_entry0_rptr:8;
        u32 rsvd_16:16;
    } b;
} fw_push_rd_entry0_ptrs_t;

#define FW_PUSH_RD_E0_RPTR_BASE                  0x00000114
#define   FW_PUSH_RD_E0_RPTR_UPDT_EN_MASK        0x80000000
#define   FW_PUSH_RD_E0_RPTR_UPDT_EN_SHIFT               31
#define   FW_PUSH_RD_E0_RPTR_BASE_MASK           0x007fffff
#define   FW_PUSH_RD_E0_RPTR_BASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 fw_push_rd_e0_rptr_base:23;
        u32 rsvd_23:8;
        u32 fw_push_rd_e0_rptr_updt_en:1;
    } b;
} fw_push_rd_e0_rptr_base_t;

#define FW_PUSH_RD_ENTRY1_BASE                   0x00000118
#define   FW_PUSH_RD_ENTRY1_MXSZ_MASK            0xff000000
#define   FW_PUSH_RD_ENTRY1_MXSZ_SHIFT                   24
#define   FW_PUSH_RD_ENTRY1_BASE_MASK            0x007fffff
#define   FW_PUSH_RD_ENTRY1_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 fw_push_rd_entry1_base:23;
        u32 rsvd_23:1;
        u32 fw_push_rd_entry1_mxsz:8;
    } b;
} fw_push_rd_entry1_base_t;

#define FW_PUSH_RD_ENTRY1_PTRS                   0x0000011c
#define   FW_PUSH_RD_ENTRY1_RPTR_MASK            0x0000ff00
#define   FW_PUSH_RD_ENTRY1_RPTR_SHIFT                    8
#define   FW_PUSH_RD_ENTRY1_WPTR_MASK            0x000000ff
#define   FW_PUSH_RD_ENTRY1_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 fw_push_rd_entry1_wptr:8;
        u32 fw_push_rd_entry1_rptr:8;
        u32 rsvd_16:16;
    } b;
} fw_push_rd_entry1_ptrs_t;

#define FW_PUSH_RD_E1_RPTR_BASE                  0x00000120
#define   FW_PUSH_RD_E1_RPTE_UPDT_EN_MASK        0x80000000
#define   FW_PUSH_RD_E1_RPTE_UPDT_EN_SHIFT               31
#define   FW_PUSH_RD_E1_RPTR_BASE_MASK           0x007fffff
#define   FW_PUSH_RD_E1_RPTR_BASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 fw_push_rd_e1_rptr_base:23;
        u32 rsvd_23:8;
        u32 fw_push_rd_e1_rpte_updt_en:1;
    } b;
} fw_push_rd_e1_rptr_base_t;

#define RD_ENTRY_LLIST_POP_SEL                   0x00000124
#define   RD_ENTRY_LLIST_POP_SEL_MASK            0x0000000f
#define   RD_ENTRY_LLIST_POP_SEL_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 rd_entry_llist_pop_sel:4;
        u32 rsvd_4:28;
    } b;
} rd_entry_llist_pop_sel_t;

#define RD_ENTRY_LLIST_POP_DAT0                  0x00000128
#define   RD_ENTRY_LLIST_POP_DAT0_MASK           0xffffffff
#define   RD_ENTRY_LLIST_POP_DAT0_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 rd_entry_llist_pop_dat0:32;
    } b;
} rd_entry_llist_pop_dat0_t;

#define RD_ENTRY_LLIST_POP_DAT1                  0x0000012c
#define   RD_ENTRY_LLIST_POP_DAT1_MASK           0xffffffff
#define   RD_ENTRY_LLIST_POP_DAT1_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 rd_entry_llist_pop_dat1:32;
    } b;
} rd_entry_llist_pop_dat1_t;

#define FW_RD_LLIST_TEST_SEL                     0x00000130
#define   FW_RD_LLIST_TEST_GRP_MASK              0x00000008
#define   FW_RD_LLIST_TEST_GRP_SHIFT                      3
#define   FW_RD_LLIST_TEST_SEL_MASK              0x00000007
#define   FW_RD_LLIST_TEST_SEL_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 fw_rd_llist_test_sel:3;
        u32 fw_rd_llist_test_grp:1;
        u32 rsvd_4:28;
    } b;
} fw_rd_llist_test_sel_t;

#define FW_RD_LLIST_TEST_DAT0                    0x00000134
#define   FW_RD_LLIST_TEST_DAT0_MASK             0xffffffff
#define   FW_RD_LLIST_TEST_DAT0_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 fw_rd_llist_test_dat0:32;
    } b;
} fw_rd_llist_test_dat0_t;

#define FW_RD_LLIST_TEST_DAT1                    0x00000138
#define   FW_RD_LLIST_TEST_DAT1_MASK             0xffffffff
#define   FW_RD_LLIST_TEST_DAT1_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 fw_rd_llist_test_dat1:32;
    } b;
} fw_rd_llist_test_dat1_t;

#define RD_ENTRY_LLIST_STATUS                    0x0000013c
#define   DEBUG_COUNT_CLEAR_MASK                 0x80000000
#define   DEBUG_COUNT_CLEAR_SHIFT                        31
#define   RD_ENTRY_SILENT_DROP_CNT_MASK          0x7fff0000
#define   RD_ENTRY_SILENT_DROP_CNT_SHIFT                 16
#define   RD_ENTRY_LINKED_LIST_STATUS_MASK       0x000003ff
#define   RD_ENTRY_LINKED_LIST_STATUS_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 rd_entry_linked_list_status:10;
        u32 rsvd_10:6;
        u32 rd_entry_silent_drop_cnt:15;
        u32 debug_count_clear:1;
    } b;
} rd_entry_llist_status_t;

#define FW_PUSHES_READ_DU_CNT                    0x00000140
#define   FW_PUSHES_READ_DU_CNT_MASK             0xffffffff
#define   FW_PUSHES_READ_DU_CNT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 fw_pushes_read_du_cnt:32;
    } b;
} fw_pushes_read_du_cnt_t;

#define BTN_SENT_READ_DU_CNT                     0x00000144
#define   BTN_SENT_READ_DU_CNT_MASK              0xffffffff
#define   BTN_SENT_READ_DU_CNT_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 btn_sent_read_du_cnt:32;
    } b;
} btn_sent_read_du_cnt_t;

#define BTN_AUTO_UPDT_ENABLE                     0x00000150
#define   COM_FREE_QUEUE_FULL_MASK               0x01000000
#define   COM_FREE_QUEUE_FULL_SHIFT                      24
#define   COM_FREE_AUTO_UPDT_EN_MASK             0x00010000
#define   COM_FREE_AUTO_UPDT_EN_SHIFT                    16
#define   BTN_RD_AUTO_UPDT_EN_MASK               0x00001f00
#define   BTN_RD_AUTO_UPDT_EN_SHIFT                       8
#define   BTN_WD_AUTO_UPDT_EN_MASK               0x0000001f
#define   BTN_WD_AUTO_UPDT_EN_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_auto_updt_en:5;
        u32 rsvd_5:3;
        u32 btn_rd_auto_updt_en:5;
        u32 rsvd_13:3;
        u32 com_free_auto_updt_en:1;
        u32 rsvd_17:7;
        u32 com_free_queue_full:1;
        u32 rsvd_25:7;
    } b;
} btn_auto_updt_enable_t;

#define BTN_WD_ADRS_SURC0_BASE                   0x00000154
#define   BTN_WD_ADRS_SURC0_MXSZ_MASK            0xff000000
#define   BTN_WD_ADRS_SURC0_MXSZ_SHIFT                   24
#define   BTN_WD_ADRS_SURC0_BASE_MASK            0x007fffff
#define   BTN_WD_ADRS_SURC0_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs_surc0_base:23;
        u32 rsvd_23:1;
        u32 btn_wd_adrs_surc0_mxsz:8;
    } b;
} btn_wd_adrs_surc0_base_t;

#define BTN_WD_ADRS_SURC0_PTRS                   0x00000158
#define   BTN_WD_ADRS_SURC0_RPTR_MASK            0x0000ff00
#define   BTN_WD_ADRS_SURC0_RPTR_SHIFT                    8
#define   BTN_WD_ADRS_SURC0_WPTR_MASK            0x000000ff
#define   BTN_WD_ADRS_SURC0_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs_surc0_wptr:8;
        u32 btn_wd_adrs_surc0_rptr:8;
        u32 rsvd_16:16;
    } b;
} btn_wd_adrs_surc0_ptrs_t;

#define BTN_WD_ADRS0_RPTR_DBASE                  0x0000015c
#define   BTN_WD_ADRS0_RPTR_UPDT_EN_MASK         0x80000000
#define   BTN_WD_ADRS0_RPTR_UPDT_EN_SHIFT                31
#define   BTN_WD_ADRS0_RPTR_DBASE_MASK           0x007fffff
#define   BTN_WD_ADRS0_RPTR_DBASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs0_rptr_dbase:23;
        u32 rsvd_23:8;
        u32 btn_wd_adrs0_rptr_updt_en:1;
    } b;
} btn_wd_adrs0_rptr_dbase_t;

#define BTN_WD_ADRS0_UPDT_BASE                   0x00000160
#define   BTN_WD_ADRS0_UPDT_MXSZ_MASK            0xff000000
#define   BTN_WD_ADRS0_UPDT_MXSZ_SHIFT                   24
#define   BTN_WD_ADRS0_UPDT_BASE_MASK            0x007fffff
#define   BTN_WD_ADRS0_UPDT_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs0_updt_base:23;
        u32 rsvd_23:1;
        u32 btn_wd_adrs0_updt_mxsz:8;
    } b;
} btn_wd_adrs0_updt_base_t;

#define BTN_WD_ADRS0_UPDT_PTRS                   0x00000164
#define   BTN_WD_ADRS0_UPDT_RPTR_MASK            0x0000ff00
#define   BTN_WD_ADRS0_UPDT_RPTR_SHIFT                    8
#define   BTN_WD_ADRS0_UPDT_WPTR_MASK            0x000000ff
#define   BTN_WD_ADRS0_UPDT_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs0_updt_wptr:8;
        u32 btn_wd_adrs0_updt_rptr:8;
        u32 rsvd_16:16;
    } b;
} btn_wd_adrs0_updt_ptrs_t;

#define BTN_WD_ADRS0_WPTR_DBASE                  0x00000168
#define   BTN_WD_ADRS0_WPTR_UPDT_EN_MASK         0x80000000
#define   BTN_WD_ADRS0_WPTR_UPDT_EN_SHIFT                31
#define   BTN_WD_ADRS0_WPTR_DBASE_MASK           0x007fffff
#define   BTN_WD_ADRS0_WPTR_DBASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs0_wptr_dbase:23;
        u32 rsvd_23:8;
        u32 btn_wd_adrs0_wptr_updt_en:1;
    } b;
} btn_wd_adrs0_wptr_dbase_t;

#define BTN_WD_ADRS_SURC1_BASE                   0x0000016c
#define   BTN_WD_ADRS_SURC1_MXSZ_MASK            0xff000000
#define   BTN_WD_ADRS_SURC1_MXSZ_SHIFT                   24
#define   BTN_WD_ADRS_SURC1_BASE_MASK            0x007fffff
#define   BTN_WD_ADRS_SURC1_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs_surc1_base:23;
        u32 rsvd_23:1;
        u32 btn_wd_adrs_surc1_mxsz:8;
    } b;
} btn_wd_adrs_surc1_base_t;

#define BTN_WD_ADRS_SURC1_PTRS                   0x00000170
#define   BTN_WD_ADRS_SURC1_RPTR_MASK            0x0000ff00
#define   BTN_WD_ADRS_SURC1_RPTR_SHIFT                    8
#define   BTN_WD_ADRS_SURC1_WPTR_MASK            0x000000ff
#define   BTN_WD_ADRS_SURC1_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs_surc1_wptr:8;
        u32 btn_wd_adrs_surc1_rptr:8;
        u32 rsvd_16:16;
    } b;
} btn_wd_adrs_surc1_ptrs_t;

#define BTN_WD_ADRS1_RPTR_DBASE                  0x00000174
#define   BTN_WD_ADRS1_RPTR_UPDT_EN_MASK         0x80000000
#define   BTN_WD_ADRS1_RPTR_UPDT_EN_SHIFT                31
#define   BTN_WD_ADRS1_RPTR_DBASE_MASK           0x007fffff
#define   BTN_WD_ADRS1_RPTR_DBASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs1_rptr_dbase:23;
        u32 rsvd_23:8;
        u32 btn_wd_adrs1_rptr_updt_en:1;
    } b;
} btn_wd_adrs1_rptr_dbase_t;

#define BTN_WD_ADRS1_UPDT_BASE                   0x00000178
#define   BTN_WD_ADRS1_UPDT_MXSZ_MASK            0xff000000
#define   BTN_WD_ADRS1_UPDT_MXSZ_SHIFT                   24
#define   BTN_WD_ADRS1_UPDT_BASE_MASK            0x007fffff
#define   BTN_WD_ADRS1_UPDT_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs1_updt_base:23;
        u32 rsvd_23:1;
        u32 btn_wd_adrs1_updt_mxsz:8;
    } b;
} btn_wd_adrs1_updt_base_t;

#define BTN_WD_ADRS1_UPDT_PTRS                   0x0000017c
#define   BTN_WD_ADRS1_UPDT_RPTR_MASK            0x0000ff00
#define   BTN_WD_ADRS1_UPDT_RPTR_SHIFT                    8
#define   BTN_WD_ADRS1_UPDT_WPTR_MASK            0x000000ff
#define   BTN_WD_ADRS1_UPDT_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs1_updt_wptr:8;
        u32 btn_wd_adrs1_updt_rptr:8;
        u32 rsvd_16:16;
    } b;
} btn_wd_adrs1_updt_ptrs_t;

#define BTN_WD_ADRS1_WPTR_DBASE                  0x00000180
#define   BTN_WD_ADRS1_WPTR_UPDT_EN_MASK         0x80000000
#define   BTN_WD_ADRS1_WPTR_UPDT_EN_SHIFT                31
#define   BTN_WD_ADRS1_WPTR_DBASE_MASK           0x007fffff
#define   BTN_WD_ADRS1_WPTR_DBASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs1_wptr_dbase:23;
        u32 rsvd_23:8;
        u32 btn_wd_adrs1_wptr_updt_en:1;
    } b;
} btn_wd_adrs1_wptr_dbase_t;

#define BTN_RD_ADRS_SURC0_BASE                   0x00000184
#define   BTN_RD_ADRS_SURC0_MXSZ_MASK            0xff000000
#define   BTN_RD_ADRS_SURC0_MXSZ_SHIFT                   24
#define   BTN_RD_ADRS_SURC0_BASE_MASK            0x007fffff
#define   BTN_RD_ADRS_SURC0_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_rd_adrs_surc0_base:23;
        u32 rsvd_23:1;
        u32 btn_rd_adrs_surc0_mxsz:8;
    } b;
} btn_rd_adrs_surc0_base_t;

#define BTN_RD_ADRS_SURC0_PTRS                   0x00000188
#define   BTN_RD_ADRS_SURC0_RPTR_MASK            0x0000ff00
#define   BTN_RD_ADRS_SURC0_RPTR_SHIFT                    8
#define   BTN_RD_ADRS_SURC0_WPTR_MASK            0x000000ff
#define   BTN_RD_ADRS_SURC0_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_rd_adrs_surc0_wptr:8;
        u32 btn_rd_adrs_surc0_rptr:8;
        u32 rsvd_16:16;
    } b;
} btn_rd_adrs_surc0_ptrs_t;

#define BTN_RD_SURC0_RPTR_DBASE                  0x0000018c
#define   BTN_RD_SURC0_RPTR_UPDT_EN_MASK         0x80000000
#define   BTN_RD_SURC0_RPTR_UPDT_EN_SHIFT                31
#define   BTN_RD_SURC0_RPTR_DBASE_MASK           0x007fffff
#define   BTN_RD_SURC0_RPTR_DBASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_rd_surc0_rptr_dbase:23;
        u32 rsvd_23:8;
        u32 btn_rd_surc0_rptr_updt_en:1;
    } b;
} btn_rd_surc0_rptr_dbase_t;

#define BTN_RD_ADRS0_UPDT_BASE                   0x00000190
#define   BTN_RD_ADRS0_UPDT_MXSZ_MASK            0xff000000
#define   BTN_RD_ADRS0_UPDT_MXSZ_SHIFT                   24
#define   BTN_RD_ADRS0_UPDT_BASE_MASK            0x007fffff
#define   BTN_RD_ADRS0_UPDT_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_rd_adrs0_updt_base:23;
        u32 rsvd_23:1;
        u32 btn_rd_adrs0_updt_mxsz:8;
    } b;
} btn_rd_adrs0_updt_base_t;

#define BTN_RD_ADRS0_UPDT_PTRS                   0x00000194
#define   BTN_RD_ADRS0_UPDT_RPTR_MASK            0x0000ff00
#define   BTN_RD_ADRS0_UPDT_RPTR_SHIFT                    8
#define   BTN_RD_ADRS0_UPDT_WPTR_MASK            0x000000ff
#define   BTN_RD_ADRS0_UPDT_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_rd_adrs0_updt_wptr:8;
        u32 btn_rd_adrs0_updt_rptr:8;
        u32 rsvd_16:16;
    } b;
} btn_rd_adrs0_updt_ptrs_t;

#define BTN_RD_ADRS0_WPTR_DBASE                  0x00000198
#define   BTN_RD_ADRS0_WPTR_UPDT_EN_MASK         0x80000000
#define   BTN_RD_ADRS0_WPTR_UPDT_EN_SHIFT                31
#define   BTN_RD_ADRS0_WPTR_DBASE_MASK           0x007fffff
#define   BTN_RD_ADRS0_WPTR_DBASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_rd_adrs0_wptr_dbase:23;
        u32 rsvd_23:8;
        u32 btn_rd_adrs0_wptr_updt_en:1;
    } b;
} btn_rd_adrs0_wptr_dbase_t;

#define BTN_RD_ADRS_SURC1_BASE                   0x0000019c
#define   BTN_RD_ADRS_SURC1_MXSZ_MASK            0xff000000
#define   BTN_RD_ADRS_SURC1_MXSZ_SHIFT                   24
#define   BTN_RD_ADRS_SURC1_BASE_MASK            0x007fffff
#define   BTN_RD_ADRS_SURC1_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_rd_adrs_surc1_base:23;
        u32 rsvd_23:1;
        u32 btn_rd_adrs_surc1_mxsz:8;
    } b;
} btn_rd_adrs_surc1_base_t;

#define BTN_RD_ADRS_SURC1_PTRS                   0x000001a0
#define   BTN_RD_ADRS_SURC1_RPTR_MASK            0x0000ff00
#define   BTN_RD_ADRS_SURC1_RPTR_SHIFT                    8
#define   BTN_RD_ADRS_SURC1_WPTR_MASK            0x000000ff
#define   BTN_RD_ADRS_SURC1_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_rd_adrs_surc1_wptr:8;
        u32 btn_rd_adrs_surc1_rptr:8;
        u32 rsvd_16:16;
    } b;
} btn_rd_adrs_surc1_ptrs_t;

#define BTN_RD_SURC1_RPTR_DBASE                  0x000001a4
#define   BTN_RD_SURC1_RPTR_UPDT_EN_MASK         0x80000000
#define   BTN_RD_SURC1_RPTR_UPDT_EN_SHIFT                31
#define   BTN_RD_SURC1_RPTR_DBASE_MASK           0x007fffff
#define   BTN_RD_SURC1_RPTR_DBASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_rd_surc1_rptr_dbase:23;
        u32 rsvd_23:8;
        u32 btn_rd_surc1_rptr_updt_en:1;
    } b;
} btn_rd_surc1_rptr_dbase_t;

#define BTN_RD_ADRS1_UPDT_BASE                   0x000001a8
#define   BTN_RD_ADRS1_UPDT_MXSZ_MASK            0xff000000
#define   BTN_RD_ADRS1_UPDT_MXSZ_SHIFT                   24
#define   BTN_RD_ADRS1_UPDT_BASE_MASK            0x007fffff
#define   BTN_RD_ADRS1_UPDT_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_rd_adrs1_updt_base:23;
        u32 rsvd_23:1;
        u32 btn_rd_adrs1_updt_mxsz:8;
    } b;
} btn_rd_adrs1_updt_base_t;

#define BTN_RD_ADRS1_UPDT_PTRS                   0x000001ac
#define   BTN_RD_ADRS1_UPDT_RPTR_MASK            0x0000ff00
#define   BTN_RD_ADRS1_UPDT_RPTR_SHIFT                    8
#define   BTN_RD_ADRS1_UPDT_WPTR_MASK            0x000000ff
#define   BTN_RD_ADRS1_UPDT_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_rd_adrs1_updt_wptr:8;
        u32 btn_rd_adrs1_updt_rptr:8;
        u32 rsvd_16:16;
    } b;
} btn_rd_adrs1_updt_ptrs_t;

#define BTN_RD_ADRS1_WPTR_DBASE                  0x000001b0
#define   BTN_RD_ADRS1_WPTR_UPDT_EN_MASK         0x80000000
#define   BTN_RD_ADRS1_WPTR_UPDT_EN_SHIFT                31
#define   BTN_RD_ADRS1_WPTR_DBASE_MASK           0x007fffff
#define   BTN_RD_ADRS1_WPTR_DBASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_rd_adrs1_wptr_dbase:23;
        u32 rsvd_23:8;
        u32 btn_rd_adrs1_wptr_updt_en:1;
    } b;
} btn_rd_adrs1_wptr_dbase_t;

#define BTN_WD_ADRS0_UPDT1_BASE                  0x000001b4
#define   BTN_WD_ADRS0_UPDT1_MXSZ_MASK           0xff000000
#define   BTN_WD_ADRS0_UPDT1_MXSZ_SHIFT                  24
#define   BTN_WD_ADRS0_UPDT1_BASE_MASK           0x007fffff
#define   BTN_WD_ADRS0_UPDT1_BASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs0_updt1_base:23;
        u32 rsvd_23:1;
        u32 btn_wd_adrs0_updt1_mxsz:8;
    } b;
} btn_wd_adrs0_updt1_base_t;

#define BTN_WD_ADRS0_UPDT1_PTRS                  0x000001b8
#define   BTN_WD_ADRS0_UPDT1_RPTR_MASK           0x0000ff00
#define   BTN_WD_ADRS0_UPDT1_RPTR_SHIFT                   8
#define   BTN_WD_ADRS0_UPDT1_WPTR_MASK           0x000000ff
#define   BTN_WD_ADRS0_UPDT1_WPTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs0_updt1_wptr:8;
        u32 btn_wd_adrs0_updt1_rptr:8;
        u32 rsvd_16:16;
    } b;
} btn_wd_adrs0_updt1_ptrs_t;

#define BTN_WD_ADRS0_WPTR1_DBASE                 0x000001bc
#define   BTN_WD_ADRS0_WPTR_UPDT1_EN_MASK        0x80000000
#define   BTN_WD_ADRS0_WPTR_UPDT1_EN_SHIFT               31
#define   BTN_WD_ADRS0_WPTR1_DBASE_MASK          0x007fffff
#define   BTN_WD_ADRS0_WPTR1_DBASE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs0_wptr1_dbase:23;
        u32 rsvd_23:8;
        u32 btn_wd_adrs0_wptr_updt1_en:1;
    } b;
} btn_wd_adrs0_wptr1_dbase_t;

#define BTN_WD_ADRS0_UPDT2_BASE                  0x000001c0
#define   BTN_WD_ADRS0_UPDT2_MXSZ_MASK           0xff000000
#define   BTN_WD_ADRS0_UPDT2_MXSZ_SHIFT                  24
#define   BTN_WD_ADRS0_UPDT2_BASE_MASK           0x007fffff
#define   BTN_WD_ADRS0_UPDT2_BASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs0_updt2_base:23;
        u32 rsvd_23:1;
        u32 btn_wd_adrs0_updt2_mxsz:8;
    } b;
} btn_wd_adrs0_updt2_base_t;

#define BTN_WD_ADRS0_UPDT2_PTRS                  0x000001c4
#define   BTN_WD_ADRS0_UPDT2_RPTR_MASK           0x0000ff00
#define   BTN_WD_ADRS0_UPDT2_RPTR_SHIFT                   8
#define   BTN_WD_ADRS0_UPDT2_WPTR_MASK           0x000000ff
#define   BTN_WD_ADRS0_UPDT2_WPTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs0_updt2_wptr:8;
        u32 btn_wd_adrs0_updt2_rptr:8;
        u32 rsvd_16:16;
    } b;
} btn_wd_adrs0_updt2_ptrs_t;

#define BTN_WD_ADRS0_WPTR2_DBASE                 0x000001c8
#define   BTN_WD_ADRS0_WPTR_UPDT2_EN_MASK        0x80000000
#define   BTN_WD_ADRS0_WPTR_UPDT2_EN_SHIFT               31
#define   BTN_WD_ADRS0_WPTR2_DBASE_MASK          0x007fffff
#define   BTN_WD_ADRS0_WPTR2_DBASE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 btn_wd_adrs0_wptr2_dbase:23;
        u32 rsvd_23:8;
        u32 btn_wd_adrs0_wptr_updt2_en:1;
    } b;
} btn_wd_adrs0_wptr2_dbase_t;

#define BTN_COM_FREE_DTAG_DBASE                  0x000001e4
#define   BTN_COM_FREE_DTAG_MXSZ_MASK            0xff000000
#define   BTN_COM_FREE_DTAG_MXSZ_SHIFT                   24
#define   BTN_COM_FREE_DTAG_DBASE_MASK           0x007fffff
#define   BTN_COM_FREE_DTAG_DBASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 btn_com_free_dtag_dbase:23;
        u32 rsvd_23:1;
        u32 btn_com_free_dtag_mxsz:8;
    } b;
} btn_com_free_dtag_dbase_t;

#define BTN_COM_FREE_DTAG_PTRS                   0x000001e8
#define   COM_FREE_DTAG_RPTR_MASK                0x0000ff00
#define   COM_FREE_DTAG_RPTR_SHIFT                        8
#define   COM_FREE_DTAG_WPTR_MASK                0x000000ff
#define   COM_FREE_DTAG_WPTR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 com_free_dtag_wptr:8;
        u32 com_free_dtag_rptr:8;
        u32 rsvd_16:16;
    } b;
} btn_com_free_dtag_ptrs_t;

#define BTN_COM_FREE_WPTR_DBASE                  0x000001ec
#define   COM_FREE_WPTR_UPDT_EN_MASK             0x80000000
#define   COM_FREE_WPTR_UPDT_EN_SHIFT                    31
#define   BM_COM_FREE_PNTER_DBASE_MASK           0x007fffff
#define   BM_COM_FREE_PNTER_DBASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 bm_com_free_pnter_dbase:23;
        u32 rsvd_23:8;
        u32 com_free_wptr_updt_en:1;
    } b;
} btn_com_free_wptr_dbase_t;

#define DATA_ENTRY_ERR_COUNT                     0x000001f0
#define   RD_ENTRY_ERROR_COUNT_MASK              0x01ff0000
#define   RD_ENTRY_ERROR_COUNT_SHIFT                     16
#define   WD_ENTRY_ERROR_COUNT_MASK              0x000001ff
#define   WD_ENTRY_ERROR_COUNT_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 wd_entry_error_count:9;
        u32 rsvd_9:7;
        u32 rd_entry_error_count:9;
        u32 rsvd_25:7;
    } b;
} data_entry_err_count_t;

#define S_BASE_S_DTAG_HMETA                      0x00000200
#define   S_BASE_S_DTAG_HMETA_MASK               0x0000ffff
#define   S_BASE_S_DTAG_HMETA_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 s_base_s_dtag_hmeta:16;
        u32 rsvd_16:16;
    } b;
} s_base_s_dtag_hmeta_t;

#define D_BASE_D_DTAG_HMETA                      0x0000020c
#define   D_BASE_D_DTAG_HMETA_MASK               0xffffffff
#define   D_BASE_D_DTAG_HMETA_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 d_base_d_dtag_hmeta:32;
    } b;
} d_base_d_dtag_hmeta_t;

#define D_BASE_D_DTAG_HSCRC                      0x00000210
#define   D_BASE_D_DTAG_HSCRC_MASK               0xffffffff
#define   D_BASE_D_DTAG_HSCRC_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 d_base_d_dtag_hscrc:32;
    } b;
} d_base_d_dtag_hscrc_t;

#define DATA_PROCESS_CTRL_STS                    0x00000220
#define   DPE_INTERNAL_STS_MASK                  0x1fffff00
#define   DPE_INTERNAL_STS_SHIFT                          8
#define   CUR_PROCESS_TYPE_MASK                  0x000000f0
#define   CUR_PROCESS_TYPE_SHIFT                          4
#define   DATA_PROCESS_ERROR_MASK                0x00000004
#define   DATA_PROCESS_ERROR_SHIFT                        2
#define   DATA_PROCESS_ACTIVE_MASK               0x00000002
#define   DATA_PROCESS_ACTIVE_SHIFT                       1
#define   DATA_PROCESS_ENABLE_MASK               0x00000001
#define   DATA_PROCESS_ENABLE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 data_process_enable:1;
        u32 data_process_active:1;
        u32 data_process_error:1;
        u32 rsvd_3:1;
        u32 cur_process_type:4;
        u32 dpe_internal_sts:21;
        u32 rsvd_29:3;
    } b;
} data_process_ctrl_sts_t;

#define DATA_PROC_REQ_SRAM_BASE                  0x00000224
#define   DATA_PROC_REQ_MAX_SZ_MASK              0xff000000
#define   DATA_PROC_REQ_MAX_SZ_SHIFT                     24
#define   DATA_PROC_REQ_SRAM_BASE_MASK           0x007fffff
#define   DATA_PROC_REQ_SRAM_BASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 data_proc_req_sram_base:23;
        u32 rsvd_23:1;
        u32 data_proc_req_max_sz:8;
    } b;
} data_proc_req_sram_base_t;

#define DATA_PROC_REQ_POINTER                    0x00000228
#define   DATA_PROC_REQ_RPTR_MASK                0x0000ff00
#define   DATA_PROC_REQ_RPTR_SHIFT                        8
#define   DATA_PROC_REQ_WPTR_MASK                0x000000ff
#define   DATA_PROC_REQ_WPTR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 data_proc_req_wptr:8;
        u32 data_proc_req_rptr:8;
        u32 rsvd_16:16;
    } b;
} data_proc_req_pointer_t;

#define DATA_PROC_RES_SRAM_BASE                  0x0000022c
#define   DATA_PROC_RES_SRAM_BASE_MASK           0x007fffff
#define   DATA_PROC_RES_SRAM_BASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 data_proc_res_sram_base:23;
        u32 rsvd_23:9;
    } b;
} data_proc_res_sram_base_t;

#define DATA_PROC_RES_POINTER                    0x00000230
#define   DATA_PROC_RES_RPTR_MASK                0x0000ff00
#define   DATA_PROC_RES_RPTR_SHIFT                        8
#define   DATA_PROC_RES_WPTR_MASK                0x000000ff
#define   DATA_PROC_RES_WPTR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 data_proc_res_wptr:8;
        u32 data_proc_res_rptr:8;
        u32 rsvd_16:16;
    } b;
} data_proc_res_pointer_t;

#define DP_SEARCH_RES_SRAM_BASE                  0x00000234
#define   DP_SEARCH_RES_SRAM_BASE_MASK           0x007fffff
#define   DP_SEARCH_RES_SRAM_BASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 dp_search_res_sram_base:23;
        u32 rsvd_23:9;
    } b;
} dp_search_res_sram_base_t;

#define SEC_FINGERPRINT_PROG                     0x00000238
#define   SEC_FP_CHECK_FLAG_MASK                 0x0000ff00
#define   SEC_FP_CHECK_FLAG_SHIFT                         8
#define   SEC_VERIFY_FP_GOOD_MASK                0x00000020
#define   SEC_VERIFY_FP_GOOD_SHIFT                        5
#define   SEC_PROGRAM_FP_DONE_MASK               0x00000010
#define   SEC_PROGRAM_FP_DONE_SHIFT                       4
#define   SEC_VERIFY_FP_ENABLE_MASK              0x00000008
#define   SEC_VERIFY_FP_ENABLE_SHIFT                      3
#define   SEC_CHECK_FP_ENABLE_MASK               0x00000004
#define   SEC_CHECK_FP_ENABLE_SHIFT                       2
#define   SEC_FP_BACKUP_SELECT_MASK              0x00000002
#define   SEC_FP_BACKUP_SELECT_SHIFT                      1
#define   SEC_PROGRAM_FP_START_MASK              0x00000001
#define   SEC_PROGRAM_FP_START_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sec_program_fp_start:1;
        u32 sec_fp_backup_select:1;
        u32 sec_check_fp_enable:1;
        u32 sec_verify_fp_enable:1;
        u32 sec_program_fp_done:1;
        u32 sec_verify_fp_good:1;
        u32 rsvd_6:2;
        u32 sec_fp_check_flag:8;
        u32 rsvd_16:16;
    } b;
} sec_fingerprint_prog_t;

#define SEC_FINGERPRINT_FETCH                    0x0000023c
#define   SEC_FETCH_FP_DONE_MASK                 0x00000010
#define   SEC_FETCH_FP_DONE_SHIFT                         4
#define   SEC_FP_BKUP_SELECT_MASK                0x00000002
#define   SEC_FP_BKUP_SELECT_SHIFT                        1
#define   SEC_FETCH_FP_START_MASK                0x00000001
#define   SEC_FETCH_FP_START_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 sec_fetch_fp_start:1;
        u32 sec_fp_bkup_select:1;
        u32 rsvd_2:2;
        u32 sec_fetch_fp_done:1;
        u32 rsvd_5:27;
    } b;
} sec_fingerprint_fetch_t;

#define DATA_PROC_REQ1_SRAM_BASE                 0x00000240
#define   DATA_PROC_REQ1_MAX_SZ_MASK             0xff000000
#define   DATA_PROC_REQ1_MAX_SZ_SHIFT                    24
#define   DATA_PROC_REQ1_SRAM_BASE_MASK          0x007fffff
#define   DATA_PROC_REQ1_SRAM_BASE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 data_proc_req1_sram_base:23;
        u32 rsvd_23:1;
        u32 data_proc_req1_max_sz:8;
    } b;
} data_proc_req1_sram_base_t;

#define DATA_PROC_REQ1_POINTER                   0x00000244
#define   DATA_PROC_REQ1_RPTR_MASK               0x0000ff00
#define   DATA_PROC_REQ1_RPTR_SHIFT                       8
#define   DATA_PROC_REQ1_WPTR_MASK               0x000000ff
#define   DATA_PROC_REQ1_WPTR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 data_proc_req1_wptr:8;
        u32 data_proc_req1_rptr:8;
        u32 rsvd_16:16;
    } b;
} data_proc_req1_pointer_t;

#define DATA_PROC_RES1_SRAM_BASE                 0x00000248
#define   DATA_PROC_RES1_SRAM_BASE_MASK          0x007fffff
#define   DATA_PROC_RES1_SRAM_BASE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 data_proc_res1_sram_base:23;
        u32 rsvd_23:9;
    } b;
} data_proc_res1_sram_base_t;

#define DATA_PROC_RES1_POINTER                   0x0000024c
#define   DATA_PROC_RES1_RPTR_MASK               0x0000ff00
#define   DATA_PROC_RES1_RPTR_SHIFT                       8
#define   DATA_PROC_RES1_WPTR_MASK               0x000000ff
#define   DATA_PROC_RES1_WPTR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 data_proc_res1_wptr:8;
        u32 data_proc_res1_rptr:8;
        u32 rsvd_16:16;
    } b;
} data_proc_res1_pointer_t;

#define READ_UNMAP_CTRL_REG                      0x00000250
#define   BM_READ_UNMAP_ENABLE_MASK              0x80000000
#define   BM_READ_UNMAP_ENABLE_SHIFT                     31
#define   UMP_METADATA_FILL_SEL_MASK             0x08000000
#define   UMP_METADATA_FILL_SEL_SHIFT                    27
#define   UMP_PI_GUARD_FILL_SEL_MASK             0x04000000
#define   UMP_PI_GUARD_FILL_SEL_SHIFT                    26
#define   UMP_PI_APPTAG_FILL_SEL_MASK            0x02000000
#define   UMP_PI_APPTAG_FILL_SEL_SHIFT                   25
#define   UMP_PI_REFTAG_FILL_SEL_MASK            0x01000000
#define   UMP_PI_REFTAG_FILL_SEL_SHIFT                   24
#define   READ_UNMAP_DTAG_NUM_MASK               0x00ffffff
#define   READ_UNMAP_DTAG_NUM_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 read_unmap_dtag_num:24;
        u32 ump_pi_reftag_fill_sel:1;
        u32 ump_pi_apptag_fill_sel:1;
        u32 ump_pi_guard_fill_sel:1;
        u32 ump_metadata_fill_sel:1;
        u32 rsvd_28:3;
        u32 bm_read_unmap_enable:1;
    } b;
} read_unmap_ctrl_reg_t;

#define WRITE_DUMMY_CTRL_REG                     0x00000254
#define   BM_WRITE_DUMMY_ENABLE_MASK             0x80000000
#define   BM_WRITE_DUMMY_ENABLE_SHIFT                    31
#define   WRITE_DUMMY_DTAG_NUM_MASK              0x00ffffff
#define   WRITE_DUMMY_DTAG_NUM_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 write_dummy_dtag_num:24;
        u32 rsvd_24:7;
        u32 bm_write_dummy_enable:1;
    } b;
} write_dummy_ctrl_reg_t;

#define READ_UNMAP_DATA_PAT                      0x00000258
#define   READ_UNMAP_DATA_PAT_MASK               0xffffffff
#define   READ_UNMAP_DATA_PAT_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 read_unmap_data_pat:32;
    } b;
} read_unmap_data_pat_t;

#define WRITE_DUMMY_DATA_PAT                     0x0000025c
#define   WRITE_DUMMY_DATA_PAT_MASK              0xffffffff
#define   WRITE_DUMMY_DATA_PAT_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 write_dummy_data_pat:32;
    } b;
} write_dummy_data_pat_t;

#define BTN_SRAM_RD_ADDR                         0x00000260
#define   BTN_SRAM_SELECT_MASK                   0x00070000
#define   BTN_SRAM_SELECT_SHIFT                          16
#define   BTN_SRAM_RD_ADDR_MASK                  0x00000fff
#define   BTN_SRAM_RD_ADDR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 btn_sram_rd_addr:12;
        u32 rsvd_12:4;
        u32 btn_sram_select:3;
        u32 rsvd_19:13;
    } b;
} btn_sram_rd_addr_t;

#define BTN_SRAM_RD_DAT0                         0x00000264
#define   BTN_SRAM_RD_DAT0_MASK                  0xffffffff
#define   BTN_SRAM_RD_DAT0_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 btn_sram_rd_dat0:32;
    } b;
} btn_sram_rd_dat0_t;

#define BTN_SRAM_RD_DAT1                         0x00000268
#define   BTN_SRAM_RD_DATA_E_MASK                0xffffffff
#define   BTN_SRAM_RD_DATA_E_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 btn_sram_rd_data_e:32;
    } b;
} btn_sram_rd_dat1_t;

#define BTN_SRAM_RD_DAT2                         0x0000026c
#define   BTN_SRAM_RD_DATA_E_26c_MASK            0x000001ff
#define   BTN_SRAM_RD_DATA_E_26c_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_sram_rd_data_e_26c:9;
        u32 rsvd_9:23;
    } b;
} btn_sram_rd_dat2_t;

#define BTN_HCRC_SRAM_WRITE                      0x00000270
#define   HCRC_SRAM_WR_DATA_MASK                 0xffff0000
#define   HCRC_SRAM_WR_DATA_SHIFT                        16
#define   HCRC_SRAM_WR_BUSY_MASK                 0x00001000
#define   HCRC_SRAM_WR_BUSY_SHIFT                        12
#define   HCRC_SRAM_ADDRESS_MASK                 0x00000fff
#define   HCRC_SRAM_ADDRESS_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 hcrc_sram_address:12;
        u32 hcrc_sram_wr_busy:1;
        u32 rsvd_13:3;
        u32 hcrc_sram_wr_data:16;
    } b;
} btn_hcrc_sram_write_t;

#define SRAM_ECC_ERROR_INJECT                    0x00000274
#define   SRAM_INJECT_2BIT_ERROR_MASK            0x00000020
#define   SRAM_INJECT_2BIT_ERROR_SHIFT                    5
#define   SRAM_INJECT_1BIT_ERROR_MASK            0x00000010
#define   SRAM_INJECT_1BIT_ERROR_SHIFT                    4
#define   SRAM_ERR_BK3_INJECT_EN_MASK            0x00000008
#define   SRAM_ERR_BK3_INJECT_EN_SHIFT                    3
#define   SRAM_ERR_BK2_INJECT_EN_MASK            0x00000004
#define   SRAM_ERR_BK2_INJECT_EN_SHIFT                    2
#define   SRAM_ERR_BK1_INJECT_EN_MASK            0x00000002
#define   SRAM_ERR_BK1_INJECT_EN_SHIFT                    1
#define   SRAM_ERR_BK0_INJECT_EN_MASK            0x00000001
#define   SRAM_ERR_BK0_INJECT_EN_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 sram_err_bk0_inject_en:1;
        u32 sram_err_bk1_inject_en:1;
        u32 sram_err_bk2_inject_en:1;
        u32 sram_err_bk3_inject_en:1;
        u32 sram_inject_1bit_error:1;
        u32 sram_inject_2bit_error:1;
        u32 rsvd_6:26;
    } b;
} sram_ecc_error_inject_t;

#define READ_DUMMY_CTRL_REG                      0x00000278
#define   BM_READ_DUMMY_ENABLE_MASK              0x80000000
#define   BM_READ_DUMMY_ENABLE_SHIFT                     31
#define   DMY_METADATA_FILL_SEL_MASK             0x08000000
#define   DMY_METADATA_FILL_SEL_SHIFT                    27
#define   DMY_PI_GUARD_FILL_SEL_MASK             0x04000000
#define   DMY_PI_GUARD_FILL_SEL_SHIFT                    26
#define   DMY_PI_APPTAG_FILL_SEL_MASK            0x02000000
#define   DMY_PI_APPTAG_FILL_SEL_SHIFT                   25
#define   DMY_PI_REFTAG_FILL_SEL_MASK            0x01000000
#define   DMY_PI_REFTAG_FILL_SEL_SHIFT                   24
#define   READ_DUMMY_DTAG_NUM_MASK               0x00ffffff
#define   READ_DUMMY_DTAG_NUM_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 read_dummy_dtag_num:24;
        u32 dmy_pi_reftag_fill_sel:1;
        u32 dmy_pi_apptag_fill_sel:1;
        u32 dmy_pi_guard_fill_sel:1;
        u32 dmy_metadata_fill_sel:1;
        u32 rsvd_28:3;
        u32 bm_read_dummy_enable:1;
    } b;
} read_dummy_ctrl_reg_t;

#define READ_DUMMY_DATA_PAT                      0x0000027c
#define   READ_DUMMY_DATA_PAT_MASK               0xffffffff
#define   READ_DUMMY_DATA_PAT_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 read_dummy_data_pat:32;
    } b;
} read_dummy_data_pat_t;

#define SEC_SUBSYSTEM_CTRL                       0x00000280
#define   SEC_RSA_CALC_CTRL_MASK                 0xffff0000
#define   SEC_RSA_CALC_CTRL_SHIFT                        16
#define   SEC_KEYWRAP_RESET_MASK                 0x00000080
#define   SEC_KEYWRAP_RESET_SHIFT                         7
#define   SEC_SUB_MISC_CTRL_MASK                 0x0000007c
#define   SEC_SUB_MISC_CTRL_SHIFT                         2
#define   SEC_SUB_TEST_MODE_MASK                 0x00000002
#define   SEC_SUB_TEST_MODE_SHIFT                         1
#define   SEC_SUB_SECURE_MODE_MASK               0x00000001
#define   SEC_SUB_SECURE_MODE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sec_sub_secure_mode:1;
        u32 sec_sub_test_mode:1;
        u32 sec_sub_misc_ctrl:5;
        u32 sec_keywrap_reset:1;
        u32 rsvd_8:8;
        u32 sec_rsa_calc_ctrl:16;
    } b;
} sec_subsystem_ctrl_t;

#define READ_UNMAP1_CTRL_REG                     0x00000284
#define   BM_READ_UNMAP1_ENABLE_MASK             0x80000000
#define   BM_READ_UNMAP1_ENABLE_SHIFT                    31
#define   UM1_METADATA_FILL_SEL_MASK             0x08000000
#define   UM1_METADATA_FILL_SEL_SHIFT                    27
#define   UM1_PI_GUARD_FILL_SEL_MASK             0x04000000
#define   UM1_PI_GUARD_FILL_SEL_SHIFT                    26
#define   UM1_PI_APPTAG_FILL_SEL_MASK            0x02000000
#define   UM1_PI_APPTAG_FILL_SEL_SHIFT                   25
#define   UM1_PI_REFTAG_FILL_SEL_MASK            0x01000000
#define   UM1_PI_REFTAG_FILL_SEL_SHIFT                   24
#define   READ_UNMAP1_DTAG_NUM_MASK              0x00ffffff
#define   READ_UNMAP1_DTAG_NUM_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 read_unmap1_dtag_num:24;
        u32 um1_pi_reftag_fill_sel:1;
        u32 um1_pi_apptag_fill_sel:1;
        u32 um1_pi_guard_fill_sel:1;
        u32 um1_metadata_fill_sel:1;
        u32 rsvd_28:3;
        u32 bm_read_unmap1_enable:1;
    } b;
} read_unmap1_ctrl_reg_t;

#define READ_UNMAP1_DATA_PAT                     0x00000288
#define   READ_UNMAP1_DATA_PAT_MASK              0xffffffff
#define   READ_UNMAP1_DATA_PAT_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 read_unmap1_data_pat:32;
    } b;
} read_unmap1_data_pat_t;

#define FW_RD_HMB_REQST_BASE                     0x000002a0
#define   FW_RD_HMB_REQST_MXSZ_MASK              0xff000000
#define   FW_RD_HMB_REQST_MXSZ_SHIFT                     24
#define   FW_RD_HMB_ENTRY_BASE_MASK              0x007fffff
#define   FW_RD_HMB_ENTRY_BASE_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 fw_rd_hmb_entry_base:23;
        u32 rsvd_23:1;
        u32 fw_rd_hmb_reqst_mxsz:8;
    } b;
} fw_rd_hmb_reqst_base_t;

#define FW_RD_HMB_REQST_PTRS                     0x000002a4
#define   FW_RD_HMB_REQST_RPTR_MASK              0x0000ff00
#define   FW_RD_HMB_REQST_RPTR_SHIFT                      8
#define   FW_RD_HMB_REQST_WPTR_MASK              0x000000ff
#define   FW_RD_HMB_REQST_WPTR_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 fw_rd_hmb_reqst_wptr:8;
        u32 fw_rd_hmb_reqst_rptr:8;
        u32 rsvd_16:16;
    } b;
} fw_rd_hmb_reqst_ptrs_t;

#define FW_RD_HMB_RPTR_BASE                      0x000002a8
#define   FW_RD_HMB_RPTR_UPDT_EN_MASK            0x80000000
#define   FW_RD_HMB_RPTR_UPDT_EN_SHIFT                   31
#define   FW_RD_HMB_RPTR_BASE_MASK               0x007fffff
#define   FW_RD_HMB_RPTR_BASE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 fw_rd_hmb_rptr_base:23;
        u32 rsvd_23:8;
        u32 fw_rd_hmb_rptr_updt_en:1;
    } b;
} fw_rd_hmb_rptr_base_t;

#define FW_WR_HMB_REQST_BASE                     0x000002ac
#define   FW_WR_HMB_REQST_MXSZ_MASK              0xff000000
#define   FW_WR_HMB_REQST_MXSZ_SHIFT                     24
#define   FW_WR_HMB_REQST_BASE_MASK              0x007fffff
#define   FW_WR_HMB_REQST_BASE_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 fw_wr_hmb_reqst_base:23;
        u32 rsvd_23:1;
        u32 fw_wr_hmb_reqst_mxsz:8;
    } b;
} fw_wr_hmb_reqst_base_t;

#define FW_WR_HMB_REQST_PTRS                     0x000002b0
#define   FW_WR_HMB_REQST_RPTR_MASK              0x0000ff00
#define   FW_WR_HMB_REQST_RPTR_SHIFT                      8
#define   FW_WR_HMB_REQST_WPTR_MASK              0x000000ff
#define   FW_WR_HMB_REQST_WPTR_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 fw_wr_hmb_reqst_wptr:8;
        u32 fw_wr_hmb_reqst_rptr:8;
        u32 rsvd_16:16;
    } b;
} fw_wr_hmb_reqst_ptrs_t;

#define FW_WR_HMB_RPTR_BASE                      0x000002b4
#define   FW_WR_HMB_RPTR_UPDT_EN_MASK            0x80000000
#define   FW_WR_HMB_RPTR_UPDT_EN_SHIFT                   31
#define   FW_WR_HMB_RPTR_BASE_MASK               0x007fffff
#define   FW_WR_HMB_RPTR_BASE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 fw_wr_hmb_rptr_base:23;
        u32 rsvd_23:8;
        u32 fw_wr_hmb_rptr_updt_en:1;
    } b;
} fw_wr_hmb_rptr_base_t;

#define FW_ACCESS_HMB_COUNT                      0x000002b8
#define   FW_WR_HMB_DTAG_CNT_MASK                0xff000000
#define   FW_WR_HMB_DTAG_CNT_SHIFT                       24
#define   FW_WR_HMB_REQS_CNT_MASK                0x00ff0000
#define   FW_WR_HMB_REQS_CNT_SHIFT                       16
#define   FW_RD_HMB_REVD_CNT_MASK                0x0000ff00
#define   FW_RD_HMB_REVD_CNT_SHIFT                        8
#define   FW_RD_HMB_REQS_CNT_MASK                0x000000ff
#define   FW_RD_HMB_REQS_CNT_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 fw_rd_hmb_reqs_cnt:8;
        u32 fw_rd_hmb_revd_cnt:8;
        u32 fw_wr_hmb_reqs_cnt:8;
        u32 fw_wr_hmb_dtag_cnt:8;
    } b;
} fw_access_hmb_count_t;

#define BTN_HMB_DBUF_DBG_ST                      0x000002bc
#define   BTN_HMB_DBUF_DBG_ST_MASK               0x0000ffff
#define   BTN_HMB_DBUF_DBG_ST_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 btn_hmb_dbuf_dbg_st:16;
        u32 rsvd_16:16;
    } b;
} btn_hmb_dbuf_dbg_st_t;

#define HMB_RD_ERR_DTAG_ST                       0x000002c0
#define   HMB_RD_ERR_NOT_EMPTY_MASK              0x80000000
#define   HMB_RD_ERR_NOT_EMPTY_SHIFT                     31
#define   HMB_RD_ERR_DTAG_RPTR_MASK              0x00f00000
#define   HMB_RD_ERR_DTAG_RPTR_SHIFT                     20
#define   HMB_RD_ERR_DTAG_WPTR_MASK              0x000f0000
#define   HMB_RD_ERR_DTAG_WPTR_SHIFT                     16
#define   HMB_RD_ERR_DTAG_DATA_MASK              0x00000fff
#define   HMB_RD_ERR_DTAG_DATA_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 hmb_rd_err_dtag_data:12;
        u32 rsvd_12:4;
        u32 hmb_rd_err_dtag_wptr:4;
        u32 hmb_rd_err_dtag_rptr:4;
        u32 rsvd_24:7;
        u32 hmb_rd_err_not_empty:1;
    } b;
} hmb_rd_err_dtag_st_t;

#define HMB_WR_ERR_DTAG_ST                       0x000002c4
#define   HMB_WR_ERR_NOT_EMPTY_MASK              0x80000000
#define   HMB_WR_ERR_NOT_EMPTY_SHIFT                     31
#define   HMB_WR_ERR_DTAG_RPTR_MASK              0x00f00000
#define   HMB_WR_ERR_DTAG_RPTR_SHIFT                     20
#define   HMB_WR_ERR_DTAG_WPTR_MASK              0x000f0000
#define   HMB_WR_ERR_DTAG_WPTR_SHIFT                     16
#define   HMB_WR_ERR_DTAG_DATA_MASK              0x00000fff
#define   HMB_WR_ERR_DTAG_DATA_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 hmb_wr_err_dtag_data:12;
        u32 rsvd_12:4;
        u32 hmb_wr_err_dtag_wptr:4;
        u32 hmb_wr_err_dtag_rptr:4;
        u32 rsvd_24:7;
        u32 hmb_wr_err_not_empty:1;
    } b;
} hmb_wr_err_dtag_st_t;

#define DDR_TEST0_CONTROL                        0x000002d0
#define   DDR_TEST0_RD_CNT_MD_MASK               0x00200000
#define   DDR_TEST0_RD_CNT_MD_SHIFT                      21
#define   DDR_TEST0_WR_CNT_MD_MASK               0x00100000
#define   DDR_TEST0_WR_CNT_MD_SHIFT                      20
#define   DDR_TEST0_PAT_MIXMD_MASK               0x000c0000
#define   DDR_TEST0_PAT_MIXMD_SHIFT                      18
#define   DDR_TEST0_PAT_SELECT_MASK              0x00030000
#define   DDR_TEST0_PAT_SELECT_SHIFT                     16
#define   DDR_TEST0_LOOP_NUM_MASK                0x0000fff0
#define   DDR_TEST0_LOOP_NUM_SHIFT                        4
#define   DDR_TEST0_OPERATION_MASK               0x0000000c
#define   DDR_TEST0_OPERATION_SHIFT                       2
#define   DDR_TEST0_REPEATING_MASK               0x00000002
#define   DDR_TEST0_REPEATING_SHIFT                       1
#define   DDR_TEST0_RUN_START_MASK               0x00000001
#define   DDR_TEST0_RUN_START_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ddr_test0_run_start:1;
        u32 ddr_test0_repeating:1;
        u32 ddr_test0_operation:2;
        u32 ddr_test0_loop_num:12;
        u32 ddr_test0_pat_select:2;
        u32 ddr_test0_pat_mixmd:2;
        u32 ddr_test0_wr_cnt_md:1;
        u32 ddr_test0_rd_cnt_md:1;
        u32 rsvd_22:10;
    } b;
} ddr_test0_control_t;

#define DDR_TEST1_CONTROL                        0x000002d4
#define   DDR_TEST1_RD_CNT_MD_MASK               0x00200000
#define   DDR_TEST1_RD_CNT_MD_SHIFT                      21
#define   DDR_TEST1_WR_CNT_MD_MASK               0x00100000
#define   DDR_TEST1_WR_CNT_MD_SHIFT                      20
#define   DDR_TEST1_PAT_MIXMD_MASK               0x000c0000
#define   DDR_TEST1_PAT_MIXMD_SHIFT                      18
#define   DDR_TEST1_PAT_SELECT_MASK              0x00030000
#define   DDR_TEST1_PAT_SELECT_SHIFT                     16
#define   DDR_TEST1_LOOP_NUM_MASK                0x0000fff0
#define   DDR_TEST1_LOOP_NUM_SHIFT                        4
#define   DDR_TEST1_OPERATION_MASK               0x0000000c
#define   DDR_TEST1_OPERATION_SHIFT                       2
#define   DDR_TEST1_REPEATING_MASK               0x00000002
#define   DDR_TEST1_REPEATING_SHIFT                       1
#define   DDR_TEST1_RUN_START_MASK               0x00000001
#define   DDR_TEST1_RUN_START_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ddr_test1_run_start:1;
        u32 ddr_test1_repeating:1;
        u32 ddr_test1_operation:2;
        u32 ddr_test1_loop_num:12;
        u32 ddr_test1_pat_select:2;
        u32 ddr_test1_pat_mixmd:2;
        u32 ddr_test1_wr_cnt_md:1;
        u32 ddr_test1_rd_cnt_md:1;
        u32 rsvd_22:10;
    } b;
} ddr_test1_control_t;

#define DDR_TEST_FIXED_PATTERN                   0x000002d8
#define   DDR_TEST1_FIXED_PATTERN_MASK           0xffff0000
#define   DDR_TEST1_FIXED_PATTERN_SHIFT                  16
#define   DDR_TEST0_FIXED_PATTERN_MASK           0x0000ffff
#define   DDR_TEST0_FIXED_PATTERN_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 ddr_test0_fixed_pattern:16;
        u32 ddr_test1_fixed_pattern:16;
    } b;
} ddr_test_fixed_pattern_t;

#define DDR_TEST_SETTING_STATUS                  0x000002dc
#define   DDR_TEST1_ERR_COUNT_MASK               0xff000000
#define   DDR_TEST1_ERR_COUNT_SHIFT                      24
#define   DDR_TEST0_ERR_COUNT_MASK               0x00ff0000
#define   DDR_TEST0_ERR_COUNT_SHIFT                      16
#define   DDR_TEST1_ERR_UP2_ADR_MASK             0x0000c000
#define   DDR_TEST1_ERR_UP2_ADR_SHIFT                    14
#define   DDR_TEST0_ERR_UP2_ADR_MASK             0x00003000
#define   DDR_TEST0_ERR_UP2_ADR_SHIFT                    12
#define   DDR_TEST_LOOP_UNIT_MASK                0x00000070
#define   DDR_TEST_LOOP_UNIT_SHIFT                        4
#define   DDR_TEST1_LOOP_DONE_MASK               0x00000002
#define   DDR_TEST1_LOOP_DONE_SHIFT                       1
#define   DDR_TEST0_LOOP_DONE_MASK               0x00000001
#define   DDR_TEST0_LOOP_DONE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ddr_test0_loop_done:1;
        u32 ddr_test1_loop_done:1;
        u32 rsvd_2:2;
        u32 ddr_test_loop_unit:3;
        u32 rsvd_7:5;
        u32 ddr_test0_err_up2_adr:2;
        u32 ddr_test1_err_up2_adr:2;
        u32 ddr_test0_err_count:8;
        u32 ddr_test1_err_count:8;
    } b;
} ddr_test_setting_status_t;

#define DDR_TEST0_START_4KB_ADR                  0x000002e0
#define   DDR_ACCESS0_START_ADR_MASK             0x00ffffff
#define   DDR_ACCESS0_START_ADR_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ddr_access0_start_adr:24;
        u32 rsvd_24:8;
    } b;
} ddr_test0_start_4kb_adr_t;

#define DDR_TEST0_ENDING_4KB_ADR                 0x000002e4
#define   DDR_ACCESS0_ENDING_ADR_MASK            0x00ffffff
#define   DDR_ACCESS0_ENDING_ADR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ddr_access0_ending_adr:24;
        u32 rsvd_24:8;
    } b;
} ddr_test0_ending_4kb_adr_t;

#define DDR_TEST1_START_4KB_ADR                  0x000002e8
#define   DDR_ACCESS1_START_ADR_MASK             0x00ffffff
#define   DDR_ACCESS1_START_ADR_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ddr_access1_start_adr:24;
        u32 rsvd_24:8;
    } b;
} ddr_test1_start_4kb_adr_t;

#define DDR_TEST1_ENDING_4KB_ADR                 0x000002ec
#define   DDR_ACCESS1_ENDING_ADR_MASK            0x00ffffff
#define   DDR_ACCESS1_ENDING_ADR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ddr_access1_ending_adr:24;
        u32 rsvd_24:8;
    } b;
} ddr_test1_ending_4kb_adr_t;

#define TEST0_FIRST_RD_ERR_ADDR                  0x000002f0
#define   TEST0_FIRST_RD_ERR_ADDR_MASK           0xffffffff
#define   TEST0_FIRST_RD_ERR_ADDR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 test0_first_rd_err_addr:32;
    } b;
} test0_first_rd_err_addr_t;

#define TEST1_FIRST_RD_ERR_ADDR                  0x000002f4
#define   TEST1_FIRST_RD_ERR_ADDR_MASK           0xffffffff
#define   TEST1_FIRST_RD_ERR_ADDR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 test1_first_rd_err_addr:32;
    } b;
} test1_first_rd_err_addr_t;

#define FW_DDR_TEST_ACCESS_CTRL                  0x000002f8
#define   FW_DDR_TEST_ACCESS_MODE_MASK           0xf0000000
#define   FW_DDR_TEST_ACCESS_MODE_SHIFT                  28
#define   FW_DDR_TEST_ACCESS_ADDR_MASK           0x0000007f
#define   FW_DDR_TEST_ACCESS_ADDR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 fw_ddr_test_access_addr:7;
        u32 rsvd_7:21;
        u32 fw_ddr_test_access_mode:4;
    } b;
} fw_ddr_test_access_ctrl_t;

#define FW_DDR_TEST_ACCESS_DATA                  0x000002fc
#define   FW_DDR_TEST_ACCESS_DATA_MASK           0xffffffff
#define   FW_DDR_TEST_ACCESS_DATA_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 fw_ddr_test_access_data:32;
    } b;
} fw_ddr_test_access_data_t;

#define BTN_CMD_CTRL_STATUS                      0x00000300
#define   NVM_RLS_ERR_RCMD_CNT_MASK              0xffff0000
#define   NVM_RLS_ERR_RCMD_CNT_SHIFT                     16
#define   NVM_RLS_WCMD_QUE_FULL_MASK             0x00002000
#define   NVM_RLS_WCMD_QUE_FULL_SHIFT                    13
#define   NVM_RLS_RCMD_QUE_FULL_MASK             0x00001000
#define   NVM_RLS_RCMD_QUE_FULL_SHIFT                    12
#define   NCMD_QUEUE3_FULL_MASK                  0x00000800
#define   NCMD_QUEUE3_FULL_SHIFT                         11
#define   NCMD_QUEUE2_FULL_MASK                  0x00000400
#define   NCMD_QUEUE2_FULL_SHIFT                         10
#define   NCMD_QUEUE1_FULL_MASK                  0x00000200
#define   NCMD_QUEUE1_FULL_SHIFT                          9
#define   NCMD_QUEUE0_FULL_MASK                  0x00000100
#define   NCMD_QUEUE0_FULL_SHIFT                          8
#define   BTN_NCMD_CONTROL_MASK                  0x000000fe
#define   BTN_NCMD_CONTROL_SHIFT                          1
#define   BTN_NCMD_CNT_RST_MASK                  0x00000001
#define   BTN_NCMD_CNT_RST_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 btn_ncmd_cnt_rst:1;
        u32 btn_ncmd_control:7;
        u32 ncmd_queue0_full:1;
        u32 ncmd_queue1_full:1;
        u32 ncmd_queue2_full:1;
        u32 ncmd_queue3_full:1;
        u32 nvm_rls_rcmd_que_full:1;
        u32 nvm_rls_wcmd_que_full:1;
        u32 rsvd_14:2;
        u32 nvm_rls_err_rcmd_cnt:16;
    } b;
} btn_cmd_ctrl_status_t;

#define BTN_CMD_TAG_SPLIT_NUM                    0x00000304
#define   BTN_CMD_BUF_SPLIT_EN_MASK              0x80000000
#define   BTN_CMD_BUF_SPLIT_EN_SHIFT                     31
#define   BTN_CMD_TAG_SPLIT_NUM_MASK             0x00000fff
#define   BTN_CMD_TAG_SPLIT_NUM_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 btn_cmd_tag_split_num:12;
        u32 rsvd_12:19;
        u32 btn_cmd_buf_split_en:1;
    } b;
} btn_cmd_tag_split_num_t;

#define CMD_BUF_REGION0_BASE                     0x00000308
#define   CMD_BUF_REGION0_DTCM_MASK              0x00800000
#define   CMD_BUF_REGION0_DTCM_SHIFT                     23
#define   CMD_BUF_REGION0_BASE_MASK              0x007fffff
#define   CMD_BUF_REGION0_BASE_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cmd_buf_region0_base:23;
        u32 cmd_buf_region0_dtcm:1;
        u32 rsvd_24:8;
    } b;
} cmd_buf_region0_base_t;

#define CMD_BUF_REGION1_BASE                     0x0000030c
#define   CMD_BUF_REGION1_DTCM_MASK              0x00800000
#define   CMD_BUF_REGION1_DTCM_SHIFT                     23
#define   CMD_BUF_REGION1_BASE_MASK              0x007fffff
#define   CMD_BUF_REGION1_BASE_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cmd_buf_region1_base:23;
        u32 cmd_buf_region1_dtcm:1;
        u32 rsvd_24:8;
    } b;
} cmd_buf_region1_base_t;

#define P0_NRM_RD_CMD_SLOT_BASE                  0x00000310
#define   P0_NRM_RD_SLOT_MXSZ_MASK               0xff000000
#define   P0_NRM_RD_SLOT_MXSZ_SHIFT                      24
#define   P0_NRM_RD_CMD_SLOT_BASE_MASK           0x007fffff
#define   P0_NRM_RD_CMD_SLOT_BASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 p0_nrm_rd_cmd_slot_base:23;
        u32 rsvd_23:1;
        u32 p0_nrm_rd_slot_mxsz:8;
    } b;
} p0_nrm_rd_cmd_slot_base_t;

#define P0_NRM_RD_CMD_SLOT_PTRS                  0x00000314
#define   P0_NR_CMD_SLOT_RPTR_MASK               0x0000ff00
#define   P0_NR_CMD_SLOT_RPTR_SHIFT                       8
#define   P0_NR_CMD_SLOT_WPTR_MASK               0x000000ff
#define   P0_NR_CMD_SLOT_WPTR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 p0_nr_cmd_slot_wptr:8;
        u32 p0_nr_cmd_slot_rptr:8;
        u32 rsvd_16:16;
    } b;
} p0_nrm_rd_cmd_slot_ptrs_t;

#define P0_NRM_RD_SLOT_RPTR_BASE                 0x00000318
#define   P0_NR_SLOT_RPTR_UPDT_EN_MASK           0x80000000
#define   P0_NR_SLOT_RPTR_UPDT_EN_SHIFT                  31
#define   P0_NRM_RD_SLOT_RPTR_BASE_MASK          0x007fffff
#define   P0_NRM_RD_SLOT_RPTR_BASE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 p0_nrm_rd_slot_rptr_base:23;
        u32 rsvd_23:8;
        u32 p0_nr_slot_rptr_updt_en:1;
    } b;
} p0_nrm_rd_slot_rptr_base_t;

#define P0_PRI_RD_CMD_SLOT_BASE                  0x0000031c
#define   P0_PRI_RD_SLOT_MXSZ_MASK               0xff000000
#define   P0_PRI_RD_SLOT_MXSZ_SHIFT                      24
#define   P0_PRI_RD_CMD_SLOT_BASE_MASK           0x007fffff
#define   P0_PRI_RD_CMD_SLOT_BASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 p0_pri_rd_cmd_slot_base:23;
        u32 rsvd_23:1;
        u32 p0_pri_rd_slot_mxsz:8;
    } b;
} p0_pri_rd_cmd_slot_base_t;

#define P0_PRI_RD_CMD_SLOT_PTRS                  0x00000320
#define   P0_PR_CMD_SLOT_RPTR_MASK               0x0000ff00
#define   P0_PR_CMD_SLOT_RPTR_SHIFT                       8
#define   P0_PR_CMD_SLOT_WPTR_MASK               0x000000ff
#define   P0_PR_CMD_SLOT_WPTR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 p0_pr_cmd_slot_wptr:8;
        u32 p0_pr_cmd_slot_rptr:8;
        u32 rsvd_16:16;
    } b;
} p0_pri_rd_cmd_slot_ptrs_t;

#define P0_PRI_RD_SLOT_RPTR_BASE                 0x00000324
#define   P0_PR_SLOT_RPTR_UPDT_EN_MASK           0x80000000
#define   P0_PR_SLOT_RPTR_UPDT_EN_SHIFT                  31
#define   P0_PRI_RD_SLOT_RPTR_BASE_MASK          0x007fffff
#define   P0_PRI_RD_SLOT_RPTR_BASE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 p0_pri_rd_slot_rptr_base:23;
        u32 rsvd_23:8;
        u32 p0_pr_slot_rptr_updt_en:1;
    } b;
} p0_pri_rd_slot_rptr_base_t;

#define P0_NRM_WR_CMD_SLOT_BASE                  0x00000328
#define   P0_NRM_WR_SLOT_MXSZ_MASK               0xff000000
#define   P0_NRM_WR_SLOT_MXSZ_SHIFT                      24
#define   P0_NRM_WR_CMD_SLOT_BASE_MASK           0x007fffff
#define   P0_NRM_WR_CMD_SLOT_BASE_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 p0_nrm_wr_cmd_slot_base:23;
        u32 rsvd_23:1;
        u32 p0_nrm_wr_slot_mxsz:8;
    } b;
} p0_nrm_wr_cmd_slot_base_t;

#define P0_NRM_WR_CMD_SLOT_PTRS                  0x0000032c
#define   P0_NW_CMD_SLOT_RPTR_MASK               0x0000ff00
#define   P0_NW_CMD_SLOT_RPTR_SHIFT                       8
#define   P0_NW_CMD_SLOT_WPTR_MASK               0x000000ff
#define   P0_NW_CMD_SLOT_WPTR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 p0_nw_cmd_slot_wptr:8;
        u32 p0_nw_cmd_slot_rptr:8;
        u32 rsvd_16:16;
    } b;
} p0_nrm_wr_cmd_slot_ptrs_t;

#define P0_NRM_WR_SLOT_RPTR_BASE                 0x00000330
#define   P0_NW_SLOT_RPTR_UPDT_EN_MASK           0x80000000
#define   P0_NW_SLOT_RPTR_UPDT_EN_SHIFT                  31
#define   P0_NRM_WR_SLOT_RPTR_BASE_MASK          0x007fffff
#define   P0_NRM_WR_SLOT_RPTR_BASE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 p0_nrm_wr_slot_rptr_base:23;
        u32 rsvd_23:8;
        u32 p0_nw_slot_rptr_updt_en:1;
    } b;
} p0_nrm_wr_slot_rptr_base_t;

#define P0_GRP1_RD_CMD_SLOT_BASE                 0x00000334
#define   P0_GRP1_RD_SLOT_MXSZ_MASK              0xff000000
#define   P0_GRP1_RD_SLOT_MXSZ_SHIFT                     24
#define   P0_GRP1_RD_CMD_SLOT_BASE_MASK          0x007fffff
#define   P0_GRP1_RD_CMD_SLOT_BASE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 p0_grp1_rd_cmd_slot_base:23;
        u32 rsvd_23:1;
        u32 p0_grp1_rd_slot_mxsz:8;
    } b;
} p0_grp1_rd_cmd_slot_base_t;

#define P0_GRP1_RD_CMD_SLOT_PTRS                 0x00000338
#define   P0_GRP1_RD_SLOT_RPTR_MASK              0x0000ff00
#define   P0_GRP1_RD_SLOT_RPTR_SHIFT                      8
#define   P0_GRP1_RD_SLOT_WPTR_MASK              0x000000ff
#define   P0_GRP1_RD_SLOT_WPTR_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 p0_grp1_rd_slot_wptr:8;
        u32 p0_grp1_rd_slot_rptr:8;
        u32 rsvd_16:16;
    } b;
} p0_grp1_rd_cmd_slot_ptrs_t;

#define P0_GRP1_RD_SLOT_RPTR_BASE                0x0000033c
#define   P0_GRP1_SLOT_RPTR_UPDT_EN_MASK         0x80000000
#define   P0_GRP1_SLOT_RPTR_UPDT_EN_SHIFT                31
#define   P0_GRP1_RD_SLOT_RPTR_BASE_MASK         0x007fffff
#define   P0_GRP1_RD_SLOT_RPTR_BASE_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 p0_grp1_rd_slot_rptr_base:23;
        u32 rsvd_23:8;
        u32 p0_grp1_slot_rptr_updt_en:1;
    } b;
} p0_grp1_rd_slot_rptr_base_t;

#define NCMD_QUEUE_ASSIGNMENT                    0x00000360
#define   P0_GRP1_RD_QUE_NUM_MASK                0x00003000
#define   P0_GRP1_RD_QUE_NUM_SHIFT                       12
#define   P0_NRM_WR_QUE_NUM_MASK                 0x00000300
#define   P0_NRM_WR_QUE_NUM_SHIFT                         8
#define   P0_PRI_RD_QUE_NUM_MASK                 0x00000030
#define   P0_PRI_RD_QUE_NUM_SHIFT                         4
#define   P0_NRM_RD_QUE_NUM_MASK                 0x00000003
#define   P0_NRM_RD_QUE_NUM_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 p0_nrm_rd_que_num:2;
        u32 rsvd_2:2;
        u32 p0_pri_rd_que_num:2;
        u32 rsvd_6:2;
        u32 p0_nrm_wr_que_num:2;
        u32 rsvd_10:2;
        u32 p0_grp1_rd_que_num:2;
        u32 rsvd_14:18;
    } b;
} ncmd_queue_assignment_t;

#define NVM_CMD_QUEUE0_BASE                      0x00000364
#define   NCMD_QUEUE0_MXSZ_MASK                  0xff000000
#define   NCMD_QUEUE0_MXSZ_SHIFT                         24
#define   NCMD_QUEUE0_BASE_MASK                  0x007fffff
#define   NCMD_QUEUE0_BASE_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ncmd_queue0_base:23;
        u32 rsvd_23:1;
        u32 ncmd_queue0_mxsz:8;
    } b;
} nvm_cmd_queue0_base_t;

#define NVM_CMD_QUEUE0_PTRS                      0x00000368
#define   NCMD_QUEUE0_RPTR_MASK                  0x0000ff00
#define   NCMD_QUEUE0_RPTR_SHIFT                          8
#define   NCMD_QUEUE0_WPTR_MASK                  0x000000ff
#define   NCMD_QUEUE0_WPTR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ncmd_queue0_wptr:8;
        u32 ncmd_queue0_rptr:8;
        u32 rsvd_16:16;
    } b;
} nvm_cmd_queue0_ptrs_t;

#define NCMD_QUE0_WPTR_BASE                      0x0000036c
#define   NCMD_Q0_WPTR_UPDT_EN_MASK              0x80000000
#define   NCMD_Q0_WPTR_UPDT_EN_SHIFT                     31
#define   NCMD_QUE0_WPTR_BASE_MASK               0x007fffff
#define   NCMD_QUE0_WPTR_BASE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ncmd_que0_wptr_base:23;
        u32 rsvd_23:8;
        u32 ncmd_q0_wptr_updt_en:1;
    } b;
} ncmd_que0_wptr_base_t;

#define NVM_CMD_QUEUE1_BASE                      0x00000370
#define   NCMD_QUEUE1_MXSZ_MASK                  0xff000000
#define   NCMD_QUEUE1_MXSZ_SHIFT                         24
#define   NCMD_QUEUE1_BASE_MASK                  0x007fffff
#define   NCMD_QUEUE1_BASE_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ncmd_queue1_base:23;
        u32 rsvd_23:1;
        u32 ncmd_queue1_mxsz:8;
    } b;
} nvm_cmd_queue1_base_t;

#define NVM_CMD_QUEUE1_PTRS                      0x00000374
#define   NCMD_QUEUE1_RPTR_MASK                  0x0000ff00
#define   NCMD_QUEUE1_RPTR_SHIFT                          8
#define   NCMD_QUEUE1_WPTR_MASK                  0x000000ff
#define   NCMD_QUEUE1_WPTR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ncmd_queue1_wptr:8;
        u32 ncmd_queue1_rptr:8;
        u32 rsvd_16:16;
    } b;
} nvm_cmd_queue1_ptrs_t;

#define NCMD_QUE1_WPTR_BASE                      0x00000378
#define   NCMD_Q1_WPTR_UPDT_EN_MASK              0x80000000
#define   NCMD_Q1_WPTR_UPDT_EN_SHIFT                     31
#define   NCMD_QUE1_WPTR_BASE_MASK               0x007fffff
#define   NCMD_QUE1_WPTR_BASE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ncmd_que1_wptr_base:23;
        u32 rsvd_23:8;
        u32 ncmd_q1_wptr_updt_en:1;
    } b;
} ncmd_que1_wptr_base_t;

#define NVM_CMD_QUEUE2_BASE                      0x0000037c
#define   NCMD_QUEUE2_MXSZ_MASK                  0xff000000
#define   NCMD_QUEUE2_MXSZ_SHIFT                         24
#define   NCMD_QUEUE2_BASE_MASK                  0x007fffff
#define   NCMD_QUEUE2_BASE_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ncmd_queue2_base:23;
        u32 rsvd_23:1;
        u32 ncmd_queue2_mxsz:8;
    } b;
} nvm_cmd_queue2_base_t;

#define NVM_CMD_QUEUE2_PTRS                      0x00000380
#define   NCMD_QUEUE2_RPTR_MASK                  0x0000ff00
#define   NCMD_QUEUE2_RPTR_SHIFT                          8
#define   NCMD_QUEUE2_WPTR_MASK                  0x000000ff
#define   NCMD_QUEUE2_WPTR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ncmd_queue2_wptr:8;
        u32 ncmd_queue2_rptr:8;
        u32 rsvd_16:16;
    } b;
} nvm_cmd_queue2_ptrs_t;

#define NCMD_QUE2_WPTR_BASE                      0x00000384
#define   NCMD_Q2_WPTR_UPDT_EN_MASK              0x80000000
#define   NCMD_Q2_WPTR_UPDT_EN_SHIFT                     31
#define   NCMD_QUE2_WPTR_BASE_MASK               0x007fffff
#define   NCMD_QUE2_WPTR_BASE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ncmd_que2_wptr_base:23;
        u32 rsvd_23:8;
        u32 ncmd_q2_wptr_updt_en:1;
    } b;
} ncmd_que2_wptr_base_t;

#define NVM_CMD_QUEUE3_BASE                      0x00000388
#define   NCMD_QUEUE3_MXSZ_MASK                  0xff000000
#define   NCMD_QUEUE3_MXSZ_SHIFT                         24
#define   NCMD_QUEUE3_BASE_MASK                  0x007fffff
#define   NCMD_QUEUE3_BASE_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ncmd_queue3_base:23;
        u32 rsvd_23:1;
        u32 ncmd_queue3_mxsz:8;
    } b;
} nvm_cmd_queue3_base_t;

#define NVM_CMD_QUEUE3_PTRS                      0x0000038c
#define   NCMD_QUEUE3_RPTR_MASK                  0x0000ff00
#define   NCMD_QUEUE3_RPTR_SHIFT                          8
#define   NCMD_QUEUE3_WPTR_MASK                  0x000000ff
#define   NCMD_QUEUE3_WPTR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ncmd_queue3_wptr:8;
        u32 ncmd_queue3_rptr:8;
        u32 rsvd_16:16;
    } b;
} nvm_cmd_queue3_ptrs_t;

#define NCMD_QUE3_WPTR_BASE                      0x00000390
#define   NCMD_Q3_WPTR_UPDT_EN_MASK              0x80000000
#define   NCMD_Q3_WPTR_UPDT_EN_SHIFT                     31
#define   NCMD_QUE3_WPTR_BASE_MASK               0x007fffff
#define   NCMD_QUE3_WPTR_BASE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ncmd_que3_wptr_base:23;
        u32 rsvd_23:8;
        u32 ncmd_q3_wptr_updt_en:1;
    } b;
} ncmd_que3_wptr_base_t;

#define BTN_RLS_CMD_DONE_BASE                    0x000003a0
#define   BTN_RLS_CMD_DONE_MXSZ_MASK             0xff000000
#define   BTN_RLS_CMD_DONE_MXSZ_SHIFT                    24
#define   BTN_RLS_CMD_DONE_BASE_MASK             0x007fffff
#define   BTN_RLS_CMD_DONE_BASE_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 btn_rls_cmd_done_base:23;
        u32 rsvd_23:1;
        u32 btn_rls_cmd_done_mxsz:8;
    } b;
} btn_rls_cmd_done_base_t;

#define BTN_RLS_CMD_DONE_PTRS                    0x000003a4
#define   BTN_RLS_CMD_DONE_RPTR_MASK             0x0000ff00
#define   BTN_RLS_CMD_DONE_RPTR_SHIFT                     8
#define   BTN_RLS_CMD_DONE_WPTR_MASK             0x000000ff
#define   BTN_RLS_CMD_DONE_WPTR_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 btn_rls_cmd_done_wptr:8;
        u32 btn_rls_cmd_done_rptr:8;
        u32 rsvd_16:16;
    } b;
} btn_rls_cmd_done_ptrs_t;

#define BTN_RLS_DONE_RPTR_BASE                   0x000003a8
#define   BTN_RLS_DONE_RP_UPDT_EN_MASK           0x80000000
#define   BTN_RLS_DONE_RP_UPDT_EN_SHIFT                  31
#define   BTN_RLS_DONE_RPTR_BASE_MASK            0x007fffff
#define   BTN_RLS_DONE_RPTR_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 btn_rls_done_rptr_base:23;
        u32 rsvd_23:8;
        u32 btn_rls_done_rp_updt_en:1;
    } b;
} btn_rls_done_rptr_base_t;

#define NVM_RLS_RCMD_DONE_BASE                   0x000003ac
#define   NVM_RLS_RCMD_DONE_MXSZ_MASK            0xff000000
#define   NVM_RLS_RCMD_DONE_MXSZ_SHIFT                   24
#define   NVM_RLS_RCMD_DONE_BASE_MASK            0x007fffff
#define   NVM_RLS_RCMD_DONE_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 nvm_rls_rcmd_done_base:23;
        u32 rsvd_23:1;
        u32 nvm_rls_rcmd_done_mxsz:8;
    } b;
} nvm_rls_rcmd_done_base_t;

#define NVM_RLS_RCMD_DONE_PTRS                   0x000003b0
#define   NVM_RLS_RCMD_DONE_RPTR_MASK            0x0000ff00
#define   NVM_RLS_RCMD_DONE_RPTR_SHIFT                    8
#define   NVM_RLS_RCMD_DONE_WPTR_MASK            0x000000ff
#define   NVM_RLS_RCMD_DONE_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 nvm_rls_rcmd_done_wptr:8;
        u32 nvm_rls_rcmd_done_rptr:8;
        u32 rsvd_16:16;
    } b;
} nvm_rls_rcmd_done_ptrs_t;

#define NVM_RLS_RCMD_WPTR_BASE                   0x000003b4
#define   NVM_RLS_RCMD_WP_UPDT_EN_MASK           0x80000000
#define   NVM_RLS_RCMD_WP_UPDT_EN_SHIFT                  31
#define   NVM_RLS_RCMD_WPTR_BASE_MASK            0x007fffff
#define   NVM_RLS_RCMD_WPTR_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 nvm_rls_rcmd_wptr_base:23;
        u32 rsvd_23:8;
        u32 nvm_rls_rcmd_wp_updt_en:1;
    } b;
} nvm_rls_rcmd_wptr_base_t;

#define NVM_RELEASE_WCMD_BASE                    0x000003b8
#define   NVM_RELEASE_WCMD_MXSZ_MASK             0xff000000
#define   NVM_RELEASE_WCMD_MXSZ_SHIFT                    24
#define   NVM_RELEASE_WCMD_BASE_MASK             0x007fffff
#define   NVM_RELEASE_WCMD_BASE_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 nvm_release_wcmd_base:23;
        u32 rsvd_23:1;
        u32 nvm_release_wcmd_mxsz:8;
    } b;
} nvm_release_wcmd_base_t;

#define NVM_RELEASE_WCMD_PTRS                    0x000003bc
#define   NVM_RELEASE_WCMD_RPTR_MASK             0x0000ff00
#define   NVM_RELEASE_WCMD_RPTR_SHIFT                     8
#define   NVM_RELEASE_WCMD_WPTR_MASK             0x000000ff
#define   NVM_RELEASE_WCMD_WPTR_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 nvm_release_wcmd_wptr:8;
        u32 nvm_release_wcmd_rptr:8;
        u32 rsvd_16:16;
    } b;
} nvm_release_wcmd_ptrs_t;

#define NVM_RLS_WCMD_WPTR_BASE                   0x000003c0
#define   NVM_RLS_WCMD_WP_UPDT_EN_MASK           0x80000000
#define   NVM_RLS_WCMD_WP_UPDT_EN_SHIFT                  31
#define   NVM_RLS_WCMD_WPTR_BASE_MASK            0x007fffff
#define   NVM_RLS_WCMD_WPTR_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 nvm_rls_wcmd_wptr_base:23;
        u32 rsvd_23:8;
        u32 nvm_rls_wcmd_wp_updt_en:1;
    } b;
} nvm_rls_wcmd_wptr_base_t;

#define CMD_CTRL_INTER_STATUS                    0x000003c4
#define   CMD_CTRL_INTER_STATUS_MASK             0xffffffff
#define   CMD_CTRL_INTER_STATUS_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 cmd_ctrl_inter_status:32;
    } b;
} cmd_ctrl_inter_status_t;

#define BTN_CMD_RELEASE_COUNT                    0x000003c8
#define   BTN_CMD_RELEASE_COUNT_MASK             0xffffffff
#define   BTN_CMD_RELEASE_COUNT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 btn_cmd_release_count:32;
    } b;
} btn_cmd_release_count_t;

#define NVM_CMD_RELEASE_COUNT                    0x000003cc
#define   NVM_CMD_RELEASE_COUNT_MASK             0xffffffff
#define   NVM_CMD_RELEASE_COUNT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 nvm_cmd_release_count:32;
    } b;
} nvm_cmd_release_count_t;

#define NVM_R_CMD_RECEIVE_CNT                    0x000003d0
#define   NVM_R_CMD_RECEIVE_CNT_MASK             0xffffffff
#define   NVM_R_CMD_RECEIVE_CNT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 nvm_r_cmd_receive_cnt:32;
    } b;
} nvm_r_cmd_receive_cnt_t;

#define NVM_W_CMD_RECEIVE_CNT                    0x000003d4
#define   NVM_W_CMD_RECEIVE_CNT_MASK             0xffffffff
#define   NVM_W_CMD_RECEIVE_CNT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 nvm_w_cmd_receive_cnt:32;
    } b;
} nvm_w_cmd_receive_cnt_t;

#define NVM_CMD_REVD_TO_QUEUE                    0x000003d8
#define   NVM_CMD_REVD_TO_QUEUE_MASK             0xffffffff
#define   NVM_CMD_REVD_TO_QUEUE_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 nvm_cmd_revd_to_queue:32;
    } b;
} nvm_cmd_revd_to_queue_t;

#define NVM_C_CMD_RECEIVE_CNT                    0x000003dc
#define   NVM_C_CMD_RECEIVE_CNT_MASK             0xffffffff
#define   NVM_C_CMD_RECEIVE_CNT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 nvm_c_cmd_receive_cnt:32;
    } b;
} nvm_c_cmd_receive_cnt_t;

#define CRYPTO_CAPABILITY_REG                    0x00000400
#define   VERSION_MASK                           0xff000000
#define   VERSION_SHIFT                                  24
#define   SM4_SUPPORT_MASK                       0x00020000
#define   SM4_SUPPORT_SHIFT                              17
#define   AES_SUPPORT_MASK                       0x00010000
#define   AES_SUPPORT_SHIFT                              16
#define   CFG_NUM_MASK                           0x0000ff00
#define   CFG_NUM_SHIFT                                   8
#define   CAP_NUM_MASK                           0x000000ff
#define   CAP_NUM_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 cap_num:8;
        u32 cfg_num:8;
        u32 aes_support:1;
        u32 sm4_support:1;
        u32 rsvd_18:6;
        u32 version:8;
    } b;
} crypto_capability_reg_t;

#define CRYPTO_CAPABILITY0_REG                   0x00000404
#define   KEY_SIZE_MASK                          0x00ff0000
#define   KEY_SIZE_SHIFT                                 16
#define   DU_SIZE_MASK                           0x0000ff00
#define   DU_SIZE_SHIFT                                   8
#define   ALGORITHM_ID_MASK                      0x000000ff
#define   ALGORITHM_ID_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 algorithm_id:8;
        u32 du_size:8;
        u32 key_size:8;
        u32 rsvd_24:8;
    } b;
} crypto_capability0_reg_t;

#define CRYPTO_CAPABILITY1_REG                   0x00000408
#define   KEY_SIZE_408_MASK                      0x00ff0000
#define   KEY_SIZE_408_SHIFT                             16
#define   DU_SIZE_408_MASK                       0x0000ff00
#define   DU_SIZE_408_SHIFT                               8
#define   ALGORITHM_ID_408_MASK                  0x000000ff
#define   ALGORITHM_ID_408_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 algorithm_id_408:8;
        u32 du_size_408:8;
        u32 key_size_408:8;
        u32 rsvd_24:8;
    } b;
} crypto_capability1_reg_t;

#define CRYPTO_SYS_CFG_REG                       0x00000480
#define   REQUIRE_CLK_MASK                       0x80000000
#define   REQUIRE_CLK_SHIFT                              31
#define   KEY_MEM_WR_INIT_VAL_MASK               0x00700000
#define   KEY_MEM_WR_INIT_VAL_SHIFT                      20
#define   KEY_MEM_RD_INIT_VAL_MASK               0x00070000
#define   KEY_MEM_RD_INIT_VAL_SHIFT                      16

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:16;
        u32 key_mem_rd_init_val:3;
        u32 rsvd_19:1;
        u32 key_mem_wr_init_val:3;
        u32 rsvd_23:8;
        u32 require_clk:1;
    } b;
} crypto_sys_cfg_reg_t;

#define CRYPTO_CFG0_REG                          0x00000500
#define   CFG_EN_MASK                            0x80000000
#define   CFG_EN_SHIFT                                   31
#define   SM4_MODE_MASK                          0x40000000
#define   SM4_MODE_SHIFT                                 30
#define   DU_SIZE_SEL_MASK                       0x0000ff00
#define   DU_SIZE_SEL_SHIFT                               8
#define   KEY_SIZE_SEL_MASK                      0x000000f0
#define   KEY_SIZE_SEL_SHIFT                              4
#define   ALG_ID_SEL_MASK                        0x0000000f
#define   ALG_ID_SEL_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 alg_id_sel:4;
        u32 key_size_sel:4;
        u32 du_size_sel:8;
        u32 rsvd_16:14;
        u32 sm4_mode:1;
        u32 cfg_en:1;
    } b;
} crypto_cfg0_reg_t;

#define CRYPTO_CFG1_REG                          0x00000504
#define   CFG_EN_504_MASK                        0x80000000
#define   CFG_EN_504_SHIFT                               31
#define   SM4_MODE_504_MASK                      0x40000000
#define   SM4_MODE_504_SHIFT                             30
#define   DU_SIZE_SEL_504_MASK                   0x0000ff00
#define   DU_SIZE_SEL_504_SHIFT                           8
#define   KEY_SIZE_SEL_504_MASK                  0x000000f0
#define   KEY_SIZE_SEL_504_SHIFT                          4
#define   ALG_ID_SEL_504_MASK                    0x0000000f
#define   ALG_ID_SEL_504_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 alg_id_sel_504:4;
        u32 key_size_sel_504:4;
        u32 du_size_sel_504:8;
        u32 rsvd_16:14;
        u32 sm4_mode_504:1;
        u32 cfg_en_504:1;
    } b;
} crypto_cfg1_reg_t;

#define CRYPTO_CFG2_REG                          0x00000508
#define   CFG_EN_508_MASK                        0x80000000
#define   CFG_EN_508_SHIFT                               31
#define   SM4_MODE_508_MASK                      0x40000000
#define   SM4_MODE_508_SHIFT                             30
#define   DU_SIZE_SEL_508_MASK                   0x0000ff00
#define   DU_SIZE_SEL_508_SHIFT                           8
#define   KEY_SIZE_SEL_508_MASK                  0x000000f0
#define   KEY_SIZE_SEL_508_SHIFT                          4
#define   ALG_ID_SEL_508_MASK                    0x0000000f
#define   ALG_ID_SEL_508_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 alg_id_sel_508:4;
        u32 key_size_sel_508:4;
        u32 du_size_sel_508:8;
        u32 rsvd_16:14;
        u32 sm4_mode_508:1;
        u32 cfg_en_508:1;
    } b;
} crypto_cfg2_reg_t;

#define CRYPTO_CFG3_REG                          0x0000050c
#define   CFG_EN_50c_MASK                        0x80000000
#define   CFG_EN_50c_SHIFT                               31
#define   SM4_MODE_50c_MASK                      0x40000000
#define   SM4_MODE_50c_SHIFT                             30
#define   DU_SIZE_SEL_50c_MASK                   0x0000ff00
#define   DU_SIZE_SEL_50c_SHIFT                           8
#define   KEY_SIZE_SEL_50c_MASK                  0x000000f0
#define   KEY_SIZE_SEL_50c_SHIFT                          4
#define   ALG_ID_SEL_50c_MASK                    0x0000000f
#define   ALG_ID_SEL_50c_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 alg_id_sel_50c:4;
        u32 key_size_sel_50c:4;
        u32 du_size_sel_50c:8;
        u32 rsvd_16:14;
        u32 sm4_mode_50c:1;
        u32 cfg_en_50c:1;
    } b;
} crypto_cfg3_reg_t;

#define CRYPTO_SELFTEST_CFG_REG                  0x00000580
#define   ST_MODE_EN_MASK                        0x80000000
#define   ST_MODE_EN_SHIFT                               31
#define   ST_CLEAR_MASK                          0x00000002
#define   ST_CLEAR_SHIFT                                  1
#define   ST_START_TRIGGER_MASK                  0x00000001
#define   ST_START_TRIGGER_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 st_start_trigger:1;
        u32 st_clear:1;
        u32 rsvd_2:29;
        u32 st_mode_en:1;
    } b;
} crypto_selftest_cfg_reg_t;

#define CRYPTO_SELFTEST_CNT_REG                  0x00000584
#define   ST_CNT_VAL_MASK                        0x0000ffff
#define   ST_CNT_VAL_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 st_cnt_val:16;
        u32 rsvd_16:16;
    } b;
} crypto_selftest_cnt_reg_t;

#define CRYPTO_SELFTEST_STATUS_REG               0x00000588
#define   DU_CNT_REMAINING_MASK                  0xffff0000
#define   DU_CNT_REMAINING_SHIFT                         16
#define   DOUT_SIZE_ERR_MASK                     0x00000004
#define   DOUT_SIZE_ERR_SHIFT                             2
#define   DIN_SIZE_ERR_MASK                      0x00000002
#define   DIN_SIZE_ERR_SHIFT                              1
#define   FAIL_FLAG_MASK                         0x00000001
#define   FAIL_FLAG_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fail_flag:1;
        u32 din_size_err:1;
        u32 dout_size_err:1;
        u32 rsvd_3:13;
        u32 du_cnt_remaining:16;
    } b;
} crypto_selftest_status_reg_t;

#define CRYPTO_KEY_ADDR_REG                      0x00000600
#define   KEY_WRITE_VAL_MASK                     0xffffffff
#define   KEY_WRITE_VAL_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 key_write_val:32;
    } b;
} crypto_key_addr_reg_t;

#define CRYPTO_KEY_SEL_REG                       0x00000604
#define   INTERNAL_KEY_CNT_CLEARING_MASK         0x80000000
#define   INTERNAL_KEY_CNT_CLEARING_SHIFT                31
#define   PROG_DONE_MARK_CLEARING_MASK           0x40000000
#define   PROG_DONE_MARK_CLEARING_SHIFT                  30
#define   MEK_SRAM_INIT_MASK                     0x00010000
#define   MEK_SRAM_INIT_SHIFT                            16
#define   KEY_INDEX_SEL_MASK                     0x0000003f
#define   KEY_INDEX_SEL_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 key_index_sel:6;
        u32 rsvd_6:10;
        u32 mek_sram_init:1;
        u32 rsvd_17:13;
        u32 prog_done_mark_clearing:1;
        u32 internal_key_cnt_clearing:1;
    } b;
} crypto_key_sel_reg_t;

#define CRYPTO_KEY_ADDR_OFFSET_REG               0x00000608
#define   KEY_ADDR_OFFSET_MASK                   0x000003ff
#define   KEY_ADDR_OFFSET_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 key_addr_offset:10;
        u32 rsvd_10:22;
    } b;
} crypto_key_addr_offset_reg_t;

#define CRYPTO_KEY_PROG_DONE_REG                 0x0000060c
#define   KEY_PROG_DONE_MARK_MASK                0xffffffff
#define   KEY_PROG_DONE_MARK_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 key_prog_done_mark:32;
    } b;
} crypto_key_prog_done_reg_t;

#define CRYPTO_KEY_ECC_INFO_REG                  0x00000610
#define   ECC_SYNDROME_MASK                      0x03ff0000
#define   ECC_SYNDROME_SHIFT                             16
#define   ECC_SINGLE_BIT_PFIX_MASK               0x0000f000
#define   ECC_SINGLE_BIT_PFIX_SHIFT                      12
#define   ECC_SINGLE_BIT_FIX_MASK                0x00000f00
#define   ECC_SINGLE_BIT_FIX_SHIFT                        8
#define   ECC_DOUBLE_BIT_ERR_MASK                0x000000f0
#define   ECC_DOUBLE_BIT_ERR_SHIFT                        4
#define   ECC_SINGLE_BIT_ERR_MASK                0x0000000f
#define   ECC_SINGLE_BIT_ERR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ecc_single_bit_err:4;
        u32 ecc_double_bit_err:4;
        u32 ecc_single_bit_fix:4;
        u32 ecc_single_bit_pfix:4;
        u32 ecc_syndrome:10;
        u32 rsvd_26:6;
    } b;
} crypto_key_ecc_info_reg_t;

#define CRYPTO_LBA_MAP_INDEX_SEL                 0x00000630
#define   CURRENT_INDEX_MASK                     0x000007ff
#define   CURRENT_INDEX_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 current_index:11;
        u32 rsvd_11:21;
    } b;
} crypto_lba_map_index_sel_t;

#define CRYPTO_LBA_MAP_NSID_MISC                 0x00000634
#define   VALID_MASK                             0x80000000
#define   VALID_SHIFT                                    31
#define   CFG_SEL_MASK                           0x03000000
#define   CFG_SEL_SHIFT                                  24
#define   BYPASS_CRYPTO_MASK                     0x00040000
#define   BYPASS_CRYPTO_SHIFT                            18
#define   ISGLOBAL_NAMESPACE_MASK                0x00020000
#define   ISGLOBAL_NAMESPACE_SHIFT                       17
#define   ISGLOBAL_GLOBALLY_MASK                 0x00010000
#define   ISGLOBAL_GLOBALLY_SHIFT                        16
#define   NAMESPACE_ID_MASK                      0x000000ff
#define   NAMESPACE_ID_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 namespace_id:8;
        u32 rsvd_8:8;
        u32 isglobal_globally:1;
        u32 isglobal_namespace:1;
        u32 bypass_crypto:1;
        u32 rsvd_19:5;
        u32 cfg_sel:2;
        u32 rsvd_26:5;
        u32 valid:1;
    } b;
} crypto_lba_map_nsid_misc_t;

#define CRYPTO_LBA_MAP_RANGE_START               0x00000638
#define   RANGE_START_MASK                       0x03ffffff
#define   RANGE_START_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 range_start:26;
        u32 rsvd_26:6;
    } b;
} crypto_lba_map_range_start_t;

#define CRYPTO_LBA_MAP_RANGE_END                 0x0000063c
#define   RANGE_END_MASK                         0x03ffffff
#define   RANGE_END_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 range_end:26;
        u32 rsvd_26:6;
    } b;
} crypto_lba_map_range_end_t;

#define CRYPTO_LBA_MAP_CTRL_REG                  0x00000644
#define   KEY_REFRESH_REQUEST_MASK               0x00000004
#define   KEY_REFRESH_REQUEST_SHIFT                       2
#define   MAP_DEC_EN_MASK                        0x00000002
#define   MAP_DEC_EN_SHIFT                                1
#define   MAP_ENC_EN_MASK                        0x00000001
#define   MAP_ENC_EN_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 map_enc_en:1;
        u32 map_dec_en:1;
        u32 key_refresh_request:1;
        u32 rsvd_3:29;
    } b;
} crypto_lba_map_ctrl_reg_t;

#define CRYPTO_LBA_MAP_RE_ENC_REG                0x00000648
#define   RE_ENCRYPTION_KEY_INDEX_MASK           0xffff0000
#define   RE_ENCRYPTION_KEY_INDEX_SHIFT                  16
#define   RE_ENCRYPTION_CFG_SEL_MASK             0x0000000c
#define   RE_ENCRYPTION_CFG_SEL_SHIFT                     2
#define   RE_ENCRYPTION_BYPASS_MASK              0x00000002
#define   RE_ENCRYPTION_BYPASS_SHIFT                      1
#define   RE_ENCRYPTION_MODE_SEL_MASK            0x00000001
#define   RE_ENCRYPTION_MODE_SEL_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 re_encryption_mode_sel:1;
        u32 re_encryption_bypass:1;
        u32 re_encryption_cfg_sel:2;
        u32 rsvd_4:12;
        u32 re_encryption_key_index:16;
    } b;
} crypto_lba_map_re_enc_reg_t;

#define CRYPTO_BLK_CIPHER_EVENT_REG              0x00000650
#define   INVALID_DATA_SIZE_EVENT_MASK           0x00000004
#define   INVALID_DATA_SIZE_EVENT_SHIFT                   2
#define   DEC_LBA_MAP_MISS_EVENT_MASK            0x00000002
#define   DEC_LBA_MAP_MISS_EVENT_SHIFT                    1
#define   ENC_LBA_MAP_MISS_EVENT_MASK            0x00000001
#define   ENC_LBA_MAP_MISS_EVENT_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 enc_lba_map_miss_event:1;
        u32 dec_lba_map_miss_event:1;
        u32 invalid_data_size_event:1;
        u32 rsvd_3:29;
    } b;
} crypto_blk_cipher_event_reg_t;

#define CRYPTO_BLK_CIPHER_STATUS_REG             0x00000654
#define   MAP_DEC_STAT_MASK                      0x000000f0
#define   MAP_DEC_STAT_SHIFT                              4
#define   MAP_ENC_STAT_MASK                      0x0000000f
#define   MAP_ENC_STAT_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 map_enc_stat:4;
        u32 map_dec_stat:4;
        u32 rsvd_8:24;
    } b;
} crypto_blk_cipher_status_reg_t;

#define TABLE_CONTROL_STATUS                     0x00000800
#define   TBL_RSP_QUE3_N_EMPTY_MASK              0x00008000
#define   TBL_RSP_QUE3_N_EMPTY_SHIFT                     15
#define   TBL_RSP_QUE2_N_EMPTY_MASK              0x00004000
#define   TBL_RSP_QUE2_N_EMPTY_SHIFT                     14
#define   TBL_RSP_QUE1_N_EMPTY_MASK              0x00002000
#define   TBL_RSP_QUE1_N_EMPTY_SHIFT                     13
#define   TBL_RSP_QUE0_N_EMPTY_MASK              0x00001000
#define   TBL_RSP_QUE0_N_EMPTY_SHIFT                     12
#define   TBL_RSP_QUE3_FULL_MASK                 0x00000800
#define   TBL_RSP_QUE3_FULL_SHIFT                        11
#define   TBL_RSP_QUE2_FULL_MASK                 0x00000400
#define   TBL_RSP_QUE2_FULL_SHIFT                        10
#define   TBL_RSP_QUE1_FULL_MASK                 0x00000200
#define   TBL_RSP_QUE1_FULL_SHIFT                         9
#define   TBL_RSP_QUE0_FULL_MASK                 0x00000100
#define   TBL_RSP_QUE0_FULL_SHIFT                         8
#define   TBL_ECC_ERROR_MASK                     0x00000010
#define   TBL_ECC_ERROR_SHIFT                             4
#define   TBL_INIT_REQUEST_MASK                  0x00000002
#define   TBL_INIT_REQUEST_SHIFT                          1
#define   TBL_CTRL_ENABLE_MASK                   0x00000001
#define   TBL_CTRL_ENABLE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_enable:1;
        u32 tbl_init_request:1;
        u32 rsvd_2:2;
        u32 tbl_ecc_error:1;
        u32 rsvd_5:3;
        u32 tbl_rsp_que0_full:1;
        u32 tbl_rsp_que1_full:1;
        u32 tbl_rsp_que2_full:1;
        u32 tbl_rsp_que3_full:1;
        u32 tbl_rsp_que0_n_empty:1;
        u32 tbl_rsp_que1_n_empty:1;
        u32 tbl_rsp_que2_n_empty:1;
        u32 tbl_rsp_que3_n_empty:1;
        u32 rsvd_16:16;
    } b;
} table_control_status_t;

#define TBL_CTRL_CMD_QUE0_BASE                   0x00000804
#define   TBL_CTRL_CMD_QUE0_MXSZ_MASK            0xff000000
#define   TBL_CTRL_CMD_QUE0_MXSZ_SHIFT                   24
#define   TBL_CTRL_CMD_QUE0_BASE_MASK            0x007fffff
#define   TBL_CTRL_CMD_QUE0_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_cmd_que0_base:23;
        u32 rsvd_23:1;
        u32 tbl_ctrl_cmd_que0_mxsz:8;
    } b;
} tbl_ctrl_cmd_que0_base_t;

#define TBL_CTRL_CMD_QUE0_PTRS                   0x00000808
#define   TBL_CTRL_CMD_QUE0_RPTR_MASK            0x0000ff00
#define   TBL_CTRL_CMD_QUE0_RPTR_SHIFT                    8
#define   TBL_CTRL_CMD_QUE0_WPTR_MASK            0x000000ff
#define   TBL_CTRL_CMD_QUE0_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_cmd_que0_wptr:8;
        u32 tbl_ctrl_cmd_que0_rptr:8;
        u32 rsvd_16:16;
    } b;
} tbl_ctrl_cmd_que0_ptrs_t;

#define TBL_CMD_QUE0_RPTR_BASE                   0x0000080c
#define   TBL_CMD_QUE0_RP_UPDT_EN_MASK           0x80000000
#define   TBL_CMD_QUE0_RP_UPDT_EN_SHIFT                  31
#define   TBL_CMD_QUE0_RPTR_BASE_MASK            0x007fffff
#define   TBL_CMD_QUE0_RPTR_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_cmd_que0_rptr_base:23;
        u32 rsvd_23:8;
        u32 tbl_cmd_que0_rp_updt_en:1;
    } b;
} tbl_cmd_que0_rptr_base_t;

#define TBL_CTRL_RSP_QUE0_BASE                   0x00000810
#define   TBL_CTRL_RSP_QUE0_MXSZ_MASK            0xff000000
#define   TBL_CTRL_RSP_QUE0_MXSZ_SHIFT                   24
#define   TBL_CTRL_RSP_QUE0_BASE_MASK            0x007fffff
#define   TBL_CTRL_RSP_QUE0_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_rsp_que0_base:23;
        u32 rsvd_23:1;
        u32 tbl_ctrl_rsp_que0_mxsz:8;
    } b;
} tbl_ctrl_rsp_que0_base_t;

#define TBL_CTRL_RSP_QUE0_PTRS                   0x00000814
#define   TBL_CTRL_RSP_QUE0_RPTR_MASK            0x0000ff00
#define   TBL_CTRL_RSP_QUE0_RPTR_SHIFT                    8
#define   TBL_CTRL_RSP_QUE0_WPTR_MASK            0x000000ff
#define   TBL_CTRL_RSP_QUE0_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_rsp_que0_wptr:8;
        u32 tbl_ctrl_rsp_que0_rptr:8;
        u32 rsvd_16:16;
    } b;
} tbl_ctrl_rsp_que0_ptrs_t;

#define TBL_RSP_QUE0_WPTR_BASE                   0x00000818
#define   TBL_RSP_QUE0_WP_UPDT_EN_MASK           0x80000000
#define   TBL_RSP_QUE0_WP_UPDT_EN_SHIFT                  31
#define   TBL_RSP_QUE0_WPTR_BASE_MASK            0x007fffff
#define   TBL_RSP_QUE0_WPTR_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_rsp_que0_wptr_base:23;
        u32 rsvd_23:8;
        u32 tbl_rsp_que0_wp_updt_en:1;
    } b;
} tbl_rsp_que0_wptr_base_t;

#define TBL_CTRL_CMD_QUE1_BASE                   0x0000081c
#define   TBL_CTRL_CMD_QUE1_MXSZ_MASK            0xff000000
#define   TBL_CTRL_CMD_QUE1_MXSZ_SHIFT                   24
#define   TBL_CTRL_CMD_QUE1_BASE_MASK            0x007fffff
#define   TBL_CTRL_CMD_QUE1_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_cmd_que1_base:23;
        u32 rsvd_23:1;
        u32 tbl_ctrl_cmd_que1_mxsz:8;
    } b;
} tbl_ctrl_cmd_que1_base_t;

#define TBL_CTRL_CMD_QUE1_PTRS                   0x00000820
#define   TBL_CTRL_CMD_QUE1_RPTR_MASK            0x0000ff00
#define   TBL_CTRL_CMD_QUE1_RPTR_SHIFT                    8
#define   TBL_CTRL_CMD_QUE1_WPTR_MASK            0x000000ff
#define   TBL_CTRL_CMD_QUE1_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_cmd_que1_wptr:8;
        u32 tbl_ctrl_cmd_que1_rptr:8;
        u32 rsvd_16:16;
    } b;
} tbl_ctrl_cmd_que1_ptrs_t;

#define TBL_CMD_QUE1_RPTR_BASE                   0x00000824
#define   TBL_CMD_QUE1_RP_UPDT_EN_MASK           0x80000000
#define   TBL_CMD_QUE1_RP_UPDT_EN_SHIFT                  31
#define   TBL_CMD_QUE1_RPTR_BASE_MASK            0x007fffff
#define   TBL_CMD_QUE1_RPTR_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_cmd_que1_rptr_base:23;
        u32 rsvd_23:8;
        u32 tbl_cmd_que1_rp_updt_en:1;
    } b;
} tbl_cmd_que1_rptr_base_t;

#define TBL_CTRL_RSP_QUE1_BASE                   0x00000828
#define   TBL_CTRL_RSP_QUE1_MXSZ_MASK            0xff000000
#define   TBL_CTRL_RSP_QUE1_MXSZ_SHIFT                   24
#define   TBL_CTRL_RSP_QUE1_BASE_MASK            0x007fffff
#define   TBL_CTRL_RSP_QUE1_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_rsp_que1_base:23;
        u32 rsvd_23:1;
        u32 tbl_ctrl_rsp_que1_mxsz:8;
    } b;
} tbl_ctrl_rsp_que1_base_t;

#define TBL_CTRL_RSP_QUE1_PTRS                   0x0000082c
#define   TBL_CTRL_RSP_QUE1_RPTR_MASK            0x0000ff00
#define   TBL_CTRL_RSP_QUE1_RPTR_SHIFT                    8
#define   TBL_CTRL_RSP_QUE1_WPTR_MASK            0x000000ff
#define   TBL_CTRL_RSP_QUE1_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_rsp_que1_wptr:8;
        u32 tbl_ctrl_rsp_que1_rptr:8;
        u32 rsvd_16:16;
    } b;
} tbl_ctrl_rsp_que1_ptrs_t;

#define TBL_RSP_QUE1_WPTR_BASE                   0x00000830
#define   TBL_RSP_QUE1_WP_UPDT_EN_MASK           0x80000000
#define   TBL_RSP_QUE1_WP_UPDT_EN_SHIFT                  31
#define   TBL_RSP_QUE1_WPTR_BASE_MASK            0x007fffff
#define   TBL_RSP_QUE1_WPTR_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_rsp_que1_wptr_base:23;
        u32 rsvd_23:8;
        u32 tbl_rsp_que1_wp_updt_en:1;
    } b;
} tbl_rsp_que1_wptr_base_t;

#define TBL_CTRL_CMD_QUE2_BASE                   0x00000834
#define   TBL_CTRL_CMD_QUE2_MXSZ_MASK            0xff000000
#define   TBL_CTRL_CMD_QUE2_MXSZ_SHIFT                   24
#define   TBL_CTRL_CMD_QUE2_BASE_MASK            0x007fffff
#define   TBL_CTRL_CMD_QUE2_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_cmd_que2_base:23;
        u32 rsvd_23:1;
        u32 tbl_ctrl_cmd_que2_mxsz:8;
    } b;
} tbl_ctrl_cmd_que2_base_t;

#define TBL_CTRL_CMD_QUE2_PTRS                   0x00000838
#define   TBL_CTRL_CMD_QUE2_RPTR_MASK            0x0000ff00
#define   TBL_CTRL_CMD_QUE2_RPTR_SHIFT                    8
#define   TBL_CTRL_CMD_QUE2_WPTR_MASK            0x000000ff
#define   TBL_CTRL_CMD_QUE2_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_cmd_que2_wptr:8;
        u32 tbl_ctrl_cmd_que2_rptr:8;
        u32 rsvd_16:16;
    } b;
} tbl_ctrl_cmd_que2_ptrs_t;

#define TBL_CMD_QUE2_RPTR_BASE                   0x0000083c
#define   TBL_CMD_QUE2_RP_UPDT_EN_MASK           0x80000000
#define   TBL_CMD_QUE2_RP_UPDT_EN_SHIFT                  31
#define   TBL_CMD_QUE2_RPTR_BASE_MASK            0x007fffff
#define   TBL_CMD_QUE2_RPTR_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_cmd_que2_rptr_base:23;
        u32 rsvd_23:8;
        u32 tbl_cmd_que2_rp_updt_en:1;
    } b;
} tbl_cmd_que2_rptr_base_t;

#define TBL_CTRL_RSP_QUE2_BASE                   0x00000840
#define   TBL_CTRL_RSP_QUE2_MXSZ_MASK            0xff000000
#define   TBL_CTRL_RSP_QUE2_MXSZ_SHIFT                   24
#define   TBL_CTRL_RSP_QUE2_BASE_MASK            0x007fffff
#define   TBL_CTRL_RSP_QUE2_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_rsp_que2_base:23;
        u32 rsvd_23:1;
        u32 tbl_ctrl_rsp_que2_mxsz:8;
    } b;
} tbl_ctrl_rsp_que2_base_t;

#define TBL_CTRL_RSP_QUE2_PTRS                   0x00000844
#define   TBL_CTRL_RSP_QUE2_RPTR_MASK            0x0000ff00
#define   TBL_CTRL_RSP_QUE2_RPTR_SHIFT                    8
#define   TBL_CTRL_RSP_QUE2_WPTR_MASK            0x000000ff
#define   TBL_CTRL_RSP_QUE2_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_rsp_que2_wptr:8;
        u32 tbl_ctrl_rsp_que2_rptr:8;
        u32 rsvd_16:16;
    } b;
} tbl_ctrl_rsp_que2_ptrs_t;

#define TBL_RSP_QUE2_WPTR_BASE                   0x00000848
#define   TBL_RSP_QUE2_WP_UPDT_EN_MASK           0x80000000
#define   TBL_RSP_QUE2_WP_UPDT_EN_SHIFT                  31
#define   TBL_RSP_QUE2_WPTR_BASE_MASK            0x007fffff
#define   TBL_RSP_QUE2_WPTR_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_rsp_que2_wptr_base:23;
        u32 rsvd_23:8;
        u32 tbl_rsp_que2_wp_updt_en:1;
    } b;
} tbl_rsp_que2_wptr_base_t;

#define TBL_CTRL_CMD_QUE3_BASE                   0x0000084c
#define   TBL_CTRL_CMD_QUE3_MXSZ_MASK            0xff000000
#define   TBL_CTRL_CMD_QUE3_MXSZ_SHIFT                   24
#define   TBL_CTRL_CMD_QUE3_BASE_MASK            0x007fffff
#define   TBL_CTRL_CMD_QUE3_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_cmd_que3_base:23;
        u32 rsvd_23:1;
        u32 tbl_ctrl_cmd_que3_mxsz:8;
    } b;
} tbl_ctrl_cmd_que3_base_t;

#define TBL_CTRL_CMD_QUE3_PTRS                   0x00000850
#define   TBL_CTRL_CMD_QUE3_RPTR_MASK            0x0000ff00
#define   TBL_CTRL_CMD_QUE3_RPTR_SHIFT                    8
#define   TBL_CTRL_CMD_QUE3_WPTR_MASK            0x000000ff
#define   TBL_CTRL_CMD_QUE3_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_cmd_que3_wptr:8;
        u32 tbl_ctrl_cmd_que3_rptr:8;
        u32 rsvd_16:16;
    } b;
} tbl_ctrl_cmd_que3_ptrs_t;

#define TBL_CMD_QUE3_RPTR_BASE                   0x00000854
#define   TBL_CMD_QUE3_RP_UPDT_EN_MASK           0x80000000
#define   TBL_CMD_QUE3_RP_UPDT_EN_SHIFT                  31
#define   TBL_CMD_QUE3_RPTR_BASE_MASK            0x007fffff
#define   TBL_CMD_QUE3_RPTR_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_cmd_que3_rptr_base:23;
        u32 rsvd_23:8;
        u32 tbl_cmd_que3_rp_updt_en:1;
    } b;
} tbl_cmd_que3_rptr_base_t;

#define TBL_CTRL_RSP_QUE3_BASE                   0x00000858
#define   TBL_CTRL_RSP_QUE3_MXSZ_MASK            0xff000000
#define   TBL_CTRL_RSP_QUE3_MXSZ_SHIFT                   24
#define   TBL_CTRL_RSP_QUE3_BASE_MASK            0x007fffff
#define   TBL_CTRL_RSP_QUE3_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_rsp_que3_base:23;
        u32 rsvd_23:1;
        u32 tbl_ctrl_rsp_que3_mxsz:8;
    } b;
} tbl_ctrl_rsp_que3_base_t;

#define TBL_CTRL_RSP_QUE3_PTRS                   0x0000085c
#define   TBL_CTRL_RSP_QUE3_RPTR_MASK            0x0000ff00
#define   TBL_CTRL_RSP_QUE3_RPTR_SHIFT                    8
#define   TBL_CTRL_RSP_QUE3_WPTR_MASK            0x000000ff
#define   TBL_CTRL_RSP_QUE3_WPTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_rsp_que3_wptr:8;
        u32 tbl_ctrl_rsp_que3_rptr:8;
        u32 rsvd_16:16;
    } b;
} tbl_ctrl_rsp_que3_ptrs_t;

#define TBL_RSP_QUE3_WPTR_BASE                   0x00000860
#define   TBL_RSP_QUE3_WP_UPDT_EN_MASK           0x80000000
#define   TBL_RSP_QUE3_WP_UPDT_EN_SHIFT                  31
#define   TBL_RSP_QUE3_WPTR_BASE_MASK            0x007fffff
#define   TBL_RSP_QUE3_WPTR_BASE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 tbl_rsp_que3_wptr_base:23;
        u32 rsvd_23:8;
        u32 tbl_rsp_que3_wp_updt_en:1;
    } b;
} tbl_rsp_que3_wptr_base_t;

#define TBL_CTRL_DEBUG_ADDR                      0x00000864
#define   TBL_CTRL_DEBUG_ENBL_MASK               0x80000000
#define   TBL_CTRL_DEBUG_ENBL_SHIFT                      31
#define   TBL_CTRL_DEBUG_ADDR_MASK               0x0001ffff
#define   TBL_CTRL_DEBUG_ADDR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_debug_addr:17;
        u32 rsvd_17:14;
        u32 tbl_ctrl_debug_enbl:1;
    } b;
} tbl_ctrl_debug_addr_t;

#define TBL_CTRL_DEBUG_DATA                      0x00000868
#define   TBL_CTRL_DEBUG_DATA_MASK               0xffffffff
#define   TBL_CTRL_DEBUG_DATA_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_debug_data:32;
    } b;
} tbl_ctrl_debug_data_t;

#define TBL_CTRL_TBL_INFO0                       0x0000086c
#define   TBL_CTRL_TBL_INFO0_MASK                0xffffffff
#define   TBL_CTRL_TBL_INFO0_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_tbl_info0:32;
    } b;
} tbl_ctrl_tbl_info0_t;

#define TBL_CTRL_TBL_INFO1                       0x00000870
#define   TBL_CTRL_TBL_INFO1_MASK                0xffffffff
#define   TBL_CTRL_TBL_INFO1_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_tbl_info1:32;
    } b;
} tbl_ctrl_tbl_info1_t;

#define TBL_CTRL_TBL_INFO2                       0x00000874
#define   TBL_CTRL_TBL_INFO2_MASK                0xffffffff
#define   TBL_CTRL_TBL_INFO2_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_tbl_info2:32;
    } b;
} tbl_ctrl_tbl_info2_t;

#define TBL_CTRL_TBL_INFO3                       0x00000878
#define   TBL_CTRL_TBL_INFO3_MASK                0xffffffff
#define   TBL_CTRL_TBL_INFO3_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_tbl_info3:32;
    } b;
} tbl_ctrl_tbl_info3_t;

#define TBL_CTRL_TBL_INFO4                       0x0000087c
#define   TBL_CTRL_TBL_INFO4_MASK                0xffffffff
#define   TBL_CTRL_TBL_INFO4_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_tbl_info4:32;
    } b;
} tbl_ctrl_tbl_info4_t;

#define TBL_CTRL_TBL_INFO5                       0x00000880
#define   TBL_CTRL_TBL_INFO5_MASK                0xffffffff
#define   TBL_CTRL_TBL_INFO5_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_tbl_info5:32;
    } b;
} tbl_ctrl_tbl_info5_t;

#define TBL_CTRL_TBL_INFO6                       0x00000884
#define   TBL_CTRL_TBL_INFO6_MASK                0xffffffff
#define   TBL_CTRL_TBL_INFO6_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_tbl_info6:32;
    } b;
} tbl_ctrl_tbl_info6_t;

#define TBL_CTRL_TBL_INFO7                       0x00000888
#define   TBL_CTRL_TBL_INFO7_MASK                0xffffffff
#define   TBL_CTRL_TBL_INFO7_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_tbl_info7:32;
    } b;
} tbl_ctrl_tbl_info7_t;

#define TBL_CTRL_TBL_INFO8                       0x0000088c
#define   TBL_CTRL_TBL_INFO8_MASK                0xffffffff
#define   TBL_CTRL_TBL_INFO8_SHIFT                        0
typedef union {
    u32 all;
    struct {
        u32 tbl_ctrl_tbl_info8:32;
    } b;
} tbl_ctrl_tbl_info8_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ btn_um_int_sts_t btn_um_int_sts;
    /* 0x0004 */ btn_int_mask0_t btn_int_mask0;
    /* 0x0008 */ btn_mk_int_sts0_t btn_mk_int_sts0;
    /* 0x000c */ btn_int_mask1_t btn_int_mask1;
    /* 0x0010 */ btn_mk_int_sts1_t btn_mk_int_sts1;
    /* 0x0014 */ btn_int_mask2_t btn_int_mask2;
    /* 0x0018 */ btn_mk_int_sts2_t btn_mk_int_sts2;
    /* 0x001c */ btn_int_mask3_t btn_int_mask3;
    /* 0x0020 */ btn_mk_int_sts3_t btn_mk_int_sts3;
    /* 0x0024 */ u32 rsvd_24 [8];
    /* 0x0044 */ btn_control_reg_t btn_control_reg;
    /* 0x0048 */ btn_ctrl_status_t btn_ctrl_status;
    /* 0x004c */ btn_error_status_t btn_error_status;
    /* 0x0050 */ btn_sram_ecc_err_sts_t btn_sram_ecc_err_sts;
    /* 0x0054 */ rd_hcrc_err_data_t rd_hcrc_err_data;
    /* 0x0058 */ dxfr_sram_ecc_sts_t dxfr_sram_ecc_sts;
    /* 0x005c */ u32 rsvd_5c;
    /* 0x0060 */ inter_dbg_sts_select_t inter_dbg_sts_select;
    /* 0x0064 */ selected_inter_dbg_sts_t selected_inter_dbg_sts;
    /* 0x0068 */ u32 rsvd_68;
    /* 0x006c */ btn_ctag_pointers_t btn_ctag_pointers;
    /* 0x0070 */ wr_semistrm_ctrl_status_t wr_semistrm_ctrl_status;
    /* 0x0074 */ wr_semistrm_llst0_status_t wr_semistrm_llst0_status;
    /* 0x0078 */ wr_semistrm_llst1_status_t wr_semistrm_llst1_status;
    /* 0x007c */ u32 rsvd_7c;
    /* 0x0080 */ dtag_llist_ctrl_status_t dtag_llist_ctrl_status;
    /* 0x0084 */ dtag_llist_sts_sel_t dtag_llist_sts_sel;
    /* 0x0088 */ dtag_llist_sts_data_t dtag_llist_sts_data;
    /* 0x008c */ free_dtag_llist_push_t free_dtag_llist_push;
    /* 0x0090 */ fw_isu_wd_dtag_base_t fw_isu_wd_dtag_base;
    /* 0x0094 */ fw_isu_wd_dtag_ptrs_t fw_isu_wd_dtag_ptrs;
    /* 0x0098 */ fw_wdtag_rptr_updt_base_t fw_wdtag_rptr_updt_base;
    /* 0x009c */ fw_isu_frd_dtag0_base_t fw_isu_frd_dtag0_base;
    /* 0x00a0 */ fw_isu_frd_dtag0_ptrs_t fw_isu_frd_dtag0_ptrs;
    /* 0x00a4 */ fw_frdtag0_rptr_updt_base_t fw_frdtag0_rptr_updt_base;
    /* 0x00a8 */ fw_isu_frd_dtag1_base_t fw_isu_frd_dtag1_base;
    /* 0x00ac */ fw_isu_frd_dtag1_ptrs_t fw_isu_frd_dtag1_ptrs;
    /* 0x00b0 */ fw_frdtag1_rptr_updt_base_t fw_frdtag1_rptr_updt_base;
    /* 0x00b4 */ data_tag_llist_pop_t data_tag_llist_pop;
    /* 0x00b8 */ data_tag_ll_inter_sts_t data_tag_ll_inter_sts;
    /* 0x00bc */ u32 rsvd_bc;
    /* 0x00c0 */ wd_entry_llist_ctrl_status_t wd_entry_llist_ctrl_status;
    /* 0x00c4 */ wd_entry_llist_sts_sel_t wd_entry_llist_sts_sel;
    /* 0x00c8 */ wd_entry_llist_sts_data_t wd_entry_llist_sts_data;
    /* 0x00cc */ wd_entry_llist_pop_sel_t wd_entry_llist_pop_sel;
    /* 0x00d0 */ wd_entry_llist_pop_dat0_t wd_entry_llist_pop_dat0;
    /* 0x00d4 */ wd_entry_llist_pop_dat1_t wd_entry_llist_pop_dat1;
    /* 0x00d8 */ fw_wd_llist_test_sel_t fw_wd_llist_test_sel;
    /* 0x00dc */ fw_wd_llist_test_dat0_t fw_wd_llist_test_dat0;
    /* 0x00e0 */ fw_wd_llist_test_dat1_t fw_wd_llist_test_dat1;
    /* 0x00e4 */ fw_wd_llist_test_dat2_t fw_wd_llist_test_dat2;
    /* 0x00e8 */ u32 rsvd_e8 [3];
    /* 0x00f4 */ wd_entry_ll_inter_sts_t wd_entry_ll_inter_sts;
    /* 0x00f8 */ u32 rsvd_f8 [2];
    /* 0x0100 */ rd_entry_llist_ctrl_status_t rd_entry_llist_ctrl_status;
    /* 0x0104 */ rd_entry_llist_sts_sel_t rd_entry_llist_sts_sel;
    /* 0x0108 */ rd_entry_llist_sts_data_t rd_entry_llist_sts_data;
    /* 0x010c */ fw_push_rd_entry0_base_t fw_push_rd_entry0_base;
    /* 0x0110 */ fw_push_rd_entry0_ptrs_t fw_push_rd_entry0_ptrs;
    /* 0x0114 */ fw_push_rd_e0_rptr_base_t fw_push_rd_e0_rptr_base;
    /* 0x0118 */ fw_push_rd_entry1_base_t fw_push_rd_entry1_base;
    /* 0x011c */ fw_push_rd_entry1_ptrs_t fw_push_rd_entry1_ptrs;
    /* 0x0120 */ fw_push_rd_e1_rptr_base_t fw_push_rd_e1_rptr_base;
    /* 0x0124 */ rd_entry_llist_pop_sel_t rd_entry_llist_pop_sel;
    /* 0x0128 */ rd_entry_llist_pop_dat0_t rd_entry_llist_pop_dat0;
    /* 0x012c */ rd_entry_llist_pop_dat1_t rd_entry_llist_pop_dat1;
    /* 0x0130 */ fw_rd_llist_test_sel_t fw_rd_llist_test_sel;
    /* 0x0134 */ fw_rd_llist_test_dat0_t fw_rd_llist_test_dat0;
    /* 0x0138 */ fw_rd_llist_test_dat1_t fw_rd_llist_test_dat1;
    /* 0x013c */ rd_entry_llist_status_t rd_entry_llist_status;
    /* 0x0140 */ fw_pushes_read_du_cnt_t fw_pushes_read_du_cnt;
    /* 0x0144 */ btn_sent_read_du_cnt_t btn_sent_read_du_cnt;
    /* 0x0148 */ u32 rsvd_148 [2];
    /* 0x0150 */ btn_auto_updt_enable_t btn_auto_updt_enable;
    /* 0x0154 */ btn_wd_adrs_surc0_base_t btn_wd_adrs_surc0_base;
    /* 0x0158 */ btn_wd_adrs_surc0_ptrs_t btn_wd_adrs_surc0_ptrs;
    /* 0x015c */ btn_wd_adrs0_rptr_dbase_t btn_wd_adrs0_rptr_dbase;
    /* 0x0160 */ btn_wd_adrs0_updt_base_t btn_wd_adrs0_updt_base;
    /* 0x0164 */ btn_wd_adrs0_updt_ptrs_t btn_wd_adrs0_updt_ptrs;
    /* 0x0168 */ btn_wd_adrs0_wptr_dbase_t btn_wd_adrs0_wptr_dbase;
    /* 0x016c */ btn_wd_adrs_surc1_base_t btn_wd_adrs_surc1_base;
    /* 0x0170 */ btn_wd_adrs_surc1_ptrs_t btn_wd_adrs_surc1_ptrs;
    /* 0x0174 */ btn_wd_adrs1_rptr_dbase_t btn_wd_adrs1_rptr_dbase;
    /* 0x0178 */ btn_wd_adrs1_updt_base_t btn_wd_adrs1_updt_base;
    /* 0x017c */ btn_wd_adrs1_updt_ptrs_t btn_wd_adrs1_updt_ptrs;
    /* 0x0180 */ btn_wd_adrs1_wptr_dbase_t btn_wd_adrs1_wptr_dbase;
    /* 0x0184 */ btn_rd_adrs_surc0_base_t btn_rd_adrs_surc0_base;
    /* 0x0188 */ btn_rd_adrs_surc0_ptrs_t btn_rd_adrs_surc0_ptrs;
    /* 0x018c */ btn_rd_surc0_rptr_dbase_t btn_rd_surc0_rptr_dbase;
    /* 0x0190 */ btn_rd_adrs0_updt_base_t btn_rd_adrs0_updt_base;
    /* 0x0194 */ btn_rd_adrs0_updt_ptrs_t btn_rd_adrs0_updt_ptrs;
    /* 0x0198 */ btn_rd_adrs0_wptr_dbase_t btn_rd_adrs0_wptr_dbase;
    /* 0x019c */ btn_rd_adrs_surc1_base_t btn_rd_adrs_surc1_base;
    /* 0x01a0 */ btn_rd_adrs_surc1_ptrs_t btn_rd_adrs_surc1_ptrs;
    /* 0x01a4 */ btn_rd_surc1_rptr_dbase_t btn_rd_surc1_rptr_dbase;
    /* 0x01a8 */ btn_rd_adrs1_updt_base_t btn_rd_adrs1_updt_base;
    /* 0x01ac */ btn_rd_adrs1_updt_ptrs_t btn_rd_adrs1_updt_ptrs;
    /* 0x01b0 */ btn_rd_adrs1_wptr_dbase_t btn_rd_adrs1_wptr_dbase;
    /* 0x01b4 */ btn_wd_adrs0_updt1_base_t btn_wd_adrs0_updt1_base;
    /* 0x01b8 */ btn_wd_adrs0_updt1_ptrs_t btn_wd_adrs0_updt1_ptrs;
    /* 0x01bc */ btn_wd_adrs0_wptr1_dbase_t btn_wd_adrs0_wptr1_dbase;
    /* 0x01c0 */ btn_wd_adrs0_updt2_base_t btn_wd_adrs0_updt2_base;
    /* 0x01c4 */ btn_wd_adrs0_updt2_ptrs_t btn_wd_adrs0_updt2_ptrs;
    /* 0x01c8 */ btn_wd_adrs0_wptr2_dbase_t btn_wd_adrs0_wptr2_dbase;
    /* 0x01cc */ u32 rsvd_1cc [6];
    /* 0x01e4 */ btn_com_free_dtag_dbase_t btn_com_free_dtag_dbase;
    /* 0x01e8 */ btn_com_free_dtag_ptrs_t btn_com_free_dtag_ptrs;
    /* 0x01ec */ btn_com_free_wptr_dbase_t btn_com_free_wptr_dbase;
    /* 0x01f0 */ data_entry_err_count_t data_entry_err_count;
    /* 0x01f4 */ u32 rsvd_1f4 [3];
    /* 0x0200 */ s_base_s_dtag_hmeta_t s_base_s_dtag_hmeta;
    /* 0x0204 */ u32 rsvd_204 [2];
    /* 0x020c */ d_base_d_dtag_hmeta_t d_base_d_dtag_hmeta;
    /* 0x0210 */ d_base_d_dtag_hscrc_t d_base_d_dtag_hscrc;
    /* 0x0214 */ u32 rsvd_214 [3];
    /* 0x0220 */ data_process_ctrl_sts_t data_process_ctrl_sts;
    /* 0x0224 */ data_proc_req_sram_base_t data_proc_req_sram_base;
    /* 0x0228 */ data_proc_req_pointer_t data_proc_req_pointer;
    /* 0x022c */ data_proc_res_sram_base_t data_proc_res_sram_base;
    /* 0x0230 */ data_proc_res_pointer_t data_proc_res_pointer;
    /* 0x0234 */ dp_search_res_sram_base_t dp_search_res_sram_base;
    /* 0x0238 */ sec_fingerprint_prog_t sec_fingerprint_prog;
    /* 0x023c */ sec_fingerprint_fetch_t sec_fingerprint_fetch;
    /* 0x0240 */ data_proc_req1_sram_base_t data_proc_req1_sram_base;
    /* 0x0244 */ data_proc_req1_pointer_t data_proc_req1_pointer;
    /* 0x0248 */ data_proc_res1_sram_base_t data_proc_res1_sram_base;
    /* 0x024c */ data_proc_res1_pointer_t data_proc_res1_pointer;
    /* 0x0250 */ read_unmap_ctrl_reg_t read_unmap_ctrl_reg;
    /* 0x0254 */ write_dummy_ctrl_reg_t write_dummy_ctrl_reg;
    /* 0x0258 */ read_unmap_data_pat_t read_unmap_data_pat;
    /* 0x025c */ write_dummy_data_pat_t write_dummy_data_pat;
    /* 0x0260 */ btn_sram_rd_addr_t btn_sram_rd_addr;
    /* 0x0264 */ btn_sram_rd_dat0_t btn_sram_rd_dat0;
    /* 0x0268 */ btn_sram_rd_dat1_t btn_sram_rd_dat1;
    /* 0x026c */ btn_sram_rd_dat2_t btn_sram_rd_dat2;
    /* 0x0270 */ btn_hcrc_sram_write_t btn_hcrc_sram_write;
    /* 0x0274 */ sram_ecc_error_inject_t sram_ecc_error_inject;
    /* 0x0278 */ read_dummy_ctrl_reg_t read_dummy_ctrl_reg;
    /* 0x027c */ read_dummy_data_pat_t read_dummy_data_pat;
    /* 0x0280 */ sec_subsystem_ctrl_t sec_subsystem_ctrl;
    /* 0x0284 */ read_unmap1_ctrl_reg_t read_unmap1_ctrl_reg;
    /* 0x0288 */ read_unmap1_data_pat_t read_unmap1_data_pat;
    /* 0x028c */ u32 rsvd_28c [5];
    /* 0x02a0 */ fw_rd_hmb_reqst_base_t fw_rd_hmb_reqst_base;
    /* 0x02a4 */ fw_rd_hmb_reqst_ptrs_t fw_rd_hmb_reqst_ptrs;
    /* 0x02a8 */ fw_rd_hmb_rptr_base_t fw_rd_hmb_rptr_base;
    /* 0x02ac */ fw_wr_hmb_reqst_base_t fw_wr_hmb_reqst_base;
    /* 0x02b0 */ fw_wr_hmb_reqst_ptrs_t fw_wr_hmb_reqst_ptrs;
    /* 0x02b4 */ fw_wr_hmb_rptr_base_t fw_wr_hmb_rptr_base;
    /* 0x02b8 */ fw_access_hmb_count_t fw_access_hmb_count;
    /* 0x02bc */ btn_hmb_dbuf_dbg_st_t btn_hmb_dbuf_dbg_st;
    /* 0x02c0 */ hmb_rd_err_dtag_st_t hmb_rd_err_dtag_st;
    /* 0x02c4 */ hmb_wr_err_dtag_st_t hmb_wr_err_dtag_st;
    /* 0x02c8 */ u32 rsvd_2c8 [2];
    /* 0x02d0 */ ddr_test0_control_t ddr_test0_control;
    /* 0x02d4 */ ddr_test1_control_t ddr_test1_control;
    /* 0x02d8 */ ddr_test_fixed_pattern_t ddr_test_fixed_pattern;
    /* 0x02dc */ ddr_test_setting_status_t ddr_test_setting_status;
    /* 0x02e0 */ ddr_test0_start_4kb_adr_t ddr_test0_start_4kb_adr;
    /* 0x02e4 */ ddr_test0_ending_4kb_adr_t ddr_test0_ending_4kb_adr;
    /* 0x02e8 */ ddr_test1_start_4kb_adr_t ddr_test1_start_4kb_adr;
    /* 0x02ec */ ddr_test1_ending_4kb_adr_t ddr_test1_ending_4kb_adr;
    /* 0x02f0 */ test0_first_rd_err_addr_t test0_first_rd_err_addr;
    /* 0x02f4 */ test1_first_rd_err_addr_t test1_first_rd_err_addr;
    /* 0x02f8 */ fw_ddr_test_access_ctrl_t fw_ddr_test_access_ctrl;
    /* 0x02fc */ fw_ddr_test_access_data_t fw_ddr_test_access_data;
    /* 0x0300 */ btn_cmd_ctrl_status_t btn_cmd_ctrl_status;
    /* 0x0304 */ btn_cmd_tag_split_num_t btn_cmd_tag_split_num;
    /* 0x0308 */ cmd_buf_region0_base_t cmd_buf_region0_base;
    /* 0x030c */ cmd_buf_region1_base_t cmd_buf_region1_base;
    /* 0x0310 */ p0_nrm_rd_cmd_slot_base_t p0_nrm_rd_cmd_slot_base;
    /* 0x0314 */ p0_nrm_rd_cmd_slot_ptrs_t p0_nrm_rd_cmd_slot_ptrs;
    /* 0x0318 */ p0_nrm_rd_slot_rptr_base_t p0_nrm_rd_slot_rptr_base;
    /* 0x031c */ p0_pri_rd_cmd_slot_base_t p0_pri_rd_cmd_slot_base;
    /* 0x0320 */ p0_pri_rd_cmd_slot_ptrs_t p0_pri_rd_cmd_slot_ptrs;
    /* 0x0324 */ p0_pri_rd_slot_rptr_base_t p0_pri_rd_slot_rptr_base;
    /* 0x0328 */ p0_nrm_wr_cmd_slot_base_t p0_nrm_wr_cmd_slot_base;
    /* 0x032c */ p0_nrm_wr_cmd_slot_ptrs_t p0_nrm_wr_cmd_slot_ptrs;
    /* 0x0330 */ p0_nrm_wr_slot_rptr_base_t p0_nrm_wr_slot_rptr_base;
    /* 0x0334 */ p0_grp1_rd_cmd_slot_base_t p0_grp1_rd_cmd_slot_base;
    /* 0x0338 */ p0_grp1_rd_cmd_slot_ptrs_t p0_grp1_rd_cmd_slot_ptrs;
    /* 0x033c */ p0_grp1_rd_slot_rptr_base_t p0_grp1_rd_slot_rptr_base;
    /* 0x0340 */ u32 rsvd_340 [8];
    /* 0x0360 */ ncmd_queue_assignment_t ncmd_queue_assignment;
    /* 0x0364 */ nvm_cmd_queue0_base_t nvm_cmd_queue0_base;
    /* 0x0368 */ nvm_cmd_queue0_ptrs_t nvm_cmd_queue0_ptrs;
    /* 0x036c */ ncmd_que0_wptr_base_t ncmd_que0_wptr_base;
    /* 0x0370 */ nvm_cmd_queue1_base_t nvm_cmd_queue1_base;
    /* 0x0374 */ nvm_cmd_queue1_ptrs_t nvm_cmd_queue1_ptrs;
    /* 0x0378 */ ncmd_que1_wptr_base_t ncmd_que1_wptr_base;
    /* 0x037c */ nvm_cmd_queue2_base_t nvm_cmd_queue2_base;
    /* 0x0380 */ nvm_cmd_queue2_ptrs_t nvm_cmd_queue2_ptrs;
    /* 0x0384 */ ncmd_que2_wptr_base_t ncmd_que2_wptr_base;
    /* 0x0388 */ nvm_cmd_queue3_base_t nvm_cmd_queue3_base;
    /* 0x038c */ nvm_cmd_queue3_ptrs_t nvm_cmd_queue3_ptrs;
    /* 0x0390 */ ncmd_que3_wptr_base_t ncmd_que3_wptr_base;
    /* 0x0394 */ u32 rsvd_394 [3];
    /* 0x03a0 */ btn_rls_cmd_done_base_t btn_rls_cmd_done_base;
    /* 0x03a4 */ btn_rls_cmd_done_ptrs_t btn_rls_cmd_done_ptrs;
    /* 0x03a8 */ btn_rls_done_rptr_base_t btn_rls_done_rptr_base;
    /* 0x03ac */ nvm_rls_rcmd_done_base_t nvm_rls_rcmd_done_base;
    /* 0x03b0 */ nvm_rls_rcmd_done_ptrs_t nvm_rls_rcmd_done_ptrs;
    /* 0x03b4 */ nvm_rls_rcmd_wptr_base_t nvm_rls_rcmd_wptr_base;
    /* 0x03b8 */ nvm_release_wcmd_base_t nvm_release_wcmd_base;
    /* 0x03bc */ nvm_release_wcmd_ptrs_t nvm_release_wcmd_ptrs;
    /* 0x03c0 */ nvm_rls_wcmd_wptr_base_t nvm_rls_wcmd_wptr_base;
    /* 0x03c4 */ cmd_ctrl_inter_status_t cmd_ctrl_inter_status;
    /* 0x03c8 */ btn_cmd_release_count_t btn_cmd_release_count;
    /* 0x03cc */ nvm_cmd_release_count_t nvm_cmd_release_count;
    /* 0x03d0 */ nvm_r_cmd_receive_cnt_t nvm_r_cmd_receive_cnt;
    /* 0x03d4 */ nvm_w_cmd_receive_cnt_t nvm_w_cmd_receive_cnt;
    /* 0x03d8 */ nvm_cmd_revd_to_queue_t nvm_cmd_revd_to_queue;
    /* 0x03dc */ nvm_c_cmd_receive_cnt_t nvm_c_cmd_receive_cnt;
    /* 0x03e0 */ u32 rsvd_3e0 [8];
    /* 0x0400 */ crypto_capability_reg_t crypto_capability_reg;
    /* 0x0404 */ crypto_capability0_reg_t crypto_capability0_reg;
    /* 0x0408 */ crypto_capability1_reg_t crypto_capability1_reg;
    /* 0x040c */ u32 rsvd_40c [29];
    /* 0x0480 */ crypto_sys_cfg_reg_t crypto_sys_cfg_reg;
    /* 0x0484 */ u32 rsvd_484 [31];
    /* 0x0500 */ crypto_cfg0_reg_t crypto_cfg0_reg;
    /* 0x0504 */ crypto_cfg1_reg_t crypto_cfg1_reg;
    /* 0x0508 */ crypto_cfg2_reg_t crypto_cfg2_reg;
    /* 0x050c */ crypto_cfg3_reg_t crypto_cfg3_reg;
    /* 0x0510 */ u32 rsvd_510 [28];
    /* 0x0580 */ crypto_selftest_cfg_reg_t crypto_selftest_cfg_reg;
    /* 0x0584 */ crypto_selftest_cnt_reg_t crypto_selftest_cnt_reg;
    /* 0x0588 */ crypto_selftest_status_reg_t crypto_selftest_status_reg;
    /* 0x058c */ u32 rsvd_58c [29];
    /* 0x0600 */ crypto_key_addr_reg_t crypto_key_addr_reg;
    /* 0x0604 */ crypto_key_sel_reg_t crypto_key_sel_reg;
    /* 0x0608 */ crypto_key_addr_offset_reg_t crypto_key_addr_offset_reg;
    /* 0x060c */ crypto_key_prog_done_reg_t crypto_key_prog_done_reg;
    /* 0x0610 */ crypto_key_ecc_info_reg_t crypto_key_ecc_info_reg;
    /* 0x0614 */ u32 rsvd_614 [7];
    /* 0x0630 */ crypto_lba_map_index_sel_t crypto_lba_map_index_sel;
    /* 0x0634 */ crypto_lba_map_nsid_misc_t crypto_lba_map_nsid_misc;
    /* 0x0638 */ crypto_lba_map_range_start_t crypto_lba_map_range_start;
    /* 0x063c */ crypto_lba_map_range_end_t crypto_lba_map_range_end;
    /* 0x0640 */ u32 rsvd_640;
    /* 0x0644 */ crypto_lba_map_ctrl_reg_t crypto_lba_map_ctrl_reg;
    /* 0x0648 */ crypto_lba_map_re_enc_reg_t crypto_lba_map_re_enc_reg;
    /* 0x064c */ u32 rsvd_64c;
    /* 0x0650 */ crypto_blk_cipher_event_reg_t crypto_blk_cipher_event_reg;
    /* 0x0654 */ crypto_blk_cipher_status_reg_t crypto_blk_cipher_status_reg;
    /* 0x0658 */ u32 rsvd_658 [106];
    /* 0x0800 */ table_control_status_t table_control_status;
    /* 0x0804 */ tbl_ctrl_cmd_que0_base_t tbl_ctrl_cmd_que0_base;
    /* 0x0808 */ tbl_ctrl_cmd_que0_ptrs_t tbl_ctrl_cmd_que0_ptrs;
    /* 0x080c */ tbl_cmd_que0_rptr_base_t tbl_cmd_que0_rptr_base;
    /* 0x0810 */ tbl_ctrl_rsp_que0_base_t tbl_ctrl_rsp_que0_base;
    /* 0x0814 */ tbl_ctrl_rsp_que0_ptrs_t tbl_ctrl_rsp_que0_ptrs;
    /* 0x0818 */ tbl_rsp_que0_wptr_base_t tbl_rsp_que0_wptr_base;
    /* 0x081c */ tbl_ctrl_cmd_que1_base_t tbl_ctrl_cmd_que1_base;
    /* 0x0820 */ tbl_ctrl_cmd_que1_ptrs_t tbl_ctrl_cmd_que1_ptrs;
    /* 0x0824 */ tbl_cmd_que1_rptr_base_t tbl_cmd_que1_rptr_base;
    /* 0x0828 */ tbl_ctrl_rsp_que1_base_t tbl_ctrl_rsp_que1_base;
    /* 0x082c */ tbl_ctrl_rsp_que1_ptrs_t tbl_ctrl_rsp_que1_ptrs;
    /* 0x0830 */ tbl_rsp_que1_wptr_base_t tbl_rsp_que1_wptr_base;
    /* 0x0834 */ tbl_ctrl_cmd_que2_base_t tbl_ctrl_cmd_que2_base;
    /* 0x0838 */ tbl_ctrl_cmd_que2_ptrs_t tbl_ctrl_cmd_que2_ptrs;
    /* 0x083c */ tbl_cmd_que2_rptr_base_t tbl_cmd_que2_rptr_base;
    /* 0x0840 */ tbl_ctrl_rsp_que2_base_t tbl_ctrl_rsp_que2_base;
    /* 0x0844 */ tbl_ctrl_rsp_que2_ptrs_t tbl_ctrl_rsp_que2_ptrs;
    /* 0x0848 */ tbl_rsp_que2_wptr_base_t tbl_rsp_que2_wptr_base;
    /* 0x084c */ tbl_ctrl_cmd_que3_base_t tbl_ctrl_cmd_que3_base;
    /* 0x0850 */ tbl_ctrl_cmd_que3_ptrs_t tbl_ctrl_cmd_que3_ptrs;
    /* 0x0854 */ tbl_cmd_que3_rptr_base_t tbl_cmd_que3_rptr_base;
    /* 0x0858 */ tbl_ctrl_rsp_que3_base_t tbl_ctrl_rsp_que3_base;
    /* 0x085c */ tbl_ctrl_rsp_que3_ptrs_t tbl_ctrl_rsp_que3_ptrs;
    /* 0x0860 */ tbl_rsp_que3_wptr_base_t tbl_rsp_que3_wptr_base;
    /* 0x0864 */ tbl_ctrl_debug_addr_t tbl_ctrl_debug_addr;
    /* 0x0868 */ tbl_ctrl_debug_data_t tbl_ctrl_debug_data;
    /* 0x086c */ tbl_ctrl_tbl_info0_t tbl_ctrl_tbl_info0;
    /* 0x0870 */ tbl_ctrl_tbl_info1_t tbl_ctrl_tbl_info1;
    /* 0x0874 */ tbl_ctrl_tbl_info2_t tbl_ctrl_tbl_info2;
    /* 0x0878 */ tbl_ctrl_tbl_info3_t tbl_ctrl_tbl_info3;
    /* 0x087c */ tbl_ctrl_tbl_info4_t tbl_ctrl_tbl_info4;
    /* 0x0880 */ tbl_ctrl_tbl_info5_t tbl_ctrl_tbl_info5;
    /* 0x0884 */ tbl_ctrl_tbl_info6_t tbl_ctrl_tbl_info6;
    /* 0x0888 */ tbl_ctrl_tbl_info7_t tbl_ctrl_tbl_info7;
    /* 0x088c */ tbl_ctrl_tbl_info8_t tbl_ctrl_tbl_info8;
} btn_cmd_data_reg_regs_t;


#endif /* rev 9 */