//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _BTN_FTL_NCL_REG_H_
#define _BTN_FTL_NCL_REG_H_

#define BTN_FTL_NCL_INT_GRP0_SRC                 0x00000000
#define   _FTL_HW_ACCELR_SOFT_RESET_DONE_MASK    0x80000000
#define   _FTL_HW_ACCELR_SOFT_RESET_DONE_SHIFT           31
#define   L2P_TP_RD_REQ_QUE_UPDT_MASK            0x20000000
#define   L2P_TP_RD_REQ_QUE_UPDT_SHIFT                   29
#define   L2P_UNMAP_LDA_QUE_UPDT_MASK            0x10000000
#define   L2P_UNMAP_LDA_QUE_UPDT_SHIFT                   28
#define   FTL_STAT_CNT_FET_RSLT_QUE_UPDT_MASK    0x08000000
#define   FTL_STAT_CNT_FET_RSLT_QUE_UPDT_SHIFT           27
#define   DVL_INFO_FW_UPDT_RSLT_QUE_UPDT_MASK    0x04000000
#define   DVL_INFO_FW_UPDT_RSLT_QUE_UPDT_SHIFT           26
#define   FTL_STAT_CNT_SRCH_RSLT_QUE_UPDT_MASK   0x02000000
#define   FTL_STAT_CNT_SRCH_RSLT_QUE_UPDT_SHIFT          25
#define   FTL_STAT_CNT_NOTIF_QUE_UPDT_MASK       0x01000000
#define   FTL_STAT_CNT_NOTIF_QUE_UPDT_SHIFT              24
#define   L2P_UPDT_RECYCLE_QUE_UPDT_MASK         0x00800000
#define   L2P_UPDT_RECYCLE_QUE_UPDT_SHIFT                23
#define   FTL_HW_ACCELR_OVFL_ERR_MASK            0x00400000
#define   FTL_HW_ACCELR_OVFL_ERR_SHIFT                   22
#define   FTL_HW_ACCELR_MEM_ERR_MASK             0x00200000
#define   FTL_HW_ACCELR_MEM_ERR_SHIFT                    21
#define   FTL_HW_ACCELR_IF_ERR_MASK              0x00100000
#define   FTL_HW_ACCELR_IF_ERR_SHIFT                     20
#define   PDA_GEN_RSLT0_QUE7_UPDT_MASK           0x00004000
#define   PDA_GEN_RSLT0_QUE7_UPDT_SHIFT                  14
#define   PDA_GEN_RSLT0_QUE6_UPDT_MASK           0x00002000
#define   PDA_GEN_RSLT0_QUE6_UPDT_SHIFT                  13
#define   PDA_GEN_RSLT0_QUE5_UPDT_MASK           0x00001000
#define   PDA_GEN_RSLT0_QUE5_UPDT_SHIFT                  12
#define   PDA_GEN_RSLT0_QUE4_UPDT_MASK           0x00000800
#define   PDA_GEN_RSLT0_QUE4_UPDT_SHIFT                  11
#define   PDA_GEN_RSLT0_QUE3_UPDT_MASK           0x00000400
#define   PDA_GEN_RSLT0_QUE3_UPDT_SHIFT                  10
#define   PDA_GEN_RSLT0_QUE2_UPDT_MASK           0x00000200
#define   PDA_GEN_RSLT0_QUE2_UPDT_SHIFT                   9
#define   PDA_GEN_RSLT0_QUE1_UPDT_MASK           0x00000100
#define   PDA_GEN_RSLT0_QUE1_UPDT_SHIFT                   8
#define   PDA_GEN_RSLT0_QUE0_UPDT_MASK           0x00000080
#define   PDA_GEN_RSLT0_QUE0_UPDT_SHIFT                   7
#define   L2P_COMMIT_COMPL_QUE1_UPDT_MASK        0x00000040
#define   L2P_COMMIT_COMPL_QUE1_UPDT_SHIFT                6
#define   L2P_COMMIT_COMPL_QUE0_UPDT_MASK        0x00000020
#define   L2P_COMMIT_COMPL_QUE0_UPDT_SHIFT                5
#define   L2P_UPDT_COMPL_QUE1_UPDT_MASK          0x00000010
#define   L2P_UPDT_COMPL_QUE1_UPDT_SHIFT                  4
#define   L2P_UPDT_COMPL_QUE0_UPDT_MASK          0x00000008
#define   L2P_UPDT_COMPL_QUE0_UPDT_SHIFT                  3
#define   L2P_PDA_RSLT_URGENT_QUE0_UPDT_MASK     0x00000004
#define   L2P_PDA_RSLT_URGENT_QUE0_UPDT_SHIFT             2
#define   L2P_PDA_RSLT_HIGH_QUE0_UPDT_MASK       0x00000002
#define   L2P_PDA_RSLT_HIGH_QUE0_UPDT_SHIFT               1
#define   L2P_PDA_RSLT_NORM_QUE0_UPDT_MASK       0x00000001
#define   L2P_PDA_RSLT_NORM_QUE0_UPDT_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_norm_que0_updt:1;
        u32 l2p_pda_rslt_high_que0_updt:1;
        u32 l2p_pda_rslt_urgent_que0_updt:1;
        u32 l2p_updt_compl_que0_updt:1;
        u32 l2p_updt_compl_que1_updt:1;
        u32 l2p_commit_compl_que0_updt:1;
        u32 l2p_commit_compl_que1_updt:1;
        u32 pda_gen_rslt0_que0_updt:1;
        u32 pda_gen_rslt0_que1_updt:1;
        u32 pda_gen_rslt0_que2_updt:1;
        u32 pda_gen_rslt0_que3_updt:1;
        u32 pda_gen_rslt0_que4_updt:1;
        u32 pda_gen_rslt0_que5_updt:1;
        u32 pda_gen_rslt0_que6_updt:1;
        u32 pda_gen_rslt0_que7_updt:1;
        u32 rsvd_15:5;
        u32 ftl_hw_accelr_if_err:1;
        u32 ftl_hw_accelr_mem_err:1;
        u32 ftl_hw_accelr_ovfl_err:1;
        u32 l2p_updt_recycle_que_updt:1;
        u32 ftl_stat_cnt_notif_que_updt:1;
        u32 ftl_stat_cnt_srch_rslt_que_updt:1;
        u32 dvl_info_fw_updt_rslt_que_updt:1;
        u32 ftl_stat_cnt_fet_rslt_que_updt:1;
        u32 l2p_unmap_lda_que_updt:1;
        u32 l2p_tp_rd_req_que_updt:1;
        u32 rsvd_30:1;
        u32 _ftl_hw_accelr_soft_reset_done:1;
    } b;
} btn_ftl_ncl_int_grp0_src_t;

#define BTN_FTL_NCL_INT_GRP0_MASK0               0x00000004
#define   FTL_NCL_INT_GRP0_MASK0_MASK            0xffffffff
#define   FTL_NCL_INT_GRP0_MASK0_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_int_grp0_mask0:32;
    } b;
} btn_ftl_ncl_int_grp0_mask0_t;

#define BTN_FTL_NCL_INT_GRP0_STS0                0x00000008
#define   FTL_NCL_MK_INT_GRP0_STS0_MASK          0xffffffff
#define   FTL_NCL_MK_INT_GRP0_STS0_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_mk_int_grp0_sts0:32;
    } b;
} btn_ftl_ncl_int_grp0_sts0_t;

#define BTN_FTL_NCL_INT_GRP0_MASK1               0x0000000c
#define   FTL_NCL_INT_GRP0_MASK1_MASK            0xffffffff
#define   FTL_NCL_INT_GRP0_MASK1_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_int_grp0_mask1:32;
    } b;
} btn_ftl_ncl_int_grp0_mask1_t;

#define BTN_FTL_NCL_INT_GRP0_STS1                0x00000010
#define   FTL_NCL_MK_INT_GRP0_STS1_MASK          0xffffffff
#define   FTL_NCL_MK_INT_GRP0_STS1_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_mk_int_grp0_sts1:32;
    } b;
} btn_ftl_ncl_int_grp0_sts1_t;

#define BTN_FTL_NCL_INT_GRP0_MASK2               0x00000014
#define   FTL_NCL_INT_GRP0_MASK2_MASK            0xffffffff
#define   FTL_NCL_INT_GRP0_MASK2_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_int_grp0_mask2:32;
    } b;
} btn_ftl_ncl_int_grp0_mask2_t;

#define BTN_FTL_NCL_INT_GRP0_STS2                0x00000018
#define   FTL_NCL_MK_INT_GRP0_STS2_MASK          0xffffffff
#define   FTL_NCL_MK_INT_GRP0_STS2_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_mk_int_grp0_sts2:32;
    } b;
} btn_ftl_ncl_int_grp0_sts2_t;

#define BTN_FTL_NCL_INT_GRP0_MASK3               0x0000001c
#define   FTL_NCL_INT_GRP0_MASK3_MASK            0xffffffff
#define   FTL_NCL_INT_GRP0_MASK3_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_int_grp0_mask3:32;
    } b;
} btn_ftl_ncl_int_grp0_mask3_t;

#define BTN_FTL_NCL_INT_GRP0_STS3                0x00000020
#define   FTL_NCL_MK_INT_GRP0_STS3_MASK          0xffffffff
#define   FTL_NCL_MK_INT_GRP0_STS3_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_mk_int_grp0_sts3:32;
    } b;
} btn_ftl_ncl_int_grp0_sts3_t;

#define BTN_FTL_NCL_INT_GRP1_SRC                 0x00000024
#define   PDA_GEN_RSLT1_QUE7_UPDT_MASK           0x00004000
#define   PDA_GEN_RSLT1_QUE7_UPDT_SHIFT                  14
#define   PDA_GEN_RSLT1_QUE6_UPDT_MASK           0x00002000
#define   PDA_GEN_RSLT1_QUE6_UPDT_SHIFT                  13
#define   PDA_GEN_RSLT1_QUE5_UPDT_MASK           0x00001000
#define   PDA_GEN_RSLT1_QUE5_UPDT_SHIFT                  12
#define   PDA_GEN_RSLT1_QUE4_UPDT_MASK           0x00000800
#define   PDA_GEN_RSLT1_QUE4_UPDT_SHIFT                  11
#define   PDA_GEN_RSLT1_QUE3_UPDT_MASK           0x00000400
#define   PDA_GEN_RSLT1_QUE3_UPDT_SHIFT                  10
#define   PDA_GEN_RSLT1_QUE2_UPDT_MASK           0x00000200
#define   PDA_GEN_RSLT1_QUE2_UPDT_SHIFT                   9
#define   PDA_GEN_RSLT1_QUE1_UPDT_MASK           0x00000100
#define   PDA_GEN_RSLT1_QUE1_UPDT_SHIFT                   8
#define   PDA_GEN_RSLT1_QUE0_UPDT_MASK           0x00000080
#define   PDA_GEN_RSLT1_QUE0_UPDT_SHIFT                   7
#define   L2P_COMMIT_COMPL_QUE3_UPDT_MASK        0x00000040
#define   L2P_COMMIT_COMPL_QUE3_UPDT_SHIFT                6
#define   L2P_COMMIT_COMPL_QUE2_UPDT_MASK        0x00000020
#define   L2P_COMMIT_COMPL_QUE2_UPDT_SHIFT                5
#define   L2P_UPDT_COMPL_QUE3_UPDT_MASK          0x00000010
#define   L2P_UPDT_COMPL_QUE3_UPDT_SHIFT                  4
#define   L2P_UPDT_COMPL_QUE2_UPDT_MASK          0x00000008
#define   L2P_UPDT_COMPL_QUE2_UPDT_SHIFT                  3
#define   L2P_PDA_RSLT_URGENT_QUE1_UPDT_MASK     0x00000004
#define   L2P_PDA_RSLT_URGENT_QUE1_UPDT_SHIFT             2
#define   L2P_PDA_RSLT_HIGH_QUE1_UPDT_MASK       0x00000002
#define   L2P_PDA_RSLT_HIGH_QUE1_UPDT_SHIFT               1
#define   L2P_PDA_RSLT_NORM_QUE1_UPDT_MASK       0x00000001
#define   L2P_PDA_RSLT_NORM_QUE1_UPDT_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_norm_que1_updt:1;
        u32 l2p_pda_rslt_high_que1_updt:1;
        u32 l2p_pda_rslt_urgent_que1_updt:1;
        u32 l2p_updt_compl_que2_updt:1;
        u32 l2p_updt_compl_que3_updt:1;
        u32 l2p_commit_compl_que2_updt:1;
        u32 l2p_commit_compl_que3_updt:1;
        u32 pda_gen_rslt1_que0_updt:1;
        u32 pda_gen_rslt1_que1_updt:1;
        u32 pda_gen_rslt1_que2_updt:1;
        u32 pda_gen_rslt1_que3_updt:1;
        u32 pda_gen_rslt1_que4_updt:1;
        u32 pda_gen_rslt1_que5_updt:1;
        u32 pda_gen_rslt1_que6_updt:1;
        u32 pda_gen_rslt1_que7_updt:1;
        u32 rsvd_15:17;
    } b;
} btn_ftl_ncl_int_grp1_src_t;

#define BTN_FTL_NCL_INT_GRP1_MASK0               0x00000028
#define   FTL_NCL_INT_GRP1_MASK0_MASK            0xffffffff
#define   FTL_NCL_INT_GRP1_MASK0_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_int_grp1_mask0:32;
    } b;
} btn_ftl_ncl_int_grp1_mask0_t;

#define BTN_FTL_NCL_INT_GRP1_STS0                0x0000002c
#define   FTL_NCL_MK_INT_GRP1_STS0_MASK          0xffffffff
#define   FTL_NCL_MK_INT_GRP1_STS0_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_mk_int_grp1_sts0:32;
    } b;
} btn_ftl_ncl_int_grp1_sts0_t;

#define BTN_FTL_NCL_INT_GRP1_MASK1               0x00000030
#define   FTL_NCL_INT_GRP1_MASK1_MASK            0xffffffff
#define   FTL_NCL_INT_GRP1_MASK1_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_int_grp1_mask1:32;
    } b;
} btn_ftl_ncl_int_grp1_mask1_t;

#define BTN_FTL_NCL_INT_GRP1_STS1                0x00000034
#define   FTL_NCL_MK_INT_GRP1_STS1_MASK          0xffffffff
#define   FTL_NCL_MK_INT_GRP1_STS1_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_mk_int_grp1_sts1:32;
    } b;
} btn_ftl_ncl_int_grp1_sts1_t;

#define BTN_FTL_NCL_INT_GRP1_MASK2               0x00000038
#define   FTL_NCL_INT_GRP1_MASK2_MASK            0xffffffff
#define   FTL_NCL_INT_GRP1_MASK2_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_int_grp1_mask2:32;
    } b;
} btn_ftl_ncl_int_grp1_mask2_t;

#define BTN_FTL_NCL_INT_GRP1_STS2                0x0000003c
#define   FTL_NCL_MK_INT_GRP1_STS2_MASK          0xffffffff
#define   FTL_NCL_MK_INT_GRP1_STS2_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_mk_int_grp1_sts2:32;
    } b;
} btn_ftl_ncl_int_grp1_sts2_t;

#define BTN_FTL_NCL_INT_GRP1_MASK3               0x00000040
#define   FTL_NCL_INT_GRP1_MASK3_MASK            0xffffffff
#define   FTL_NCL_INT_GRP1_MASK3_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_int_grp1_mask3:32;
    } b;
} btn_ftl_ncl_int_grp1_mask3_t;

#define BTN_FTL_NCL_INT_GRP1_STS3                0x00000044
#define   FTL_NCL_MK_INT_GRP1_STS3_MASK          0xffffffff
#define   FTL_NCL_MK_INT_GRP1_STS3_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_mk_int_grp1_sts3:32;
    } b;
} btn_ftl_ncl_int_grp1_sts3_t;

#define BTN_FTL_NCL_CTRL0                        0x00000048
#define   L2P_TABLE_CACHE_FLUSH_MASK             0x80000000
#define   L2P_TABLE_CACHE_FLUSH_SHIFT                    31
#define   DVBM_CACHE_FLUSH_MASK                  0x40000000
#define   DVBM_CACHE_FLUSH_SHIFT                         30
#define   VLDC_CACHE_FLUSH_MASK                  0x20000000
#define   VLDC_CACHE_FLUSH_SHIFT                         29
#define   VLDC_LOC_MEM_DISABLE_MASK              0x00020000
#define   VLDC_LOC_MEM_DISABLE_SHIFT                     17
#define   VLDC_BACKUP_RESTORE_DIR_MASK           0x00010000
#define   VLDC_BACKUP_RESTORE_DIR_SHIFT                  16
#define   VLDC_BACKUP_RESTORE_START_MASK         0x00008000
#define   VLDC_BACKUP_RESTORE_START_SHIFT                15
#define   DU_VLD_INFO_REBUILD_START_MASK         0x00004000
#define   DU_VLD_INFO_REBUILD_START_SHIFT                14
#define   VLDC_CACHE_SCHEME_CONF_MASK            0x00003000
#define   VLDC_CACHE_SCHEME_CONF_SHIFT                   12
#define   FTL_INTERNAL_SRAM_INIT_MASK            0x00000400
#define   FTL_INTERNAL_SRAM_INIT_SHIFT                   10
#define   L2P_SRCH_DTAG_RSLT_LOC_SEL_MASK        0x00000200
#define   L2P_SRCH_DTAG_RSLT_LOC_SEL_SHIFT                9
#define   DVBM_CACHE_DISABLE_MASK                0x00000100
#define   DVBM_CACHE_DISABLE_SHIFT                        8
#define   CMT_CACHE_LINE_SIZE_SEL_MASK           0x00000040
#define   CMT_CACHE_LINE_SIZE_SEL_SHIFT                   6
#define   CMT_CACHE_WAY_NUM_SEL_MASK             0x00000020
#define   CMT_CACHE_WAY_NUM_SEL_SHIFT                     5
#define   CMT_BYPASS_MODE_MASK                   0x00000010
#define   CMT_BYPASS_MODE_SHIFT                           4
#define   FTL_GTD_ENABLE_MASK                    0x00000008
#define   FTL_GTD_ENABLE_SHIFT                            3
#define   P2L_DVBM_CONF_SEL_MASK                 0x00000004
#define   P2L_DVBM_CONF_SEL_SHIFT                         2
#define   _FTL_HW_ACCELR_SOFT_RESET_MASK         0x00000002
#define   _FTL_HW_ACCELR_SOFT_RESET_SHIFT                 1
#define   FTL_HW_ACCELR_ABORT_START_MASK         0x00000001
#define   FTL_HW_ACCELR_ABORT_START_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 ftl_hw_accelr_abort_start:1;
        u32 _ftl_hw_accelr_soft_reset:1;
        u32 p2l_dvbm_conf_sel:1;
        u32 ftl_gtd_enable:1;
        u32 cmt_bypass_mode:1;
        u32 cmt_cache_way_num_sel:1;
        u32 cmt_cache_line_size_sel:1;
        u32 rsvd_7:1;
        u32 dvbm_cache_disable:1;
        u32 l2p_srch_dtag_rslt_loc_sel:1;
        u32 ftl_internal_sram_init:1;
        u32 rsvd_11:1;
        u32 vldc_cache_scheme_conf:2;
        u32 du_vld_info_rebuild_start:1;
        u32 vldc_backup_restore_start:1;
        u32 vldc_backup_restore_dir:1;
        u32 vldc_loc_mem_disable:1;
        u32 rsvd_18:11;
        u32 vldc_cache_flush:1;
        u32 dvbm_cache_flush:1;
        u32 l2p_table_cache_flush:1;
    } b;
} btn_ftl_ncl_ctrl0_t;

#define BTN_FTL_NCL_CTRL1                        0x0000004c
#define   PAGE_PER_BLOCK_MASK                    0xfff80000
#define   PAGE_PER_BLOCK_SHIFT                           19
#define   CH_NUM_MASK                            0x00078000
#define   CH_NUM_SHIFT                                   15
#define   CE_NUM_MASK                            0x00007800
#define   CE_NUM_SHIFT                                   11
#define   LUN_NUM_MASK                           0x00000780
#define   LUN_NUM_SHIFT                                   7
#define   PLANE_NUM_MASK                         0x00000078
#define   PLANE_NUM_SHIFT                                 3
#define   DU_PER_PAGE_MASK                       0x00000007
#define   DU_PER_PAGE_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 du_per_page:3;
        u32 plane_num:4;
        u32 lun_num:4;
        u32 ce_num:4;
        u32 ch_num:4;
        u32 page_per_block:13;
    } b;
} btn_ftl_ncl_ctrl1_t;

#define BTN_FTL_NCL_CTRL2                        0x00000050
#define   L2P_URGENT_SRCH_REQ_WEIGHT_MASK        0xf0000000
#define   L2P_URGENT_SRCH_REQ_WEIGHT_SHIFT               28
#define   L2P_HIGH_SRCH_REQ_WEIGHT_MASK          0x0f000000
#define   L2P_HIGH_SRCH_REQ_WEIGHT_SHIFT                 24
#define   L2P_NORM_SRCH_REQ_WEIGHT_MASK          0x00f00000
#define   L2P_NORM_SRCH_REQ_WEIGHT_SHIFT                 20
#define   P2L_RVS_SRCH_REQ_WEIGHT_MASK           0x000f0000
#define   P2L_RVS_SRCH_REQ_WEIGHT_SHIFT                  16
#define   FTL_UNMAPPED_PDA_VLD_MASK              0x0000f000
#define   FTL_UNMAPPED_PDA_VLD_SHIFT                     12
#define   L2P_UPDT_REQ_LOCK_EN_MASK              0x00000800
#define   L2P_UPDT_REQ_LOCK_EN_SHIFT                     11
#define   L2P_SRCH_REQ_LOCK_EN_MASK              0x00000400
#define   L2P_SRCH_REQ_LOCK_EN_SHIFT                     10
#define   L2P_UPDT_RANGE_CHK_EN_MASK             0x00000200
#define   L2P_UPDT_RANGE_CHK_EN_SHIFT                     9
#define   L2P_SRCH_RANGE_CHK_EN_MASK             0x00000100
#define   L2P_SRCH_RANGE_CHK_EN_SHIFT                     8
#define   L2P_UPDT_RECYCLE_QUE_CONFIG_MASK       0x00000010
#define   L2P_UPDT_RECYCLE_QUE_CONFIG_SHIFT               4
#define   L2P_UPDT_COMPL_QUE3_CONFIG_MASK        0x00000008
#define   L2P_UPDT_COMPL_QUE3_CONFIG_SHIFT                3
#define   L2P_UPDT_COMPL_QUE2_CONFIG_MASK        0x00000004
#define   L2P_UPDT_COMPL_QUE2_CONFIG_SHIFT                2
#define   L2P_UPDT_COMPL_QUE1_CONFIG_MASK        0x00000002
#define   L2P_UPDT_COMPL_QUE1_CONFIG_SHIFT                1
#define   L2P_UPDT_COMPL_QUE0_CONFIG_MASK        0x00000001
#define   L2P_UPDT_COMPL_QUE0_CONFIG_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que0_config:1;
        u32 l2p_updt_compl_que1_config:1;
        u32 l2p_updt_compl_que2_config:1;
        u32 l2p_updt_compl_que3_config:1;
        u32 l2p_updt_recycle_que_config:1;
        u32 rsvd_5:3;
        u32 l2p_srch_range_chk_en:1;
        u32 l2p_updt_range_chk_en:1;
        u32 l2p_srch_req_lock_en:1;
        u32 l2p_updt_req_lock_en:1;
        u32 ftl_unmapped_pda_vld:4;
        u32 p2l_rvs_srch_req_weight:4;
        u32 l2p_norm_srch_req_weight:4;
        u32 l2p_high_srch_req_weight:4;
        u32 l2p_urgent_srch_req_weight:4;
    } b;
} btn_ftl_ncl_ctrl2_t;

#define BTN_FTL_NCL_CTRL3                        0x00000054
#define   FTL_UNMAPPED_PDA_UPDT_EN_MASK          0xf0000000
#define   FTL_UNMAPPED_PDA_UPDT_EN_SHIFT                 28
#define   FTL_MAX_DRAM_WR_REQ_NUM_MASK           0x000f0000
#define   FTL_MAX_DRAM_WR_REQ_NUM_SHIFT                  16
#define   FTL_MAX_DRAM_RD_REQ_NUM_MASK           0x0000f000
#define   FTL_MAX_DRAM_RD_REQ_NUM_SHIFT                  12
#define   FTL_MAX_SRAM_WR_REQ_NUM_MASK           0x00000e00
#define   FTL_MAX_SRAM_WR_REQ_NUM_SHIFT                   9
#define   FTL_MAX_SRAM_RD_REQ_NUM_MASK           0x000001c0
#define   FTL_MAX_SRAM_RD_REQ_NUM_SHIFT                   6
#define   FTL_MAX_DTCM_WR_REQ_NUM_MASK           0x00000038
#define   FTL_MAX_DTCM_WR_REQ_NUM_SHIFT                   3
#define   FTL_MAX_DTCM_RD_REQ_NUM_MASK           0x00000007
#define   FTL_MAX_DTCM_RD_REQ_NUM_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 ftl_max_dtcm_rd_req_num:3;
        u32 ftl_max_dtcm_wr_req_num:3;
        u32 ftl_max_sram_rd_req_num:3;
        u32 ftl_max_sram_wr_req_num:3;
        u32 ftl_max_dram_rd_req_num:4;
        u32 ftl_max_dram_wr_req_num:4;
        u32 rsvd_20:8;
        u32 ftl_unmapped_pda_updt_en:4;
    } b;
} btn_ftl_ncl_ctrl3_t;

#define BTN_FTL_NCL_ERROR_STATUS0                0x00000060
#define   FTL_SPB_ID_OVFL_ERR_DISABLE_MASK       0x80000000
#define   FTL_SPB_ID_OVFL_ERR_DISABLE_SHIFT              31
#define   FTL_VLD_PDA_GEN_SPB_ID_OVFL_ERR_MASK   0x10000000
#define   FTL_VLD_PDA_GEN_SPB_ID_OVFL_ERR_SHIFT          28
#define   FTL_L2P_UPDT_SPB_ID_OVFL_ERR_MASK      0x08000000
#define   FTL_L2P_UPDT_SPB_ID_OVFL_ERR_SHIFT             27
#define   FTL_L2P_SRCH_SPB_ID_OVFL_ERR_MASK      0x04000000
#define   FTL_L2P_SRCH_SPB_ID_OVFL_ERR_SHIFT             26
#define   FTL_L2P_UPDA_LDA_OVFL_ERR_MASK         0x02000000
#define   FTL_L2P_UPDA_LDA_OVFL_ERR_SHIFT                25
#define   FTL_L2P_SRCH_LDA_OVFL_ERR_MASK         0x01000000
#define   FTL_L2P_SRCH_LDA_OVFL_ERR_SHIFT                24
#define   FTL_NCL_IF_MEM_ERR_SEL_MASK            0x00800000
#define   FTL_NCL_IF_MEM_ERR_SEL_SHIFT                   23
#define   FTL_NCL_IF_MEM_ERR_INDEX_SEL_MASK      0x00180000
#define   FTL_NCL_IF_MEM_ERR_INDEX_SEL_SHIFT             19
#define   FTL_NCL_IF_MEM_ERR_SRC_SEL_MASK        0x00070000
#define   FTL_NCL_IF_MEM_ERR_SRC_SEL_SHIFT               16
#define   FTL_NCL_MEM_ERR_FLAG7_MASK             0x00008000
#define   FTL_NCL_MEM_ERR_FLAG7_SHIFT                    15
#define   FTL_NCL_MEM_ERR_FLAG6_MASK             0x00004000
#define   FTL_NCL_MEM_ERR_FLAG6_SHIFT                    14
#define   FTL_NCL_MEM_ERR_FLAG5_MASK             0x00002000
#define   FTL_NCL_MEM_ERR_FLAG5_SHIFT                    13
#define   FTL_NCL_MEM_ERR_FLAG4_MASK             0x00001000
#define   FTL_NCL_MEM_ERR_FLAG4_SHIFT                    12
#define   FTL_NCL_MEM_ERR_FLAG3_MASK             0x00000800
#define   FTL_NCL_MEM_ERR_FLAG3_SHIFT                    11
#define   FTL_NCL_MEM_ERR_FLAG2_MASK             0x00000400
#define   FTL_NCL_MEM_ERR_FLAG2_SHIFT                    10
#define   FTL_NCL_MEM_ERR_FLAG1_MASK             0x00000200
#define   FTL_NCL_MEM_ERR_FLAG1_SHIFT                     9
#define   FTL_NCL_MEM_ERR_FLAG0_MASK             0x00000100
#define   FTL_NCL_MEM_ERR_FLAG0_SHIFT                     8
#define   FTL_NCL_IF_ERR_FLAG5_MASK              0x00000020
#define   FTL_NCL_IF_ERR_FLAG5_SHIFT                      5
#define   FTL_NCL_IF_ERR_FLAG4_MASK              0x00000010
#define   FTL_NCL_IF_ERR_FLAG4_SHIFT                      4
#define   FTL_NCL_IF_ERR_FLAG3_MASK              0x00000008
#define   FTL_NCL_IF_ERR_FLAG3_SHIFT                      3
#define   FTL_NCL_IF_ERR_FLAG2_MASK              0x00000004
#define   FTL_NCL_IF_ERR_FLAG2_SHIFT                      2
#define   FTL_NCL_IF_ERR_FLAG1_MASK              0x00000002
#define   FTL_NCL_IF_ERR_FLAG1_SHIFT                      1
#define   FTL_NCL_IF_ERR_FLAG0_MASK              0x00000001
#define   FTL_NCL_IF_ERR_FLAG0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_if_err_flag0:1;
        u32 ftl_ncl_if_err_flag1:1;
        u32 ftl_ncl_if_err_flag2:1;
        u32 ftl_ncl_if_err_flag3:1;
        u32 ftl_ncl_if_err_flag4:1;
        u32 ftl_ncl_if_err_flag5:1;
        u32 rsvd_6:2;
        u32 ftl_ncl_mem_err_flag0:1;
        u32 ftl_ncl_mem_err_flag1:1;
        u32 ftl_ncl_mem_err_flag2:1;
        u32 ftl_ncl_mem_err_flag3:1;
        u32 ftl_ncl_mem_err_flag4:1;
        u32 ftl_ncl_mem_err_flag5:1;
        u32 ftl_ncl_mem_err_flag6:1;
        u32 ftl_ncl_mem_err_flag7:1;
        u32 ftl_ncl_if_mem_err_src_sel:3;
        u32 ftl_ncl_if_mem_err_index_sel:2;
        u32 rsvd_21:2;
        u32 ftl_ncl_if_mem_err_sel:1;
        u32 ftl_l2p_srch_lda_ovfl_err:1;
        u32 ftl_l2p_upda_lda_ovfl_err:1;
        u32 ftl_l2p_srch_spb_id_ovfl_err:1;
        u32 ftl_l2p_updt_spb_id_ovfl_err:1;
        u32 ftl_vld_pda_gen_spb_id_ovfl_err:1;
        u32 rsvd_29:2;
        u32 ftl_spb_id_ovfl_err_disable:1;
    } b;
} btn_ftl_ncl_error_status0_t;

#define BTN_FTL_NCL_ERROR_STATUS1                0x00000064
#define   FTL_NCL_IF_MEM_ERROR_ADDR_MASK         0xffffffff
#define   FTL_NCL_IF_MEM_ERROR_ADDR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_if_mem_error_addr:32;
    } b;
} btn_ftl_ncl_error_status1_t;

#define BTN_FTL_REGION0_DATA_GTD_BASE_ADDR       0x00000070
#define   FTL_REGION0_DATA_GTD_BASE_ADDRR_MASK   0xffffffff
#define   FTL_REGION0_DATA_GTD_BASE_ADDRR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 ftl_region0_data_gtd_base_addrr:32;
    } b;
} btn_ftl_region0_data_gtd_base_addr_t;

#define BTN_FTL_REGION0_DATA_TP_BASE_ADDR        0x00000074
#define   FTL_REGION0_DATA_TP_BASE_ADDR_MASK     0xffffffff
#define   FTL_REGION0_DATA_TP_BASE_ADDR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ftl_region0_data_tp_base_addr:32;
    } b;
} btn_ftl_region0_data_tp_base_addr_t;

#define BTN_FTL_REGION0_DATA_DVBM_BASE_ADDR      0x00000078
#define   FTL_REGION0_DATA_DVBM_BASE_ADDR_MASK   0xffffffff
#define   FTL_REGION0_DATA_DVBM_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 ftl_region0_data_dvbm_base_addr:32;
    } b;
} btn_ftl_region0_data_dvbm_base_addr_t;

#define BTN_FTL_REGION1_DATA_GTD_BASE_ADDR       0x00000080
#define   FTL_REGION1_DATA_GTD_BASE_ADDR_MASK    0xffffffff
#define   FTL_REGION1_DATA_GTD_BASE_ADDR_SHIFT            0

typedef union {
    u32 all;
    struct {
        u32 ftl_region1_data_gtd_base_addr:32;
    } b;
} btn_ftl_region1_data_gtd_base_addr_t;

#define BTN_FTL_REGION1_DATA_TP_BASE_ADDR        0x00000084
#define   FTL_REGION1_DATA_TP_BASE_ADDR_MASK     0xffffffff
#define   FTL_REGION1_DATA_TP_BASE_ADDR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ftl_region1_data_tp_base_addr:32;
    } b;
} btn_ftl_region1_data_tp_base_addr_t;

#define BTN_FTL_REGION1_DATA_DVBM_BASE_ADDR      0x00000088
#define   FTL_REGION1_DATA_DVBM_BASE_ADDR_MASK   0xffffffff
#define   FTL_REGION1_DATA_DVBM_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 ftl_region1_data_dvbm_base_addr:32;
    } b;
} btn_ftl_region1_data_dvbm_base_addr_t;

#define BTN_RSVD_PDA_RANGE                       0x0000008c
#define   FTL_RSVD_PDA_RANGE_MASK                0xffffffff
#define   FTL_RSVD_PDA_RANGE_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ftl_rsvd_pda_range:32;
    } b;
} btn_rsvd_pda_range_t;

#define BTN_UNMAPPED_PDA0                        0x00000090
#define   FTL_UNMAPPED_PDA0_MASK                 0xffffffff
#define   FTL_UNMAPPED_PDA0_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 ftl_unmapped_pda0:32;
    } b;
} btn_unmapped_pda0_t;

#define BTN_PDA_CONF_REG0                        0x00000094
#define   FTL_PDA_CPDA_MODE_SEL_MASK             0x80000000
#define   FTL_PDA_CPDA_MODE_SEL_SHIFT                    31
#define   FTL_PDA_VLD_MSB_MASK                   0x007e0000
#define   FTL_PDA_VLD_MSB_SHIFT                          17
#define   FTL_PDA_SPB_OFFSET_MASK                0x0001f000
#define   FTL_PDA_SPB_OFFSET_SHIFT                       12
#define   FTL_PDA_PAGE_OFFSET_MASK               0x00000f80
#define   FTL_PDA_PAGE_OFFSET_SHIFT                       7
#define   FTL_PDA_INTLV_OFFSET_MASK              0x0000007c
#define   FTL_PDA_INTLV_OFFSET_SHIFT                      2
#define   FTL_PDA_DU_OFFSET_MASK                 0x00000003
#define   FTL_PDA_DU_OFFSET_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 ftl_pda_du_offset:2;
        u32 ftl_pda_intlv_offset:5;
        u32 ftl_pda_page_offset:5;
        u32 ftl_pda_spb_offset:5;
        u32 ftl_pda_vld_msb:6;
        u32 rsvd_23:8;
        u32 ftl_pda_cpda_mode_sel:1;
    } b;
} btn_pda_conf_reg0_t;

#define BTN_PDA_CONF_REG1                        0x00000098
#define   FTL_PDA_INTLV_PLN_BW_MASK              0x00f00000
#define   FTL_PDA_INTLV_PLN_BW_SHIFT                     20
#define   FTL_PDA_INTLV_LUN_BW_MASK              0x000f0000
#define   FTL_PDA_INTLV_LUN_BW_SHIFT                     16
#define   FTL_PDA_INTLV_CH_BW_MASK               0x00001e00
#define   FTL_PDA_INTLV_CH_BW_SHIFT                       9
#define   FTL_PDA_INTLV_CE_BW_MASK               0x000001e0
#define   FTL_PDA_INTLV_CE_BW_SHIFT                       5
#define   FTL_PDA_INTLV_TYPE_MASK                0x0000001f
#define   FTL_PDA_INTLV_TYPE_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ftl_pda_intlv_type:5;
        u32 ftl_pda_intlv_ce_bw:4;
        u32 ftl_pda_intlv_ch_bw:4;
        u32 rsvd_13:3;
        u32 ftl_pda_intlv_lun_bw:4;
        u32 ftl_pda_intlv_pln_bw:4;
        u32 rsvd_24:8;
    } b;
} btn_pda_conf_reg1_t;

#define BTN_CPDA_CONF_REG0                       0x0000009c
#define   FTL_CPDA_VLD_MSB_MASK                  0x003e0000
#define   FTL_CPDA_VLD_MSB_SHIFT                         17
#define   FTL_CPDA_SPCC_OFFSET_MASK              0x0001f000
#define   FTL_CPDA_SPCC_OFFSET_SHIFT                     12
#define   FTL_CPDA_LUN_OFFSET_MASK               0x00000f80
#define   FTL_CPDA_LUN_OFFSET_SHIFT                       7
#define   FTL_CPDA_PLANE_OFFSET_MASK             0x0000007c
#define   FTL_CPDA_PLANE_OFFSET_SHIFT                     2
#define   FTL_CPDA_DU_OFFSET_MASK                0x00000003
#define   FTL_CPDA_DU_OFFSET_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ftl_cpda_du_offset:2;
        u32 ftl_cpda_plane_offset:5;
        u32 ftl_cpda_lun_offset:5;
        u32 ftl_cpda_spcc_offset:5;
        u32 ftl_cpda_vld_msb:5;
        u32 rsvd_22:10;
    } b;
} btn_cpda_conf_reg0_t;

#define BTN_PDA_RSLT_GRP_SEL_CONF_REG            0x000000a0
#define   PDA_CH15_GRP_SEL_MASK                  0xc0000000
#define   PDA_CH15_GRP_SEL_SHIFT                         30
#define   PDA_CH14_GRP_SEL_MASK                  0x30000000
#define   PDA_CH14_GRP_SEL_SHIFT                         28
#define   PDA_CH13_GRP_SEL_MASK                  0x0c000000
#define   PDA_CH13_GRP_SEL_SHIFT                         26
#define   PDA_CH12_GRP_SEL_MASK                  0x03000000
#define   PDA_CH12_GRP_SEL_SHIFT                         24
#define   PDA_CH11_GRP_SEL_MASK                  0x00c00000
#define   PDA_CH11_GRP_SEL_SHIFT                         22
#define   PDA_CH10_GRP_SEL_MASK                  0x00300000
#define   PDA_CH10_GRP_SEL_SHIFT                         20
#define   PDA_CH9_GRP_SEL_MASK                   0x000c0000
#define   PDA_CH9_GRP_SEL_SHIFT                          18
#define   PDA_CH8_GRP_SEL_MASK                   0x00030000
#define   PDA_CH8_GRP_SEL_SHIFT                          16
#define   PDA_CH7_GRP_SEL_MASK                   0x0000c000
#define   PDA_CH7_GRP_SEL_SHIFT                          14
#define   PDA_CH6_GRP_SEL_MASK                   0x00003000
#define   PDA_CH6_GRP_SEL_SHIFT                          12
#define   PDA_CH5_GRP_SEL_MASK                   0x00000c00
#define   PDA_CH5_GRP_SEL_SHIFT                          10
#define   PDA_CH4_GRP_SEL_MASK                   0x00000300
#define   PDA_CH4_GRP_SEL_SHIFT                           8
#define   PDA_CH3_GRP_SEL_MASK                   0x000000c0
#define   PDA_CH3_GRP_SEL_SHIFT                           6
#define   PDA_CH2_GRP_SEL_MASK                   0x00000030
#define   PDA_CH2_GRP_SEL_SHIFT                           4
#define   PDA_CH1_GRP_SEL_MASK                   0x0000000c
#define   PDA_CH1_GRP_SEL_SHIFT                           2
#define   PDA_CH0_GRP_SEL_MASK                   0x00000003
#define   PDA_CH0_GRP_SEL_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 pda_ch0_grp_sel:2;
        u32 pda_ch1_grp_sel:2;
        u32 pda_ch2_grp_sel:2;
        u32 pda_ch3_grp_sel:2;
        u32 pda_ch4_grp_sel:2;
        u32 pda_ch5_grp_sel:2;
        u32 pda_ch6_grp_sel:2;
        u32 pda_ch7_grp_sel:2;
        u32 pda_ch8_grp_sel:2;
        u32 pda_ch9_grp_sel:2;
        u32 pda_ch10_grp_sel:2;
        u32 pda_ch11_grp_sel:2;
        u32 pda_ch12_grp_sel:2;
        u32 pda_ch13_grp_sel:2;
        u32 pda_ch14_grp_sel:2;
        u32 pda_ch15_grp_sel:2;
    } b;
} btn_pda_rslt_grp_sel_conf_reg_t;

#define BTN_SPB_DIE_GRP_CONF_REG                 0x000000a4
#define   SPB_DIE_GRP_CONF_DIRECTION_MASK        0x80000000
#define   SPB_DIE_GRP_CONF_DIRECTION_SHIFT               31
#define   SPB_DIE_GRP_ID_MASK                    0x00000f00
#define   SPB_DIE_GRP_ID_SHIFT                            8
#define   SPB_DIE_GRP_CONF_CH_ID_MASK            0x000000f0
#define   SPB_DIE_GRP_CONF_CH_ID_SHIFT                    4
#define   SPB_DIE_GRP_CONF_CE_ID_MASK            0x00000007
#define   SPB_DIE_GRP_CONF_CE_ID_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 spb_die_grp_conf_ce_id:3;
        u32 rsvd_3:1;
        u32 spb_die_grp_conf_ch_id:4;
        u32 spb_die_grp_id:4;
        u32 rsvd_12:19;
        u32 spb_die_grp_conf_direction:1;
    } b;
} btn_spb_die_grp_conf_reg_t;

#define BTN_LDA_MASK                             0x000000a8
#define   FTL_LDA_MASK_MASK                      0xffffffff
#define   FTL_LDA_MASK_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 ftl_lda_mask:32;
    } b;
} btn_lda_mask_t;

#define BTN_RSVD_LDA_VALUE                       0x000000ac
#define   FTL_RSVD_LDA_VALUE_MASK                0xffffffff
#define   FTL_RSVD_LDA_VALUE_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ftl_rsvd_lda_value:32;
    } b;
} btn_rsvd_lda_value_t;

#define BTN_LDA_MAX_VALUE                        0x000000b0
#define   FTL_LDA_MAX_VALUE_MASK                 0xffffffff
#define   FTL_LDA_MAX_VALUE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 ftl_lda_max_value:32;
    } b;
} btn_lda_max_value_t;

#define BTN_PDA_MASK                             0x000000b4
#define   FTL_PDA_MASK_MASK                      0xffffffff
#define   FTL_PDA_MASK_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 ftl_pda_mask:32;
    } b;
} btn_pda_mask_t;

#define BTN_UNMAPPED_PDA1                        0x000000b8
#define   FTL_UNMAPPED_PDA1_MASK                 0xffffffff
#define   FTL_UNMAPPED_PDA1_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 ftl_unmapped_pda1:32;
    } b;
} btn_unmapped_pda1_t;

#define BTN_UNMAPPED_PDA2                        0x000000bc
#define   FTL_UNMAPPED_PDA2_MASK                 0xffffffff
#define   FTL_UNMAPPED_PDA2_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 ftl_unmapped_pda2:32;
    } b;
} btn_unmapped_pda2_t;

#define BTN_UNMAPPED_PDA3                        0x000000c0
#define   FTL_UNMAPPED_PDA3_MASK                 0xffffffff
#define   FTL_UNMAPPED_PDA3_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 ftl_unmapped_pda3:32;
    } b;
} btn_unmapped_pda3_t;

#define BTN_L2P_TABLE_START_LDA                  0x000000c4
#define   L2P_TABLE_START_LDA_MASK               0xffffffff
#define   L2P_TABLE_START_LDA_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 l2p_table_start_lda:32;
    } b;
} btn_l2p_table_start_lda_t;

#define BTN_L2P_TABLE_ENTRY_NUM                  0x000000c8
#define   L2P_TABLE_ENTRY_NUM_MASK               0xffffffff
#define   L2P_TABLE_ENTRY_NUM_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 l2p_table_entry_num:32;
    } b;
} btn_l2p_table_entry_num_t;

#define BTN_L2P_NORM_SRCH_QUE0_BASE_ADDR         0x00000100
#define   L2P_NORM_SRCH_QUE0_ENTRY_MAX_SZ_MASK   0xff000000
#define   L2P_NORM_SRCH_QUE0_ENTRY_MAX_SZ_SHIFT          24
#define   L2P_NORM_SRCH_QUE0_BASE_ADDR_MASK      0x007fffff
#define   L2P_NORM_SRCH_QUE0_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 l2p_norm_srch_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_norm_srch_que0_entry_max_sz:8;
    } b;
} btn_l2p_norm_srch_que0_base_addr_t;

#define BTN_L2P_NORM_SRCH_QUE0_PTRS              0x00000104
#define   L2P_NORM_SRCH_QUE0_RD_PTR_MASK         0x0000ff00
#define   L2P_NORM_SRCH_QUE0_RD_PTR_SHIFT                 8
#define   L2P_NORM_SRCH_QUE0_WR_PTR_MASK         0x000000ff
#define   L2P_NORM_SRCH_QUE0_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 l2p_norm_srch_que0_wr_ptr:8;
        u32 l2p_norm_srch_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_norm_srch_que0_ptrs_t;

#define BTN_L2P_NORM_SRCH_QUE0_RDPTR_BASE_ADDR   0x00000108
#define   L2P_NORM_SRCH_QUE0_RDPTR_UPDT_EN_MASK  0x80000000
#define   L2P_NORM_SRCH_QUE0_RDPTR_UPDT_EN_SHIFT         31
#define   L2P_NORM_SRCH_QUE0_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_NORM_SRCH_QUE0_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_norm_srch_que0_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_norm_srch_que0_rdptr_updt_en:1;
    } b;
} btn_l2p_norm_srch_que0_rdptr_base_addr_t;

#define BTN_L2P_HIGH_SRCH_QUE0_BASE_ADDR         0x0000010c
#define   L2P_HIGH_SRCH_QUE0_ENTRY_MAX_SZ_MASK   0xff000000
#define   L2P_HIGH_SRCH_QUE0_ENTRY_MAX_SZ_SHIFT          24
#define   L2P_HIGH_SRCH_QUE0_BASE_ADDR_MASK      0x007fffff
#define   L2P_HIGH_SRCH_QUE0_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 l2p_high_srch_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_high_srch_que0_entry_max_sz:8;
    } b;
} btn_l2p_high_srch_que0_base_addr_t;

#define BTN_L2P_HIGH_SRCH_QUE0_PTRS              0x00000110
#define   L2P_HIGH_SRCH_QUE0_RD_PTR_MASK         0x0000ff00
#define   L2P_HIGH_SRCH_QUE0_RD_PTR_SHIFT                 8
#define   L2P_HIGH_SRCH_QUE0_WR_PTR_MASK         0x000000ff
#define   L2P_HIGH_SRCH_QUE0_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 l2p_high_srch_que0_wr_ptr:8;
        u32 l2p_high_srch_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_high_srch_que0_ptrs_t;

#define BTN_L2P_HIGH_SRCH_QUE0_RDPTR_BASE_ADDR   0x00000114
#define   L2P_HIGH_SRCH_QUE0_RDPTR_UPDT_EN_MASK  0x80000000
#define   L2P_HIGH_SRCH_QUE0_RDPTR_UPDT_EN_SHIFT         31
#define   L2P_HIGH_SRCH_QUE0_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_HIGH_SRCH_QUE0_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_high_srch_que0_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_high_srch_que0_rdptr_updt_en:1;
    } b;
} btn_l2p_high_srch_que0_rdptr_base_addr_t;

#define BTN_L2P_URGENT_SRCH_QUE0_BASE_ADDR       0x00000118
#define   L2P_URGENT_SRCH_QUE0_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_URGENT_SRCH_QUE0_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_URGENT_SRCH_QUE0_BASE_ADDR_MASK    0x007fffff
#define   L2P_URGENT_SRCH_QUE0_BASE_ADDR_SHIFT            0

typedef union {
    u32 all;
    struct {
        u32 l2p_urgent_srch_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_urgent_srch_que0_entry_max_sz:8;
    } b;
} btn_l2p_urgent_srch_que0_base_addr_t;

#define BTN_L2P_URGENT_SRCH_QUE0_PTRS            0x0000011c
#define   L2P_URGENT_SRCH_QUE0_RD_PTR_MASK       0x0000ff00
#define   L2P_URGENT_SRCH_QUE0_RD_PTR_SHIFT               8
#define   L2P_URGENT_SRCH_QUE0_WR_PTR_MASK       0x000000ff
#define   L2P_URGENT_SRCH_QUE0_WR_PTR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 l2p_urgent_srch_que0_wr_ptr:8;
        u32 l2p_urgent_srch_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_urgent_srch_que0_ptrs_t;

#define BTN_L2P_URGENT_SRCH_QUE0_RDPTR_BASE_ADDR 0x00000120
#define   L2P_URGENT_SRCH_QUE0_RDPTR_UPDT_EN_MASK 0x80000000
#define   L2P_URGENT_SRCH_QUE0_RDPTR_UPDT_EN_SHIFT         31
#define   L2P_URGENT_SRCH_QUE0_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_URGENT_SRCH_QUE0_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_urgent_srch_que0_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_urgent_srch_que0_rdptr_updt_en:1;
    } b;
} btn_l2p_urgent_srch_que0_rdptr_base_addr_t;

#define BTN_L2P_NORM_SRCH_QUE1_BASE_ADDR         0x00000130
#define   L2P_NORM_SRCH_QUE1_ENTRY_MAX_SZ_MASK   0xff000000
#define   L2P_NORM_SRCH_QUE1_ENTRY_MAX_SZ_SHIFT          24
#define   L2P_NORM_SRCH_QUE1_BASE_ADDR_MASK      0x007fffff
#define   L2P_NORM_SRCH_QUE1_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 l2p_norm_srch_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_norm_srch_que1_entry_max_sz:8;
    } b;
} btn_l2p_norm_srch_que1_base_addr_t;

#define BTN_L2P_NORM_SRCH_QUE1_PTRS              0x00000134
#define   L2P_NORM_SRCH_QUE1_RD_PTR_MASK         0x0000ff00
#define   L2P_NORM_SRCH_QUE1_RD_PTR_SHIFT                 8
#define   L2P_NORM_SRCH_QUE1_WR_PTR_MASK         0x000000ff
#define   L2P_NORM_SRCH_QUE1_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 l2p_norm_srch_que1_wr_ptr:8;
        u32 l2p_norm_srch_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_norm_srch_que1_ptrs_t;

#define BTN_L2P_NORM_SRCH_QUE1_RDPTR_BASE_ADDR   0x00000138
#define   L2P_NORM_SRCH_QUE1_RDPTR_UPDT_EN_MASK  0x80000000
#define   L2P_NORM_SRCH_QUE1_RDPTR_UPDT_EN_SHIFT         31
#define   L2P_NORM_SRCH_QUE1_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_NORM_SRCH_QUE1_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_norm_srch_que1_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_norm_srch_que1_rdptr_updt_en:1;
    } b;
} btn_l2p_norm_srch_que1_rdptr_base_addr_t;

#define BTN_L2P_HIGH_SRCH_QUE1_BASE_ADDR         0x0000013c
#define   L2P_HIGH_SRCH_QUE1_ENTRY_MAX_SZ_MASK   0xff000000
#define   L2P_HIGH_SRCH_QUE1_ENTRY_MAX_SZ_SHIFT          24
#define   L2P_HIGH_SRCH_QUE1_BASE_ADDR_MASK      0x007fffff
#define   L2P_HIGH_SRCH_QUE1_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 l2p_high_srch_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_high_srch_que1_entry_max_sz:8;
    } b;
} btn_l2p_high_srch_que1_base_addr_t;

#define BTN_L2P_HIGH_SRCH_QUE1_PTRS              0x00000140
#define   L2P_HIGH_SRCH_QUE1_RD_PTR_MASK         0x0000ff00
#define   L2P_HIGH_SRCH_QUE1_RD_PTR_SHIFT                 8
#define   L2P_HIGH_SRCH_QUE1_WR_PTR_MASK         0x000000ff
#define   L2P_HIGH_SRCH_QUE1_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 l2p_high_srch_que1_wr_ptr:8;
        u32 l2p_high_srch_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_high_srch_que1_ptrs_t;

#define BTN_L2P_HIGH_SRCH_QUE1_RDPTR_BASE_ADDR   0x00000144
#define   L2P_HIGH_SRCH_QUE1_RDPTR_UPDT_EN_MASK  0x80000000
#define   L2P_HIGH_SRCH_QUE1_RDPTR_UPDT_EN_SHIFT         31
#define   L2P_HIGH_SRCH_QUE1_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_HIGH_SRCH_QUE1_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_high_srch_que1_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_high_srch_que1_rdptr_updt_en:1;
    } b;
} btn_l2p_high_srch_que1_rdptr_base_addr_t;

#define BTN_L2P_URGENT_SRCH_QUE1_BASE_ADDR       0x00000148
#define   L2P_URGENT_SRCH_QUE1_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_URGENT_SRCH_QUE1_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_URGENT_SRCH_QUE1_BASE_ADDR_MASK    0x007fffff
#define   L2P_URGENT_SRCH_QUE1_BASE_ADDR_SHIFT            0

typedef union {
    u32 all;
    struct {
        u32 l2p_urgent_srch_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_urgent_srch_que1_entry_max_sz:8;
    } b;
} btn_l2p_urgent_srch_que1_base_addr_t;

#define BTN_L2P_URGENT_SRCH_QUE1_PTRS            0x0000014c
#define   L2P_URGENT_SRCH_QUE1_RD_PTR_MASK       0x0000ff00
#define   L2P_URGENT_SRCH_QUE1_RD_PTR_SHIFT               8
#define   L2P_URGENT_SRCH_QUE1_WR_PTR_MASK       0x000000ff
#define   L2P_URGENT_SRCH_QUE1_WR_PTR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 l2p_urgent_srch_que1_wr_ptr:8;
        u32 l2p_urgent_srch_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_urgent_srch_que1_ptrs_t;

#define BTN_L2P_URGENT_SRCH_QUE1_RDPTR_BASE_ADDR 0x00000150
#define   L2P_URGENT_SRCH_QUE1_RDPTR_UPDT_EN_MASK 0x80000000
#define   L2P_URGENT_SRCH_QUE1_RDPTR_UPDT_EN_SHIFT         31
#define   L2P_URGENT_SRCH_QUE1_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_URGENT_SRCH_QUE1_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_urgent_srch_que1_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_urgent_srch_que1_rdptr_updt_en:1;
    } b;
} btn_l2p_urgent_srch_que1_rdptr_base_addr_t;

#define BTN_L2P_UPDT_REQ_QUE0_BASE_ADDR          0x00000160
#define   L2P_UPDT_REQ_QUE0_ENTRY_MAX_SZ_MASK    0xff000000
#define   L2P_UPDT_REQ_QUE0_ENTRY_MAX_SZ_SHIFT           24
#define   L2P_UPDT_REQ_QUE0_BASE_ADDR_MASK       0x007fffff
#define   L2P_UPDT_REQ_QUE0_BASE_ADDR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_req_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_updt_req_que0_entry_max_sz:8;
    } b;
} btn_l2p_updt_req_que0_base_addr_t;

#define BTN_L2P_UPDT_REQ_QUE0_PTRS               0x00000164
#define   L2P_UPDT_REQ_QUE0_RD_PTR_MASK          0x0000ff00
#define   L2P_UPDT_REQ_QUE0_RD_PTR_SHIFT                  8
#define   L2P_UPDT_REQ_QUE0_WR_PTR_MASK          0x000000ff
#define   L2P_UPDT_REQ_QUE0_WR_PTR_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_req_que0_wr_ptr:8;
        u32 l2p_updt_req_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_updt_req_que0_ptrs_t;

#define BTN_L2P_UPDT_REQ_QUE0_RDPTR_BASE_ADDR    0x00000168
#define   L2P_UPDT_REQ_QUE0_RDPTR_UPDT_EN_MASK   0x80000000
#define   L2P_UPDT_REQ_QUE0_RDPTR_UPDT_EN_SHIFT          31
#define   L2P_UPDT_REQ_QUE0_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_UPDT_REQ_QUE0_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_req_que0_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_updt_req_que0_rdptr_updt_en:1;
    } b;
} btn_l2p_updt_req_que0_rdptr_base_addr_t;

#define BTN_L2P_UPDT_REQ_QUE1_BASE_ADDR          0x0000016c
#define   L2P_UPDT_REQ_QUE1_ENTRY_MAX_SZ_MASK    0xff000000
#define   L2P_UPDT_REQ_QUE1_ENTRY_MAX_SZ_SHIFT           24
#define   L2P_UPDT_REQ_QUE1_BASE_ADDR_MASK       0x007fffff
#define   L2P_UPDT_REQ_QUE1_BASE_ADDR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_req_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_updt_req_que1_entry_max_sz:8;
    } b;
} btn_l2p_updt_req_que1_base_addr_t;

#define BTN_L2P_UPDT_REQ_QUE1_PTRS               0x00000170
#define   L2P_UPDT_REQ_QUE1_RD_PTR_MASK          0x0000ff00
#define   L2P_UPDT_REQ_QUE1_RD_PTR_SHIFT                  8
#define   L2P_UPDT_REQ_QUE1_WR_PTR_MASK          0x000000ff
#define   L2P_UPDT_REQ_QUE1_WR_PTR_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_req_que1_wr_ptr:8;
        u32 l2p_updt_req_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_updt_req_que1_ptrs_t;

#define BTN_L2P_UPDT_REQ_QUE1_RDPTR_BASE_ADDR    0x00000174
#define   L2P_UPDT_REQ_QUE1_RDPTR_UPDT_EN_MASK   0x80000000
#define   L2P_UPDT_REQ_QUE1_RDPTR_UPDT_EN_SHIFT          31
#define   L2P_UPDT_REQ_QUE1_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_UPDT_REQ_QUE1_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_req_que1_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_updt_req_que1_rdptr_updt_en:1;
    } b;
} btn_l2p_updt_req_que1_rdptr_base_addr_t;

#define BTN_L2P_PDA_RSLT_LOC_PTR_QUE0_BASE_ADDR  0x00000190
#define   L2P_PDA_RSLT_LOC_PTR_QUE0_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_PDA_RSLT_LOC_PTR_QUE0_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_PDA_RSLT_LOC_PTR_QUE0_BASE_ADDR_MASK 0x007fffff
#define   L2P_PDA_RSLT_LOC_PTR_QUE0_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_loc_ptr_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_pda_rslt_loc_ptr_que0_entry_max_sz:8;
    } b;
} btn_l2p_pda_rslt_loc_ptr_que0_base_addr_t;

#define BTN_L2P_PDA_RSLT_LOC_PTR_QUE0_PTRS       0x00000194
#define   L2P_PDA_RSLT_LOC_PTR_QUE0_RD_PTR_MASK  0x0000ff00
#define   L2P_PDA_RSLT_LOC_PTR_QUE0_RD_PTR_SHIFT          8
#define   L2P_PDA_RSLT_LOC_PTR_QUE0_WR_PTR_MASK  0x000000ff
#define   L2P_PDA_RSLT_LOC_PTR_QUE0_WR_PTR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_loc_ptr_que0_wr_ptr:8;
        u32 l2p_pda_rslt_loc_ptr_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_pda_rslt_loc_ptr_que0_ptrs_t;

#define BTN_L2P_PDA_RSLT_LOC_PTR_QUE0_RDPTR_BASE_ADDR 0x00000198
#define   L2P_PDA_RSLT_LOC_PTR_QUE0_RDPTR_UPDT_EN_MASK 0x80000000
#define   L2P_PDA_RSLT_LOC_PTR_QUE0_RDPTR_UPDT_EN_SHIFT         31
#define   L2P_PDA_RSLT_LOC_PTR_QUE0_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_PDA_RSLT_LOC_PTR_QUE0_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_loc_ptr_que0_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_pda_rslt_loc_ptr_que0_rdptr_updt_en:1;
    } b;
} btn_l2p_pda_rslt_loc_ptr_que0_rdptr_base_addr_t;

#define BTN_L2P_PDA_RSLT_NORM_QUE0_BASE_ADDR     0x0000019c
#define   L2P_PDA_RSLT_NORM_QUE0_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_PDA_RSLT_NORM_QUE0_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_PDA_RSLT_NORM_QUE0_BASE_ADDR_MASK  0x007fffff
#define   L2P_PDA_RSLT_NORM_QUE0_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_norm_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_pda_rslt_norm_que0_entry_max_sz:8;
    } b;
} btn_l2p_pda_rslt_norm_que0_base_addr_t;

#define BTN_L2P_PDA_RSLT_NORM_QUE0_PTRS          0x000001a0
#define   L2P_PDA_RSLT_NORM_QUE0_RD_PTR_MASK     0x0000ff00
#define   L2P_PDA_RSLT_NORM_QUE0_RD_PTR_SHIFT             8
#define   L2P_PDA_RSLT_NORM_QUE0_WR_PTR_MASK     0x000000ff
#define   L2P_PDA_RSLT_NORM_QUE0_WR_PTR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_norm_que0_wr_ptr:8;
        u32 l2p_pda_rslt_norm_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_pda_rslt_norm_que0_ptrs_t;

#define BTN_L2P_PDA_RSLT_NORM_QUE0_WRPTR_BASE_ADDR 0x000001a4
#define   L2P_PDA_RSLT_NORM_QUE0_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_PDA_RSLT_NORM_QUE0_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_PDA_RSLT_NORM_QUE0_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_PDA_RSLT_NORM_QUE0_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_norm_que0_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_pda_rslt_norm_que0_wrptr_updt_en:1;
    } b;
} btn_l2p_pda_rslt_norm_que0_wrptr_base_addr_t;

#define BTN_L2P_PDA_RSLT_HIGH_QUE0_BASE_ADDR     0x000001a8
#define   L2P_PDA_RSLT_HIGH_QUE0_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_PDA_RSLT_HIGH_QUE0_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_PDA_RSLT_HIGH_QUE0_BASE_ADDR_MASK  0x007fffff
#define   L2P_PDA_RSLT_HIGH_QUE0_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_high_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_pda_rslt_high_que0_entry_max_sz:8;
    } b;
} btn_l2p_pda_rslt_high_que0_base_addr_t;

#define BTN_L2P_PDA_RSLT_HIGH_QUE0_PTRS          0x000001ac
#define   L2P_PDA_RSLT_HIGH_QUE0_RD_PTR_MASK     0x0000ff00
#define   L2P_PDA_RSLT_HIGH_QUE0_RD_PTR_SHIFT             8
#define   L2P_PDA_RSLT_HIGH_QUE0_WR_PTR_MASK     0x000000ff
#define   L2P_PDA_RSLT_HIGH_QUE0_WR_PTR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_high_que0_wr_ptr:8;
        u32 l2p_pda_rslt_high_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_pda_rslt_high_que0_ptrs_t;

#define BTN_L2P_PDA_RSLT_HIGH_QUE0_WRPTR_BASE_ADDR 0x000001b0
#define   L2P_PDA_RSLT_HIGH_QUE0_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_PDA_RSLT_HIGH_QUE0_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_PDA_RSLT_HIGH_QUE0_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_PDA_RSLT_HIGH_QUE0_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_high_que0_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_pda_rslt_high_que0_wrptr_updt_en:1;
    } b;
} btn_l2p_pda_rslt_high_que0_wrptr_base_addr_t;

#define BTN_L2P_PDA_RSLT_URGENT_QUE0_BASE_ADDR   0x000001b4
#define   L2P_PDA_RSLT_URGENT_QUE0_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_PDA_RSLT_URGENT_QUE0_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_PDA_RSLT_URGENT_QUE0_BASE_ADDR_MASK 0x007fffff
#define   L2P_PDA_RSLT_URGENT_QUE0_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_urgent_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_pda_rslt_urgent_que0_entry_max_sz:8;
    } b;
} btn_l2p_pda_rslt_urgent_que0_base_addr_t;

#define BTN_L2P_PDA_RSLT_URGENT_QUE0_PTRS        0x000001b8
#define   L2P_PDA_RSLT_URGENT_QUE0_RD_PTR_MASK   0x0000ff00
#define   L2P_PDA_RSLT_URGENT_QUE0_RD_PTR_SHIFT           8
#define   L2P_PDA_RSLT_URGENT_QUE0_WR_PTR_MASK   0x000000ff
#define   L2P_PDA_RSLT_URGENT_QUE0_WR_PTR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_urgent_que0_wr_ptr:8;
        u32 l2p_pda_rslt_urgent_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_pda_rslt_urgent_que0_ptrs_t;

#define BTN_L2P_PDA_RSLT_URGENT_QUE0_WRPTR_BASE_ADDR 0x000001bc
#define   L2P_PDA_RSLT_URGENT_QUE0_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_PDA_RSLT_URGENT_QUE0_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_URGENT_PDA_RSLT_QUE0_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_URGENT_PDA_RSLT_QUE0_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_urgent_pda_rslt_que0_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_pda_rslt_urgent_que0_wrptr_updt_en:1;
    } b;
} btn_l2p_pda_rslt_urgent_que0_wrptr_base_addr_t;

#define BTN_L2P_PDA_RSLT_LOC_PTR_QUE1_BASE_ADDR  0x000001c0
#define   L2P_PDA_RSLT_LOC_PTR_QUE1_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_PDA_RSLT_LOC_PTR_QUE1_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_PDA_RSLT_LOC_PTR_QUE1_BASE_ADDR_MASK 0x007fffff
#define   L2P_PDA_RSLT_LOC_PTR_QUE1_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_loc_ptr_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_pda_rslt_loc_ptr_que1_entry_max_sz:8;
    } b;
} btn_l2p_pda_rslt_loc_ptr_que1_base_addr_t;

#define BTN_L2P_PDA_RSLT_LOC_PTR_QUE1_PTRS       0x000001c4
#define   L2P_PDA_RSLT_LOC_PTR_QUE1_RD_PTR_MASK  0x0000ff00
#define   L2P_PDA_RSLT_LOC_PTR_QUE1_RD_PTR_SHIFT          8
#define   L2P_PDA_RSLT_LOC_PTR_QUE1_WR_PTR_MASK  0x000000ff
#define   L2P_PDA_RSLT_LOC_PTR_QUE1_WR_PTR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_loc_ptr_que1_wr_ptr:8;
        u32 l2p_pda_rslt_loc_ptr_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_pda_rslt_loc_ptr_que1_ptrs_t;

#define BTN_L2P_PDA_RSLT_LOC_PTR_QUE1_RDPTR_BASE_ADDR 0x000001c8
#define   L2P_PDA_RSLT_LOC_PTR_QUE1_RDPTR_UPDT_EN_MASK 0x80000000
#define   L2P_PDA_RSLT_LOC_PTR_QUE1_RDPTR_UPDT_EN_SHIFT         31
#define   L2P_PDA_RSLT_LOC_PTR_QUE1_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_PDA_RSLT_LOC_PTR_QUE1_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_loc_ptr_que1_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_pda_rslt_loc_ptr_que1_rdptr_updt_en:1;
    } b;
} btn_l2p_pda_rslt_loc_ptr_que1_rdptr_base_addr_t;

#define BTN_L2P_PDA_RSLT_NORM_QUE1_BASE_ADDR     0x000001cc
#define   L2P_PDA_RSLT_NORM_QUE1_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_PDA_RSLT_NORM_QUE1_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_PDA_RSLT_NORM_QUE1_BASE_ADDR_MASK  0x007fffff
#define   L2P_PDA_RSLT_NORM_QUE1_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_norm_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_pda_rslt_norm_que1_entry_max_sz:8;
    } b;
} btn_l2p_pda_rslt_norm_que1_base_addr_t;

#define BTN_L2P_PDA_RSLT_NORM_QUE1_PTRS          0x000001d0
#define   L2P_PDA_RSLT_NORM_QUE1_RD_PTR_MASK     0x0000ff00
#define   L2P_PDA_RSLT_NORM_QUE1_RD_PTR_SHIFT             8
#define   L2P_PDA_RSLT_NORM_QUE1_WR_PTR_MASK     0x000000ff
#define   L2P_PDA_RSLT_NORM_QUE1_WR_PTR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_norm_que1_wr_ptr:8;
        u32 l2p_pda_rslt_norm_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_pda_rslt_norm_que1_ptrs_t;

#define BTN_L2P_PDA_RSLT_NORM_QUE1_WRPTR_BASE_ADDR 0x000001d4
#define   L2P_PDA_RSLT_NORM_QUE1_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_PDA_RSLT_NORM_QUE1_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_PDA_RSLT_NORM_QUE1_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_PDA_RSLT_NORM_QUE1_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_norm_que1_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_pda_rslt_norm_que1_wrptr_updt_en:1;
    } b;
} btn_l2p_pda_rslt_norm_que1_wrptr_base_addr_t;

#define BTN_L2P_PDA_RSLT_HIGH_QUE1_BASE_ADDR     0x000001d8
#define   L2P_PDA_RSLT_HIGH_QUE1_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_PDA_RSLT_HIGH_QUE1_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_PDA_RSLT_HIGH_QUE1_BASE_ADDR_MASK  0x007fffff
#define   L2P_PDA_RSLT_HIGH_QUE1_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_high_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_pda_rslt_high_que1_entry_max_sz:8;
    } b;
} btn_l2p_pda_rslt_high_que1_base_addr_t;

#define BTN_L2P_PDA_RSLT_HIGH_QUE1_PTRS          0x000001dc
#define   L2P_PDA_RSLT_HIGH_QUE1_RD_PTR_MASK     0x0000ff00
#define   L2P_PDA_RSLT_HIGH_QUE1_RD_PTR_SHIFT             8
#define   L2P_PDA_RSLT_HIGH_QUE1_WR_PTR_MASK     0x000000ff
#define   L2P_PDA_RSLT_HIGH_QUE1_WR_PTR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_high_que1_wr_ptr:8;
        u32 l2p_pda_rslt_high_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_pda_rslt_high_que1_ptrs_t;

#define BTN_L2P_PDA_RSLT_HIGH_QUE1_WRPTR_BASE_ADDR 0x000001e0
#define   L2P_PDA_RSLT_HIGH_QUE1_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_PDA_RSLT_HIGH_QUE1_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_PDA_RSLT_HIGH_QUE1_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_PDA_RSLT_HIGH_QUE1_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_high_que1_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_pda_rslt_high_que1_wrptr_updt_en:1;
    } b;
} btn_l2p_pda_rslt_high_que1_wrptr_base_addr_t;

#define BTN_L2P_PDA_RSLT_URGENT_QUE1_BASE_ADDR   0x000001e4
#define   L2P_PDA_RSLT_URGENT_QUE1_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_PDA_RSLT_URGENT_QUE1_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_PDA_RSLT_URGENT_QUE1_BASE_ADDR_MASK 0x007fffff
#define   L2P_PDA_RSLT_URGENT_QUE1_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_urgent_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_pda_rslt_urgent_que1_entry_max_sz:8;
    } b;
} btn_l2p_pda_rslt_urgent_que1_base_addr_t;

#define BTN_L2P_PDA_RSLT_URGENT_QUE1_PTRS        0x000001e8
#define   L2P_PDA_RSLT_URGENT_QUE1_RD_PTR_MASK   0x0000ff00
#define   L2P_PDA_RSLT_URGENT_QUE1_RD_PTR_SHIFT           8
#define   L2P_PDA_RSLT_URGENT_QUE1_WR_PTR_MASK   0x000000ff
#define   L2P_PDA_RSLT_URGENT_QUE1_WR_PTR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 l2p_pda_rslt_urgent_que1_wr_ptr:8;
        u32 l2p_pda_rslt_urgent_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_pda_rslt_urgent_que1_ptrs_t;

#define BTN_L2P_PDA_RSLT_URGENT_QUE1_WRPTR_BASE_ADDR 0x000001ec
#define   L2P_PDA_RSLT_URGENT_QUE1_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_PDA_RSLT_URGENT_QUE1_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_URGENT_PDA_RSLT_QUE1_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_URGENT_PDA_RSLT_QUE1_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_urgent_pda_rslt_que1_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_pda_rslt_urgent_que1_wrptr_updt_en:1;
    } b;
} btn_l2p_pda_rslt_urgent_que1_wrptr_base_addr_t;

#define BTN_L2P_UNMAP_LDA_QUE_BASE_ADDR          0x000001fc
#define   L2P_UNMAP_LDA_QUE_ENTRY_MAX_SZ_MASK    0xff000000
#define   L2P_UNMAP_LDA_QUE_ENTRY_MAX_SZ_SHIFT           24
#define   L2P_UNMAP_LDA_QUE_BASE_ADDR_MASK       0x007fffff
#define   L2P_UNMAP_LDA_QUE_BASE_ADDR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 l2p_unmap_lda_que_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_unmap_lda_que_entry_max_sz:8;
    } b;
} btn_l2p_unmap_lda_que_base_addr_t;

#define BTN_L2P_UNMAP_LDA_QUE_PTRS               0x00000200
#define   L2P_UNMAP_LDA_QUE_RD_PTR_MASK          0x0000ff00
#define   L2P_UNMAP_LDA_QUE_RD_PTR_SHIFT                  8
#define   L2P_UNMAP_LDA_QUE_WR_PTR_MASK          0x000000ff
#define   L2P_UNMAP_LDA_QUE_WR_PTR_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 l2p_unmap_lda_que_wr_ptr:8;
        u32 l2p_unmap_lda_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_unmap_lda_que_ptrs_t;

#define BTN_L2P_UNMAP_LDA_QUE_WRPTR_BASE_ADDR    0x00000204
#define   L2P_UNMAP_LDA_QUE_WRPTR_UPDT_EN_MASK   0x80000000
#define   L2P_UNMAP_LDA_QUE_WRPTR_UPDT_EN_SHIFT          31
#define   L2P_UNMAP_LDA_QUE_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_UNMAP_LDA_QUE_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_unmap_lda_que_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_unmap_lda_que_wrptr_updt_en:1;
    } b;
} btn_l2p_unmap_lda_que_wrptr_base_addr_t;

#define BTN_L2P_COMMIT_COMPL_QUE0_BASE_ADDR      0x00000208
#define   L2P_COMMIT_COMPL_QUE0_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_COMMIT_COMPL_QUE0_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_COMMIT_COMPL_QUE0_BASE_ADDR_MASK   0x007fffff
#define   L2P_COMMIT_COMPL_QUE0_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 l2p_commit_compl_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_commit_compl_que0_entry_max_sz:8;
    } b;
} btn_l2p_commit_compl_que0_base_addr_t;

#define BTN_L2P_COMMIT_COMPL_QUE0_PTRS           0x0000020c
#define   L2P_COMMIT_COMPL_QUE0_RD_PTR_MASK      0x0000ff00
#define   L2P_COMMIT_COMPL_QUE0_RD_PTR_SHIFT              8
#define   L2P_COMMIT_COMPL_QUE0_WR_PTR_MASK      0x000000ff
#define   L2P_COMMIT_COMPL_QUE0_WR_PTR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 l2p_commit_compl_que0_wr_ptr:8;
        u32 l2p_commit_compl_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_commit_compl_que0_ptrs_t;

#define BTN_L2P_COMMIT_COMPL_QUE0_WRPTR_BASE_ADDR 0x00000210
#define   L2P_COMMIT_COMPL_QUE0_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_COMMIT_COMPL_QUE0_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_COMMIT_COMPL_QUE0_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_COMMIT_COMPL_QUE0_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_commit_compl_que0_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_commit_compl_que0_wrptr_updt_en:1;
    } b;
} btn_l2p_commit_compl_que0_wrptr_base_addr_t;

#define BTN_L2P_COMMIT_COMPL_QUE1_BASE_ADDR      0x00000214
#define   L2P_COMMIT_COMPL_QUE1_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_COMMIT_COMPL_QUE1_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_COMMIT_COMPL_QUE1_BASE_ADDR_MASK   0x007fffff
#define   L2P_COMMIT_COMPL_QUE1_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 l2p_commit_compl_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_commit_compl_que1_entry_max_sz:8;
    } b;
} btn_l2p_commit_compl_que1_base_addr_t;

#define BTN_L2P_COMMIT_COMPL_QUE1_PTRS           0x00000218
#define   L2P_COMMIT_COMPL_QUE1_RD_PTR_MASK      0x0000ff00
#define   L2P_COMMIT_COMPL_QUE1_RD_PTR_SHIFT              8
#define   L2P_COMMIT_COMPL_QUE1_WR_PTR_MASK      0x000000ff
#define   L2P_COMMIT_COMPL_QUE1_WR_PTR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 l2p_commit_compl_que1_wr_ptr:8;
        u32 l2p_commit_compl_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_commit_compl_que1_ptrs_t;

#define BTN_L2P_COMMIT_COMPL_QUE1_WRPTR_BASE_ADDR 0x0000021c
#define   L2P_COMMIT_COMPL_QUE1_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_COMMIT_COMPL_QUE1_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_COMMIT_COMPL_QUE1_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_COMMIT_COMPL_QUE1_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_commit_compl_que1_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_commit_compl_que1_wrptr_updt_en:1;
    } b;
} btn_l2p_commit_compl_que1_wrptr_base_addr_t;

#define BTN_L2P_UPDATE_RECYCLE_QUE_BASE_ADDR     0x00000220
#define   L2P_UPDATE_RECYCLE_QUE_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_UPDATE_RECYCLE_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_UPDATE_RECYCLE_QUE_BASE_ADDR_MASK  0x007fffff
#define   L2P_UPDATE_RECYCLE_QUE_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_update_recycle_que_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_update_recycle_que_entry_max_sz:8;
    } b;
} btn_l2p_update_recycle_que_base_addr_t;

#define BTN_L2P_UPDATE_RECYCLE_QUE_PTRS          0x00000224
#define   L2P_UPDATE_RECYCLE_QUE_RD_PTR_MASK     0x0000ff00
#define   L2P_UPDATE_RECYCLE_QUE_RD_PTR_SHIFT             8
#define   L2P_UPDATE_RECYCLE_QUE_WR_PTR_MASK     0x000000ff
#define   L2P_UPDATE_RECYCLE_QUE_WR_PTR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 l2p_update_recycle_que_wr_ptr:8;
        u32 l2p_update_recycle_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_update_recycle_que_ptrs_t;

#define BTN_L2P_UPDATE_RECYCLE_QUE_WRPTR_BASE_ADDR 0x00000228
#define   L2P_UPDATE_RECYCLE_QUE_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_UPDATE_RECYCLE_QUE_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_UPDATE_RECYCLE_QUE_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_UPDATE_RECYCLE_QUE_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_update_recycle_que_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_update_recycle_que_wrptr_updt_en:1;
    } b;
} btn_l2p_update_recycle_que_wrptr_base_addr_t;

#define BTN_L2P_TP_FLUSH_QUE_BASE_ADDR           0x00000250
#define   L2P_TP_FLUSH_QUE_ENTRY_MAX_SZ_MASK     0xff000000
#define   L2P_TP_FLUSH_QUE_ENTRY_MAX_SZ_SHIFT            24
#define   L2P_TP_FLUSH_QUE_BASE_ADDR_MASK        0x007fffff
#define   L2P_TP_FLUSH_QUE_BASE_ADDR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 l2p_tp_flush_que_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_tp_flush_que_entry_max_sz:8;
    } b;
} btn_l2p_tp_flush_que_base_addr_t;

#define BTN_L2P_TP_FLUSH_QUE_PTRS                0x00000254
#define   BTN_L2P_TP_FLUSH_QUE_RD_PTR_MASK       0x0000ff00
#define   BTN_L2P_TP_FLUSH_QUE_RD_PTR_SHIFT               8
#define   BTN_L2P_TP_FLUSH_QUE_WR_PTR_MASK       0x000000ff
#define   BTN_L2P_TP_FLUSH_QUE_WR_PTR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 btn_l2p_tp_flush_que_wr_ptr:8;
        u32 btn_l2p_tp_flush_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_tp_flush_que_ptrs_t;

#define BTN_L2P_TP_FLUSH_QUE_WRPTR_BASE_ADDR     0x00000258
#define   L2P_TP_FLUSH_QUE_WRPTR_UPDT_EN_MASK    0x80000000
#define   L2P_TP_FLUSH_QUE_WRPTR_UPDT_EN_SHIFT           31
#define   L2P_TP_FLUSH_QUE_WRPTR_BASE_ADDR_MASK  0x007fffff
#define   L2P_TP_FLUSH_QUE_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_tp_flush_que_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_tp_flush_que_wrptr_updt_en:1;
    } b;
} btn_l2p_tp_flush_que_wrptr_base_addr_t;

#define BTN_L2P_UPDT_COMPL_QUE0_BASE_ADDR        0x0000025c
#define   L2P_UPDT_COMPL_QUE0_ENTRY_MAX_SZ_MASK  0xff000000
#define   L2P_UPDT_COMPL_QUE0_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_UPDT_COMPL_QUE0_BASE_ADDR_MASK     0x007fffff
#define   L2P_UPDT_COMPL_QUE0_BASE_ADDR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_updt_compl_que0_entry_max_sz:8;
    } b;
} btn_l2p_updt_compl_que0_base_addr_t;

#define BTN_L2P_UPDT_COMPL_QUE0_PTRS             0x00000260
#define   L2P_UPDT_COMPL_QUE0_RD_PTR_MASK        0x0000ff00
#define   L2P_UPDT_COMPL_QUE0_RD_PTR_SHIFT                8
#define   L2P_UPDT_COMPL_QUE0_WR_PTR_MASK        0x000000ff
#define   L2P_UPDT_COMPL_QUE0_WR_PTR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que0_wr_ptr:8;
        u32 l2p_updt_compl_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_updt_compl_que0_ptrs_t;

#define BTN_L2P_UPDT_COMPL_QUE0_WRPTR_BASE_ADDR  0x00000264
#define   L2P_UPDT_COMPL_QUE0_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_UPDT_COMPL_QUE0_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_UPDT_COMPL_QUE0_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_UPDT_COMPL_QUE0_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que0_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_updt_compl_que0_wrptr_updt_en:1;
    } b;
} btn_l2p_updt_compl_que0_wrptr_base_addr_t;

#define BTN_L2P_UPDT_COMPL_QUE1_BASE_ADDR        0x00000268
#define   L2P_UPDT_COMPL_QUE1_ENTRY_MAX_SZ_MASK  0xff000000
#define   L2P_UPDT_COMPL_QUE1_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_UPDT_COMPL_QUE1_BASE_ADDR_MASK     0x007fffff
#define   L2P_UPDT_COMPL_QUE1_BASE_ADDR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_updt_compl_que1_entry_max_sz:8;
    } b;
} btn_l2p_updt_compl_que1_base_addr_t;

#define BTN_L2P_UPDT_COMPL_QUE1_PTRS             0x0000026c
#define   L2P_UPDT_COMPL_QUE1_RD_PTR_MASK        0x0000ff00
#define   L2P_UPDT_COMPL_QUE1_RD_PTR_SHIFT                8
#define   L2P_UPDT_COMPL_QUE1_WR_PTR_MASK        0x000000ff
#define   L2P_UPDT_COMPL_QUE1_WR_PTR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que1_wr_ptr:8;
        u32 l2p_updt_compl_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_updt_compl_que1_ptrs_t;

#define BTN_L2P_UPDT_COMPL_QUE1_WRPTR_BASE_ADDR  0x00000270
#define   L2P_UPDT_COMPL_QUE1_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_UPDT_COMPL_QUE1_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_UPDT_COMPL_QUE1_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_UPDT_COMPL_QUE1_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que1_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_updt_compl_que1_wrptr_updt_en:1;
    } b;
} btn_l2p_updt_compl_que1_wrptr_base_addr_t;

#define BTN_L2P_UPDT_REQ_QUE2_BASE_ADDR          0x00000274
#define   L2P_UPDT_REQ_QUE2_ENTRY_MAX_SZ_MASK    0xff000000
#define   L2P_UPDT_REQ_QUE2_ENTRY_MAX_SZ_SHIFT           24
#define   L2P_UPDT_REQ_QUE2_BASE_ADDR_MASK       0x007fffff
#define   L2P_UPDT_REQ_QUE2_BASE_ADDR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_req_que2_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_updt_req_que2_entry_max_sz:8;
    } b;
} btn_l2p_updt_req_que2_base_addr_t;

#define BTN_L2P_UPDT_REQ_QUE2_PTRS               0x00000278
#define   L2P_UPDT_REQ_QUE2_RD_PTR_MASK          0x0000ff00
#define   L2P_UPDT_REQ_QUE2_RD_PTR_SHIFT                  8
#define   L2P_UPDT_REQ_QUE2_WR_PTR_MASK          0x000000ff
#define   L2P_UPDT_REQ_QUE2_WR_PTR_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_req_que2_wr_ptr:8;
        u32 l2p_updt_req_que2_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_updt_req_que2_ptrs_t;

#define BTN_L2P_UPDT_REQ_QUE2_RDPTR_BASE_ADDR    0x0000027c
#define   L2P_UPDT_REQ_QUE2_RDPTR_UPDT_EN_MASK   0x80000000
#define   L2P_UPDT_REQ_QUE2_RDPTR_UPDT_EN_SHIFT          31
#define   L2P_UPDT_REQ_QUE2_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_UPDT_REQ_QUE2_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_req_que2_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_updt_req_que2_rdptr_updt_en:1;
    } b;
} btn_l2p_updt_req_que2_rdptr_base_addr_t;

#define BTN_L2P_COMMIT_COMPL_QUE2_BASE_ADDR      0x00000280
#define   L2P_COMMIT_COMPL_QUE2_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_COMMIT_COMPL_QUE2_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_COMMIT_COMPL_QUE2_BASE_ADDR_MASK   0x007fffff
#define   L2P_COMMIT_COMPL_QUE2_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 l2p_commit_compl_que2_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_commit_compl_que2_entry_max_sz:8;
    } b;
} btn_l2p_commit_compl_que2_base_addr_t;

#define BTN_L2P_COMMIT_COMPL_QUE2_PTRS           0x00000284
#define   L2P_COMMIT_COMPL_QUE2_RD_PTR_MASK      0x0000ff00
#define   L2P_COMMIT_COMPL_QUE2_RD_PTR_SHIFT              8
#define   L2P_COMMIT_COMPL_QUE2_WR_PTR_MASK      0x000000ff
#define   L2P_COMMIT_COMPL_QUE2_WR_PTR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 l2p_commit_compl_que2_wr_ptr:8;
        u32 l2p_commit_compl_que2_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_commit_compl_que2_ptrs_t;

#define BTN_L2P_COMMIT_COMPL_QUE2_WRPTR_BASE_ADDR 0x00000288
#define   L2P_COMMIT_COMPL_QUE2_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_COMMIT_COMPL_QUE2_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_COMMIT_COMPL_QUE2_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_COMMIT_COMPL_QUE2_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_commit_compl_que2_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_commit_compl_que2_wrptr_updt_en:1;
    } b;
} btn_l2p_commit_compl_que2_wrptr_base_addr_t;

#define BTN_L2P_UPDT_COMPL_QUE2_BASE_ADDR        0x0000028c
#define   L2P_UPDT_COMPL_QUE2_ENTRY_MAX_SZ_MASK  0xff000000
#define   L2P_UPDT_COMPL_QUE2_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_UPDT_COMPL_QUE2_BASE_ADDR_MASK     0x007fffff
#define   L2P_UPDT_COMPL_QUE2_BASE_ADDR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que2_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_updt_compl_que2_entry_max_sz:8;
    } b;
} btn_l2p_updt_compl_que2_base_addr_t;

#define BTN_L2P_UPDT_COMPL_QUE2_PTRS             0x00000290
#define   L2P_UPDT_COMPL_QUE2_RD_PTR_MASK        0x0000ff00
#define   L2P_UPDT_COMPL_QUE2_RD_PTR_SHIFT                8
#define   L2P_UPDT_COMPL_QUE2_WR_PTR_MASK        0x000000ff
#define   L2P_UPDT_COMPL_QUE2_WR_PTR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que2_wr_ptr:8;
        u32 l2p_updt_compl_que2_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_updt_compl_que2_ptrs_t;

#define BTN_L2P_UPDT_COMPL_QUE2_WRPTR_BASE_ADDR  0x00000294
#define   L2P_UPDT_COMPL_QUE2_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_UPDT_COMPL_QUE2_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_UPDT_COMPL_QUE2_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_UPDT_COMPL_QUE2_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que2_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_updt_compl_que2_wrptr_updt_en:1;
    } b;
} btn_l2p_updt_compl_que2_wrptr_base_addr_t;

#define BTN_L2P_UPDT_REQ_QUE3_BASE_ADDR          0x00000298
#define   L2P_UPDT_REQ_QUE3_ENTRY_MAX_SZ_MASK    0xff000000
#define   L2P_UPDT_REQ_QUE3_ENTRY_MAX_SZ_SHIFT           24
#define   L2P_UPDT_REQ_QUE3_BASE_ADDR_MASK       0x007fffff
#define   L2P_UPDT_REQ_QUE3_BASE_ADDR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_req_que3_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_updt_req_que3_entry_max_sz:8;
    } b;
} btn_l2p_updt_req_que3_base_addr_t;

#define BTN_L2P_UPDT_REQ_QUE3_PTRS               0x0000029c
#define   L2P_UPDT_REQ_QUE3_RD_PTR_MASK          0x0000ff00
#define   L2P_UPDT_REQ_QUE3_RD_PTR_SHIFT                  8
#define   L2P_UPDT_REQ_QUE3_WR_PTR_MASK          0x000000ff
#define   L2P_UPDT_REQ_QUE3_WR_PTR_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_req_que3_wr_ptr:8;
        u32 l2p_updt_req_que3_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_updt_req_que3_ptrs_t;

#define BTN_L2P_UPDT_REQ_QUE3_RDPTR_BASE_ADDR    0x000002a0
#define   L2P_UPDT_REQ_QUE3_RDPTR_UPDT_EN_MASK   0x80000000
#define   L2P_UPDT_REQ_QUE3_RDPTR_UPDT_EN_SHIFT          31
#define   L2P_UPDT_REQ_QUE3_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_UPDT_REQ_QUE3_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_req_que3_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_updt_req_que3_rdptr_updt_en:1;
    } b;
} btn_l2p_updt_req_que3_rdptr_base_addr_t;

#define BTN_L2P_COMMIT_COMPL_QUE3_BASE_ADDR      0x000002a4
#define   L2P_COMMIT_COMPL_QUE3_ENTRY_MAX_SZ_MASK 0xff000000
#define   L2P_COMMIT_COMPL_QUE3_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_COMMIT_COMPL_QUE3_BASE_ADDR_MASK   0x007fffff
#define   L2P_COMMIT_COMPL_QUE3_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 l2p_commit_compl_que3_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_commit_compl_que3_entry_max_sz:8;
    } b;
} btn_l2p_commit_compl_que3_base_addr_t;

#define BTN_L2P_COMMIT_COMPL_QUE3_PTRS           0x000002a8
#define   L2P_COMMIT_COMPL_QUE3_RD_PTR_MASK      0x0000ff00
#define   L2P_COMMIT_COMPL_QUE3_RD_PTR_SHIFT              8
#define   L2P_COMMIT_COMPL_QUE3_WR_PTR_MASK      0x000000ff
#define   L2P_COMMIT_COMPL_QUE3_WR_PTR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 l2p_commit_compl_que3_wr_ptr:8;
        u32 l2p_commit_compl_que3_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_commit_compl_que3_ptrs_t;

#define BTN_L2P_COMMIT_COMPL_QUE3_WRPTR_BASE_ADDR 0x000002ac
#define   L2P_COMMIT_COMPL_QUE3_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_COMMIT_COMPL_QUE3_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_COMMIT_COMPL_QUE3_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_COMMIT_COMPL_QUE3_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_commit_compl_que3_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_commit_compl_que3_wrptr_updt_en:1;
    } b;
} btn_l2p_commit_compl_que3_wrptr_base_addr_t;

#define BTN_L2P_UPDT_COMPL_QUE3_BASE_ADDR        0x000002b0
#define   L2P_UPDT_COMPL_QUE3_ENTRY_MAX_SZ_MASK  0xff000000
#define   L2P_UPDT_COMPL_QUE3_ENTRY_MAX_SZ_SHIFT         24
#define   L2P_UPDT_COMPL_QUE3_BASE_ADDR_MASK     0x007fffff
#define   L2P_UPDT_COMPL_QUE3_BASE_ADDR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que3_base_addr:23;
        u32 rsvd_23:1;
        u32 l2p_updt_compl_que3_entry_max_sz:8;
    } b;
} btn_l2p_updt_compl_que3_base_addr_t;

#define BTN_L2P_UPDT_COMPL_QUE3_PTRS             0x000002b4
#define   L2P_UPDT_COMPL_QUE3_RD_PTR_MASK        0x0000ff00
#define   L2P_UPDT_COMPL_QUE3_RD_PTR_SHIFT                8
#define   L2P_UPDT_COMPL_QUE3_WR_PTR_MASK        0x000000ff
#define   L2P_UPDT_COMPL_QUE3_WR_PTR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que3_wr_ptr:8;
        u32 l2p_updt_compl_que3_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_l2p_updt_compl_que3_ptrs_t;

#define BTN_L2P_UPDT_COMPL_QUE3_WRPTR_BASE_ADDR  0x000002b8
#define   L2P_UPDT_COMPL_QUE3_WRPTR_UPDT_EN_MASK 0x80000000
#define   L2P_UPDT_COMPL_QUE3_WRPTR_UPDT_EN_SHIFT         31
#define   L2P_UPDT_COMPL_QUE3_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   L2P_UPDT_COMPL_QUE3_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 l2p_updt_compl_que3_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 l2p_updt_compl_que3_wrptr_updt_en:1;
    } b;
} btn_l2p_updt_compl_que3_wrptr_base_addr_t;

#define BTN_FTL_STATUS_CNT_TABLE_CONFIG_REG0     0x00000300
#define   FTL_STATUS_CNT_BASE_ADDR_MASK          0xffffffff
#define   FTL_STATUS_CNT_BASE_ADDR_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_base_addr:32;
    } b;
} btn_ftl_status_cnt_table_config_reg0_t;

#define BTN_FTL_STATUS_CNT_TABLE_CONFIG_REG1     0x00000304
#define   FTL_STATUS_TABLE_BASE_ADDR_MASK        0xffffffff
#define   FTL_STATUS_TABLE_BASE_ADDR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_table_base_addr:32;
    } b;
} btn_ftl_status_cnt_table_config_reg1_t;

#define BTN_FTL_STATUS_CNT_TABLE_CONFIG_REG2     0x00000308
#define   FTL_STATUS_CNT_LOC_SEL_MASK            0xc0000000
#define   FTL_STATUS_CNT_LOC_SEL_SHIFT                   30
#define   FTL_STATUS_CNT_ENTRY_SIZE_MASK         0x30000000
#define   FTL_STATUS_CNT_ENTRY_SIZE_SHIFT                28
#define   FTL_STATUS_TABLE_LOC_SEL_MASK          0x0c000000
#define   FTL_STATUS_TABLE_LOC_SEL_SHIFT                 26
#define   FTL_STATUS_TABLE_ENTRY_SIZE_MASK       0x03000000
#define   FTL_STATUS_TABLE_ENTRY_SIZE_SHIFT              24
#define   FTL_STATUS_CNT_TABLE_MAX_ENTRY_PER_GRP_MASK 0x00ffffff
#define   FTL_STATUS_CNT_TABLE_MAX_ENTRY_PER_GRP_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_table_max_entry_per_grp:24;
        u32 ftl_status_table_entry_size:2;
        u32 ftl_status_table_loc_sel:2;
        u32 ftl_status_cnt_entry_size:2;
        u32 ftl_status_cnt_loc_sel:2;
    } b;
} btn_ftl_status_cnt_table_config_reg2_t;

#define BTN_FTL_STATUS_CNT_TABLE_CONFIG_REG3     0x0000030c
#define   FTL_STATUS_CNT_TABLE_CONFIG_PTR_MASK   0x00000003
#define   FTL_STATUS_CNT_TABLE_CONFIG_PTR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_table_config_ptr:2;
        u32 rsvd_2:30;
    } b;
} btn_ftl_status_cnt_table_config_reg3_t;

#define BTN_FTL_STATUS_CNT_MAX_VALUE_REG0        0x00000310
#define   FTL_STATUS_CNT_MAX_VALUE0_MASK         0xffffffff
#define   FTL_STATUS_CNT_MAX_VALUE0_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_max_value0:32;
    } b;
} btn_ftl_status_cnt_max_value_reg0_t;

#define BTN_FTL_STATUS_CNT_MAX_VALUE_REG1        0x00000314
#define   FTL_STATUS_CNT_MAX_VALUE1_MASK         0xffffffff
#define   FTL_STATUS_CNT_MAX_VALUE1_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_max_value1:32;
    } b;
} btn_ftl_status_cnt_max_value_reg1_t;

#define BTN_FTL_STATUS_CNT_NOTIF_THRESHOLD       0x00000318
#define   FTL_STATUS_CNT_NOTIF_THRESHOLD_MASK    0xffffffff
#define   FTL_STATUS_CNT_NOTIF_THRESHOLD_SHIFT            0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_notif_threshold:32;
    } b;
} btn_ftl_status_cnt_notif_threshold_t;

#define BTN_FTL_STATUS_CNT_FET_REQ_QUE_BASE_ADDR 0x00000320
#define   FTL_STATUS_CNT_FET_REQ_QUE_ENTRY_MAX_SZ_MASK 0xff000000
#define   FTL_STATUS_CNT_FET_REQ_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   FTL_STATUS_CNT_FET_REQ_QUE_BASE_ADDR_MASK 0x007fffff
#define   FTL_STATUS_CNT_FET_REQ_QUE_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_fet_req_que_base_addr:23;
        u32 rsvd_23:1;
        u32 ftl_status_cnt_fet_req_que_entry_max_sz:8;
    } b;
} btn_ftl_status_cnt_fet_req_que_base_addr_t;

#define BTN_FTL_STATUS_CNT_FET_REQ_QUE_PTRS      0x00000324
#define   FTL_STATUS_CNT_FET_REQ_QUE_RD_PTR_MASK 0x0000ff00
#define   FTL_STATUS_CNT_FET_REQ_QUE_RD_PTR_SHIFT          8
#define   FTL_STATUS_CNT_FET_REQ_QUE_WR_PTR_MASK 0x000000ff
#define   FTL_STATUS_CNT_FET_REQ_QUE_WR_PTR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_fet_req_que_wr_ptr:8;
        u32 ftl_status_cnt_fet_req_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_ftl_status_cnt_fet_req_que_ptrs_t;

#define BTN_FTL_STATUS_CNT_FET_REQ_QUE_RDPTR_BASE_ADDR 0x00000328
#define   FTL_STATUS_CNT_FET_REQ_QUE_RDPTR_UPDT_EN_MASK 0x80000000
#define   FTL_STATUS_CNT_FET_REQ_QUE_RDPTR_UPDT_EN_SHIFT         31
#define   FTL_STATUS_CNT_FET_REQ_QUE_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   FTL_STATUS_CNT_FET_REQ_QUE_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_fet_req_que_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 ftl_status_cnt_fet_req_que_rdptr_updt_en:1;
    } b;
} btn_ftl_status_cnt_fet_req_que_rdptr_base_addr_t;

#define BTN_FTL_STATUS_CNT_FET_RSLT_QUE_BASE_ADDR 0x0000032c
#define   FTL_STATUS_CNT_FET_RSLT_QUE_ENTRY_MAX_SZ_MASK 0xff000000
#define   FTL_STATUS_CNT_FET_RSLT_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   FTL_STATUS_CNT_FET_RSLT_QUE_BASE_ADDR_MASK 0x007fffff
#define   FTL_STATUS_CNT_FET_RSLT_QUE_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_fet_rslt_que_base_addr:23;
        u32 rsvd_23:1;
        u32 ftl_status_cnt_fet_rslt_que_entry_max_sz:8;
    } b;
} btn_ftl_status_cnt_fet_rslt_que_base_addr_t;

#define BTN_FTL_STATUS_CNT_FET_RSLT_QUE_PTRS     0x00000330
#define   FTL_STATUS_CNT_FET_RSLT_QUE_RD_PTR_MASK 0x0000ff00
#define   FTL_STATUS_CNT_FET_RSLT_QUE_RD_PTR_SHIFT          8
#define   FTL_STATUS_CNT_FET_RSLT_QUE_WR_PTR_MASK 0x000000ff
#define   FTL_STATUS_CNT_FET_RSLT_QUE_WR_PTR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_fet_rslt_que_wr_ptr:8;
        u32 ftl_status_cnt_fet_rslt_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_ftl_status_cnt_fet_rslt_que_ptrs_t;

#define BTN_FTL_STATUS_CNT_FET_RSLT_QUE_WRPTR_BASE_ADDR 0x00000334
#define   FTL_STATUS_CNT_FET_RSLT_QUE_WRPTR_UPDT_EN_MASK 0x80000000
#define   FTL_STATUS_CNT_FET_RSLT_QUE_WRPTR_UPDT_EN_SHIFT         31
#define   FTL_STATUS_CNT_FET_RSLT_QUE_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   FTL_STATUS_CNT_FET_RSLT_QUE_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_fet_rslt_que_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 ftl_status_cnt_fet_rslt_que_wrptr_updt_en:1;
    } b;
} btn_ftl_status_cnt_fet_rslt_que_wrptr_base_addr_t;

#define BTN_FTL_STATUS_CNT_NOTIF_QUE_BASE_ADDR   0x00000338
#define   FTL_STATUS_CNT_NOTIF_QUE_ENTRY_MAX_SZ_MASK 0xff000000
#define   FTL_STATUS_CNT_NOTIF_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   FTL_STATUS_CNT_NOTIF_QUE_BASE_ADDR_MASK 0x007fffff
#define   FTL_STATUS_CNT_NOTIF_QUE_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_notif_que_base_addr:23;
        u32 rsvd_23:1;
        u32 ftl_status_cnt_notif_que_entry_max_sz:8;
    } b;
} btn_ftl_status_cnt_notif_que_base_addr_t;

#define BTN_FTL_STATUS_CNT_NOTIF_QUE_PTRS        0x0000033c
#define   FTL_STATUS_CNT_NOTIF_QUE_RD_PTR_MASK   0x0000ff00
#define   FTL_STATUS_CNT_NOTIF_QUE_RD_PTR_SHIFT           8
#define   FTL_STATUS_CNT_NOTIF_QUE_WR_PTR_MASK   0x000000ff
#define   FTL_STATUS_CNT_NOTIF_QUE_WR_PTR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_notif_que_wr_ptr:8;
        u32 ftl_status_cnt_notif_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_ftl_status_cnt_notif_que_ptrs_t;

#define BTN_FTL_STATUS_CNT_NOTIF_QUE_WRPTR_BASE_ADDR 0x00000340
#define   FTL_STATUS_CNT_NOTIF_QUE_WRPTR_UPDT_EN_MASK 0x80000000
#define   FTL_STATUS_CNT_NOTIF_QUE_WRPTR_UPDT_EN_SHIFT         31
#define   FTL_STATUS_CNT_NOTIF_QUE_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   FTL_STATUS_CNT_NOTIF_QUE_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_notif_que_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 ftl_status_cnt_notif_que_wrptr_updt_en:1;
    } b;
} btn_ftl_status_cnt_notif_que_wrptr_base_addr_t;

#define BTN_FTL_STATUS_CNT_SRCH_REQ_QUE_BASE_ADDR 0x00000344
#define   FTL_STATUS_CNT_SRCH_REQ_QUE_ENTRY_MAX_SZ_MASK 0xff000000
#define   FTL_STATUS_CNT_SRCH_REQ_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   FTL_STATUS_CNT_SRCH_REQ_QUE_BASE_ADDR_MASK 0x007fffff
#define   FTL_STATUS_CNT_SRCH_REQ_QUE_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_srch_req_que_base_addr:23;
        u32 rsvd_23:1;
        u32 ftl_status_cnt_srch_req_que_entry_max_sz:8;
    } b;
} btn_ftl_status_cnt_srch_req_que_base_addr_t;

#define BTN_FTL_STATUS_CNT_SRCH_REQ_QUE_PTRS     0x00000348
#define   FTL_STATUS_CNT_SRCH_REQ_QUE_RD_PTR_MASK 0x0000ff00
#define   FTL_STATUS_CNT_SRCH_REQ_QUE_RD_PTR_SHIFT          8
#define   FTL_STATUS_CNT_SRCH_REQ_QUE_WR_PTR_MASK 0x000000ff
#define   FTL_STATUS_CNT_SRCH_REQ_QUE_WR_PTR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_srch_req_que_wr_ptr:8;
        u32 ftl_status_cnt_srch_req_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_ftl_status_cnt_srch_req_que_ptrs_t;

#define BTN_FTL_STATUS_CNT_SRCH_REQ_QUE_RDPTR_BASE_ADDR 0x0000034c
#define   FTL_STATUS_CNT_SRCH_REQ_QUE_RDPTR_UPDT_EN_MASK 0x80000000
#define   FTL_STATUS_CNT_SRCH_REQ_QUE_RDPTR_UPDT_EN_SHIFT         31
#define   FTL_STATUS_CNT_SRCH_REQ_QUE_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   FTL_STATUS_CNT_SRCH_REQ_QUE_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_srch_req_que_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 ftl_status_cnt_srch_req_que_rdptr_updt_en:1;
    } b;
} btn_ftl_status_cnt_srch_req_que_rdptr_base_addr_t;

#define BTN_FTL_STATUS_CNT_SRCH_RSLT_QUE_BASE_ADDR 0x00000350
#define   FTL_STATUS_CNT_SRCH_RSLT_QUE_ENTRY_MAX_SZ_MASK 0xff000000
#define   FTL_STATUS_CNT_SRCH_RSLT_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   FTL_STATUS_CNT_SRCH_RSLT_QUE_BASE_ADDR_MASK 0x007fffff
#define   FTL_STATUS_CNT_SRCH_RSLT_QUE_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_srch_rslt_que_base_addr:23;
        u32 rsvd_23:1;
        u32 ftl_status_cnt_srch_rslt_que_entry_max_sz:8;
    } b;
} btn_ftl_status_cnt_srch_rslt_que_base_addr_t;

#define BTN_FTL_STATUS_CNT_SRCH_RSLT_QUE_PTRS    0x00000354
#define   FTL_STATUS_CNT_SRCH_RSLT_QUE_RD_PTR_MASK 0x0000ff00
#define   FTL_STATUS_CNT_SRCH_RSLT_QUE_RD_PTR_SHIFT          8
#define   FTL_STATUS_CNT_SRCH_RSLT_QUE_WR_PTR_MASK 0x000000ff
#define   FTL_STATUS_CNT_SRCH_RSLT_QUE_WR_PTR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_srch_rslt_que_wr_ptr:8;
        u32 ftl_status_cnt_srch_rslt_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_ftl_status_cnt_srch_rslt_que_ptrs_t;

#define BTN_FTL_STATUS_CNT_SRCH_RSLT_QUE_WRPTR_BASE_ADDR 0x00000358
#define   FTL_STATUS_CNT_SRCH_RSLT_QUE_WRPTR_UPDT_EN_MASK 0x80000000
#define   FTL_STATUS_CNT_SRCH_RSLT_QUE_WRPTR_UPDT_EN_SHIFT         31
#define   FTL_STATUS_CNT_SRCH_RSLT_QUE_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   FTL_STATUS_CNT_SRCH_RSLT_QUE_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_status_cnt_srch_rslt_que_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 ftl_status_cnt_srch_rslt_que_wrptr_updt_en:1;
    } b;
} btn_ftl_status_cnt_srch_rslt_que_wrptr_base_addr_t;

#define BTN_DVL_INFO_FW_UPDT_REQ_QUE_BASE_ADDR   0x00000380
#define   DVL_INFO_FW_UPDT_REQ_QUE_ENTRY_MAX_SZ_MASK 0xff000000
#define   DVL_INFO_FW_UPDT_REQ_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   DVL_INFO_FW_UPDT_REQ_QUE_BASE_ADDR_MASK 0x007fffff
#define   DVL_INFO_FW_UPDT_REQ_QUE_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 dvl_info_fw_updt_req_que_base_addr:23;
        u32 rsvd_23:1;
        u32 dvl_info_fw_updt_req_que_entry_max_sz:8;
    } b;
} btn_dvl_info_fw_updt_req_que_base_addr_t;

#define BTN_DVL_INFO_FW_UPDT_REQ_QUE_PTRS        0x00000384
#define   DVL_INFO_FW_UPDT_REQ_QUE_RD_PTR_MASK   0x0000ff00
#define   DVL_INFO_FW_UPDT_REQ_QUE_RD_PTR_SHIFT           8
#define   DVL_INFO_FW_UPDT_REQ_QUE_WR_PTR_MASK   0x000000ff
#define   DVL_INFO_FW_UPDT_REQ_QUE_WR_PTR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 dvl_info_fw_updt_req_que_wr_ptr:8;
        u32 dvl_info_fw_updt_req_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_dvl_info_fw_updt_req_que_ptrs_t;

#define BTN_DVL_INFO_FW_UPDT_REQ_QUE_RDPTR_BASE_ADDR 0x00000388
#define   DVL_INFO_FW_UPDT_REQ_QUE_RDPTR_UPDT_EN_MASK 0x80000000
#define   DVL_INFO_FW_UPDT_REQ_QUE_RDPTR_UPDT_EN_SHIFT         31
#define   DVL_INFO_FW_UPDT_REQ_QUE_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   DVL_INFO_FW_UPDT_REQ_QUE_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 dvl_info_fw_updt_req_que_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 dvl_info_fw_updt_req_que_rdptr_updt_en:1;
    } b;
} btn_dvl_info_fw_updt_req_que_rdptr_base_addr_t;

#define BTN_DVL_INFO_FW_UPDT_RSLT_QUE_BASE_ADDR  0x0000038c
#define   DVL_INFO_FW_UPDT_RSLT_QUE_ENTRY_MAX_SZ_MASK 0xff000000
#define   DVL_INFO_FW_UPDT_RSLT_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   DVL_INFO_FW_UPDT_RSLT_QUE_BASE_ADDR_MASK 0x007fffff
#define   DVL_INFO_FW_UPDT_RSLT_QUE_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 dvl_info_fw_updt_rslt_que_base_addr:23;
        u32 rsvd_23:1;
        u32 dvl_info_fw_updt_rslt_que_entry_max_sz:8;
    } b;
} btn_dvl_info_fw_updt_rslt_que_base_addr_t;

#define BTN_DVL_INFO_FW_UPDT_RSLT_QUE_PTRS       0x00000390
#define   DVL_INFO_FW_UPDT_RSLT_QUE_RD_PTR_MASK  0x0000ff00
#define   DVL_INFO_FW_UPDT_RSLT_QUE_RD_PTR_SHIFT          8
#define   DVL_INFO_FW_UPDT_RSLT_QUE_WR_PTR_MASK  0x000000ff
#define   DVL_INFO_FW_UPDT_RSLT_QUE_WR_PTR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 dvl_info_fw_updt_rslt_que_wr_ptr:8;
        u32 dvl_info_fw_updt_rslt_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_dvl_info_fw_updt_rslt_que_ptrs_t;

#define BTN_DVL_INFO_FW_UPDT_RSLT_QUE_WRPTR_BASE_ADDR 0x00000394
#define   DVL_INFO_FW_UPDT_RSLT_QUE_WRPTR_UPDT_EN_MASK 0x80000000
#define   DVL_INFO_FW_UPDT_RSLT_QUE_WRPTR_UPDT_EN_SHIFT         31
#define   DVL_INFO_FW_UPDT_RSLT_QUE_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   DVL_INFO_FW_UPDT_RSLT_QUE_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 dvl_info_fw_updt_rslt_que_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 dvl_info_fw_updt_rslt_que_wrptr_updt_en:1;
    } b;
} btn_dvl_info_fw_updt_rslt_que_wrptr_base_addr_t;

#define BTN_VLDC_BACKUP_RESTORE_LOC_ADDR         0x00000398
#define   FTL_VLDC_BACKUP_RESTORE_ADDR_MASK      0x007fffff
#define   FTL_VLDC_BACKUP_RESTORE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 ftl_vldc_backup_restore_addr:23;
        u32 rsvd_23:9;
    } b;
} btn_vldc_backup_restore_loc_addr_t;

#define BTN_VLDC_BACKUP_RESTORE_SIZE             0x0000039c
#define   FTL_VLDC_BACKUP_RESTORE_SIZE_MASK      0x00007fff
#define   FTL_VLDC_BACKUP_RESTORE_SIZE_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 ftl_vldc_backup_restore_size:15;
        u32 rsvd_15:17;
    } b;
} btn_vldc_backup_restore_size_t;

#define BTN_FTL_CPDA_CONV_REQ_QUE_BASE_ADDR      0x000003e8
#define   FTL_CPDA_CONV_REQ_QUE_ENTRY_MAX_SZ_MASK 0xff000000
#define   FTL_CPDA_CONV_REQ_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   FTL_CPDA_CONV_REQ_QUE_BASE_ADDR_MASK   0x007fffff
#define   FTL_CPDA_CONV_REQ_QUE_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 ftl_cpda_conv_req_que_base_addr:23;
        u32 rsvd_23:1;
        u32 ftl_cpda_conv_req_que_entry_max_sz:8;
    } b;
} btn_ftl_cpda_conv_req_que_base_addr_t;

#define BTN_FTL_CPDA_CONV_REQ_QUE_PTRS           0x000003ec
#define   FTL_CPDA_CONV_REQ_QUE_RD_PTR_MASK      0x0000ff00
#define   FTL_CPDA_CONV_REQ_QUE_RD_PTR_SHIFT              8
#define   FTL_CPDA_CONV_REQ_QUE_WR_PTR_MASK      0x000000ff
#define   FTL_CPDA_CONV_REQ_QUE_WR_PTR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 ftl_cpda_conv_req_que_wr_ptr:8;
        u32 ftl_cpda_conv_req_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_ftl_cpda_conv_req_que_ptrs_t;

#define BTN_FTL_CPDA_CONV_REQ_QUE_RDPTR_BASE_ADDR 0x000003f0
#define   FTL_CPDA_CONV_REQ_QUE_RDPTR_UPDT_EN_MASK 0x80000000
#define   FTL_CPDA_CONV_REQ_QUE_RDPTR_UPDT_EN_SHIFT         31
#define   FTL_CPDA_CONV_REQ_QUE_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   FTL_CPDA_CONV_REQ_QUE_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_cpda_conv_req_que_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 ftl_cpda_conv_req_que_rdptr_updt_en:1;
    } b;
} btn_ftl_cpda_conv_req_que_rdptr_base_addr_t;

#define BTN_FTL_CPDA_CONV_RSLT_QUE_BASE_ADDR     0x000003f4
#define   FTL_CPDA_CONV_RSLT_QUE_ENTRY_MAX_SZ_MASK 0xff000000
#define   FTL_CPDA_CONV_RSLT_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   FTL_CPDA_CONV_RSLT_QUE_BASE_ADDR_MASK  0x007fffff
#define   FTL_CPDA_CONV_RSLT_QUE_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_cpda_conv_rslt_que_base_addr:23;
        u32 rsvd_23:1;
        u32 ftl_cpda_conv_rslt_que_entry_max_sz:8;
    } b;
} btn_ftl_cpda_conv_rslt_que_base_addr_t;

#define BTN_FTL_CPDA_CONV_RSLT_QUE_PTRS          0x000003f8
#define   FTL_CPDA_CONV_RSLT_QUE_RD_PTR_MASK     0x0000ff00
#define   FTL_CPDA_CONV_RSLT_QUE_RD_PTR_SHIFT             8
#define   FTL_CPDA_CONV_RSLT_QUE_WR_PTR_MASK     0x000000ff
#define   FTL_CPDA_CONV_RSLT_QUE_WR_PTR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ftl_cpda_conv_rslt_que_wr_ptr:8;
        u32 ftl_cpda_conv_rslt_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_ftl_cpda_conv_rslt_que_ptrs_t;

#define BTN_FTL_CPDA_CONV_RSLT_QUE_WRPTR_BASE_ADDR 0x000003fc
#define   FTL_CPDA_CONV_RSLT_QUE_WRPTR_UPDT_EN_MASK 0x80000000
#define   FTL_CPDA_CONV_RSLT_QUE_WRPTR_UPDT_EN_SHIFT         31
#define   FTL_CPDA_CONV_RSLT_QUE_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   FTL_CPDA_CONV_RSLT_QUE_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ftl_cpda_conv_rslt_que_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 ftl_cpda_conv_rslt_que_wrptr_updt_en:1;
    } b;
} btn_ftl_cpda_conv_rslt_que_wrptr_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE0_BASE_ADDR           0x00000400
#define   PDA_GEN_REQ_QUE0_ENTRY_MAX_SZ_MASK     0xff000000
#define   PDA_GEN_REQ_QUE0_ENTRY_MAX_SZ_SHIFT            24
#define   PDA_GEN_REQ_QUE0_BASE_ADDR_MASK        0x007fffff
#define   PDA_GEN_REQ_QUE0_BASE_ADDR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_req_que0_entry_max_sz:8;
    } b;
} btn_pda_gen_req_que0_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE0_PTRS                0x00000404
#define   PDA_GEN_REQ_QUE0_RD_PTR_MASK           0x0000ff00
#define   PDA_GEN_REQ_QUE0_RD_PTR_SHIFT                   8
#define   PDA_GEN_REQ_QUE0_WR_PTR_MASK           0x000000ff
#define   PDA_GEN_REQ_QUE0_WR_PTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que0_wr_ptr:8;
        u32 pda_gen_req_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_req_que0_ptrs_t;

#define BTN_PDA_GEN_REQ_QUE0_RDPTR_BASE_ADDR     0x00000408
#define   PDA_GEN_REQ_QUE0_RDPTR_UPDT_EN_MASK    0x80000000
#define   PDA_GEN_REQ_QUE0_RDPTR_UPDT_EN_SHIFT           31
#define   PDA_GEN_REQ_QUE0_RDPTR_BASE_ADDR_MASK  0x007fffff
#define   PDA_GEN_REQ_QUE0_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que0_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_req_que0_rdptr_updt_en:1;
    } b;
} btn_pda_gen_req_que0_rdptr_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE1_BASE_ADDR           0x0000040c
#define   PDA_GEN_REQ_QUE1_ENTRY_MAX_SZ_MASK     0xff000000
#define   PDA_GEN_REQ_QUE1_ENTRY_MAX_SZ_SHIFT            24
#define   PDA_GEN_REQ_QUE1_BASE_ADDR_MASK        0x007fffff
#define   PDA_GEN_REQ_QUE1_BASE_ADDR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_req_que1_entry_max_sz:8;
    } b;
} btn_pda_gen_req_que1_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE1_PTRS                0x00000410
#define   PDA_GEN_REQ_QUE1_RD_PTR_MASK           0x0000ff00
#define   PDA_GEN_REQ_QUE1_RD_PTR_SHIFT                   8
#define   PDA_GEN_REQ_QUE1_WR_PTR_MASK           0x000000ff
#define   PDA_GEN_REQ_QUE1_WR_PTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que1_wr_ptr:8;
        u32 pda_gen_req_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_req_que1_ptrs_t;

#define BTN_PDA_GEN_REQ_QUE1_RDPTR_BASE_ADDR     0x00000414
#define   PDA_GEN_REQ_QUE1_RDPTR_UPDT_EN_MASK    0x80000000
#define   PDA_GEN_REQ_QUE1_RDPTR_UPDT_EN_SHIFT           31
#define   PDA_GEN_REQ_QUE1_RDPTR_BASE_ADDR_MASK  0x007fffff
#define   PDA_GEN_REQ_QUE1_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que1_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_req_que1_rdptr_updt_en:1;
    } b;
} btn_pda_gen_req_que1_rdptr_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE2_BASE_ADDR           0x00000418
#define   PDA_GEN_REQ_QUE2_ENTRY_MAX_SZ_MASK     0xff000000
#define   PDA_GEN_REQ_QUE2_ENTRY_MAX_SZ_SHIFT            24
#define   PDA_GEN_REQ_QUE2_BASE_ADDR_MASK        0x007fffff
#define   PDA_GEN_REQ_QUE2_BASE_ADDR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que2_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_req_que2_entry_max_sz:8;
    } b;
} btn_pda_gen_req_que2_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE2_PTRS                0x0000041c
#define   PDA_GEN_REQ_QUE2_RD_PTR_MASK           0x0000ff00
#define   PDA_GEN_REQ_QUE2_RD_PTR_SHIFT                   8
#define   PDA_GEN_REQ_QUE2_WR_PTR_MASK           0x000000ff
#define   PDA_GEN_REQ_QUE2_WR_PTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que2_wr_ptr:8;
        u32 pda_gen_req_que2_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_req_que2_ptrs_t;

#define BTN_PDA_GEN_REQ_QUE2_RDPTR_BASE_ADDR     0x00000420
#define   PDA_GEN_REQ_QUE2_RDPTR_UPDT_EN_MASK    0x80000000
#define   PDA_GEN_REQ_QUE2_RDPTR_UPDT_EN_SHIFT           31
#define   PDA_GEN_REQ_QUE2_RDPTR_BASE_ADDR_MASK  0x007fffff
#define   PDA_GEN_REQ_QUE2_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que2_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_req_que2_rdptr_updt_en:1;
    } b;
} btn_pda_gen_req_que2_rdptr_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE3_BASE_ADDR           0x00000424
#define   PDA_GEN_REQ_QUE3_ENTRY_MAX_SZ_MASK     0xff000000
#define   PDA_GEN_REQ_QUE3_ENTRY_MAX_SZ_SHIFT            24
#define   PDA_GEN_REQ_QUE3_BASE_ADDR_MASK        0x007fffff
#define   PDA_GEN_REQ_QUE3_BASE_ADDR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que3_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_req_que3_entry_max_sz:8;
    } b;
} btn_pda_gen_req_que3_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE3_PTRS                0x00000428
#define   PDA_GEN_REQ_QUE3_RD_PTR_MASK           0x0000ff00
#define   PDA_GEN_REQ_QUE3_RD_PTR_SHIFT                   8
#define   PDA_GEN_REQ_QUE3_WR_PTR_MASK           0x000000ff
#define   PDA_GEN_REQ_QUE3_WR_PTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que3_wr_ptr:8;
        u32 pda_gen_req_que3_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_req_que3_ptrs_t;

#define BTN_PDA_GEN_REQ_QUE3_RDPTR_BASE_ADDR     0x0000042c
#define   PDA_GEN_REQ_QUE3_RDPTR_UPDT_EN_MASK    0x80000000
#define   PDA_GEN_REQ_QUE3_RDPTR_UPDT_EN_SHIFT           31
#define   PDA_GEN_REQ_QUE3_RDPTR_BASE_ADDR_MASK  0x007fffff
#define   PDA_GEN_REQ_QUE3_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que3_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_req_que3_rdptr_updt_en:1;
    } b;
} btn_pda_gen_req_que3_rdptr_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE4_BASE_ADDR           0x00000430
#define   PDA_GEN_REQ_QUE4_ENTRY_MAX_SZ_MASK     0xff000000
#define   PDA_GEN_REQ_QUE4_ENTRY_MAX_SZ_SHIFT            24
#define   PDA_GEN_REQ_QUE4_BASE_ADDR_MASK        0x007fffff
#define   PDA_GEN_REQ_QUE4_BASE_ADDR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que4_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_req_que4_entry_max_sz:8;
    } b;
} btn_pda_gen_req_que4_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE4_PTRS                0x00000434
#define   PDA_GEN_REQ_QUE4_RD_PTR_MASK           0x0000ff00
#define   PDA_GEN_REQ_QUE4_RD_PTR_SHIFT                   8
#define   PDA_GEN_REQ_QUE4_WR_PTR_MASK           0x000000ff
#define   PDA_GEN_REQ_QUE4_WR_PTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que4_wr_ptr:8;
        u32 pda_gen_req_que4_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_req_que4_ptrs_t;

#define BTN_PDA_GEN_REQ_QUE4_RDPTR_BASE_ADDR     0x00000438
#define   PDA_GEN_REQ_QUE4_RDPTR_UPDT_EN_MASK    0x80000000
#define   PDA_GEN_REQ_QUE4_RDPTR_UPDT_EN_SHIFT           31
#define   PDA_GEN_REQ_QUE4_RDPTR_BASE_ADDR_MASK  0x007fffff
#define   PDA_GEN_REQ_QUE4_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que4_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_req_que4_rdptr_updt_en:1;
    } b;
} btn_pda_gen_req_que4_rdptr_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE5_BASE_ADDR           0x0000043c
#define   PDA_GEN_REQ_QUE5_ENTRY_MAX_SZ_MASK     0xff000000
#define   PDA_GEN_REQ_QUE5_ENTRY_MAX_SZ_SHIFT            24
#define   PDA_GEN_REQ_QUE5_BASE_ADDR_MASK        0x007fffff
#define   PDA_GEN_REQ_QUE5_BASE_ADDR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que5_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_req_que5_entry_max_sz:8;
    } b;
} btn_pda_gen_req_que5_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE5_PTRS                0x00000440
#define   PDA_GEN_REQ_QUE5_RD_PTR_MASK           0x0000ff00
#define   PDA_GEN_REQ_QUE5_RD_PTR_SHIFT                   8
#define   PDA_GEN_REQ_QUE5_WR_PTR_MASK           0x000000ff
#define   PDA_GEN_REQ_QUE5_WR_PTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que5_wr_ptr:8;
        u32 pda_gen_req_que5_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_req_que5_ptrs_t;

#define BTN_PDA_GEN_REQ_QUE5_RDPTR_BASE_ADDR     0x00000444
#define   PDA_GEN_REQ_QUE5_RDPTR_UPDT_EN_MASK    0x80000000
#define   PDA_GEN_REQ_QUE5_RDPTR_UPDT_EN_SHIFT           31
#define   PDA_GEN_REQ_QUE5_RDPTR_BASE_ADDR_MASK  0x007fffff
#define   PDA_GEN_REQ_QUE5_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que5_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_req_que5_rdptr_updt_en:1;
    } b;
} btn_pda_gen_req_que5_rdptr_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE6_BASE_ADDR           0x00000448
#define   PDA_GEN_REQ_QUE6_ENTRY_MAX_SZ_MASK     0xff000000
#define   PDA_GEN_REQ_QUE6_ENTRY_MAX_SZ_SHIFT            24
#define   PDA_GEN_REQ_QUE6_BASE_ADDR_MASK        0x007fffff
#define   PDA_GEN_REQ_QUE6_BASE_ADDR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que6_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_req_que6_entry_max_sz:8;
    } b;
} btn_pda_gen_req_que6_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE6_PTRS                0x0000044c
#define   PDA_GEN_REQ_QUE6_RD_PTR_MASK           0x0000ff00
#define   PDA_GEN_REQ_QUE6_RD_PTR_SHIFT                   8
#define   PDA_GEN_REQ_QUE6_WR_PTR_MASK           0x000000ff
#define   PDA_GEN_REQ_QUE6_WR_PTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que6_wr_ptr:8;
        u32 pda_gen_req_que6_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_req_que6_ptrs_t;

#define BTN_PDA_GEN_REQ_QUE6_RDPTR_BASE_ADDR     0x00000450
#define   PDA_GEN_REQ_QUE6_RDPTR_UPDT_EN_MASK    0x80000000
#define   PDA_GEN_REQ_QUE6_RDPTR_UPDT_EN_SHIFT           31
#define   PDA_GEN_REQ_QUE3_RDPTR_BASE_ADDR_450_MASK 0x007fffff
#define   PDA_GEN_REQ_QUE3_RDPTR_BASE_ADDR_450_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que3_rdptr_base_addr_450:23;
        u32 rsvd_23:8;
        u32 pda_gen_req_que6_rdptr_updt_en:1;
    } b;
} btn_pda_gen_req_que6_rdptr_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE7_BASE_ADDR           0x00000454
#define   PDA_GEN_REQ_QUE7_ENTRY_MAX_SZ_MASK     0xff000000
#define   PDA_GEN_REQ_QUE7_ENTRY_MAX_SZ_SHIFT            24
#define   PDA_GEN_REQ_QUE7_BASE_ADDR_MASK        0x007fffff
#define   PDA_GEN_REQ_QUE7_BASE_ADDR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que7_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_req_que7_entry_max_sz:8;
    } b;
} btn_pda_gen_req_que7_base_addr_t;

#define BTN_PDA_GEN_REQ_QUE7_PTRS                0x00000458
#define   PDA_GEN_REQ_QUE7_RD_PTR_MASK           0x0000ff00
#define   PDA_GEN_REQ_QUE7_RD_PTR_SHIFT                   8
#define   PDA_GEN_REQ_QUE7_WR_PTR_MASK           0x000000ff
#define   PDA_GEN_REQ_QUE7_WR_PTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que7_wr_ptr:8;
        u32 pda_gen_req_que7_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_req_que7_ptrs_t;

#define BTN_PDA_GEN_REQ_QUE7_RDPTR_BASE_ADDR     0x0000045c
#define   PDA_GEN_REQ_QUE7_RDPTR_UPDT_EN_MASK    0x80000000
#define   PDA_GEN_REQ_QUE7_RDPTR_UPDT_EN_SHIFT           31
#define   PDA_GEN_REQ_QUE7_RDPTR_BASE_ADDR_MASK  0x007fffff
#define   PDA_GEN_REQ_QUE7_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_req_que7_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_req_que7_rdptr_updt_en:1;
    } b;
} btn_pda_gen_req_que7_rdptr_base_addr_t;

#define BTN_PDA_GEN_RSLT0_LOC_PTR_QUE_BASE_ADDR  0x00000460
#define   PDA_GEN_RSLT0_LOC_PTR_QUE_ENTRY_MAX_SZ_MASK 0xff000000
#define   PDA_GEN_RSLT0_LOC_PTR_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   PDA_GEN_RSLT0_LOC_PTR_QUE_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT0_LOC_PTR_QUE_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_loc_ptr_que_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt0_loc_ptr_que_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt0_loc_ptr_que_base_addr_t;

#define BTN_PDA_GEN_RSLT0_LOC_PTR_QUE_PTRS       0x00000464
#define   PDA_GEN_RSLT0_LOC_PTR_QUE_RD_PTR_MASK  0x0000ff00
#define   PDA_GEN_RSLT0_LOC_PTR_QUE_RD_PTR_SHIFT          8
#define   PDA_GEN_RSLT0_LOC_PTR_QUE_WR_PTR_MASK  0x000000ff
#define   PDA_GEN_RSLT0_LOC_PTR_QUE_WR_PTR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_loc_ptr_que_wr_ptr:8;
        u32 pda_gen_rslt0_loc_ptr_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt0_loc_ptr_que_ptrs_t;

#define BTN_PDA_GEN_RSLT0_LOC_PTR_QUE_RDPTR_BASE_ADDR 0x00000468
#define   PDA_GEN_RSLT0_LOC_PTR_QUE_RDPTR_UPDT_EN_MASK 0x80000000
#define   PDA_GEN_RSLT0_LOC_PTR_QUE_RDPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT0_LOC_PTR_QUE_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT0_LOC_PTR_QUE_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_loc_ptr_que_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt0_loc_ptr_que_rdptr_updt_en:1;
    } b;
} btn_pda_gen_rslt0_loc_ptr_que_rdptr_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE0_BASE_ADDR         0x0000046c
#define   PDA_GEN_RSLT0_QUE0_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT0_QUE0_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT0_QUE0_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT0_QUE0_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt0_que0_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt0_que0_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE0_PTRS              0x00000470
#define   PDA_GEN_RSLT0_QUE0_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT0_QUE0_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT0_QUE0_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT0_QUE0_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que0_wr_ptr:8;
        u32 pda_gen_rslt0_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt0_que0_ptrs_t;

#define BTN_PDA_GEN_RSLT0_QUE0_WRPTR_BASE_ADDR   0x00000474
#define   PDA_GEN_RSLT0_QUE0_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT0_QUE0_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT0_QUE0_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT0_QUE0_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que0_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt0_que0_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt0_que0_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE1_BASE_ADDR         0x00000478
#define   PDA_GEN_RSLT0_QUE1_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT0_QUE1_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT0_QUE1_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT0_QUE1_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt0_que1_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt0_que1_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE1_PTRS              0x0000047c
#define   PDA_GEN_RSLT0_QUE1_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT0_QUE1_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT0_QUE1_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT0_QUE1_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que1_wr_ptr:8;
        u32 pda_gen_rslt0_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt0_que1_ptrs_t;

#define BTN_PDA_GEN_RSLT0_QUE1_WRPTR_BASE_ADDR   0x00000480
#define   PDA_GEN_RSLT0_QUE1_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT0_QUE1_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT0_QUE1_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT0_QUE1_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que1_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt0_que1_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt0_que1_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE2_BASE_ADDR         0x00000484
#define   PDA_GEN_RSLT0_QUE2_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT0_QUE2_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT0_QUE2_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT0_QUE2_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que2_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt0_que2_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt0_que2_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE2_PTRS              0x00000488
#define   PDA_GEN_RSLT0_QUE2_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT0_QUE2_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT0_QUE2_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT0_QUE2_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que2_wr_ptr:8;
        u32 pda_gen_rslt0_que2_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt0_que2_ptrs_t;

#define BTN_PDA_GEN_RSLT0_QUE2_WRPTR_BASE_ADDR   0x0000048c
#define   PDA_GEN_RSLT0_QUE2_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT0_QUE2_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT0_QUE2_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT0_QUE2_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que2_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt0_que2_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt0_que2_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE3_BASE_ADDR         0x00000490
#define   PDA_GEN_RSLT0_QUE3_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT0_QUE3_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT0_QUE3_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT0_QUE3_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que3_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt0_que3_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt0_que3_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE3_PTRS              0x00000494
#define   PDA_GEN_RSLT0_QUE3_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT0_QUE3_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT0_QUE3_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT0_QUE3_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que3_wr_ptr:8;
        u32 pda_gen_rslt0_que3_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt0_que3_ptrs_t;

#define BTN_PDA_GEN_RSLT0_QUE3_WRPTR_BASE_ADDR   0x00000498
#define   PDA_GEN_RSLT0_QUE3_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT0_QUE3_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT0_QUE3_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT0_QUE3_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que3_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt0_que3_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt0_que3_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE4_BASE_ADDR         0x0000049c
#define   PDA_GEN_RSLT0_QUE4_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT0_QUE4_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT0_QUE4_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT0_QUE4_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que4_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt0_que4_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt0_que4_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE4_PTRS              0x000004a0
#define   PDA_GEN_RSLT0_QUE4_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT0_QUE4_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT0_QUE4_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT0_QUE4_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que4_wr_ptr:8;
        u32 pda_gen_rslt0_que4_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt0_que4_ptrs_t;

#define BTN_PDA_GEN_RSLT0_QUE4_WRPTR_BASE_ADDR   0x000004a4
#define   PDA_GEN_RSLT0_QUE4_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT0_QUE4_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT0_QUE4_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT0_QUE4_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que4_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt0_que4_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt0_que4_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE5_BASE_ADDR         0x000004a8
#define   PDA_GEN_RSLT0_QUE5_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT0_QUE5_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT0_QUE5_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT0_QUE5_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que5_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt0_que5_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt0_que5_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE5_PTRS              0x000004ac
#define   PDA_GEN_RSLT0_QUE5_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT0_QUE5_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT0_QUE5_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT0_QUE5_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que5_wr_ptr:8;
        u32 pda_gen_rslt0_que5_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt0_que5_ptrs_t;

#define BTN_PDA_GEN_RSLT0_QUE5_WRPTR_BASE_ADDR   0x000004b0
#define   PDA_GEN_RSLT0_QUE5_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT0_QUE5_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT0_QUE5_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT0_QUE5_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que5_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt0_que5_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt0_que5_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE6_BASE_ADDR         0x000004b4
#define   PDA_GEN_RSLT0_QUE6_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT0_QUE6_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT0_QUE6_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT0_QUE6_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que6_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt0_que6_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt0_que6_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE6_PTRS              0x000004b8
#define   PDA_GEN_RSLT0_QUE6_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT0_QUE6_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT0_QUE6_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT0_QUE6_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que6_wr_ptr:8;
        u32 pda_gen_rslt0_que6_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt0_que6_ptrs_t;

#define BTN_PDA_GEN_RSLT0_QUE6_WRPTR_BASE_ADDR   0x000004bc
#define   PDA_GEN_RSLT0_QUE6_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT0_QUE6_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT0_QUE6_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT0_QUE6_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que6_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt0_que6_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt0_que6_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE7_BASE_ADDR         0x000004c0
#define   PDA_GEN_RSLT0_QUE7_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT0_QUE7_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT0_QUE7_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT0_QUE7_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que7_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt0_que7_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt0_que7_base_addr_t;

#define BTN_PDA_GEN_RSLT0_QUE7_PTRS              0x000004c4
#define   PDA_GEN_RSLT0_QUE7_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT0_QUE7_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT0_QUE7_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT0_QUE7_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt0_que7_wr_ptr:8;
        u32 pda_gen_rslt0_que7_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt0_que7_ptrs_t;

#define BTN_PDA_GEN_RSLT0_QUE7_WRPTR_BASE_ADDR   0x000004c8
#define   PDA_GEN_RSLT0_QUE7_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT0_QUE7_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT_QUE7_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT_QUE7_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt_que7_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt0_que7_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt0_que7_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT1_LOC_PTR_QUE_BASE_ADDR  0x000004cc
#define   PDA_GEN_RSLT1_LOC_PTR_QUE_ENTRY_MAX_SZ_MASK 0xff000000
#define   PDA_GEN_RSLT1_LOC_PTR_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   PDA_GEN_RSLT1_LOC_PTR_QUE_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT1_LOC_PTR_QUE_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_loc_ptr_que_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt1_loc_ptr_que_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt1_loc_ptr_que_base_addr_t;

#define BTN_PDA_GEN_RSLT1_LOC_PTR_QUE_PTRS       0x000004d0
#define   PDA_GEN_RSLT1_LOC_PTR_QUE_RD_PTR_MASK  0x0000ff00
#define   PDA_GEN_RSLT1_LOC_PTR_QUE_RD_PTR_SHIFT          8
#define   PDA_GEN_RSLT1_LOC_PTR_QUE_WR_PTR_MASK  0x000000ff
#define   PDA_GEN_RSLT1_LOC_PTR_QUE_WR_PTR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_loc_ptr_que_wr_ptr:8;
        u32 pda_gen_rslt1_loc_ptr_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt1_loc_ptr_que_ptrs_t;

#define BTN_PDA_GEN_RSLT1_LOC_PTR_QUE_RDPTR_BASE_ADDR 0x000004d4
#define   PDA_GEN_RSLT1_LOC_PTR_QUE_RDPTR_UPDT_EN_MASK 0x80000000
#define   PDA_GEN_RSLT1_LOC_PTR_QUE_RDPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT1_LOC_PTR_QUE_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT1_LOC_PTR_QUE_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_loc_ptr_que_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt1_loc_ptr_que_rdptr_updt_en:1;
    } b;
} btn_pda_gen_rslt1_loc_ptr_que_rdptr_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE0_BASE_ADDR         0x000004d8
#define   PDA_GEN_RSLT1_QUE0_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT1_QUE0_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT1_QUE0_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT1_QUE0_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt1_que0_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt1_que0_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE0_PTRS              0x000004dc
#define   PDA_GEN_RSLT1_QUE0_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT1_QUE0_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT1_QUE0_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT1_QUE0_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que0_wr_ptr:8;
        u32 pda_gen_rslt1_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt1_que0_ptrs_t;

#define BTN_PDA_GEN_RSLT1_QUE0_WRPTR_BASE_ADDR   0x000004e0
#define   PDA_GEN_RSLT1_QUE0_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT1_QUE0_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT1_QUE0_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT1_QUE0_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que0_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt1_que0_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt1_que0_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE1_BASE_ADDR         0x000004e4
#define   PDA_GEN_RSLT1_QUE1_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT1_QUE1_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT1_QUE1_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT1_QUE1_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt1_que1_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt1_que1_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE1_PTRS              0x000004e8
#define   PDA_GEN_RSLT1_QUE1_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT1_QUE1_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT1_QUE1_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT1_QUE1_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que1_wr_ptr:8;
        u32 pda_gen_rslt1_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt1_que1_ptrs_t;

#define BTN_PDA_GEN_RSLT1_QUE1_WRPTR_BASE_ADDR   0x000004ec
#define   PDA_GEN_RSLT1_QUE1_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT1_QUE1_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT1_QUE1_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT1_QUE1_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que1_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt1_que1_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt1_que1_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE2_BASE_ADDR         0x000004f0
#define   PDA_GEN_RSLT1_QUE2_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT1_QUE2_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT1_QUE2_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT1_QUE2_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que2_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt1_que2_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt1_que2_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE2_PTRS              0x000004f4
#define   PDA_GEN_RSLT1_QUE2_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT1_QUE2_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT1_QUE2_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT1_QUE2_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que2_wr_ptr:8;
        u32 pda_gen_rslt1_que2_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt1_que2_ptrs_t;

#define BTN_PDA_GEN_RSLT1_QUE2_WRPTR_BASE_ADDR   0x000004f8
#define   PDA_GEN_RSLT1_QUE2_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT1_QUE2_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT1_QUE2_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT1_QUE2_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que2_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt1_que2_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt1_que2_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE3_BASE_ADDR         0x000004fc
#define   PDA_GEN_RSLT1_QUE3_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT1_QUE3_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT1_QUE3_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT1_QUE3_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que3_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt1_que3_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt1_que3_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE3_PTRS              0x00000500
#define   PDA_GEN_RSLT1_QUE3_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT1_QUE3_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT1_QUE3_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT1_QUE3_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que3_wr_ptr:8;
        u32 pda_gen_rslt1_que3_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt1_que3_ptrs_t;

#define BTN_PDA_GEN_RSLT1_QUE3_WRPTR_BASE_ADDR   0x00000504
#define   PDA_GEN_RSLT1_QUE3_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT1_QUE3_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT1_QUE3_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT1_QUE3_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que3_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt1_que3_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt1_que3_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE4_BASE_ADDR         0x00000508
#define   PDA_GEN_RSLT1_QUE4_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT1_QUE4_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT1_QUE4_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT1_QUE4_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que4_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt1_que4_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt1_que4_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE4_PTRS              0x0000050c
#define   PDA_GEN_RSLT1_QUE4_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT1_QUE4_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT1_QUE4_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT1_QUE4_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que4_wr_ptr:8;
        u32 pda_gen_rslt1_que4_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt1_que4_ptrs_t;

#define BTN_PDA_GEN_RSLT1_QUE4_WRPTR_BASE_ADDR   0x00000510
#define   PDA_GEN_RSLT1_QUE4_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT1_QUE4_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT1_QUE4_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT1_QUE4_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que4_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt1_que4_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt1_que4_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE5_BASE_ADDR         0x00000514
#define   PDA_GEN_RSLT1_QUE5_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT1_QUE5_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT1_QUE5_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT1_QUE5_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que5_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt1_que5_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt1_que5_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE5_PTRS              0x00000518
#define   PDA_GEN_RSLT1_QUE5_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT1_QUE5_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT1_QUE5_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT1_QUE5_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que5_wr_ptr:8;
        u32 pda_gen_rslt1_que5_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt1_que5_ptrs_t;

#define BTN_PDA_GEN_RSLT1_QUE5_WRPTR_BASE_ADDR   0x0000051c
#define   PDA_GEN_RSLT1_QUE5_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT1_QUE5_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT1_QUE5_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT1_QUE5_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que5_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt1_que5_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt1_que5_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE6_BASE_ADDR         0x00000520
#define   PDA_GEN_RSLT1_QUE6_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT1_QUE6_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT1_QUE6_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT1_QUE6_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que6_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt1_que6_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt1_que6_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE6_PTRS              0x00000524
#define   PDA_GEN_RSLT1_QUE6_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT1_QUE6_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT1_QUE6_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT1_QUE6_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que6_wr_ptr:8;
        u32 pda_gen_rslt1_que6_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt1_que6_ptrs_t;

#define BTN_PDA_GEN_RSLT1_QUE6_WRPTR_BASE_ADDR   0x00000528
#define   PDA_GEN_RSLT1_QUE6_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT1_QUE6_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT1_QUE6_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   PDA_GEN_RSLT1_QUE6_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que6_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt1_que6_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt1_que6_wrptr_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE7_BASE_ADDR         0x0000052c
#define   PDA_GEN_RSLT1_QUE7_ENTRY_MAX_SZ_MASK   0xff000000
#define   PDA_GEN_RSLT1_QUE7_ENTRY_MAX_SZ_SHIFT          24
#define   PDA_GEN_RSLT1_QUE7_BASE_ADDR_MASK      0x007fffff
#define   PDA_GEN_RSLT1_QUE7_BASE_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que7_base_addr:23;
        u32 rsvd_23:1;
        u32 pda_gen_rslt1_que7_entry_max_sz:8;
    } b;
} btn_pda_gen_rslt1_que7_base_addr_t;

#define BTN_PDA_GEN_RSLT1_QUE7_PTRS              0x00000530
#define   PDA_GEN_RSLT1_QUE7_RD_PTR_MASK         0x0000ff00
#define   PDA_GEN_RSLT1_QUE7_RD_PTR_SHIFT                 8
#define   PDA_GEN_RSLT1_QUE7_WR_PTR_MASK         0x000000ff
#define   PDA_GEN_RSLT1_QUE7_WR_PTR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt1_que7_wr_ptr:8;
        u32 pda_gen_rslt1_que7_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} btn_pda_gen_rslt1_que7_ptrs_t;

#define BTN_PDA_GEN_RSLT1_QUE7_WRPTR_BASE_ADDR   0x00000534
#define   PDA_GEN_RSLT1_QUE7_WRPTR_UPDT_EN_MASK  0x80000000
#define   PDA_GEN_RSLT1_QUE7_WRPTR_UPDT_EN_SHIFT         31
#define   PDA_GEN_RSLT_QUE7_WRPTR_BASE_ADDR_534_MASK 0x007fffff
#define   PDA_GEN_RSLT_QUE7_WRPTR_BASE_ADDR_534_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 pda_gen_rslt_que7_wrptr_base_addr_534:23;
        u32 rsvd_23:8;
        u32 pda_gen_rslt1_que7_wrptr_updt_en:1;
    } b;
} btn_pda_gen_rslt1_que7_wrptr_base_addr_t;

#define BTN_FTL_NCL_DEBUG_REG                    0x00000700
#define   FTL_NCL_DBG_STATUS_MASK                0xffff0000
#define   FTL_NCL_DBG_STATUS_SHIFT                       16
#define   FTL_NCL_DBG_SEL_MASK                   0x0000ffff
#define   FTL_NCL_DBG_SEL_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_dbg_sel:16;
        u32 ftl_ncl_dbg_status:16;
    } b;
} btn_ftl_ncl_debug_reg_t;

#define BTN_FTL_NCL_CPU_ACCS_CTRL                0x00000704
#define   FTL_NCL_CPU_ACCS_SEL_MASK              0x00ff0000
#define   FTL_NCL_CPU_ACCS_SEL_SHIFT                     16
#define   FTL_NCL_CPU_ACCS_RD_WR_PTR_MASK        0x0000ffff
#define   FTL_NCL_CPU_ACCS_RD_WR_PTR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_cpu_accs_rd_wr_ptr:16;
        u32 ftl_ncl_cpu_accs_sel:8;
        u32 rsvd_24:8;
    } b;
} btn_ftl_ncl_cpu_accs_ctrl_t;

#define BTN_FTL_NCL_CPU_ACCS_REG0                0x00000708
#define   FTL_NCL_CPU_ACCS_REG0_MASK             0xffffffff
#define   FTL_NCL_CPU_ACCS_REG0_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_cpu_accs_reg0:32;
    } b;
} btn_ftl_ncl_cpu_accs_reg0_t;

#define BTN_FTL_NCL_CPU_ACCS_REG1                0x0000070c
#define   FTL_NCL_CPU_ACCS_REG1_MASK             0xffffffff
#define   FTL_NCL_CPU_ACCS_REG1_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_cpu_accs_reg1:32;
    } b;
} btn_ftl_ncl_cpu_accs_reg1_t;

#define BTN_FTL_NCL_CPU_ACCS_REG2                0x00000710
#define   FTL_NCL_CPU_ACCS_REG2_MASK             0xffffffff
#define   FTL_NCL_CPU_ACCS_REG2_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_cpu_accs_reg2:32;
    } b;
} btn_ftl_ncl_cpu_accs_reg2_t;

#define BTN_FTL_NCL_CPU_ACCS_REG3                0x00000714
#define   FTL_NCL_CPU_ACCS_REG3_MASK             0xffffffff
#define   FTL_NCL_CPU_ACCS_REG3_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_cpu_accs_reg3:32;
    } b;
} btn_ftl_ncl_cpu_accs_reg3_t;

#define BTN_FTL_NCL_CPU_ACCS_REG4                0x00000718
#define   FTL_NCL_CPU_ACCS_REG4_MASK             0xffffffff
#define   FTL_NCL_CPU_ACCS_REG4_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_cpu_accs_reg4:32;
    } b;
} btn_ftl_ncl_cpu_accs_reg4_t;

#define BTN_FTL_NCL_CPU_ACCS_REG5                0x0000071c
#define   FTL_NCL_CPU_ACCS_REG5_MASK             0xffffffff
#define   FTL_NCL_CPU_ACCS_REG5_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_cpu_accs_reg5:32;
    } b;
} btn_ftl_ncl_cpu_accs_reg5_t;

#define BTN_FTL_NCL_CPU_ACCS_REG6                0x00000720
#define   FTL_NCL_CPU_ACCS_REG6_MASK             0xffffffff
#define   FTL_NCL_CPU_ACCS_REG6_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_cpu_accs_reg6:32;
    } b;
} btn_ftl_ncl_cpu_accs_reg6_t;

#define BTN_FTL_NCL_CPU_ACCS_REG7                0x00000724
#define   FTL_NCL_CPU_ACCS_REG7_MASK             0xffffffff
#define   FTL_NCL_CPU_ACCS_REG7_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ftl_ncl_cpu_accs_reg7:32;
    } b;
} btn_ftl_ncl_cpu_accs_reg7_t;

#define BTN_FTL_LTMODE_CONFIG                    0x00000730
#define   FTL_LTMODE_SPB_BW_MASK                 0x000007c0
#define   FTL_LTMODE_SPB_BW_SHIFT                         6
#define   FTL_LTMODE_SPB_OFFSET_MASK             0x0000003e
#define   FTL_LTMODE_SPB_OFFSET_SHIFT                     1
#define   FTL_LTMODE_EN_MASK                     0x00000001
#define   FTL_LTMODE_EN_SHIFT                             0
typedef union {
    u32 all;
    struct {
        u32 ftl_ltmode_en:1;
        u32 ftl_ltmode_spb_offset:5;
        u32 ftl_ltmode_spb_bw:5;
        u32 rsvd_11:21;
    } b;
} btn_ftl_ltmode_config_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ btn_ftl_ncl_int_grp0_src_t btn_ftl_ncl_int_grp0_src;
    /* 0x0004 */ btn_ftl_ncl_int_grp0_mask0_t btn_ftl_ncl_int_grp0_mask0;
    /* 0x0008 */ btn_ftl_ncl_int_grp0_sts0_t btn_ftl_ncl_int_grp0_sts0;
    /* 0x000c */ btn_ftl_ncl_int_grp0_mask1_t btn_ftl_ncl_int_grp0_mask1;
    /* 0x0010 */ btn_ftl_ncl_int_grp0_sts1_t btn_ftl_ncl_int_grp0_sts1;
    /* 0x0014 */ btn_ftl_ncl_int_grp0_mask2_t btn_ftl_ncl_int_grp0_mask2;
    /* 0x0018 */ btn_ftl_ncl_int_grp0_sts2_t btn_ftl_ncl_int_grp0_sts2;
    /* 0x001c */ btn_ftl_ncl_int_grp0_mask3_t btn_ftl_ncl_int_grp0_mask3;
    /* 0x0020 */ btn_ftl_ncl_int_grp0_sts3_t btn_ftl_ncl_int_grp0_sts3;
    /* 0x0024 */ btn_ftl_ncl_int_grp1_src_t btn_ftl_ncl_int_grp1_src;
    /* 0x0028 */ btn_ftl_ncl_int_grp1_mask0_t btn_ftl_ncl_int_grp1_mask0;
    /* 0x002c */ btn_ftl_ncl_int_grp1_sts0_t btn_ftl_ncl_int_grp1_sts0;
    /* 0x0030 */ btn_ftl_ncl_int_grp1_mask1_t btn_ftl_ncl_int_grp1_mask1;
    /* 0x0034 */ btn_ftl_ncl_int_grp1_sts1_t btn_ftl_ncl_int_grp1_sts1;
    /* 0x0038 */ btn_ftl_ncl_int_grp1_mask2_t btn_ftl_ncl_int_grp1_mask2;
    /* 0x003c */ btn_ftl_ncl_int_grp1_sts2_t btn_ftl_ncl_int_grp1_sts2;
    /* 0x0040 */ btn_ftl_ncl_int_grp1_mask3_t btn_ftl_ncl_int_grp1_mask3;
    /* 0x0044 */ btn_ftl_ncl_int_grp1_sts3_t btn_ftl_ncl_int_grp1_sts3;
    /* 0x0048 */ btn_ftl_ncl_ctrl0_t btn_ftl_ncl_ctrl0;
    /* 0x004c */ btn_ftl_ncl_ctrl1_t btn_ftl_ncl_ctrl1;
    /* 0x0050 */ btn_ftl_ncl_ctrl2_t btn_ftl_ncl_ctrl2;
    /* 0x0054 */ btn_ftl_ncl_ctrl3_t btn_ftl_ncl_ctrl3;
    /* 0x0058 */ u32 rsvd_58 [2];
    /* 0x0060 */ btn_ftl_ncl_error_status0_t btn_ftl_ncl_error_status0;
    /* 0x0064 */ btn_ftl_ncl_error_status1_t btn_ftl_ncl_error_status1;
    /* 0x0068 */ u32 rsvd_68 [2];
    /* 0x0070 */ btn_ftl_region0_data_gtd_base_addr_t btn_ftl_region0_data_gtd_base_addr;
    /* 0x0074 */ btn_ftl_region0_data_tp_base_addr_t btn_ftl_region0_data_tp_base_addr;
    /* 0x0078 */ btn_ftl_region0_data_dvbm_base_addr_t btn_ftl_region0_data_dvbm_base_addr;
    /* 0x007c */ u32 rsvd_7c;
    /* 0x0080 */ btn_ftl_region1_data_gtd_base_addr_t btn_ftl_region1_data_gtd_base_addr;
    /* 0x0084 */ btn_ftl_region1_data_tp_base_addr_t btn_ftl_region1_data_tp_base_addr;
    /* 0x0088 */ btn_ftl_region1_data_dvbm_base_addr_t btn_ftl_region1_data_dvbm_base_addr;
    /* 0x008c */ btn_rsvd_pda_range_t btn_rsvd_pda_range;
    /* 0x0090 */ btn_unmapped_pda0_t btn_unmapped_pda0;
    /* 0x0094 */ btn_pda_conf_reg0_t btn_pda_conf_reg0;
    /* 0x0098 */ btn_pda_conf_reg1_t btn_pda_conf_reg1;
    /* 0x009c */ btn_cpda_conf_reg0_t btn_cpda_conf_reg0;
    /* 0x00a0 */ btn_pda_rslt_grp_sel_conf_reg_t btn_pda_rslt_grp_sel_conf_reg;
    /* 0x00a4 */ btn_spb_die_grp_conf_reg_t btn_spb_die_grp_conf_reg;
    /* 0x00a8 */ btn_lda_mask_t btn_lda_mask;
    /* 0x00ac */ btn_rsvd_lda_value_t btn_rsvd_lda_value;
    /* 0x00b0 */ btn_lda_max_value_t btn_lda_max_value;
    /* 0x00b4 */ btn_pda_mask_t btn_pda_mask;
    /* 0x00b8 */ btn_unmapped_pda1_t btn_unmapped_pda1;
    /* 0x00bc */ btn_unmapped_pda2_t btn_unmapped_pda2;
    /* 0x00c0 */ btn_unmapped_pda3_t btn_unmapped_pda3;
    /* 0x00c4 */ btn_l2p_table_start_lda_t btn_l2p_table_start_lda;
    /* 0x00c8 */ btn_l2p_table_entry_num_t btn_l2p_table_entry_num;
    /* 0x00cc */ u32 rsvd_cc [13];
    /* 0x0100 */ btn_l2p_norm_srch_que0_base_addr_t btn_l2p_norm_srch_que0_base_addr;
    /* 0x0104 */ btn_l2p_norm_srch_que0_ptrs_t btn_l2p_norm_srch_que0_ptrs;
    /* 0x0108 */ btn_l2p_norm_srch_que0_rdptr_base_addr_t btn_l2p_norm_srch_que0_rdptr_base_addr;
    /* 0x010c */ btn_l2p_high_srch_que0_base_addr_t btn_l2p_high_srch_que0_base_addr;
    /* 0x0110 */ btn_l2p_high_srch_que0_ptrs_t btn_l2p_high_srch_que0_ptrs;
    /* 0x0114 */ btn_l2p_high_srch_que0_rdptr_base_addr_t btn_l2p_high_srch_que0_rdptr_base_addr;
    /* 0x0118 */ btn_l2p_urgent_srch_que0_base_addr_t btn_l2p_urgent_srch_que0_base_addr;
    /* 0x011c */ btn_l2p_urgent_srch_que0_ptrs_t btn_l2p_urgent_srch_que0_ptrs;
    /* 0x0120 */ btn_l2p_urgent_srch_que0_rdptr_base_addr_t btn_l2p_urgent_srch_que0_rdptr_base_addr;
    /* 0x0124 */ u32 rsvd_124 [3];
    /* 0x0130 */ btn_l2p_norm_srch_que1_base_addr_t btn_l2p_norm_srch_que1_base_addr;
    /* 0x0134 */ btn_l2p_norm_srch_que1_ptrs_t btn_l2p_norm_srch_que1_ptrs;
    /* 0x0138 */ btn_l2p_norm_srch_que1_rdptr_base_addr_t btn_l2p_norm_srch_que1_rdptr_base_addr;
    /* 0x013c */ btn_l2p_high_srch_que1_base_addr_t btn_l2p_high_srch_que1_base_addr;
    /* 0x0140 */ btn_l2p_high_srch_que1_ptrs_t btn_l2p_high_srch_que1_ptrs;
    /* 0x0144 */ btn_l2p_high_srch_que1_rdptr_base_addr_t btn_l2p_high_srch_que1_rdptr_base_addr;
    /* 0x0148 */ btn_l2p_urgent_srch_que1_base_addr_t btn_l2p_urgent_srch_que1_base_addr;
    /* 0x014c */ btn_l2p_urgent_srch_que1_ptrs_t btn_l2p_urgent_srch_que1_ptrs;
    /* 0x0150 */ btn_l2p_urgent_srch_que1_rdptr_base_addr_t btn_l2p_urgent_srch_que1_rdptr_base_addr;
    /* 0x0154 */ u32 rsvd_154 [3];
    /* 0x0160 */ btn_l2p_updt_req_que0_base_addr_t btn_l2p_updt_req_que0_base_addr;
    /* 0x0164 */ btn_l2p_updt_req_que0_ptrs_t btn_l2p_updt_req_que0_ptrs;
    /* 0x0168 */ btn_l2p_updt_req_que0_rdptr_base_addr_t btn_l2p_updt_req_que0_rdptr_base_addr;
    /* 0x016c */ btn_l2p_updt_req_que1_base_addr_t btn_l2p_updt_req_que1_base_addr;
    /* 0x0170 */ btn_l2p_updt_req_que1_ptrs_t btn_l2p_updt_req_que1_ptrs;
    /* 0x0174 */ btn_l2p_updt_req_que1_rdptr_base_addr_t btn_l2p_updt_req_que1_rdptr_base_addr;
    /* 0x0178 */ u32 rsvd_178 [6];
    /* 0x0190 */ btn_l2p_pda_rslt_loc_ptr_que0_base_addr_t btn_l2p_pda_rslt_loc_ptr_que0_base_addr;
    /* 0x0194 */ btn_l2p_pda_rslt_loc_ptr_que0_ptrs_t btn_l2p_pda_rslt_loc_ptr_que0_ptrs;
    /* 0x0198 */ btn_l2p_pda_rslt_loc_ptr_que0_rdptr_base_addr_t btn_l2p_pda_rslt_loc_ptr_que0_rdptr_base_addr;
    /* 0x019c */ btn_l2p_pda_rslt_norm_que0_base_addr_t btn_l2p_pda_rslt_norm_que0_base_addr;
    /* 0x01a0 */ btn_l2p_pda_rslt_norm_que0_ptrs_t btn_l2p_pda_rslt_norm_que0_ptrs;
    /* 0x01a4 */ btn_l2p_pda_rslt_norm_que0_wrptr_base_addr_t btn_l2p_pda_rslt_norm_que0_wrptr_base_addr;
    /* 0x01a8 */ btn_l2p_pda_rslt_high_que0_base_addr_t btn_l2p_pda_rslt_high_que0_base_addr;
    /* 0x01ac */ btn_l2p_pda_rslt_high_que0_ptrs_t btn_l2p_pda_rslt_high_que0_ptrs;
    /* 0x01b0 */ btn_l2p_pda_rslt_high_que0_wrptr_base_addr_t btn_l2p_pda_rslt_high_que0_wrptr_base_addr;
    /* 0x01b4 */ btn_l2p_pda_rslt_urgent_que0_base_addr_t btn_l2p_pda_rslt_urgent_que0_base_addr;
    /* 0x01b8 */ btn_l2p_pda_rslt_urgent_que0_ptrs_t btn_l2p_pda_rslt_urgent_que0_ptrs;
    /* 0x01bc */ btn_l2p_pda_rslt_urgent_que0_wrptr_base_addr_t btn_l2p_pda_rslt_urgent_que0_wrptr_base_addr;
    /* 0x01c0 */ btn_l2p_pda_rslt_loc_ptr_que1_base_addr_t btn_l2p_pda_rslt_loc_ptr_que1_base_addr;
    /* 0x01c4 */ btn_l2p_pda_rslt_loc_ptr_que1_ptrs_t btn_l2p_pda_rslt_loc_ptr_que1_ptrs;
    /* 0x01c8 */ btn_l2p_pda_rslt_loc_ptr_que1_rdptr_base_addr_t btn_l2p_pda_rslt_loc_ptr_que1_rdptr_base_addr;
    /* 0x01cc */ btn_l2p_pda_rslt_norm_que1_base_addr_t btn_l2p_pda_rslt_norm_que1_base_addr;
    /* 0x01d0 */ btn_l2p_pda_rslt_norm_que1_ptrs_t btn_l2p_pda_rslt_norm_que1_ptrs;
    /* 0x01d4 */ btn_l2p_pda_rslt_norm_que1_wrptr_base_addr_t btn_l2p_pda_rslt_norm_que1_wrptr_base_addr;
    /* 0x01d8 */ btn_l2p_pda_rslt_high_que1_base_addr_t btn_l2p_pda_rslt_high_que1_base_addr;
    /* 0x01dc */ btn_l2p_pda_rslt_high_que1_ptrs_t btn_l2p_pda_rslt_high_que1_ptrs;
    /* 0x01e0 */ btn_l2p_pda_rslt_high_que1_wrptr_base_addr_t btn_l2p_pda_rslt_high_que1_wrptr_base_addr;
    /* 0x01e4 */ btn_l2p_pda_rslt_urgent_que1_base_addr_t btn_l2p_pda_rslt_urgent_que1_base_addr;
    /* 0x01e8 */ btn_l2p_pda_rslt_urgent_que1_ptrs_t btn_l2p_pda_rslt_urgent_que1_ptrs;
    /* 0x01ec */ btn_l2p_pda_rslt_urgent_que1_wrptr_base_addr_t btn_l2p_pda_rslt_urgent_que1_wrptr_base_addr;
    /* 0x01f0 */ u32 rsvd_1f0 [3];
    /* 0x01fc */ btn_l2p_unmap_lda_que_base_addr_t btn_l2p_unmap_lda_que_base_addr;
    /* 0x0200 */ btn_l2p_unmap_lda_que_ptrs_t btn_l2p_unmap_lda_que_ptrs;
    /* 0x0204 */ btn_l2p_unmap_lda_que_wrptr_base_addr_t btn_l2p_unmap_lda_que_wrptr_base_addr;
    /* 0x0208 */ btn_l2p_commit_compl_que0_base_addr_t btn_l2p_commit_compl_que0_base_addr;
    /* 0x020c */ btn_l2p_commit_compl_que0_ptrs_t btn_l2p_commit_compl_que0_ptrs;
    /* 0x0210 */ btn_l2p_commit_compl_que0_wrptr_base_addr_t btn_l2p_commit_compl_que0_wrptr_base_addr;
    /* 0x0214 */ btn_l2p_commit_compl_que1_base_addr_t btn_l2p_commit_compl_que1_base_addr;
    /* 0x0218 */ btn_l2p_commit_compl_que1_ptrs_t btn_l2p_commit_compl_que1_ptrs;
    /* 0x021c */ btn_l2p_commit_compl_que1_wrptr_base_addr_t btn_l2p_commit_compl_que1_wrptr_base_addr;
    /* 0x0220 */ btn_l2p_update_recycle_que_base_addr_t btn_l2p_update_recycle_que_base_addr;
    /* 0x0224 */ btn_l2p_update_recycle_que_ptrs_t btn_l2p_update_recycle_que_ptrs;
    /* 0x0228 */ btn_l2p_update_recycle_que_wrptr_base_addr_t btn_l2p_update_recycle_que_wrptr_base_addr;
    /* 0x022c */ u32 rsvd_22c [9];
    /* 0x0250 */ btn_l2p_tp_flush_que_base_addr_t btn_l2p_tp_flush_que_base_addr;
    /* 0x0254 */ btn_l2p_tp_flush_que_ptrs_t btn_l2p_tp_flush_que_ptrs;
    /* 0x0258 */ btn_l2p_tp_flush_que_wrptr_base_addr_t btn_l2p_tp_flush_que_wrptr_base_addr;
    /* 0x025c */ btn_l2p_updt_compl_que0_base_addr_t btn_l2p_updt_compl_que0_base_addr;
    /* 0x0260 */ btn_l2p_updt_compl_que0_ptrs_t btn_l2p_updt_compl_que0_ptrs;
    /* 0x0264 */ btn_l2p_updt_compl_que0_wrptr_base_addr_t btn_l2p_updt_compl_que0_wrptr_base_addr;
    /* 0x0268 */ btn_l2p_updt_compl_que1_base_addr_t btn_l2p_updt_compl_que1_base_addr;
    /* 0x026c */ btn_l2p_updt_compl_que1_ptrs_t btn_l2p_updt_compl_que1_ptrs;
    /* 0x0270 */ btn_l2p_updt_compl_que1_wrptr_base_addr_t btn_l2p_updt_compl_que1_wrptr_base_addr;
    /* 0x0274 */ btn_l2p_updt_req_que2_base_addr_t btn_l2p_updt_req_que2_base_addr;
    /* 0x0278 */ btn_l2p_updt_req_que2_ptrs_t btn_l2p_updt_req_que2_ptrs;
    /* 0x027c */ btn_l2p_updt_req_que2_rdptr_base_addr_t btn_l2p_updt_req_que2_rdptr_base_addr;
    /* 0x0280 */ btn_l2p_commit_compl_que2_base_addr_t btn_l2p_commit_compl_que2_base_addr;
    /* 0x0284 */ btn_l2p_commit_compl_que2_ptrs_t btn_l2p_commit_compl_que2_ptrs;
    /* 0x0288 */ btn_l2p_commit_compl_que2_wrptr_base_addr_t btn_l2p_commit_compl_que2_wrptr_base_addr;
    /* 0x028c */ btn_l2p_updt_compl_que2_base_addr_t btn_l2p_updt_compl_que2_base_addr;
    /* 0x0290 */ btn_l2p_updt_compl_que2_ptrs_t btn_l2p_updt_compl_que2_ptrs;
    /* 0x0294 */ btn_l2p_updt_compl_que2_wrptr_base_addr_t btn_l2p_updt_compl_que2_wrptr_base_addr;
    /* 0x0298 */ btn_l2p_updt_req_que3_base_addr_t btn_l2p_updt_req_que3_base_addr;
    /* 0x029c */ btn_l2p_updt_req_que3_ptrs_t btn_l2p_updt_req_que3_ptrs;
    /* 0x02a0 */ btn_l2p_updt_req_que3_rdptr_base_addr_t btn_l2p_updt_req_que3_rdptr_base_addr;
    /* 0x02a4 */ btn_l2p_commit_compl_que3_base_addr_t btn_l2p_commit_compl_que3_base_addr;
    /* 0x02a8 */ btn_l2p_commit_compl_que3_ptrs_t btn_l2p_commit_compl_que3_ptrs;
    /* 0x02ac */ btn_l2p_commit_compl_que3_wrptr_base_addr_t btn_l2p_commit_compl_que3_wrptr_base_addr;
    /* 0x02b0 */ btn_l2p_updt_compl_que3_base_addr_t btn_l2p_updt_compl_que3_base_addr;
    /* 0x02b4 */ btn_l2p_updt_compl_que3_ptrs_t btn_l2p_updt_compl_que3_ptrs;
    /* 0x02b8 */ btn_l2p_updt_compl_que3_wrptr_base_addr_t btn_l2p_updt_compl_que3_wrptr_base_addr;
    /* 0x02bc */ u32 rsvd_2bc [17];
    /* 0x0300 */ btn_ftl_status_cnt_table_config_reg0_t btn_ftl_status_cnt_table_config_reg0;
    /* 0x0304 */ btn_ftl_status_cnt_table_config_reg1_t btn_ftl_status_cnt_table_config_reg1;
    /* 0x0308 */ btn_ftl_status_cnt_table_config_reg2_t btn_ftl_status_cnt_table_config_reg2;
    /* 0x030c */ btn_ftl_status_cnt_table_config_reg3_t btn_ftl_status_cnt_table_config_reg3;
    /* 0x0310 */ btn_ftl_status_cnt_max_value_reg0_t btn_ftl_status_cnt_max_value_reg0;
    /* 0x0314 */ btn_ftl_status_cnt_max_value_reg1_t btn_ftl_status_cnt_max_value_reg1;
    /* 0x0318 */ btn_ftl_status_cnt_notif_threshold_t btn_ftl_status_cnt_notif_threshold;
    /* 0x031c */ u32 rsvd_31c;
    /* 0x0320 */ btn_ftl_status_cnt_fet_req_que_base_addr_t btn_ftl_status_cnt_fet_req_que_base_addr;
    /* 0x0324 */ btn_ftl_status_cnt_fet_req_que_ptrs_t btn_ftl_status_cnt_fet_req_que_ptrs;
    /* 0x0328 */ btn_ftl_status_cnt_fet_req_que_rdptr_base_addr_t btn_ftl_status_cnt_fet_req_que_rdptr_base_addr;
    /* 0x032c */ btn_ftl_status_cnt_fet_rslt_que_base_addr_t btn_ftl_status_cnt_fet_rslt_que_base_addr;
    /* 0x0330 */ btn_ftl_status_cnt_fet_rslt_que_ptrs_t btn_ftl_status_cnt_fet_rslt_que_ptrs;
    /* 0x0334 */ btn_ftl_status_cnt_fet_rslt_que_wrptr_base_addr_t btn_ftl_status_cnt_fet_rslt_que_wrptr_base_addr;
    /* 0x0338 */ btn_ftl_status_cnt_notif_que_base_addr_t btn_ftl_status_cnt_notif_que_base_addr;
    /* 0x033c */ btn_ftl_status_cnt_notif_que_ptrs_t btn_ftl_status_cnt_notif_que_ptrs;
    /* 0x0340 */ btn_ftl_status_cnt_notif_que_wrptr_base_addr_t btn_ftl_status_cnt_notif_que_wrptr_base_addr;
    /* 0x0344 */ btn_ftl_status_cnt_srch_req_que_base_addr_t btn_ftl_status_cnt_srch_req_que_base_addr;
    /* 0x0348 */ btn_ftl_status_cnt_srch_req_que_ptrs_t btn_ftl_status_cnt_srch_req_que_ptrs;
    /* 0x034c */ btn_ftl_status_cnt_srch_req_que_rdptr_base_addr_t btn_ftl_status_cnt_srch_req_que_rdptr_base_addr;
    /* 0x0350 */ btn_ftl_status_cnt_srch_rslt_que_base_addr_t btn_ftl_status_cnt_srch_rslt_que_base_addr;
    /* 0x0354 */ btn_ftl_status_cnt_srch_rslt_que_ptrs_t btn_ftl_status_cnt_srch_rslt_que_ptrs;
    /* 0x0358 */ btn_ftl_status_cnt_srch_rslt_que_wrptr_base_addr_t btn_ftl_status_cnt_srch_rslt_que_wrptr_base_addr;
    /* 0x035c */ u32 rsvd_35c [9];
    /* 0x0380 */ btn_dvl_info_fw_updt_req_que_base_addr_t btn_dvl_info_fw_updt_req_que_base_addr;
    /* 0x0384 */ btn_dvl_info_fw_updt_req_que_ptrs_t btn_dvl_info_fw_updt_req_que_ptrs;
    /* 0x0388 */ btn_dvl_info_fw_updt_req_que_rdptr_base_addr_t btn_dvl_info_fw_updt_req_que_rdptr_base_addr;
    /* 0x038c */ btn_dvl_info_fw_updt_rslt_que_base_addr_t btn_dvl_info_fw_updt_rslt_que_base_addr;
    /* 0x0390 */ btn_dvl_info_fw_updt_rslt_que_ptrs_t btn_dvl_info_fw_updt_rslt_que_ptrs;
    /* 0x0394 */ btn_dvl_info_fw_updt_rslt_que_wrptr_base_addr_t btn_dvl_info_fw_updt_rslt_que_wrptr_base_addr;
    /* 0x0398 */ btn_vldc_backup_restore_loc_addr_t btn_vldc_backup_restore_loc_addr;
    /* 0x039c */ btn_vldc_backup_restore_size_t btn_vldc_backup_restore_size;
    /* 0x03a0 */ u32 rsvd_3a0 [18];
    /* 0x03e8 */ btn_ftl_cpda_conv_req_que_base_addr_t btn_ftl_cpda_conv_req_que_base_addr;
    /* 0x03ec */ btn_ftl_cpda_conv_req_que_ptrs_t btn_ftl_cpda_conv_req_que_ptrs;
    /* 0x03f0 */ btn_ftl_cpda_conv_req_que_rdptr_base_addr_t btn_ftl_cpda_conv_req_que_rdptr_base_addr;
    /* 0x03f4 */ btn_ftl_cpda_conv_rslt_que_base_addr_t btn_ftl_cpda_conv_rslt_que_base_addr;
    /* 0x03f8 */ btn_ftl_cpda_conv_rslt_que_ptrs_t btn_ftl_cpda_conv_rslt_que_ptrs;
    /* 0x03fc */ btn_ftl_cpda_conv_rslt_que_wrptr_base_addr_t btn_ftl_cpda_conv_rslt_que_wrptr_base_addr;
    /* 0x0400 */ btn_pda_gen_req_que0_base_addr_t btn_pda_gen_req_que0_base_addr;
    /* 0x0404 */ btn_pda_gen_req_que0_ptrs_t btn_pda_gen_req_que0_ptrs;
    /* 0x0408 */ btn_pda_gen_req_que0_rdptr_base_addr_t btn_pda_gen_req_que0_rdptr_base_addr;
    /* 0x040c */ btn_pda_gen_req_que1_base_addr_t btn_pda_gen_req_que1_base_addr;
    /* 0x0410 */ btn_pda_gen_req_que1_ptrs_t btn_pda_gen_req_que1_ptrs;
    /* 0x0414 */ btn_pda_gen_req_que1_rdptr_base_addr_t btn_pda_gen_req_que1_rdptr_base_addr;
    /* 0x0418 */ btn_pda_gen_req_que2_base_addr_t btn_pda_gen_req_que2_base_addr;
    /* 0x041c */ btn_pda_gen_req_que2_ptrs_t btn_pda_gen_req_que2_ptrs;
    /* 0x0420 */ btn_pda_gen_req_que2_rdptr_base_addr_t btn_pda_gen_req_que2_rdptr_base_addr;
    /* 0x0424 */ btn_pda_gen_req_que3_base_addr_t btn_pda_gen_req_que3_base_addr;
    /* 0x0428 */ btn_pda_gen_req_que3_ptrs_t btn_pda_gen_req_que3_ptrs;
    /* 0x042c */ btn_pda_gen_req_que3_rdptr_base_addr_t btn_pda_gen_req_que3_rdptr_base_addr;
    /* 0x0430 */ btn_pda_gen_req_que4_base_addr_t btn_pda_gen_req_que4_base_addr;
    /* 0x0434 */ btn_pda_gen_req_que4_ptrs_t btn_pda_gen_req_que4_ptrs;
    /* 0x0438 */ btn_pda_gen_req_que4_rdptr_base_addr_t btn_pda_gen_req_que4_rdptr_base_addr;
    /* 0x043c */ btn_pda_gen_req_que5_base_addr_t btn_pda_gen_req_que5_base_addr;
    /* 0x0440 */ btn_pda_gen_req_que5_ptrs_t btn_pda_gen_req_que5_ptrs;
    /* 0x0444 */ btn_pda_gen_req_que5_rdptr_base_addr_t btn_pda_gen_req_que5_rdptr_base_addr;
    /* 0x0448 */ btn_pda_gen_req_que6_base_addr_t btn_pda_gen_req_que6_base_addr;
    /* 0x044c */ btn_pda_gen_req_que6_ptrs_t btn_pda_gen_req_que6_ptrs;
    /* 0x0450 */ btn_pda_gen_req_que6_rdptr_base_addr_t btn_pda_gen_req_que6_rdptr_base_addr;
    /* 0x0454 */ btn_pda_gen_req_que7_base_addr_t btn_pda_gen_req_que7_base_addr;
    /* 0x0458 */ btn_pda_gen_req_que7_ptrs_t btn_pda_gen_req_que7_ptrs;
    /* 0x045c */ btn_pda_gen_req_que7_rdptr_base_addr_t btn_pda_gen_req_que7_rdptr_base_addr;
    /* 0x0460 */ btn_pda_gen_rslt0_loc_ptr_que_base_addr_t btn_pda_gen_rslt0_loc_ptr_que_base_addr;
    /* 0x0464 */ btn_pda_gen_rslt0_loc_ptr_que_ptrs_t btn_pda_gen_rslt0_loc_ptr_que_ptrs;
    /* 0x0468 */ btn_pda_gen_rslt0_loc_ptr_que_rdptr_base_addr_t btn_pda_gen_rslt0_loc_ptr_que_rdptr_base_addr;
    /* 0x046c */ btn_pda_gen_rslt0_que0_base_addr_t btn_pda_gen_rslt0_que0_base_addr;
    /* 0x0470 */ btn_pda_gen_rslt0_que0_ptrs_t btn_pda_gen_rslt0_que0_ptrs;
    /* 0x0474 */ btn_pda_gen_rslt0_que0_wrptr_base_addr_t btn_pda_gen_rslt0_que0_wrptr_base_addr;
    /* 0x0478 */ btn_pda_gen_rslt0_que1_base_addr_t btn_pda_gen_rslt0_que1_base_addr;
    /* 0x047c */ btn_pda_gen_rslt0_que1_ptrs_t btn_pda_gen_rslt0_que1_ptrs;
    /* 0x0480 */ btn_pda_gen_rslt0_que1_wrptr_base_addr_t btn_pda_gen_rslt0_que1_wrptr_base_addr;
    /* 0x0484 */ btn_pda_gen_rslt0_que2_base_addr_t btn_pda_gen_rslt0_que2_base_addr;
    /* 0x0488 */ btn_pda_gen_rslt0_que2_ptrs_t btn_pda_gen_rslt0_que2_ptrs;
    /* 0x048c */ btn_pda_gen_rslt0_que2_wrptr_base_addr_t btn_pda_gen_rslt0_que2_wrptr_base_addr;
    /* 0x0490 */ btn_pda_gen_rslt0_que3_base_addr_t btn_pda_gen_rslt0_que3_base_addr;
    /* 0x0494 */ btn_pda_gen_rslt0_que3_ptrs_t btn_pda_gen_rslt0_que3_ptrs;
    /* 0x0498 */ btn_pda_gen_rslt0_que3_wrptr_base_addr_t btn_pda_gen_rslt0_que3_wrptr_base_addr;
    /* 0x049c */ btn_pda_gen_rslt0_que4_base_addr_t btn_pda_gen_rslt0_que4_base_addr;
    /* 0x04a0 */ btn_pda_gen_rslt0_que4_ptrs_t btn_pda_gen_rslt0_que4_ptrs;
    /* 0x04a4 */ btn_pda_gen_rslt0_que4_wrptr_base_addr_t btn_pda_gen_rslt0_que4_wrptr_base_addr;
    /* 0x04a8 */ btn_pda_gen_rslt0_que5_base_addr_t btn_pda_gen_rslt0_que5_base_addr;
    /* 0x04ac */ btn_pda_gen_rslt0_que5_ptrs_t btn_pda_gen_rslt0_que5_ptrs;
    /* 0x04b0 */ btn_pda_gen_rslt0_que5_wrptr_base_addr_t btn_pda_gen_rslt0_que5_wrptr_base_addr;
    /* 0x04b4 */ btn_pda_gen_rslt0_que6_base_addr_t btn_pda_gen_rslt0_que6_base_addr;
    /* 0x04b8 */ btn_pda_gen_rslt0_que6_ptrs_t btn_pda_gen_rslt0_que6_ptrs;
    /* 0x04bc */ btn_pda_gen_rslt0_que6_wrptr_base_addr_t btn_pda_gen_rslt0_que6_wrptr_base_addr;
    /* 0x04c0 */ btn_pda_gen_rslt0_que7_base_addr_t btn_pda_gen_rslt0_que7_base_addr;
    /* 0x04c4 */ btn_pda_gen_rslt0_que7_ptrs_t btn_pda_gen_rslt0_que7_ptrs;
    /* 0x04c8 */ btn_pda_gen_rslt0_que7_wrptr_base_addr_t btn_pda_gen_rslt0_que7_wrptr_base_addr;
    /* 0x04cc */ btn_pda_gen_rslt1_loc_ptr_que_base_addr_t btn_pda_gen_rslt1_loc_ptr_que_base_addr;
    /* 0x04d0 */ btn_pda_gen_rslt1_loc_ptr_que_ptrs_t btn_pda_gen_rslt1_loc_ptr_que_ptrs;
    /* 0x04d4 */ btn_pda_gen_rslt1_loc_ptr_que_rdptr_base_addr_t btn_pda_gen_rslt1_loc_ptr_que_rdptr_base_addr;
    /* 0x04d8 */ btn_pda_gen_rslt1_que0_base_addr_t btn_pda_gen_rslt1_que0_base_addr;
    /* 0x04dc */ btn_pda_gen_rslt1_que0_ptrs_t btn_pda_gen_rslt1_que0_ptrs;
    /* 0x04e0 */ btn_pda_gen_rslt1_que0_wrptr_base_addr_t btn_pda_gen_rslt1_que0_wrptr_base_addr;
    /* 0x04e4 */ btn_pda_gen_rslt1_que1_base_addr_t btn_pda_gen_rslt1_que1_base_addr;
    /* 0x04e8 */ btn_pda_gen_rslt1_que1_ptrs_t btn_pda_gen_rslt1_que1_ptrs;
    /* 0x04ec */ btn_pda_gen_rslt1_que1_wrptr_base_addr_t btn_pda_gen_rslt1_que1_wrptr_base_addr;
    /* 0x04f0 */ btn_pda_gen_rslt1_que2_base_addr_t btn_pda_gen_rslt1_que2_base_addr;
    /* 0x04f4 */ btn_pda_gen_rslt1_que2_ptrs_t btn_pda_gen_rslt1_que2_ptrs;
    /* 0x04f8 */ btn_pda_gen_rslt1_que2_wrptr_base_addr_t btn_pda_gen_rslt1_que2_wrptr_base_addr;
    /* 0x04fc */ btn_pda_gen_rslt1_que3_base_addr_t btn_pda_gen_rslt1_que3_base_addr;
    /* 0x0500 */ btn_pda_gen_rslt1_que3_ptrs_t btn_pda_gen_rslt1_que3_ptrs;
    /* 0x0504 */ btn_pda_gen_rslt1_que3_wrptr_base_addr_t btn_pda_gen_rslt1_que3_wrptr_base_addr;
    /* 0x0508 */ btn_pda_gen_rslt1_que4_base_addr_t btn_pda_gen_rslt1_que4_base_addr;
    /* 0x050c */ btn_pda_gen_rslt1_que4_ptrs_t btn_pda_gen_rslt1_que4_ptrs;
    /* 0x0510 */ btn_pda_gen_rslt1_que4_wrptr_base_addr_t btn_pda_gen_rslt1_que4_wrptr_base_addr;
    /* 0x0514 */ btn_pda_gen_rslt1_que5_base_addr_t btn_pda_gen_rslt1_que5_base_addr;
    /* 0x0518 */ btn_pda_gen_rslt1_que5_ptrs_t btn_pda_gen_rslt1_que5_ptrs;
    /* 0x051c */ btn_pda_gen_rslt1_que5_wrptr_base_addr_t btn_pda_gen_rslt1_que5_wrptr_base_addr;
    /* 0x0520 */ btn_pda_gen_rslt1_que6_base_addr_t btn_pda_gen_rslt1_que6_base_addr;
    /* 0x0524 */ btn_pda_gen_rslt1_que6_ptrs_t btn_pda_gen_rslt1_que6_ptrs;
    /* 0x0528 */ btn_pda_gen_rslt1_que6_wrptr_base_addr_t btn_pda_gen_rslt1_que6_wrptr_base_addr;
    /* 0x052c */ btn_pda_gen_rslt1_que7_base_addr_t btn_pda_gen_rslt1_que7_base_addr;
    /* 0x0530 */ btn_pda_gen_rslt1_que7_ptrs_t btn_pda_gen_rslt1_que7_ptrs;
    /* 0x0534 */ btn_pda_gen_rslt1_que7_wrptr_base_addr_t btn_pda_gen_rslt1_que7_wrptr_base_addr;
    /* 0x0538 */ u32 rsvd_538 [114];
    /* 0x0700 */ btn_ftl_ncl_debug_reg_t btn_ftl_ncl_debug_reg;
    /* 0x0704 */ btn_ftl_ncl_cpu_accs_ctrl_t btn_ftl_ncl_cpu_accs_ctrl;
    /* 0x0708 */ btn_ftl_ncl_cpu_accs_reg0_t btn_ftl_ncl_cpu_accs_reg0;
    /* 0x070c */ btn_ftl_ncl_cpu_accs_reg1_t btn_ftl_ncl_cpu_accs_reg1;
    /* 0x0710 */ btn_ftl_ncl_cpu_accs_reg2_t btn_ftl_ncl_cpu_accs_reg2;
    /* 0x0714 */ btn_ftl_ncl_cpu_accs_reg3_t btn_ftl_ncl_cpu_accs_reg3;
    /* 0x0718 */ btn_ftl_ncl_cpu_accs_reg4_t btn_ftl_ncl_cpu_accs_reg4;
    /* 0x071c */ btn_ftl_ncl_cpu_accs_reg5_t btn_ftl_ncl_cpu_accs_reg5;
    /* 0x0720 */ btn_ftl_ncl_cpu_accs_reg6_t btn_ftl_ncl_cpu_accs_reg6;
    /* 0x0724 */ btn_ftl_ncl_cpu_accs_reg7_t btn_ftl_ncl_cpu_accs_reg7;
    /* 0x0728 */ u32 rsvd_728 [2];
    /* 0x0730 */ btn_ftl_ltmode_config_t btn_ftl_ltmode_config;
} btn_ftl_ncl_reg_regs_t;


#endif /* rev 10 */