//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _COMMON_CTRL_H_
#define _COMMON_CTRL_H_

#define UNMASK_INT_STTS                          0x0000c000
#define   NAME_SPACE_PAR_ERR_MASK                0x00000400
#define   NAME_SPACE_PAR_ERR_SHIFT                       10
#define   CMD_ABORT_DONE_MASK                    0x00000200
#define   CMD_ABORT_DONE_SHIFT                            9
#define   SQ_DELETED_MASK                        0x00000100
#define   SQ_DELETED_SHIFT                                8
#define   FUNC_DIS_DONE_MASK                     0x00000080
#define   FUNC_DIS_DONE_SHIFT                             7
#define   CMB_INT_MASK                           0x00000040
#define   CMB_INT_SHIFT                                   6
#define   CMD_ERR_MASK                           0x00000020
#define   CMD_ERR_SHIFT                                   5
#define   DU_CMD_INV_MASK                        0x00000010
#define   DU_CMD_INV_SHIFT                                4
#define   CMD_INV_ERR_MASK                       0x00000008
#define   CMD_INV_ERR_SHIFT                               3
#define   ERR_ABORTED_MASK                       0x00000004
#define   ERR_ABORTED_SHIFT                               2
#define   CMD_COMPLETED_MASK                     0x00000002
#define   CMD_COMPLETED_SHIFT                             1
#define   CMD_RCVD_MASK                          0x00000001
#define   CMD_RCVD_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 cmd_rcvd:1;
        u32 cmd_completed:1;
        u32 err_aborted:1;
        u32 cmd_inv_err:1;
        u32 du_cmd_inv:1;
        u32 cmd_err:1;
        u32 cmb_int:1;
        u32 func_dis_done:1;
        u32 sq_deleted:1;
        u32 cmd_abort_done:1;
        u32 name_space_par_err:1;
        u32 rsvd_11:21;
    } b;
} unmask_int_stts_t;

#define INT_MASK_1                               0x0000c004
#define   INT_MASK_1_MASK                        0x000007ff
#define   INT_MASK_1_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 int_mask_1:11;
        u32 rsvd_11:21;
    } b;
} int_mask_1_t;

#define MASK_INT_STTS_1                          0x0000c008
#define   MASKED_INT_1_MASK                      0x000007ff
#define   MASKED_INT_1_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 masked_int_1:11;
        u32 rsvd_11:21;
    } b;
} mask_int_stts_1_t;

#define MODE_CTRL                                0x0000c00c
#define   PRINFO_CHK_EN_MASK                     0x20000000
#define   PRINFO_CHK_EN_SHIFT                            29
#define   PAR_DATA_FILL_EN_MASK                  0x10000000
#define   PAR_DATA_FILL_EN_SHIFT                         28
#define   ILBRT_CHK_EN_MASK                      0x08000000
#define   ILBRT_CHK_EN_SHIFT                             27
#define   DIS_APPEND_CMD_MASK                    0x04000000
#define   DIS_APPEND_CMD_SHIFT                           26
#define   HS_CRC_REPORT_EN_MASK                  0x02000000
#define   HS_CRC_REPORT_EN_SHIFT                         25
#define   OC_RCMD_AUTO_CMPL_DIS_MASK             0x01000000
#define   OC_RCMD_AUTO_CMPL_DIS_SHIFT                    24
#define   RCMD_AUTO_CMPL_DIS_MASK                0x00800000
#define   RCMD_AUTO_CMPL_DIS_SHIFT                       23
#define   MAX_CMD_SLOT_MASK                      0x00600000
#define   MAX_CMD_SLOT_SHIFT                             21
#define   IOM_ALL_NS_EN_MASK                     0x00100000
#define   IOM_ALL_NS_EN_SHIFT                            20
#define   FLUSH_ALL_NS_EN_MASK                   0x00080000
#define   FLUSH_ALL_NS_EN_SHIFT                          19
#define   FW_CMD_Q_DEPTH_MASK                    0x00070000
#define   FW_CMD_Q_DEPTH_SHIFT                           16
#define   PPA_SZ_MASK                            0x0000e000
#define   PPA_SZ_SHIFT                                   13
#define   SRIOV_EN_MASK                          0x00001000
#define   SRIOV_EN_SHIFT                                 12
#define   AES_EN_MASK                            0x00000800
#define   AES_EN_SHIFT                                   11
#define   NS_REM_EN_MASK                         0x00000400
#define   NS_REM_EN_SHIFT                                10
#define   NCB_IND_EN_MASK                        0x00000200
#define   NCB_IND_EN_SHIFT                                9
#define   DIS_SGL_NEXT_MASK                      0x00000100
#define   DIS_SGL_NEXT_SHIFT                              8
#define   DIS_PRP_NEXT_MASK                      0x00000080
#define   DIS_PRP_NEXT_SHIFT                              7
#define   SGL_SUB_ERR_MODE_MASK                  0x00000040
#define   SGL_SUB_ERR_MODE_SHIFT                          6
#define   CHK_LBRT_MASK                          0x00000020
#define   CHK_LBRT_SHIFT                                  5
#define   PAR_DU_RD_MODE_MASK                    0x00000010
#define   PAR_DU_RD_MODE_SHIFT                            4
#define   PCIE_PAR_CHK_EN_MASK                   0x00000008
#define   PCIE_PAR_CHK_EN_SHIFT                           3
#define   PAR_CHK_EN_MASK                        0x00000004
#define   PAR_CHK_EN_SHIFT                                2
#define   LBA_RANGE_CHK_EN_MASK                  0x00000002
#define   LBA_RANGE_CHK_EN_SHIFT                          1
#define   OPEN_CHNL_EN_MASK                      0x00000001
#define   OPEN_CHNL_EN_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 open_chnl_en:1;
        u32 lba_range_chk_en:1;
        u32 par_chk_en:1;
        u32 pcie_par_chk_en:1;
        u32 par_du_rd_mode:1;
        u32 chk_lbrt:1;
        u32 sgl_sub_err_mode:1;
        u32 dis_prp_next:1;
        u32 dis_sgl_next:1;
        u32 ncb_ind_en:1;
        u32 ns_rem_en:1;
        u32 aes_en:1;
        u32 sriov_en:1;
        u32 ppa_sz:3;
        u32 fw_cmd_q_depth:3;
        u32 flush_all_ns_en:1;
        u32 iom_all_ns_en:1;
        u32 max_cmd_slot:2;
        u32 rcmd_auto_cmpl_dis:1;
        u32 oc_rcmd_auto_cmpl_dis:1;
        u32 hs_crc_report_en:1;
        u32 dis_append_cmd:1;
        u32 ilbrt_chk_en:1;
        u32 par_data_fill_en:1;
        u32 prinfo_chk_en:1;
        u32 rsvd_30:2;
    } b;
} mode_ctrl_t;

#define ABORT_CTRL                               0x0000c010
#define   CMD_RX_IDLE_MASK                       0x00001000
#define   CMD_RX_IDLE_SHIFT                              12
#define   CMD_CMPL_IDLE_MASK                     0x00000800
#define   CMD_CMPL_IDLE_SHIFT                            11
#define   CMD_FETCH_IDLE_MASK                    0x00000400
#define   CMD_FETCH_IDLE_SHIFT                           10
#define   CMD_PROC_IDLE_MASK                     0x00000200
#define   CMD_PROC_IDLE_SHIFT                             9
#define   CLR_PRP_CACHE_MASK                     0x00000020
#define   CLR_PRP_CACHE_SHIFT                             5
#define   RESET_LL_MASK                          0x00000010
#define   RESET_LL_SHIFT                                  4
#define   RESET_ERR_Q_MASK                       0x00000008
#define   RESET_ERR_Q_SHIFT                               3
#define   CLR_ALL_CMD_VLD_MASK                   0x00000004
#define   CLR_ALL_CMD_VLD_SHIFT                           2
#define   CMD_PROC_ABORT_MASK                    0x00000002
#define   CMD_PROC_ABORT_SHIFT                            1
#define   RESET_CMD_PROC_MASK                    0x00000001
#define   RESET_CMD_PROC_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 reset_cmd_proc:1;
        u32 cmd_proc_abort:1;
        u32 clr_all_cmd_vld:1;
        u32 reset_err_q:1;
        u32 reset_ll:1;
        u32 clr_prp_cache:1;
        u32 rsvd_6:3;
        u32 cmd_proc_idle:1;
        u32 cmd_fetch_idle:1;
        u32 cmd_cmpl_idle:1;
        u32 cmd_rx_idle:1;
        u32 rsvd_13:19;
    } b;
} abort_ctrl_t;

#define READ_UNM_CTRL                            0x0000c014
#define   READ_UNM_EN_MASK                       0x01000000
#define   READ_UNM_EN_SHIFT                              24
#define   READ_UNM_DTAG_MASK                     0x00ffffff
#define   READ_UNM_DTAG_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 read_unm_dtag:24;
        u32 read_unm_en:1;
        u32 rsvd_25:7;
    } b;
} read_unm_ctrl_t;

#define NAME_SPACE_CTRL                          0x0000c018
#define   NAME_SPACE_TABLE_ID_MASK               0x000000fe
#define   NAME_SPACE_TABLE_ID_SHIFT                       1
#define   NAME_SPACE_TABLE_RW_MASK               0x00000001
#define   NAME_SPACE_TABLE_RW_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 name_space_table_rw:1;
        u32 name_space_table_id:7;
        u32 rsvd_8:24;
    } b;
} name_space_ctrl_t;

#define READ_UNM1_CTRL                           0x0000c01c
#define   READ_UNM1_EN_MASK                      0x01000000
#define   READ_UNM1_EN_SHIFT                             24
#define   READ_UNM1_DTAG_MASK                    0x00ffffff
#define   READ_UNM1_DTAG_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 read_unm1_dtag:24;
        u32 read_unm1_en:1;
        u32 rsvd_25:7;
    } b;
} read_unm1_ctrl_t;

#define MAX_LBA_L                                0x0000c020
#define   MAX_LBA_LOW_MASK                       0xffffffff
#define   MAX_LBA_LOW_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 max_lba_low:32;
    } b;
} max_lba_l_t;

#define MAX_LBA_H                                0x0000c024
#define   PAR_WRITE_SET_MASK                     0x00800000
#define   PAR_WRITE_SET_SHIFT                            23
#define   NS_WR_PROT_MASK                        0x00400000
#define   NS_WR_PROT_SHIFT                               22
#define   META_ONLY_EN_MASK                      0x00200000
#define   META_ONLY_EN_SHIFT                             21
#define   DEV_NAME_SPACE_ID_MASK                 0x001fc000
#define   DEV_NAME_SPACE_ID_SHIFT                        14
#define   PI_LOCATION_MASK                       0x00002000
#define   PI_LOCATION_SHIFT                              13
#define   META_SEPARATE_MASK                     0x00001000
#define   META_SEPARATE_SHIFT                            12
#define   PI_CTRL_MASK                           0x00000c00
#define   PI_CTRL_SHIFT                                  10
#define   META_SIZE_MASK                         0x00000200
#define   META_SIZE_SHIFT                                 9
#define   HOST_SECTOR_SIZE_MASK                  0x00000100
#define   HOST_SECTOR_SIZE_SHIFT                          8
#define   MAX_LBA_HIGH_MASK                      0x0000000f
#define   MAX_LBA_HIGH_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 max_lba_high:4;
        u32 rsvd_4:4;
        u32 host_sector_size:1;
        u32 meta_size:1;
        u32 pi_ctrl:2;
        u32 meta_separate:1;
        u32 pi_location:1;
        u32 dev_name_space_id:7;
        u32 meta_only_en:1;
        u32 ns_wr_prot:1;
        u32 par_write_set:1;
        u32 rsvd_24:8;
    } b;
} max_lba_h_t;

#define NAME_SPACE_VLD_0                         0x0000c028
#define   NAME_SPACE_VLD_DW0_MASK                0xffffffff
#define   NAME_SPACE_VLD_DW0_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 name_space_vld_dw0:32;
    } b;
} name_space_vld_0_t;

#define NAME_SPACE_VLD_1                         0x0000c02c
#define   NAME_SPACE_VLD_32_MASK                 0x00000001
#define   NAME_SPACE_VLD_32_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 name_space_vld_32:1;
        u32 rsvd_1:31;
    } b;
} name_space_vld_1_t;

#define HW_CMD_CTRL                              0x0000c034
#define   HW_CMD_OPC_VLD_MASK                    0x0000ffff
#define   HW_CMD_OPC_VLD_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 hw_cmd_opc_vld:16;
        u32 rsvd_16:16;
    } b;
} hw_cmd_ctrl_t;

#define HW_CMD_TYPE                              0x0000c038
#define   HW_CMD_TYPE_7_MASK                     0x00e00000
#define   HW_CMD_TYPE_7_SHIFT                            21
#define   HW_CMD_TYPE_6_MASK                     0x001c0000
#define   HW_CMD_TYPE_6_SHIFT                            18
#define   HW_CMD_TYPE_5_MASK                     0x00038000
#define   HW_CMD_TYPE_5_SHIFT                            15
#define   HW_CMD_TYPE_4_MASK                     0x00007000
#define   HW_CMD_TYPE_4_SHIFT                            12
#define   HW_CMD_TYPE_3_MASK                     0x00000e00
#define   HW_CMD_TYPE_3_SHIFT                             9
#define   HW_CMD_TYPE_2_MASK                     0x000001c0
#define   HW_CMD_TYPE_2_SHIFT                             6
#define   HW_CMD_TYPE_1_MASK                     0x00000038
#define   HW_CMD_TYPE_1_SHIFT                             3
#define   HW_CMD_TYPE_0_MASK                     0x00000007
#define   HW_CMD_TYPE_0_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 hw_cmd_type_0:3;
        u32 hw_cmd_type_1:3;
        u32 hw_cmd_type_2:3;
        u32 hw_cmd_type_3:3;
        u32 hw_cmd_type_4:3;
        u32 hw_cmd_type_5:3;
        u32 hw_cmd_type_6:3;
        u32 hw_cmd_type_7:3;
        u32 rsvd_24:8;
    } b;
} hw_cmd_type_t;

#define HW_CMD_OPCODE_1                          0x0000c03c
#define   HW_CMD_OPCODE_3_MASK                   0xff000000
#define   HW_CMD_OPCODE_3_SHIFT                          24
#define   HW_CMD_OPCODE_2_MASK                   0x00ff0000
#define   HW_CMD_OPCODE_2_SHIFT                          16
#define   HW_CMD_OPCODE_1_MASK                   0x0000ff00
#define   HW_CMD_OPCODE_1_SHIFT                           8
#define   HW_CMD_OPCODE_0_MASK                   0x000000ff
#define   HW_CMD_OPCODE_0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 hw_cmd_opcode_0:8;
        u32 hw_cmd_opcode_1:8;
        u32 hw_cmd_opcode_2:8;
        u32 hw_cmd_opcode_3:8;
    } b;
} hw_cmd_opcode_1_t;

#define HW_CMD_OPCODE_2                          0x0000c040
#define   HW_CMD_OPCODE_7_MASK                   0xff000000
#define   HW_CMD_OPCODE_7_SHIFT                          24
#define   HW_CMD_OPCODE_6_MASK                   0x00ff0000
#define   HW_CMD_OPCODE_6_SHIFT                          16
#define   HW_CMD_OPCODE_5_MASK                   0x0000ff00
#define   HW_CMD_OPCODE_5_SHIFT                           8
#define   HW_CMD_OPCODE_4_MASK                   0x000000ff
#define   HW_CMD_OPCODE_4_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 hw_cmd_opcode_4:8;
        u32 hw_cmd_opcode_5:8;
        u32 hw_cmd_opcode_6:8;
        u32 hw_cmd_opcode_7:8;
    } b;
} hw_cmd_opcode_2_t;

#define HW_CMD_OPCODE_3                          0x0000c044
#define   HW_CMD_OPCODE_11_MASK                  0xff000000
#define   HW_CMD_OPCODE_11_SHIFT                         24
#define   HW_CMD_OPCODE_10_MASK                  0x00ff0000
#define   HW_CMD_OPCODE_10_SHIFT                         16
#define   HW_CMD_OPCODE_9_MASK                   0x0000ff00
#define   HW_CMD_OPCODE_9_SHIFT                           8
#define   HW_CMD_OPCODE_8_MASK                   0x000000ff
#define   HW_CMD_OPCODE_8_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 hw_cmd_opcode_8:8;
        u32 hw_cmd_opcode_9:8;
        u32 hw_cmd_opcode_10:8;
        u32 hw_cmd_opcode_11:8;
    } b;
} hw_cmd_opcode_3_t;

#define HW_CMD_TYPE_1                            0x0000c048
#define   HW_CMD_TYPE_15_MASK                    0x00e00000
#define   HW_CMD_TYPE_15_SHIFT                           21
#define   HW_CMD_TYPE_14_MASK                    0x001c0000
#define   HW_CMD_TYPE_14_SHIFT                           18
#define   HW_CMD_TYPE_13_MASK                    0x00038000
#define   HW_CMD_TYPE_13_SHIFT                           15
#define   HW_CMD_TYPE_12_MASK                    0x00007000
#define   HW_CMD_TYPE_12_SHIFT                           12
#define   HW_CMD_TYPE_11_MASK                    0x00000e00
#define   HW_CMD_TYPE_11_SHIFT                            9
#define   HW_CMD_TYPE_10_MASK                    0x000001c0
#define   HW_CMD_TYPE_10_SHIFT                            6
#define   HW_CMD_TYPE_9_MASK                     0x00000038
#define   HW_CMD_TYPE_9_SHIFT                             3
#define   HW_CMD_TYPE_8_MASK                     0x00000007
#define   HW_CMD_TYPE_8_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 hw_cmd_type_8:3;
        u32 hw_cmd_type_9:3;
        u32 hw_cmd_type_10:3;
        u32 hw_cmd_type_11:3;
        u32 hw_cmd_type_12:3;
        u32 hw_cmd_type_13:3;
        u32 hw_cmd_type_14:3;
        u32 hw_cmd_type_15:3;
        u32 rsvd_24:8;
    } b;
} hw_cmd_type_1_t;

#define HW_CMD_OPCODE_4                          0x0000c04c
#define   HW_CMD_OPCODE_15_MASK                  0xff000000
#define   HW_CMD_OPCODE_15_SHIFT                         24
#define   HW_CMD_OPCODE_14_MASK                  0x00ff0000
#define   HW_CMD_OPCODE_14_SHIFT                         16
#define   HW_CMD_OPCODE_13_MASK                  0x0000ff00
#define   HW_CMD_OPCODE_13_SHIFT                          8
#define   HW_CMD_OPCODE_12_MASK                  0x000000ff
#define   HW_CMD_OPCODE_12_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 hw_cmd_opcode_12:8;
        u32 hw_cmd_opcode_13:8;
        u32 hw_cmd_opcode_14:8;
        u32 hw_cmd_opcode_15:8;
    } b;
} hw_cmd_opcode_4_t;

#define DIS_FUNC_CTRL                            0x0000c050
#define   FUNC_DIS_CS_MASK                       0xc0000000
#define   FUNC_DIS_CS_SHIFT                              30
#define   SLOT_NOT_EMPTY_MASK                    0x20000000
#define   SLOT_NOT_EMPTY_SHIFT                           29
#define   ALL_FUNC_MASK                          0x00000200
#define   ALL_FUNC_SHIFT                                  9
#define   FUNC_ID_MASK                           0x0000007e
#define   FUNC_ID_SHIFT                                   1
#define   OPERATION_MASK                         0x00000001
#define   OPERATION_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 operation:1;
        u32 func_id:6;
        u32 rsvd_7:2;
        u32 all_func:1;
        u32 rsvd_10:19;
        u32 slot_not_empty:1;
        u32 func_dis_cs:2;
    } b;
} dis_func_ctrl_t;

#define DIS_FUNC_0_P0                            0x0000c054
#define   DIS_FUNC_DW0_MASK                      0xffffffff
#define   DIS_FUNC_DW0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 dis_func_dw0:32;
    } b;
} dis_func_0_p0_t;

#define DIS_FUNC_0_P1                            0x0000c058
#define   DIS_FUNC_BUSY_MASK                     0x80000000
#define   DIS_FUNC_BUSY_SHIFT                            31
#define   DIS_FUNC_32_MASK                       0x00000001
#define   DIS_FUNC_32_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 dis_func_32:1;
        u32 rsvd_1:30;
        u32 dis_func_busy:1;
    } b;
} dis_func_0_p1_t;

#define DIS_FUNC_DONE_0                          0x0000c060
#define   DIS_FUNC_DONE_DW0_MASK                 0xffffffff
#define   DIS_FUNC_DONE_DW0_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 dis_func_done_dw0:32;
    } b;
} dis_func_done_0_t;

#define DIS_FUNC_DONE_1                          0x0000c064
#define   DIS_FUNC_DONE_32_MASK                  0x00000001
#define   DIS_FUNC_DONE_32_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 dis_func_done_32:1;
        u32 rsvd_1:31;
    } b;
} dis_func_done_1_t;

#define MAX_DATA_SZ                              0x0000c06c
#define   MAX_DATA_SIZE_MASK                     0x0000ffff
#define   MAX_DATA_SIZE_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 max_data_size:16;
        u32 rsvd_16:16;
    } b;
} max_data_sz_t;

#define OC_CTRL                                  0x0000c070
#define   OC_READ_META_FORMAT_MASK               0x00000180
#define   OC_READ_META_FORMAT_SHIFT                       7
#define   OC_READ_META_AUTO_EN_MASK              0x00000040
#define   OC_READ_META_AUTO_EN_SHIFT                      6
#define   RD_META_PTR_MODE_MASK                  0x00000020
#define   RD_META_PTR_MODE_SHIFT                          5
#define   WR_META_IN_CDW_MASK                    0x00000010
#define   WR_META_IN_CDW_SHIFT                            4
#define   RD_CMPL_MODE_MASK                      0x00000008
#define   RD_CMPL_MODE_SHIFT                              3
#define   CUSTOM_PPA_LOC_MASK                    0x00000004
#define   CUSTOM_PPA_LOC_SHIFT                            2
#define   COPY_PPA_LOC_MASK                      0x00000002
#define   COPY_PPA_LOC_SHIFT                              1
#define   RW_PPA_LOC_MASK                        0x00000001
#define   RW_PPA_LOC_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 rw_ppa_loc:1;
        u32 copy_ppa_loc:1;
        u32 custom_ppa_loc:1;
        u32 rd_cmpl_mode:1;
        u32 wr_meta_in_cdw:1;
        u32 rd_meta_ptr_mode:1;
        u32 oc_read_meta_auto_en:1;
        u32 oc_read_meta_format:2;
        u32 rsvd_9:23;
    } b;
} oc_ctrl_t;

#define READ_ERR_DTAG                            0x0000c074
#define   READ_ERR_DTAG_EN_MASK                  0x01000000
#define   READ_ERR_DTAG_EN_SHIFT                         24
#define   READ_ERR_DTAG_MASK                     0x00ffffff
#define   READ_ERR_DTAG_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 read_err_dtag:24;
        u32 read_err_dtag_en:1;
        u32 rsvd_25:7;
    } b;
} read_err_dtag_t;

#define OC_META_BASE                             0x0000c078
#define   OC_META_QUEUE_LOC_MASK                 0x00800000
#define   OC_META_QUEUE_LOC_SHIFT                        23
#define   OC_META_BASE_ADDR_MASK                 0x007fffff
#define   OC_META_BASE_ADDR_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 oc_meta_base_addr:23;
        u32 oc_meta_queue_loc:1;
        u32 rsvd_24:8;
    } b;
} oc_meta_base_t;

#define AES_BYPASS_DTAG                          0x0000c07c
#define   AES_BYPASS_DTAG_EN_MASK                0x01000000
#define   AES_BYPASS_DTAG_EN_SHIFT                       24
#define   AES_BYPASS_DTAG_MASK                   0x00ffffff
#define   AES_BYPASS_DTAG_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 aes_bypass_dtag:24;
        u32 aes_bypass_dtag_en:1;
        u32 rsvd_25:7;
    } b;
} aes_bypass_dtag_t;

#define ERR_CMPL_Q_BASE                          0x0000c080
#define   ERR_CMPL_MAX_SZ_MASK                   0xff000000
#define   ERR_CMPL_MAX_SZ_SHIFT                          24
#define   ERR_CMPL_Q_LOC_MASK                    0x00800000
#define   ERR_CMPL_Q_LOC_SHIFT                           23
#define   ERR_CMPL_Q_BASE_MASK                   0x007fffff
#define   ERR_CMPL_Q_BASE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 err_cmpl_q_base:23;
        u32 err_cmpl_q_loc:1;
        u32 err_cmpl_max_sz:8;
    } b;
} err_cmpl_q_base_t;

#define ERR_CMPL_Q_PTR                           0x0000c084
#define   ERR_CMPL_RD_PTR_MASK                   0x00ff0000
#define   ERR_CMPL_RD_PTR_SHIFT                          16
#define   ERR_CMPL_WR_PTR_MASK                   0x000000ff
#define   ERR_CMPL_WR_PTR_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 err_cmpl_wr_ptr:8;
        u32 rsvd_8:8;
        u32 err_cmpl_rd_ptr:8;
        u32 rsvd_24:8;
    } b;
} err_cmpl_q_ptr_t;

#define ABORT_Q_BASE                             0x0000c088
#define   ABORT_Q_MAX_SZ_MASK                    0xff000000
#define   ABORT_Q_MAX_SZ_SHIFT                           24
#define   ABORT_Q_LOC_MASK                       0x00800000
#define   ABORT_Q_LOC_SHIFT                              23
#define   ABORT_Q_BASE_MASK                      0x007fffff
#define   ABORT_Q_BASE_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 abort_q_base:23;
        u32 abort_q_loc:1;
        u32 abort_q_max_sz:8;
    } b;
} abort_q_base_t;

#define ABORT_Q_PTR                              0x0000c08c
#define   ABORT_Q_RD_PTR_MASK                    0x00ff0000
#define   ABORT_Q_RD_PTR_SHIFT                           16
#define   ABORT_Q_WR_PTR_MASK                    0x000000ff
#define   ABORT_Q_WR_PTR_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 abort_q_wr_ptr:8;
        u32 rsvd_8:8;
        u32 abort_q_rd_ptr:8;
        u32 rsvd_24:8;
    } b;
} abort_q_ptr_t;

#define ABORT_CMPL_Q_BASE                        0x0000c090
#define   ABORT_CMPL_MAX_SZ_MASK                 0xff000000
#define   ABORT_CMPL_MAX_SZ_SHIFT                        24
#define   ABORT_CMPL_Q_LOC_MASK                  0x00800000
#define   ABORT_CMPL_Q_LOC_SHIFT                         23
#define   ABORT_CMPL_Q_BASE_MASK                 0x007fffff
#define   ABORT_CMPL_Q_BASE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 abort_cmpl_q_base:23;
        u32 abort_cmpl_q_loc:1;
        u32 abort_cmpl_max_sz:8;
    } b;
} abort_cmpl_q_base_t;

#define ABORT_CMPL_Q_PTR                         0x0000c094
#define   ABORT_CMPL_RD_PTR_MASK                 0x00ff0000
#define   ABORT_CMPL_RD_PTR_SHIFT                        16
#define   ABORT_CMPL_WR_PTR_MASK                 0x000000ff
#define   ABORT_CMPL_WR_PTR_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 abort_cmpl_wr_ptr:8;
        u32 rsvd_8:8;
        u32 abort_cmpl_rd_ptr:8;
        u32 rsvd_24:8;
    } b;
} abort_cmpl_q_ptr_t;

#define WRITE_ZERO_CTRL                          0x0000c098
#define   WRITE_ZERO_EN_MASK                     0x00000100
#define   WRITE_ZERO_EN_SHIFT                             8
#define   WRITE_ZERO_OPCODE_MASK                 0x000000ff
#define   WRITE_ZERO_OPCODE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 write_zero_opcode:8;
        u32 write_zero_en:1;
        u32 rsvd_9:23;
    } b;
} write_zero_ctrl_t;

#define DEL_SQ_CTRL                              0x0000c09c
#define   ALL_SQ_MASK                            0x00000200
#define   ALL_SQ_SHIFT                                    9
#define   SQ_ID_MASK                             0x000000fe
#define   SQ_ID_SHIFT                                     1
#define   OPERATION_c09c_MASK                    0x00000001
#define   OPERATION_c09c_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 operation_c09c:1;
        u32 sq_id:7;
        u32 rsvd_8:1;
        u32 all_sq:1;
        u32 rsvd_10:22;
    } b;
} del_sq_ctrl_t;

#define DEL_SQ_DW0                               0x0000c0a0
#define   DEL_SQ_DW0_MASK                        0xffffffff
#define   DEL_SQ_DW0_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 del_sq_dw0:32;
    } b;
} del_sq_dw0_t;

#define DEL_SQ_DW1                               0x0000c0a4
#define   DEL_SQ_DW1_MASK                        0xffffffff
#define   DEL_SQ_DW1_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 del_sq_dw1:32;
    } b;
} del_sq_dw1_t;

#define DEL_SQ_DW2                               0x0000c0a8
#define   DEL_SQ_DW2_MASK                        0x00000003
#define   DEL_SQ_DW2_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 del_sq_dw2:2;
        u32 rsvd_2:30;
    } b;
} del_sq_dw2_t;

#define DEL_SQ_DONE_DW0                          0x0000c0ac
#define   DEL_SQ_DONE_DW0_MASK                   0xffffffff
#define   DEL_SQ_DONE_DW0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 del_sq_done_dw0:32;
    } b;
} del_sq_done_dw0_t;

#define DEL_SQ_DONE_DW1                          0x0000c0b0
#define   DEL_SQ_DONE_DW0_c0b0_MASK              0xffffffff
#define   DEL_SQ_DONE_DW0_c0b0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 del_sq_done_dw0_c0b0:32;
    } b;
} del_sq_done_dw1_t;

#define DEL_SQ_DONE_DW2                          0x0000c0b4
#define   DEL_SQ_DONE_DW2_MASK                   0x00000003
#define   DEL_SQ_DONE_DW2_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 del_sq_done_dw2:2;
        u32 rsvd_2:30;
    } b;
} del_sq_done_dw2_t;

#define SLOT_MISC_CTRL                           0x0000c0bc
#define   TX_FIFO_TH_MASK                        0x00000f00
#define   TX_FIFO_TH_SHIFT                                8
#define   HW_AUTO_DIS_EN_MASK                    0x00000080
#define   HW_AUTO_DIS_EN_SHIFT                            7
#define   DIS_SLOT_AVAIL_MASK                    0x00000040
#define   DIS_SLOT_AVAIL_SHIFT                            6
#define   RD_ABORT_MODE_MASK                     0x00000020
#define   RD_ABORT_MODE_SHIFT                             5
#define   SLOT_FULL_THRESH_MASK                  0x0000001e
#define   SLOT_FULL_THRESH_SHIFT                          1
#define   FUNC_DIS_INIT_ST_MASK                  0x00000001
#define   FUNC_DIS_INIT_ST_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 func_dis_init_st:1;
        u32 slot_full_thresh:4;
        u32 rd_abort_mode:1;
        u32 dis_slot_avail:1;
        u32 hw_auto_dis_en:1;
        u32 tx_fifo_th:4;
        u32 rsvd_12:20;
    } b;
} slot_misc_ctrl_t;

#define INT_MASK_2                               0x0000c0c0
#define   INT_MASK_2_MASK                        0x000007ff
#define   INT_MASK_2_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 int_mask_2:11;
        u32 rsvd_11:21;
    } b;
} int_mask_2_t;

#define MASK_INT_STTS_2                          0x0000c0c4
#define   MASKED_INT_2_MASK                      0x000007ff
#define   MASKED_INT_2_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 masked_int_2:11;
        u32 rsvd_11:21;
    } b;
} mask_int_stts_2_t;

#define INT_MASK_3                               0x0000c0c8
#define   INT_MASK_3_MASK                        0x000007ff
#define   INT_MASK_3_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 int_mask_3:11;
        u32 rsvd_11:21;
    } b;
} int_mask_3_t;

#define MASK_INT_STTS_3                          0x0000c0cc
#define   MASKED_INT_3_MASK                      0x000007ff
#define   MASKED_INT_3_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 masked_int_3:11;
        u32 rsvd_11:21;
    } b;
} mask_int_stts_3_t;

#define INT_MASK_4                               0x0000c0d0
#define   INT_MASK_4_MASK                        0x000007ff
#define   INT_MASK_4_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 int_mask_4:11;
        u32 rsvd_11:21;
    } b;
} int_mask_4_t;

#define MASK_INT_STTS_4                          0x0000c0d4
#define   MASKED_INT_4_MASK                      0x000007ff
#define   MASKED_INT_4_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 masked_int_4:11;
        u32 rsvd_11:21;
    } b;
} mask_int_stts_4_t;

#define CMD_SLOT_VALID_0                         0x0000c100
#define   CMD_SLOT_VLD_DW0_MASK                  0xffffffff
#define   CMD_SLOT_VLD_DW0_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw0:32;
    } b;
} cmd_slot_valid_0_t;

#define CMD_SLOT_VALID_1                         0x0000c104
#define   CMD_SLOT_VLD_DW1_MASK                  0xffffffff
#define   CMD_SLOT_VLD_DW1_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw1:32;
    } b;
} cmd_slot_valid_1_t;

#define CMD_SLOT_VALID_2                         0x0000c108
#define   CMD_SLOT_VLD_DW2_MASK                  0xffffffff
#define   CMD_SLOT_VLD_DW2_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw2:32;
    } b;
} cmd_slot_valid_2_t;

#define CMD_SLOT_VALID_3                         0x0000c10c
#define   CMD_SLOT_VLD_DW3_MASK                  0xffffffff
#define   CMD_SLOT_VLD_DW3_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw3:32;
    } b;
} cmd_slot_valid_3_t;

#define CMD_SLOT_VALID_4                         0x0000c110
#define   CMD_SLOT_VLD_DW4_MASK                  0xffffffff
#define   CMD_SLOT_VLD_DW4_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw4:32;
    } b;
} cmd_slot_valid_4_t;

#define CMD_SLOT_VALID_5                         0x0000c114
#define   CMD_SLOT_VLD_DW5_MASK                  0xffffffff
#define   CMD_SLOT_VLD_DW5_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw5:32;
    } b;
} cmd_slot_valid_5_t;

#define CMD_SLOT_VALID_6                         0x0000c118
#define   CMD_SLOT_VLD_DW6_MASK                  0xffffffff
#define   CMD_SLOT_VLD_DW6_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw6:32;
    } b;
} cmd_slot_valid_6_t;

#define CMD_SLOT_VALID_7                         0x0000c11c
#define   CMD_SLOT_VLD_DW7_MASK                  0xffffffff
#define   CMD_SLOT_VLD_DW7_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw7:32;
    } b;
} cmd_slot_valid_7_t;

#define CMD_SLOT_VALID_8                         0x0000c120
#define   CMD_SLOT_VLD_DW8_MASK                  0xffffffff
#define   CMD_SLOT_VLD_DW8_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw8:32;
    } b;
} cmd_slot_valid_8_t;

#define CMD_SLOT_VALID_9                         0x0000c124
#define   CMD_SLOT_VLD_DW9_MASK                  0xffffffff
#define   CMD_SLOT_VLD_DW9_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw9:32;
    } b;
} cmd_slot_valid_9_t;

#define CMD_SLOT_VALID_10                        0x0000c128
#define   CMD_SLOT_VLD_DW10_MASK                 0xffffffff
#define   CMD_SLOT_VLD_DW10_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw10:32;
    } b;
} cmd_slot_valid_10_t;

#define CMD_SLOT_VALID_11                        0x0000c12c
#define   CMD_SLOT_VLD_DW11_MASK                 0xffffffff
#define   CMD_SLOT_VLD_DW11_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw11:32;
    } b;
} cmd_slot_valid_11_t;

#define CMD_SLOT_VALID_12                        0x0000c130
#define   CMD_SLOT_VLD_DW12_MASK                 0xffffffff
#define   CMD_SLOT_VLD_DW12_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw12:32;
    } b;
} cmd_slot_valid_12_t;

#define CMD_SLOT_VALID_13                        0x0000c134
#define   CMD_SLOT_VLD_DW13_MASK                 0xffffffff
#define   CMD_SLOT_VLD_DW13_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw13:32;
    } b;
} cmd_slot_valid_13_t;

#define CMD_SLOT_VALID_14                        0x0000c138
#define   CMD_SLOT_VLD_DW14_MASK                 0xffffffff
#define   CMD_SLOT_VLD_DW14_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw14:32;
    } b;
} cmd_slot_valid_14_t;

#define CMD_SLOT_VALID_15                        0x0000c13c
#define   CMD_SLOT_VLD_DW15_MASK                 0xffffffff
#define   CMD_SLOT_VLD_DW15_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cmd_slot_vld_dw15:32;
    } b;
} cmd_slot_valid_15_t;

#define NVM_SET_CTRL                             0x0000c180
#define   NVM_SET_VLD_MASK                       0x000ffff0
#define   NVM_SET_VLD_SHIFT                               4
#define   NVM_SET_MODE_MASK                      0x00000006
#define   NVM_SET_MODE_SHIFT                              1
#define   NVM_SET_EN_MASK                        0x00000001
#define   NVM_SET_EN_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 nvm_set_en:1;
        u32 nvm_set_mode:2;
        u32 rsvd_3:1;
        u32 nvm_set_vld:16;
        u32 rsvd_20:12;
    } b;
} nvm_set_ctrl_t;

#define NVM_SET0_ID                              0x0000c184
#define   NVM_SET0_ID3_MASK                      0xff000000
#define   NVM_SET0_ID3_SHIFT                             24
#define   NVM_SET0_ID2_MASK                      0x00ff0000
#define   NVM_SET0_ID2_SHIFT                             16
#define   NVM_SET0_ID1_MASK                      0x0000ff00
#define   NVM_SET0_ID1_SHIFT                              8
#define   NVM_SET0_ID0_MASK                      0x000000ff
#define   NVM_SET0_ID0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nvm_set0_id0:8;
        u32 nvm_set0_id1:8;
        u32 nvm_set0_id2:8;
        u32 nvm_set0_id3:8;
    } b;
} nvm_set0_id_t;

#define NVM_SET1_ID                              0x0000c188
#define   NVM_SET1_ID3_MASK                      0xff000000
#define   NVM_SET1_ID3_SHIFT                             24
#define   NVM_SET1_ID2_MASK                      0x00ff0000
#define   NVM_SET1_ID2_SHIFT                             16
#define   NVM_SET1_ID1_MASK                      0x0000ff00
#define   NVM_SET1_ID1_SHIFT                              8
#define   NVM_SET1_ID0_MASK                      0x000000ff
#define   NVM_SET1_ID0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nvm_set1_id0:8;
        u32 nvm_set1_id1:8;
        u32 nvm_set1_id2:8;
        u32 nvm_set1_id3:8;
    } b;
} nvm_set1_id_t;

#define NVM_SET2_ID                              0x0000c18c
#define   NVM_SET2_ID3_MASK                      0xff000000
#define   NVM_SET2_ID3_SHIFT                             24
#define   NVM_SET2_ID2_MASK                      0x00ff0000
#define   NVM_SET2_ID2_SHIFT                             16
#define   NVM_SET2_ID1_MASK                      0x0000ff00
#define   NVM_SET2_ID1_SHIFT                              8
#define   NVM_SET2_ID0_MASK                      0x000000ff
#define   NVM_SET2_ID0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nvm_set2_id0:8;
        u32 nvm_set2_id1:8;
        u32 nvm_set2_id2:8;
        u32 nvm_set2_id3:8;
    } b;
} nvm_set2_id_t;

#define NVM_SET3_ID                              0x0000c190
#define   NVM_SET3_ID3_MASK                      0xff000000
#define   NVM_SET3_ID3_SHIFT                             24
#define   NVM_SET3_ID2_MASK                      0x00ff0000
#define   NVM_SET3_ID2_SHIFT                             16
#define   NVM_SET3_ID1_MASK                      0x0000ff00
#define   NVM_SET3_ID1_SHIFT                              8
#define   NVM_SET3_ID0_MASK                      0x000000ff
#define   NVM_SET3_ID0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nvm_set3_id0:8;
        u32 nvm_set3_id1:8;
        u32 nvm_set3_id2:8;
        u32 nvm_set3_id3:8;
    } b;
} nvm_set3_id_t;

#define NVM_SET4_ID                              0x0000c194
#define   NVM_SET4_ID3_MASK                      0xff000000
#define   NVM_SET4_ID3_SHIFT                             24
#define   NVM_SET4_ID2_MASK                      0x00ff0000
#define   NVM_SET4_ID2_SHIFT                             16
#define   NVM_SET4_ID1_MASK                      0x0000ff00
#define   NVM_SET4_ID1_SHIFT                              8
#define   NVM_SET4_ID0_MASK                      0x000000ff
#define   NVM_SET4_ID0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nvm_set4_id0:8;
        u32 nvm_set4_id1:8;
        u32 nvm_set4_id2:8;
        u32 nvm_set4_id3:8;
    } b;
} nvm_set4_id_t;

#define NVM_SET5_ID                              0x0000c198
#define   NVM_SET5_ID3_MASK                      0xff000000
#define   NVM_SET5_ID3_SHIFT                             24
#define   NVM_SET5_ID2_MASK                      0x00ff0000
#define   NVM_SET5_ID2_SHIFT                             16
#define   NVM_SET5_ID1_MASK                      0x0000ff00
#define   NVM_SET5_ID1_SHIFT                              8
#define   NVM_SET5_ID0_MASK                      0x000000ff
#define   NVM_SET5_ID0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nvm_set5_id0:8;
        u32 nvm_set5_id1:8;
        u32 nvm_set5_id2:8;
        u32 nvm_set5_id3:8;
    } b;
} nvm_set5_id_t;

#define NVM_SET6_ID                              0x0000c19c
#define   NVM_SET6_ID3_MASK                      0xff000000
#define   NVM_SET6_ID3_SHIFT                             24
#define   NVM_SET6_ID2_MASK                      0x00ff0000
#define   NVM_SET6_ID2_SHIFT                             16
#define   NVM_SET6_ID1_MASK                      0x0000ff00
#define   NVM_SET6_ID1_SHIFT                              8
#define   NVM_SET6_ID0_MASK                      0x000000ff
#define   NVM_SET6_ID0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nvm_set6_id0:8;
        u32 nvm_set6_id1:8;
        u32 nvm_set6_id2:8;
        u32 nvm_set6_id3:8;
    } b;
} nvm_set6_id_t;

#define NVM_SET7_ID                              0x0000c1a0
#define   NVM_SET7_ID3_MASK                      0xff000000
#define   NVM_SET7_ID3_SHIFT                             24
#define   NVM_SET7_ID2_MASK                      0x00ff0000
#define   NVM_SET7_ID2_SHIFT                             16
#define   NVM_SET7_ID1_MASK                      0x0000ff00
#define   NVM_SET7_ID1_SHIFT                              8
#define   NVM_SET7_ID0_MASK                      0x000000ff
#define   NVM_SET7_ID0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nvm_set7_id0:8;
        u32 nvm_set7_id1:8;
        u32 nvm_set7_id2:8;
        u32 nvm_set7_id3:8;
    } b;
} nvm_set7_id_t;

#define NVM_SET8_ID                              0x0000c1a4
#define   NVM_SET8_ID3_MASK                      0xff000000
#define   NVM_SET8_ID3_SHIFT                             24
#define   NVM_SET8_ID2_MASK                      0x00ff0000
#define   NVM_SET8_ID2_SHIFT                             16
#define   NVM_SET8_ID1_MASK                      0x0000ff00
#define   NVM_SET8_ID1_SHIFT                              8
#define   NVM_SET8_ID0_MASK                      0x000000ff
#define   NVM_SET8_ID0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nvm_set8_id0:8;
        u32 nvm_set8_id1:8;
        u32 nvm_set8_id2:8;
        u32 nvm_set8_id3:8;
    } b;
} nvm_set8_id_t;

#define NVM_SET9_ID                              0x0000c1a8
#define   NVM_SET9_ID3_MASK                      0xff000000
#define   NVM_SET9_ID3_SHIFT                             24
#define   NVM_SET9_ID2_MASK                      0x00ff0000
#define   NVM_SET9_ID2_SHIFT                             16
#define   NVM_SET9_ID1_MASK                      0x0000ff00
#define   NVM_SET9_ID1_SHIFT                              8
#define   NVM_SET9_ID0_MASK                      0x000000ff
#define   NVM_SET9_ID0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nvm_set9_id0:8;
        u32 nvm_set9_id1:8;
        u32 nvm_set9_id2:8;
        u32 nvm_set9_id3:8;
    } b;
} nvm_set9_id_t;

#define NVM_SET10_ID                             0x0000c1ac
#define   NVM_SET10_ID3_MASK                     0xff000000
#define   NVM_SET10_ID3_SHIFT                            24
#define   NVM_SET10_ID2_MASK                     0x00ff0000
#define   NVM_SET10_ID2_SHIFT                            16
#define   NVM_SET10_ID1_MASK                     0x0000ff00
#define   NVM_SET10_ID1_SHIFT                             8
#define   NVM_SET10_ID0_MASK                     0x000000ff
#define   NVM_SET10_ID0_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 nvm_set10_id0:8;
        u32 nvm_set10_id1:8;
        u32 nvm_set10_id2:8;
        u32 nvm_set10_id3:8;
    } b;
} nvm_set10_id_t;

#define NVM_SET11_ID                             0x0000c1b0
#define   NVM_SET11_ID3_MASK                     0xff000000
#define   NVM_SET11_ID3_SHIFT                            24
#define   NVM_SET11_ID2_MASK                     0x00ff0000
#define   NVM_SET11_ID2_SHIFT                            16
#define   NVM_SET11_ID1_MASK                     0x0000ff00
#define   NVM_SET11_ID1_SHIFT                             8
#define   NVM_SET11_ID0_MASK                     0x000000ff
#define   NVM_SET11_ID0_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 nvm_set11_id0:8;
        u32 nvm_set11_id1:8;
        u32 nvm_set11_id2:8;
        u32 nvm_set11_id3:8;
    } b;
} nvm_set11_id_t;

#define NVM_SET12_ID                             0x0000c1b4
#define   NVM_SET12_ID3_MASK                     0xff000000
#define   NVM_SET12_ID3_SHIFT                            24
#define   NVM_SET12_ID2_MASK                     0x00ff0000
#define   NVM_SET12_ID2_SHIFT                            16
#define   NVM_SET12_ID1_MASK                     0x0000ff00
#define   NVM_SET12_ID1_SHIFT                             8
#define   NVM_SET12_ID0_MASK                     0x000000ff
#define   NVM_SET12_ID0_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 nvm_set12_id0:8;
        u32 nvm_set12_id1:8;
        u32 nvm_set12_id2:8;
        u32 nvm_set12_id3:8;
    } b;
} nvm_set12_id_t;

#define NVM_SET13_ID                             0x0000c1b8
#define   NVM_SET13_ID3_MASK                     0xff000000
#define   NVM_SET13_ID3_SHIFT                            24
#define   NVM_SET13_ID2_MASK                     0x00ff0000
#define   NVM_SET13_ID2_SHIFT                            16
#define   NVM_SET13_ID1_MASK                     0x0000ff00
#define   NVM_SET13_ID1_SHIFT                             8
#define   NVM_SET13_ID0_MASK                     0x000000ff
#define   NVM_SET13_ID0_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 nvm_set13_id0:8;
        u32 nvm_set13_id1:8;
        u32 nvm_set13_id2:8;
        u32 nvm_set13_id3:8;
    } b;
} nvm_set13_id_t;

#define NVM_SET14_ID                             0x0000c1bc
#define   NVM_SET14_ID3_MASK                     0xff000000
#define   NVM_SET14_ID3_SHIFT                            24
#define   NVM_SET14_ID2_MASK                     0x00ff0000
#define   NVM_SET14_ID2_SHIFT                            16
#define   NVM_SET14_ID1_MASK                     0x0000ff00
#define   NVM_SET14_ID1_SHIFT                             8
#define   NVM_SET14_ID0_MASK                     0x000000ff
#define   NVM_SET14_ID0_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 nvm_set14_id0:8;
        u32 nvm_set14_id1:8;
        u32 nvm_set14_id2:8;
        u32 nvm_set14_id3:8;
    } b;
} nvm_set14_id_t;

#define NVM_SET15_ID                             0x0000c1c0
#define   NVM_SET15_ID3_MASK                     0xff000000
#define   NVM_SET15_ID3_SHIFT                            24
#define   NVM_SET15_ID2_MASK                     0x00ff0000
#define   NVM_SET15_ID2_SHIFT                            16
#define   NVM_SET15_ID1_MASK                     0x0000ff00
#define   NVM_SET15_ID1_SHIFT                             8
#define   NVM_SET15_ID0_MASK                     0x000000ff
#define   NVM_SET15_ID0_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 nvm_set15_id0:8;
        u32 nvm_set15_id1:8;
        u32 nvm_set15_id2:8;
        u32 nvm_set15_id3:8;
    } b;
} nvm_set15_id_t;

#define FILL_CRC_VALUE                           0x0000c1d0
#define   FILL_CRC_VALUE_MASK                    0x0000ffff
#define   FILL_CRC_VALUE_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 fill_crc_value:16;
        u32 rsvd_16:16;
    } b;
} fill_crc_value_t;

#define ABORT_DEBUG_CTRL                         0x0000c1d8
#define   ABORT_DEBUG_DONE_MASK                  0x00010000
#define   ABORT_DEBUG_DONE_SHIFT                         16
#define   ABORT_DEBUG_ADDR_MASK                  0x00003ff0
#define   ABORT_DEBUG_ADDR_SHIFT                          4
#define   ABORT_DEBUG_SEL_MASK                   0x0000000c
#define   ABORT_DEBUG_SEL_SHIFT                           2
#define   ABORT_DEBUG_RW_MASK                    0x00000002
#define   ABORT_DEBUG_RW_SHIFT                            1
#define   ABORT_DEBUG_EN_MASK                    0x00000001
#define   ABORT_DEBUG_EN_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 abort_debug_en:1;
        u32 abort_debug_rw:1;
        u32 abort_debug_sel:2;
        u32 abort_debug_addr:10;
        u32 rsvd_14:2;
        u32 abort_debug_done:1;
        u32 rsvd_17:15;
    } b;
} abort_debug_ctrl_t;

#define ABORT_DEBUG_DATA                         0x0000c1dc
#define   ABORT_DEBUG_DATA_MASK                  0x00ffffff
#define   ABORT_DEBUG_DATA_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 abort_debug_data:24;
        u32 rsvd_24:8;
    } b;
} abort_debug_data_t;

#define DEBUG_CONTROL                            0x0000c1e0
#define   TBL_DEBUG_RDY_MASK                     0x80000000
#define   TBL_DEBUG_RDY_SHIFT                            31
#define   DEBUG_DORCE_RDY_MASK                   0x01000000
#define   DEBUG_DORCE_RDY_SHIFT                          24
#define   DEBUG_SEL_MASK                         0x00ff0000
#define   DEBUG_SEL_SHIFT                                16
#define   DEBUG_EN_MASK                          0x00008000
#define   DEBUG_EN_SHIFT                                 15
#define   DEBUG_ADDR_MASK                        0x00007fff
#define   DEBUG_ADDR_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 debug_addr:15;
        u32 debug_en:1;
        u32 debug_sel:8;
        u32 debug_dorce_rdy:1;
        u32 rsvd_25:6;
        u32 tbl_debug_rdy:1;
    } b;
} debug_control_t;

#define TABLE_DATA                               0x0000c1e4
#define   DEBUG_TBL_DATA_MASK                    0xffffffff
#define   DEBUG_TBL_DATA_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 debug_tbl_data:32;
    } b;
} table_data_t;

#define DEBUG_DATA                               0x0000c1e8
#define   CMD_PROC_DEBUG_DATA_MASK               0xffffffff
#define   CMD_PROC_DEBUG_DATA_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 cmd_proc_debug_data:32;
    } b;
} debug_data_t;

#define DEBUG_SLOT                               0x0000c1ec
#define   DU_CMD_INV_SLOT_MASK                   0x000ffc00
#define   DU_CMD_INV_SLOT_SHIFT                          10
#define   CMD_INV_SLOT_MASK                      0x000003ff
#define   CMD_INV_SLOT_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cmd_inv_slot:10;
        u32 du_cmd_inv_slot:10;
        u32 rsvd_20:12;
    } b;
} debug_slot_t;

#define DATA_XFER_DEBUG_ADDR                     0x0000c1f0
#define   DXF_DEBUG_ADDR_MASK                    0x0000ffff
#define   DXF_DEBUG_ADDR_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 dxf_debug_addr:16;
        u32 rsvd_16:16;
    } b;
} data_xfer_debug_addr_t;

#define DATA_XFER_DEBUG_DATA                     0x0000c1f4
#define   DXF_DEBUG_DATA_MASK                    0xffffffff
#define   DXF_DEBUG_DATA_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 dxf_debug_data:32;
    } b;
} data_xfer_debug_data_t;

#define BTN_DLV_CNT                              0x0000c1f8
#define   BTN_DLV_CNT_MASK                       0xffffffff
#define   BTN_DLV_CNT_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 btn_dlv_cnt:32;
    } b;
} btn_dlv_cnt_t;

#define BTN_DLV_INFO                             0x0000c1fc
#define   LAST_NS_ID_MASK                        0xfe000000
#define   LAST_NS_ID_SHIFT                               25
#define   LAST_SEC_TYPE_MASK                     0x01c00000
#define   LAST_SEC_TYPE_SHIFT                            22
#define   LAST_SQ_ID_MASK                        0x003fc000
#define   LAST_SQ_ID_SHIFT                               14
#define   LAST_CMD_TYPE_MASK                     0x00003c00
#define   LAST_CMD_TYPE_SHIFT                            10
#define   LAST_NVM_CMD_ID_MASK                   0x000003ff
#define   LAST_NVM_CMD_ID_SHIFT                           0
typedef union {
    u32 all;
    struct {
        u32 last_nvm_cmd_id:10;
        u32 last_cmd_type:4;
        u32 last_sq_id:8;
        u32 last_sec_type:3;
        u32 last_ns_id:7;
    } b;
} btn_dlv_info_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ u32 rsvd_0 [12288];
    /* 0xc000 */ unmask_int_stts_t unmask_int_stts;
    /* 0xc004 */ int_mask_1_t int_mask_1;
    /* 0xc008 */ mask_int_stts_1_t mask_int_stts_1;
    /* 0xc00c */ mode_ctrl_t mode_ctrl;
    /* 0xc010 */ abort_ctrl_t abort_ctrl;
    /* 0xc014 */ read_unm_ctrl_t read_unm_ctrl;
    /* 0xc018 */ name_space_ctrl_t name_space_ctrl;
    /* 0xc01c */ read_unm1_ctrl_t read_unm1_ctrl;
    /* 0xc020 */ max_lba_l_t max_lba_l;
    /* 0xc024 */ max_lba_h_t max_lba_h;
    /* 0xc028 */ name_space_vld_0_t name_space_vld_0;
    /* 0xc02c */ name_space_vld_1_t name_space_vld_1;
    /* 0xc030 */ u32 rsvd_c030;
    /* 0xc034 */ hw_cmd_ctrl_t hw_cmd_ctrl;
    /* 0xc038 */ hw_cmd_type_t hw_cmd_type;
    /* 0xc03c */ hw_cmd_opcode_1_t hw_cmd_opcode_1;
    /* 0xc040 */ hw_cmd_opcode_2_t hw_cmd_opcode_2;
    /* 0xc044 */ hw_cmd_opcode_3_t hw_cmd_opcode_3;
    /* 0xc048 */ hw_cmd_type_1_t hw_cmd_type_1;
    /* 0xc04c */ hw_cmd_opcode_4_t hw_cmd_opcode_4;
    /* 0xc050 */ dis_func_ctrl_t dis_func_ctrl;
    /* 0xc054 */ dis_func_0_p0_t dis_func_0_p0;
    /* 0xc058 */ dis_func_0_p1_t dis_func_0_p1;
    /* 0xc05c */ u32 rsvd_c05c;
    /* 0xc060 */ dis_func_done_0_t dis_func_done_0;
    /* 0xc064 */ dis_func_done_1_t dis_func_done_1;
    /* 0xc068 */ u32 rsvd_c068;
    /* 0xc06c */ max_data_sz_t max_data_sz;
    /* 0xc070 */ oc_ctrl_t oc_ctrl;
    /* 0xc074 */ read_err_dtag_t read_err_dtag;
    /* 0xc078 */ oc_meta_base_t oc_meta_base;
    /* 0xc07c */ aes_bypass_dtag_t aes_bypass_dtag;
    /* 0xc080 */ err_cmpl_q_base_t err_cmpl_q_base;
    /* 0xc084 */ err_cmpl_q_ptr_t err_cmpl_q_ptr;
    /* 0xc088 */ abort_q_base_t abort_q_base;
    /* 0xc08c */ abort_q_ptr_t abort_q_ptr;
    /* 0xc090 */ abort_cmpl_q_base_t abort_cmpl_q_base;
    /* 0xc094 */ abort_cmpl_q_ptr_t abort_cmpl_q_ptr;
    /* 0xc098 */ write_zero_ctrl_t write_zero_ctrl;
    /* 0xc09c */ del_sq_ctrl_t del_sq_ctrl;
    /* 0xc0a0 */ del_sq_dw0_t del_sq_dw0;
    /* 0xc0a4 */ del_sq_dw1_t del_sq_dw1;
    /* 0xc0a8 */ del_sq_dw2_t del_sq_dw2;
    /* 0xc0ac */ del_sq_done_dw0_t del_sq_done_dw0;
    /* 0xc0b0 */ del_sq_done_dw1_t del_sq_done_dw1;
    /* 0xc0b4 */ del_sq_done_dw2_t del_sq_done_dw2;
    /* 0xc0b8 */ u32 rsvd_c0b8;
    /* 0xc0bc */ slot_misc_ctrl_t slot_misc_ctrl;
    /* 0xc0c0 */ int_mask_2_t int_mask_2;
    /* 0xc0c4 */ mask_int_stts_2_t mask_int_stts_2;
    /* 0xc0c8 */ int_mask_3_t int_mask_3;
    /* 0xc0cc */ mask_int_stts_3_t mask_int_stts_3;
    /* 0xc0d0 */ int_mask_4_t int_mask_4;
    /* 0xc0d4 */ mask_int_stts_4_t mask_int_stts_4;
    /* 0xc0d8 */ u32 rsvd_c0d8 [10];
    /* 0xc100 */ cmd_slot_valid_0_t cmd_slot_valid_0;
    /* 0xc104 */ cmd_slot_valid_1_t cmd_slot_valid_1;
    /* 0xc108 */ cmd_slot_valid_2_t cmd_slot_valid_2;
    /* 0xc10c */ cmd_slot_valid_3_t cmd_slot_valid_3;
    /* 0xc110 */ cmd_slot_valid_4_t cmd_slot_valid_4;
    /* 0xc114 */ cmd_slot_valid_5_t cmd_slot_valid_5;
    /* 0xc118 */ cmd_slot_valid_6_t cmd_slot_valid_6;
    /* 0xc11c */ cmd_slot_valid_7_t cmd_slot_valid_7;
    /* 0xc120 */ cmd_slot_valid_8_t cmd_slot_valid_8;
    /* 0xc124 */ cmd_slot_valid_9_t cmd_slot_valid_9;
    /* 0xc128 */ cmd_slot_valid_10_t cmd_slot_valid_10;
    /* 0xc12c */ cmd_slot_valid_11_t cmd_slot_valid_11;
    /* 0xc130 */ cmd_slot_valid_12_t cmd_slot_valid_12;
    /* 0xc134 */ cmd_slot_valid_13_t cmd_slot_valid_13;
    /* 0xc138 */ cmd_slot_valid_14_t cmd_slot_valid_14;
    /* 0xc13c */ cmd_slot_valid_15_t cmd_slot_valid_15;
    /* 0xc140 */ u32 rsvd_c140 [16];
    /* 0xc180 */ nvm_set_ctrl_t nvm_set_ctrl;
    /* 0xc184 */ nvm_set0_id_t nvm_set0_id;
    /* 0xc188 */ nvm_set1_id_t nvm_set1_id;
    /* 0xc18c */ nvm_set2_id_t nvm_set2_id;
    /* 0xc190 */ nvm_set3_id_t nvm_set3_id;
    /* 0xc194 */ nvm_set4_id_t nvm_set4_id;
    /* 0xc198 */ nvm_set5_id_t nvm_set5_id;
    /* 0xc19c */ nvm_set6_id_t nvm_set6_id;
    /* 0xc1a0 */ nvm_set7_id_t nvm_set7_id;
    /* 0xc1a4 */ nvm_set8_id_t nvm_set8_id;
    /* 0xc1a8 */ nvm_set9_id_t nvm_set9_id;
    /* 0xc1ac */ nvm_set10_id_t nvm_set10_id;
    /* 0xc1b0 */ nvm_set11_id_t nvm_set11_id;
    /* 0xc1b4 */ nvm_set12_id_t nvm_set12_id;
    /* 0xc1b8 */ nvm_set13_id_t nvm_set13_id;
    /* 0xc1bc */ nvm_set14_id_t nvm_set14_id;
    /* 0xc1c0 */ nvm_set15_id_t nvm_set15_id;
    /* 0xc1c4 */ u32 rsvd_c1c4 [3];
    /* 0xc1d0 */ fill_crc_value_t fill_crc_value;
    /* 0xc1d4 */ u32 rsvd_c1d4;
    /* 0xc1d8 */ abort_debug_ctrl_t abort_debug_ctrl;
    /* 0xc1dc */ abort_debug_data_t abort_debug_data;
    /* 0xc1e0 */ debug_control_t debug_control;
    /* 0xc1e4 */ table_data_t table_data;
    /* 0xc1e8 */ debug_data_t debug_data;
    /* 0xc1ec */ debug_slot_t debug_slot;
    /* 0xc1f0 */ data_xfer_debug_addr_t data_xfer_debug_addr;
    /* 0xc1f4 */ data_xfer_debug_data_t data_xfer_debug_data;
    /* 0xc1f8 */ btn_dlv_cnt_t btn_dlv_cnt;
    /* 0xc1fc */ btn_dlv_info_t btn_dlv_info;
} common_ctrl_regs_t;


#endif /* rev 9 */