//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _FLEX_ADDR_H_
#define _FLEX_ADDR_H_

#define FLEX_SQ0_H_BASE_ADDR_L                   0x00000000
#define   SQ_H_BASE_ADDR_L_MASK                  0xffffffff
#define   SQ_H_BASE_ADDR_L_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l:32;
    } b;
} flex_sq0_h_base_addr_l_t;

#define FLEX_SQ0_H_BASE_ADDR_H                   0x00000004
#define   SQ_H_BASE_ADDR_H_MASK                  0xffffffff
#define   SQ_H_BASE_ADDR_H_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h:32;
    } b;
} flex_sq0_h_base_addr_h_t;

#define FLEX_SQ1_H_BASE_ADDR_L                   0x00000008
#define   SQ_H_BASE_ADDR_L_8_MASK                0xffffffff
#define   SQ_H_BASE_ADDR_L_8_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_8:32;
    } b;
} flex_sq1_h_base_addr_l_t;

#define FLEX_SQ1_H_BASE_ADDR_H                   0x0000000c
#define   SQ_H_BASE_ADDR_H_c_MASK                0xffffffff
#define   SQ_H_BASE_ADDR_H_c_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_c:32;
    } b;
} flex_sq1_h_base_addr_h_t;

#define FLEX_SQ2_H_BASE_ADDR_L                   0x00000010
#define   SQ_H_BASE_ADDR_L_10_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_10_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_10:32;
    } b;
} flex_sq2_h_base_addr_l_t;

#define FLEX_SQ2_H_BASE_ADDR_H                   0x00000014
#define   SQ_H_BASE_ADDR_H_14_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_14_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_14:32;
    } b;
} flex_sq2_h_base_addr_h_t;

#define FLEX_SQ3_H_BASE_ADDR_L                   0x00000018
#define   SQ_H_BASE_ADDR_L_18_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_18_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_18:32;
    } b;
} flex_sq3_h_base_addr_l_t;

#define FLEX_SQ3_H_BASE_ADDR_H                   0x0000001c
#define   SQ_H_BASE_ADDR_H_1c_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_1c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1c:32;
    } b;
} flex_sq3_h_base_addr_h_t;

#define FLEX_SQ4_H_BASE_ADDR_L                   0x00000020
#define   SQ_H_BASE_ADDR_L_20_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_20_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_20:32;
    } b;
} flex_sq4_h_base_addr_l_t;

#define FLEX_SQ4_H_BASE_ADDR_H                   0x00000024
#define   SQ_H_BASE_ADDR_H_24_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_24_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_24:32;
    } b;
} flex_sq4_h_base_addr_h_t;

#define FLEX_SQ5_H_BASE_ADDR_L                   0x00000028
#define   SQ_H_BASE_ADDR_L_28_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_28_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_28:32;
    } b;
} flex_sq5_h_base_addr_l_t;

#define FLEX_SQ5_H_BASE_ADDR_H                   0x0000002c
#define   SQ_H_BASE_ADDR_H_2c_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_2c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_2c:32;
    } b;
} flex_sq5_h_base_addr_h_t;

#define FLEX_SQ6_H_BASE_ADDR_L                   0x00000030
#define   SQ_H_BASE_ADDR_L_30_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_30_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_30:32;
    } b;
} flex_sq6_h_base_addr_l_t;

#define FLEX_SQ6_H_BASE_ADDR_H                   0x00000034
#define   SQ_H_BASE_ADDR_H_34_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_34_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_34:32;
    } b;
} flex_sq6_h_base_addr_h_t;

#define FLEX_SQ7_H_BASE_ADDR_L                   0x00000038
#define   SQ_H_BASE_ADDR_L_38_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_38_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_38:32;
    } b;
} flex_sq7_h_base_addr_l_t;

#define FLEX_SQ7_H_BASE_ADDR_H                   0x0000003c
#define   SQ_H_BASE_ADDR_H_3c_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_3c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_3c:32;
    } b;
} flex_sq7_h_base_addr_h_t;

#define FLEX_SQ8_H_BASE_ADDR_L                   0x00000040
#define   SQ_H_BASE_ADDR_L_40_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_40_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_40:32;
    } b;
} flex_sq8_h_base_addr_l_t;

#define FLEX_SQ8_H_BASE_ADDR_H                   0x00000044
#define   SQ_H_BASE_ADDR_H_44_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_44_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_44:32;
    } b;
} flex_sq8_h_base_addr_h_t;

#define FLEX_SQ9_H_BASE_ADDR_L                   0x00000048
#define   SQ_H_BASE_ADDR_L_48_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_48_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_48:32;
    } b;
} flex_sq9_h_base_addr_l_t;

#define FLEX_SQ9_H_BASE_ADDR_H                   0x0000004c
#define   SQ_H_BASE_ADDR_H_4c_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_4c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_4c:32;
    } b;
} flex_sq9_h_base_addr_h_t;

#define FLEX_SQ10_H_BASE_ADDR_L                  0x00000050
#define   SQ_H_BASE_ADDR_L_50_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_50_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_50:32;
    } b;
} flex_sq10_h_base_addr_l_t;

#define FLEX_SQ10_H_BASE_ADDR_H                  0x00000054
#define   SQ_H_BASE_ADDR_H_54_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_54_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_54:32;
    } b;
} flex_sq10_h_base_addr_h_t;

#define FLEX_SQ11_H_BASE_ADDR_L                  0x00000058
#define   SQ_H_BASE_ADDR_L_58_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_58_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_58:32;
    } b;
} flex_sq11_h_base_addr_l_t;

#define FLEX_SQ11_H_BASE_ADDR_H                  0x0000005c
#define   SQ_H_BASE_ADDR_H_5c_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_5c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_5c:32;
    } b;
} flex_sq11_h_base_addr_h_t;

#define FLEX_SQ12_H_BASE_ADDR_L                  0x00000060
#define   SQ_H_BASE_ADDR_L_60_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_60_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_60:32;
    } b;
} flex_sq12_h_base_addr_l_t;

#define FLEX_SQ12_H_BASE_ADDR_H                  0x00000064
#define   SQ_H_BASE_ADDR_H_64_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_64_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_64:32;
    } b;
} flex_sq12_h_base_addr_h_t;

#define FLEX_SQ13_H_BASE_ADDR_L                  0x00000068
#define   SQ_H_BASE_ADDR_L_68_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_68_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_68:32;
    } b;
} flex_sq13_h_base_addr_l_t;

#define FLEX_SQ13_H_BASE_ADDR_H                  0x0000006c
#define   SQ_H_BASE_ADDR_H_6c_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_6c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_6c:32;
    } b;
} flex_sq13_h_base_addr_h_t;

#define FLEX_SQ14_H_BASE_ADDR_L                  0x00000070
#define   SQ_H_BASE_ADDR_L_70_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_70_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_70:32;
    } b;
} flex_sq14_h_base_addr_l_t;

#define FLEX_SQ14_H_BASE_ADDR_H                  0x00000074
#define   SQ_H_BASE_ADDR_H_74_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_74_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_74:32;
    } b;
} flex_sq14_h_base_addr_h_t;

#define FLEX_SQ15_H_BASE_ADDR_L                  0x00000078
#define   SQ_H_BASE_ADDR_L_78_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_78_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_78:32;
    } b;
} flex_sq15_h_base_addr_l_t;

#define FLEX_SQ15_H_BASE_ADDR_H                  0x0000007c
#define   SQ_H_BASE_ADDR_H_7c_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_7c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_7c:32;
    } b;
} flex_sq15_h_base_addr_h_t;

#define FLEX_SQ16_H_BASE_ADDR_L                  0x00000080
#define   SQ_H_BASE_ADDR_L_80_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_80_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_80:32;
    } b;
} flex_sq16_h_base_addr_l_t;

#define FLEX_SQ16_H_BASE_ADDR_H                  0x00000084
#define   SQ_H_BASE_ADDR_H_84_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_84_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_84:32;
    } b;
} flex_sq16_h_base_addr_h_t;

#define FLEX_SQ17_H_BASE_ADDR_L                  0x00000088
#define   SQ_H_BASE_ADDR_L_88_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_88_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_88:32;
    } b;
} flex_sq17_h_base_addr_l_t;

#define FLEX_SQ17_H_BASE_ADDR_H                  0x0000008c
#define   SQ_H_BASE_ADDR_H_8c_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_8c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_8c:32;
    } b;
} flex_sq17_h_base_addr_h_t;

#define FLEX_SQ18_H_BASE_ADDR_L                  0x00000090
#define   SQ_H_BASE_ADDR_L_90_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_90_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_90:32;
    } b;
} flex_sq18_h_base_addr_l_t;

#define FLEX_SQ18_H_BASE_ADDR_H                  0x00000094
#define   SQ_H_BASE_ADDR_H_94_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_94_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_94:32;
    } b;
} flex_sq18_h_base_addr_h_t;

#define FLEX_SQ19_H_BASE_ADDR_L                  0x00000098
#define   SQ_H_BASE_ADDR_L_98_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_98_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_98:32;
    } b;
} flex_sq19_h_base_addr_l_t;

#define FLEX_SQ19_H_BASE_ADDR_H                  0x0000009c
#define   SQ_H_BASE_ADDR_H_9c_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_9c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_9c:32;
    } b;
} flex_sq19_h_base_addr_h_t;

#define FLEX_SQ20_H_BASE_ADDR_L                  0x000000a0
#define   SQ_H_BASE_ADDR_L_a0_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_a0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_a0:32;
    } b;
} flex_sq20_h_base_addr_l_t;

#define FLEX_SQ20_H_BASE_ADDR_H                  0x000000a4
#define   SQ_H_BASE_ADDR_H_a4_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_a4_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_a4:32;
    } b;
} flex_sq20_h_base_addr_h_t;

#define FLEX_SQ21_H_BASE_ADDR_L                  0x000000a8
#define   SQ_H_BASE_ADDR_L_a8_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_a8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_a8:32;
    } b;
} flex_sq21_h_base_addr_l_t;

#define FLEX_SQ21_H_BASE_ADDR_H                  0x000000ac
#define   SQ_H_BASE_ADDR_H_ac_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_ac_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_ac:32;
    } b;
} flex_sq21_h_base_addr_h_t;

#define FLEX_SQ22_H_BASE_ADDR_L                  0x000000b0
#define   SQ_H_BASE_ADDR_L_b0_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_b0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_b0:32;
    } b;
} flex_sq22_h_base_addr_l_t;

#define FLEX_SQ22_H_BASE_ADDR_H                  0x000000b4
#define   SQ_H_BASE_ADDR_H_b4_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_b4_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_b4:32;
    } b;
} flex_sq22_h_base_addr_h_t;

#define FLEX_SQ23_H_BASE_ADDR_L                  0x000000b8
#define   SQ_H_BASE_ADDR_L_b8_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_b8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_b8:32;
    } b;
} flex_sq23_h_base_addr_l_t;

#define FLEX_SQ23_H_BASE_ADDR_H                  0x000000bc
#define   SQ_H_BASE_ADDR_H_bc_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_bc_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_bc:32;
    } b;
} flex_sq23_h_base_addr_h_t;

#define FLEX_SQ24_H_BASE_ADDR_L                  0x000000c0
#define   SQ_H_BASE_ADDR_L_c0_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_c0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_c0:32;
    } b;
} flex_sq24_h_base_addr_l_t;

#define FLEX_SQ24_H_BASE_ADDR_H                  0x000000c4
#define   SQ_H_BASE_ADDR_H_c4_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_c4_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_c4:32;
    } b;
} flex_sq24_h_base_addr_h_t;

#define FLEX_SQ25_H_BASE_ADDR_L                  0x000000c8
#define   SQ_H_BASE_ADDR_L_c8_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_c8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_c8:32;
    } b;
} flex_sq25_h_base_addr_l_t;

#define FLEX_SQ25_H_BASE_ADDR_H                  0x000000cc
#define   SQ_H_BASE_ADDR_H_cc_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_cc_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_cc:32;
    } b;
} flex_sq25_h_base_addr_h_t;

#define FLEX_SQ26_H_BASE_ADDR_L                  0x000000d0
#define   SQ_H_BASE_ADDR_L_d0_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_d0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_d0:32;
    } b;
} flex_sq26_h_base_addr_l_t;

#define FLEX_SQ26_H_BASE_ADDR_H                  0x000000d4
#define   SQ_H_BASE_ADDR_H_d4_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_d4_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_d4:32;
    } b;
} flex_sq26_h_base_addr_h_t;

#define FLEX_SQ27_H_BASE_ADDR_L                  0x000000d8
#define   SQ_H_BASE_ADDR_L_d8_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_d8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_d8:32;
    } b;
} flex_sq27_h_base_addr_l_t;

#define FLEX_SQ27_H_BASE_ADDR_H                  0x000000dc
#define   SQ_H_BASE_ADDR_H_dc_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_dc_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_dc:32;
    } b;
} flex_sq27_h_base_addr_h_t;

#define FLEX_SQ28_H_BASE_ADDR_L                  0x000000e0
#define   SQ_H_BASE_ADDR_L_e0_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_e0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_e0:32;
    } b;
} flex_sq28_h_base_addr_l_t;

#define FLEX_SQ28_H_BASE_ADDR_H                  0x000000e4
#define   SQ_H_BASE_ADDR_H_e4_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_e4_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_e4:32;
    } b;
} flex_sq28_h_base_addr_h_t;

#define FLEX_SQ29_H_BASE_ADDR_L                  0x000000e8
#define   SQ_H_BASE_ADDR_L_e8_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_e8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_e8:32;
    } b;
} flex_sq29_h_base_addr_l_t;

#define FLEX_SQ29_H_BASE_ADDR_H                  0x000000ec
#define   SQ_H_BASE_ADDR_H_ec_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_ec_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_ec:32;
    } b;
} flex_sq29_h_base_addr_h_t;

#define FLEX_SQ30_H_BASE_ADDR_L                  0x000000f0
#define   SQ_H_BASE_ADDR_L_f0_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_f0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_f0:32;
    } b;
} flex_sq30_h_base_addr_l_t;

#define FLEX_SQ30_H_BASE_ADDR_H                  0x000000f4
#define   SQ_H_BASE_ADDR_H_f4_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_f4_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_f4:32;
    } b;
} flex_sq30_h_base_addr_h_t;

#define FLEX_SQ31_H_BASE_ADDR_L                  0x000000f8
#define   SQ_H_BASE_ADDR_L_f8_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_L_f8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_f8:32;
    } b;
} flex_sq31_h_base_addr_l_t;

#define FLEX_SQ31_H_BASE_ADDR_H                  0x000000fc
#define   SQ_H_BASE_ADDR_H_fc_MASK               0xffffffff
#define   SQ_H_BASE_ADDR_H_fc_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_fc:32;
    } b;
} flex_sq31_h_base_addr_h_t;

#define FLEX_SQ32_H_BASE_ADDR_L                  0x00000100
#define   SQ_H_BASE_ADDR_L_100_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_100_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_100:32;
    } b;
} flex_sq32_h_base_addr_l_t;

#define FLEX_SQ32_H_BASE_ADDR_H                  0x00000104
#define   SQ_H_BASE_ADDR_H_104_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_104_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_104:32;
    } b;
} flex_sq32_h_base_addr_h_t;

#define FLEX_SQ33_H_BASE_ADDR_L                  0x00000108
#define   SQ_H_BASE_ADDR_L_108_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_108_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_108:32;
    } b;
} flex_sq33_h_base_addr_l_t;

#define FLEX_SQ33_H_BASE_ADDR_H                  0x0000010c
#define   SQ_H_BASE_ADDR_H_10c_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_10c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_10c:32;
    } b;
} flex_sq33_h_base_addr_h_t;

#define FLEX_SQ34_H_BASE_ADDR_L                  0x00000110
#define   SQ_H_BASE_ADDR_L_110_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_110_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_110:32;
    } b;
} flex_sq34_h_base_addr_l_t;

#define FLEX_SQ34_H_BASE_ADDR_H                  0x00000114
#define   SQ_H_BASE_ADDR_H_114_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_114_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_114:32;
    } b;
} flex_sq34_h_base_addr_h_t;

#define FLEX_SQ35_H_BASE_ADDR_L                  0x00000118
#define   SQ_H_BASE_ADDR_L_118_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_118_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_118:32;
    } b;
} flex_sq35_h_base_addr_l_t;

#define FLEX_SQ35_H_BASE_ADDR_H                  0x0000011c
#define   SQ_H_BASE_ADDR_H_11c_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_11c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_11c:32;
    } b;
} flex_sq35_h_base_addr_h_t;

#define FLEX_SQ36_H_BASE_ADDR_L                  0x00000120
#define   SQ_H_BASE_ADDR_L_120_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_120_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_120:32;
    } b;
} flex_sq36_h_base_addr_l_t;

#define FLEX_SQ36_H_BASE_ADDR_H                  0x00000124
#define   SQ_H_BASE_ADDR_H_124_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_124_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_124:32;
    } b;
} flex_sq36_h_base_addr_h_t;

#define FLEX_SQ37_H_BASE_ADDR_L                  0x00000128
#define   SQ_H_BASE_ADDR_L_128_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_128_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_128:32;
    } b;
} flex_sq37_h_base_addr_l_t;

#define FLEX_SQ37_H_BASE_ADDR_H                  0x0000012c
#define   SQ_H_BASE_ADDR_H_12c_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_12c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_12c:32;
    } b;
} flex_sq37_h_base_addr_h_t;

#define FLEX_SQ38_H_BASE_ADDR_L                  0x00000130
#define   SQ_H_BASE_ADDR_L_130_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_130_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_130:32;
    } b;
} flex_sq38_h_base_addr_l_t;

#define FLEX_SQ38_H_BASE_ADDR_H                  0x00000134
#define   SQ_H_BASE_ADDR_H_134_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_134_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_134:32;
    } b;
} flex_sq38_h_base_addr_h_t;

#define FLEX_SQ39_H_BASE_ADDR_L                  0x00000138
#define   SQ_H_BASE_ADDR_L_138_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_138_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_138:32;
    } b;
} flex_sq39_h_base_addr_l_t;

#define FLEX_SQ39_H_BASE_ADDR_H                  0x0000013c
#define   SQ_H_BASE_ADDR_H_13c_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_13c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_13c:32;
    } b;
} flex_sq39_h_base_addr_h_t;

#define FLEX_SQ40_H_BASE_ADDR_L                  0x00000140
#define   SQ_H_BASE_ADDR_L_140_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_140_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_140:32;
    } b;
} flex_sq40_h_base_addr_l_t;

#define FLEX_SQ40_H_BASE_ADDR_H                  0x00000144
#define   SQ_H_BASE_ADDR_H_144_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_144_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_144:32;
    } b;
} flex_sq40_h_base_addr_h_t;

#define FLEX_SQ41_H_BASE_ADDR_L                  0x00000148
#define   SQ_H_BASE_ADDR_L_148_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_148_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_148:32;
    } b;
} flex_sq41_h_base_addr_l_t;

#define FLEX_SQ41_H_BASE_ADDR_H                  0x0000014c
#define   SQ_H_BASE_ADDR_H_14c_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_14c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_14c:32;
    } b;
} flex_sq41_h_base_addr_h_t;

#define FLEX_SQ42_H_BASE_ADDR_L                  0x00000150
#define   SQ_H_BASE_ADDR_L_150_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_150_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_150:32;
    } b;
} flex_sq42_h_base_addr_l_t;

#define FLEX_SQ42_H_BASE_ADDR_H                  0x00000154
#define   SQ_H_BASE_ADDR_H_154_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_154_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_154:32;
    } b;
} flex_sq42_h_base_addr_h_t;

#define FLEX_SQ43_H_BASE_ADDR_L                  0x00000158
#define   SQ_H_BASE_ADDR_L_158_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_158_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_158:32;
    } b;
} flex_sq43_h_base_addr_l_t;

#define FLEX_SQ43_H_BASE_ADDR_H                  0x0000015c
#define   SQ_H_BASE_ADDR_H_15c_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_15c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_15c:32;
    } b;
} flex_sq43_h_base_addr_h_t;

#define FLEX_SQ44_H_BASE_ADDR_L                  0x00000160
#define   SQ_H_BASE_ADDR_L_160_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_160_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_160:32;
    } b;
} flex_sq44_h_base_addr_l_t;

#define FLEX_SQ44_H_BASE_ADDR_H                  0x00000164
#define   SQ_H_BASE_ADDR_H_164_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_164_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_164:32;
    } b;
} flex_sq44_h_base_addr_h_t;

#define FLEX_SQ45_H_BASE_ADDR_L                  0x00000168
#define   SQ_H_BASE_ADDR_L_168_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_168_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_168:32;
    } b;
} flex_sq45_h_base_addr_l_t;

#define FLEX_SQ45_H_BASE_ADDR_H                  0x0000016c
#define   SQ_H_BASE_ADDR_H_16c_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_16c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_16c:32;
    } b;
} flex_sq45_h_base_addr_h_t;

#define FLEX_SQ46_H_BASE_ADDR_L                  0x00000170
#define   SQ_H_BASE_ADDR_L_170_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_170_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_170:32;
    } b;
} flex_sq46_h_base_addr_l_t;

#define FLEX_SQ46_H_BASE_ADDR_H                  0x00000174
#define   SQ_H_BASE_ADDR_H_174_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_174_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_174:32;
    } b;
} flex_sq46_h_base_addr_h_t;

#define FLEX_SQ47_H_BASE_ADDR_L                  0x00000178
#define   SQ_H_BASE_ADDR_L_178_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_178_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_178:32;
    } b;
} flex_sq47_h_base_addr_l_t;

#define FLEX_SQ47_H_BASE_ADDR_H                  0x0000017c
#define   SQ_H_BASE_ADDR_H_17c_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_17c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_17c:32;
    } b;
} flex_sq47_h_base_addr_h_t;

#define FLEX_SQ48_H_BASE_ADDR_L                  0x00000180
#define   SQ_H_BASE_ADDR_L_180_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_180_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_180:32;
    } b;
} flex_sq48_h_base_addr_l_t;

#define FLEX_SQ48_H_BASE_ADDR_H                  0x00000184
#define   SQ_H_BASE_ADDR_H_184_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_184_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_184:32;
    } b;
} flex_sq48_h_base_addr_h_t;

#define FLEX_SQ49_H_BASE_ADDR_L                  0x00000188
#define   SQ_H_BASE_ADDR_L_188_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_188_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_188:32;
    } b;
} flex_sq49_h_base_addr_l_t;

#define FLEX_SQ49_H_BASE_ADDR_H                  0x0000018c
#define   SQ_H_BASE_ADDR_H_18c_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_18c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_18c:32;
    } b;
} flex_sq49_h_base_addr_h_t;

#define FLEX_SQ50_H_BASE_ADDR_L                  0x00000190
#define   SQ_H_BASE_ADDR_L_190_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_190_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_190:32;
    } b;
} flex_sq50_h_base_addr_l_t;

#define FLEX_SQ50_H_BASE_ADDR_H                  0x00000194
#define   SQ_H_BASE_ADDR_H_194_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_194_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_194:32;
    } b;
} flex_sq50_h_base_addr_h_t;

#define FLEX_SQ51_H_BASE_ADDR_L                  0x00000198
#define   SQ_H_BASE_ADDR_L_198_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_198_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_198:32;
    } b;
} flex_sq51_h_base_addr_l_t;

#define FLEX_SQ51_H_BASE_ADDR_H                  0x0000019c
#define   SQ_H_BASE_ADDR_H_19c_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_19c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_19c:32;
    } b;
} flex_sq51_h_base_addr_h_t;

#define FLEX_SQ52_H_BASE_ADDR_L                  0x000001a0
#define   SQ_H_BASE_ADDR_L_1a0_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_1a0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_1a0:32;
    } b;
} flex_sq52_h_base_addr_l_t;

#define FLEX_SQ52_H_BASE_ADDR_H                  0x000001a4
#define   SQ_H_BASE_ADDR_H_1a4_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_1a4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1a4:32;
    } b;
} flex_sq52_h_base_addr_h_t;

#define FLEX_SQ53_H_BASE_ADDR_L                  0x000001a8
#define   SQ_H_BASE_ADDR_L_1a8_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_1a8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_1a8:32;
    } b;
} flex_sq53_h_base_addr_l_t;

#define FLEX_SQ53_H_BASE_ADDR_H                  0x000001ac
#define   SQ_H_BASE_ADDR_H_1ac_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_1ac_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1ac:32;
    } b;
} flex_sq53_h_base_addr_h_t;

#define FLEX_SQ54_H_BASE_ADDR_L                  0x000001b0
#define   SQ_H_BASE_ADDR_L_1b0_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_1b0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_1b0:32;
    } b;
} flex_sq54_h_base_addr_l_t;

#define FLEX_SQ54_H_BASE_ADDR_H                  0x000001b4
#define   SQ_H_BASE_ADDR_H_1b4_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_1b4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1b4:32;
    } b;
} flex_sq54_h_base_addr_h_t;

#define FLEX_SQ55_H_BASE_ADDR_L                  0x000001b8
#define   SQ_H_BASE_ADDR_L_1b8_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_1b8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_1b8:32;
    } b;
} flex_sq55_h_base_addr_l_t;

#define FLEX_SQ55_H_BASE_ADDR_H                  0x000001bc
#define   SQ_H_BASE_ADDR_H_1bc_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_1bc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1bc:32;
    } b;
} flex_sq55_h_base_addr_h_t;

#define FLEX_SQ56_H_BASE_ADDR_L                  0x000001c0
#define   SQ_H_BASE_ADDR_L_1c0_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_1c0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_1c0:32;
    } b;
} flex_sq56_h_base_addr_l_t;

#define FLEX_SQ56_H_BASE_ADDR_H                  0x000001c4
#define   SQ_H_BASE_ADDR_H_1c4_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_1c4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1c4:32;
    } b;
} flex_sq56_h_base_addr_h_t;

#define FLEX_SQ57_H_BASE_ADDR_L                  0x000001c8
#define   SQ_H_BASE_ADDR_L_1c8_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_1c8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_1c8:32;
    } b;
} flex_sq57_h_base_addr_l_t;

#define FLEX_SQ57_H_BASE_ADDR_H                  0x000001cc
#define   SQ_H_BASE_ADDR_H_1cc_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_1cc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1cc:32;
    } b;
} flex_sq57_h_base_addr_h_t;

#define FLEX_SQ58_H_BASE_ADDR_L                  0x000001d0
#define   SQ_H_BASE_ADDR_L_1d0_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_1d0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_1d0:32;
    } b;
} flex_sq58_h_base_addr_l_t;

#define FLEX_SQ58_H_BASE_ADDR_H                  0x000001d4
#define   SQ_H_BASE_ADDR_H_1d4_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_1d4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1d4:32;
    } b;
} flex_sq58_h_base_addr_h_t;

#define FLEX_SQ59_H_BASE_ADDR_L                  0x000001d8
#define   SQ_H_BASE_ADDR_L_1d8_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_1d8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_1d8:32;
    } b;
} flex_sq59_h_base_addr_l_t;

#define FLEX_SQ59_H_BASE_ADDR_H                  0x000001dc
#define   SQ_H_BASE_ADDR_H_1dc_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_1dc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1dc:32;
    } b;
} flex_sq59_h_base_addr_h_t;

#define FLEX_SQ60_H_BASE_ADDR_L                  0x000001e0
#define   SQ_H_BASE_ADDR_L_1e0_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_1e0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_1e0:32;
    } b;
} flex_sq60_h_base_addr_l_t;

#define FLEX_SQ60_H_BASE_ADDR_H                  0x000001e4
#define   SQ_H_BASE_ADDR_H_1e4_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_1e4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1e4:32;
    } b;
} flex_sq60_h_base_addr_h_t;

#define FLEX_SQ61_H_BASE_ADDR_L                  0x000001e8
#define   SQ_H_BASE_ADDR_L_1e8_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_1e8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_1e8:32;
    } b;
} flex_sq61_h_base_addr_l_t;

#define FLEX_SQ61_H_BASE_ADDR_H                  0x000001ec
#define   SQ_H_BASE_ADDR_H_1ec_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_1ec_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1ec:32;
    } b;
} flex_sq61_h_base_addr_h_t;

#define FLEX_SQ62_H_BASE_ADDR_L                  0x000001f0
#define   SQ_H_BASE_ADDR_L_1f0_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_1f0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_1f0:32;
    } b;
} flex_sq62_h_base_addr_l_t;

#define FLEX_SQ62_H_BASE_ADDR_H                  0x000001f4
#define   SQ_H_BASE_ADDR_H_1f4_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_1f4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1f4:32;
    } b;
} flex_sq62_h_base_addr_h_t;

#define FLEX_SQ63_H_BASE_ADDR_L                  0x000001f8
#define   SQ_H_BASE_ADDR_L_1f8_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_1f8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_1f8:32;
    } b;
} flex_sq63_h_base_addr_l_t;

#define FLEX_SQ63_H_BASE_ADDR_H                  0x000001fc
#define   SQ_H_BASE_ADDR_H_1fc_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_1fc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_1fc:32;
    } b;
} flex_sq63_h_base_addr_h_t;

#define FLEX_SQ64_H_BASE_ADDR_L                  0x00000200
#define   SQ_H_BASE_ADDR_L_200_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_200_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_200:32;
    } b;
} flex_sq64_h_base_addr_l_t;

#define FLEX_SQ64_H_BASE_ADDR_H                  0x00000204
#define   SQ_H_BASE_ADDR_H_204_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_204_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_204:32;
    } b;
} flex_sq64_h_base_addr_h_t;

#define FLEX_SQ65_H_BASE_ADDR_L                  0x00000208
#define   SQ_H_BASE_ADDR_L_208_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_L_208_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_l_208:32;
    } b;
} flex_sq65_h_base_addr_l_t;

#define FLEX_SQ65_H_BASE_ADDR_H                  0x0000020c
#define   SQ_H_BASE_ADDR_H_20c_MASK              0xffffffff
#define   SQ_H_BASE_ADDR_H_20c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 sq_h_base_addr_h_20c:32;
    } b;
} flex_sq65_h_base_addr_h_t;

#define FLEX_CQ0_H_BASE_ADDR_L                   0x00000420
#define   CQ_H_BASE_ADDR_L_MASK                  0xffffffff
#define   CQ_H_BASE_ADDR_L_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l:32;
    } b;
} flex_cq0_h_base_addr_l_t;

#define FLEX_CQ0_H_BASE_ADDR_H                   0x00000424
#define   CQ_H_BASE_ADDR_H_MASK                  0xffffffff
#define   CQ_H_BASE_ADDR_H_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h:32;
    } b;
} flex_cq0_h_base_addr_h_t;

#define FLEX_CQ1_H_BASE_ADDR_L                   0x00000428
#define   CQ_H_BASE_ADDR_L_428_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_428_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_428:32;
    } b;
} flex_cq1_h_base_addr_l_t;

#define FLEX_CQ1_H_BASE_ADDR_H                   0x0000042c
#define   CQ_H_BASE_ADDR_H_42c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_42c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_42c:32;
    } b;
} flex_cq1_h_base_addr_h_t;

#define FLEX_CQ2_H_BASE_ADDR_L                   0x00000430
#define   CQ_H_BASE_ADDR_L_430_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_430_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_430:32;
    } b;
} flex_cq2_h_base_addr_l_t;

#define FLEX_CQ2_H_BASE_ADDR_H                   0x00000434
#define   CQ_H_BASE_ADDR_H_434_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_434_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_434:32;
    } b;
} flex_cq2_h_base_addr_h_t;

#define FLEX_CQ3_H_BASE_ADDR_L                   0x00000438
#define   CQ_H_BASE_ADDR_L_438_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_438_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_438:32;
    } b;
} flex_cq3_h_base_addr_l_t;

#define FLEX_CQ3_H_BASE_ADDR_H                   0x0000043c
#define   CQ_H_BASE_ADDR_H_43c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_43c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_43c:32;
    } b;
} flex_cq3_h_base_addr_h_t;

#define FLEX_CQ4_H_BASE_ADDR_L                   0x00000440
#define   CQ_H_BASE_ADDR_L_440_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_440_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_440:32;
    } b;
} flex_cq4_h_base_addr_l_t;

#define FLEX_CQ4_H_BASE_ADDR_H                   0x00000444
#define   CQ_H_BASE_ADDR_H_444_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_444_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_444:32;
    } b;
} flex_cq4_h_base_addr_h_t;

#define FLEX_CQ5_H_BASE_ADDR_L                   0x00000448
#define   CQ_H_BASE_ADDR_L_448_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_448_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_448:32;
    } b;
} flex_cq5_h_base_addr_l_t;

#define FLEX_CQ5_H_BASE_ADDR_H                   0x0000044c
#define   CQ_H_BASE_ADDR_H_44c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_44c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_44c:32;
    } b;
} flex_cq5_h_base_addr_h_t;

#define FLEX_CQ6_H_BASE_ADDR_L                   0x00000450
#define   CQ_H_BASE_ADDR_L_450_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_450_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_450:32;
    } b;
} flex_cq6_h_base_addr_l_t;

#define FLEX_CQ6_H_BASE_ADDR_H                   0x00000454
#define   CQ_H_BASE_ADDR_H_454_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_454_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_454:32;
    } b;
} flex_cq6_h_base_addr_h_t;

#define FLEX_CQ7_H_BASE_ADDR_L                   0x00000458
#define   CQ_H_BASE_ADDR_L_458_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_458_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_458:32;
    } b;
} flex_cq7_h_base_addr_l_t;

#define FLEX_CQ7_H_BASE_ADDR_H                   0x0000045c
#define   CQ_H_BASE_ADDR_H_45c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_45c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_45c:32;
    } b;
} flex_cq7_h_base_addr_h_t;

#define FLEX_CQ8_H_BASE_ADDR_L                   0x00000460
#define   CQ_H_BASE_ADDR_L_460_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_460_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_460:32;
    } b;
} flex_cq8_h_base_addr_l_t;

#define FLEX_CQ8_H_BASE_ADDR_H                   0x00000464
#define   CQ_H_BASE_ADDR_H_464_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_464_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_464:32;
    } b;
} flex_cq8_h_base_addr_h_t;

#define FLEX_CQ9_H_BASE_ADDR_L                   0x00000468
#define   CQ_H_BASE_ADDR_L_468_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_468_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_468:32;
    } b;
} flex_cq9_h_base_addr_l_t;

#define FLEX_CQ9_H_BASE_ADDR_H                   0x0000046c
#define   CQ_H_BASE_ADDR_H_46c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_46c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_46c:32;
    } b;
} flex_cq9_h_base_addr_h_t;

#define FLEX_CQ10_H_BASE_ADDR_L                  0x00000470
#define   CQ_H_BASE_ADDR_L_470_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_470_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_470:32;
    } b;
} flex_cq10_h_base_addr_l_t;

#define FLEX_CQ10_H_BASE_ADDR_H                  0x00000474
#define   CQ_H_BASE_ADDR_H_474_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_474_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_474:32;
    } b;
} flex_cq10_h_base_addr_h_t;

#define FLEX_CQ11_H_BASE_ADDR_L                  0x00000478
#define   CQ_H_BASE_ADDR_L_478_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_478_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_478:32;
    } b;
} flex_cq11_h_base_addr_l_t;

#define FLEX_CQ11_H_BASE_ADDR_H                  0x0000047c
#define   CQ_H_BASE_ADDR_H_47c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_47c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_47c:32;
    } b;
} flex_cq11_h_base_addr_h_t;

#define FLEX_CQ12_H_BASE_ADDR_L                  0x00000480
#define   CQ_H_BASE_ADDR_L_480_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_480_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_480:32;
    } b;
} flex_cq12_h_base_addr_l_t;

#define FLEX_CQ12_H_BASE_ADDR_H                  0x00000484
#define   CQ_H_BASE_ADDR_H_484_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_484_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_484:32;
    } b;
} flex_cq12_h_base_addr_h_t;

#define FLEX_CQ13_H_BASE_ADDR_L                  0x00000488
#define   CQ_H_BASE_ADDR_L_488_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_488_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_488:32;
    } b;
} flex_cq13_h_base_addr_l_t;

#define FLEX_CQ13_H_BASE_ADDR_H                  0x0000048c
#define   CQ_H_BASE_ADDR_H_48c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_48c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_48c:32;
    } b;
} flex_cq13_h_base_addr_h_t;

#define FLEX_CQ14_H_BASE_ADDR_L                  0x00000490
#define   CQ_H_BASE_ADDR_L_490_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_490_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_490:32;
    } b;
} flex_cq14_h_base_addr_l_t;

#define FLEX_CQ14_H_BASE_ADDR_H                  0x00000494
#define   CQ_H_BASE_ADDR_H_494_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_494_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_494:32;
    } b;
} flex_cq14_h_base_addr_h_t;

#define FLEX_CQ15_H_BASE_ADDR_L                  0x00000498
#define   CQ_H_BASE_ADDR_L_498_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_498_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_498:32;
    } b;
} flex_cq15_h_base_addr_l_t;

#define FLEX_CQ15_H_BASE_ADDR_H                  0x0000049c
#define   CQ_H_BASE_ADDR_H_49c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_49c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_49c:32;
    } b;
} flex_cq15_h_base_addr_h_t;

#define FLEX_CQ16_H_BASE_ADDR_L                  0x000004a0
#define   CQ_H_BASE_ADDR_L_4a0_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_4a0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_4a0:32;
    } b;
} flex_cq16_h_base_addr_l_t;

#define FLEX_CQ16_H_BASE_ADDR_H                  0x000004a4
#define   CQ_H_BASE_ADDR_H_4a4_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_4a4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_4a4:32;
    } b;
} flex_cq16_h_base_addr_h_t;

#define FLEX_CQ17_H_BASE_ADDR_L                  0x000004a8
#define   CQ_H_BASE_ADDR_L_4a8_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_4a8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_4a8:32;
    } b;
} flex_cq17_h_base_addr_l_t;

#define FLEX_CQ17_H_BASE_ADDR_H                  0x000004ac
#define   CQ_H_BASE_ADDR_H_4ac_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_4ac_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_4ac:32;
    } b;
} flex_cq17_h_base_addr_h_t;

#define FLEX_CQ18_H_BASE_ADDR_L                  0x000004b0
#define   CQ_H_BASE_ADDR_L_4b0_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_4b0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_4b0:32;
    } b;
} flex_cq18_h_base_addr_l_t;

#define FLEX_CQ18_H_BASE_ADDR_H                  0x000004b4
#define   CQ_H_BASE_ADDR_H_4b4_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_4b4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_4b4:32;
    } b;
} flex_cq18_h_base_addr_h_t;

#define FLEX_CQ19_H_BASE_ADDR_L                  0x000004b8
#define   CQ_H_BASE_ADDR_L_4b8_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_4b8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_4b8:32;
    } b;
} flex_cq19_h_base_addr_l_t;

#define FLEX_CQ19_H_BASE_ADDR_H                  0x000004bc
#define   CQ_H_BASE_ADDR_H_4bc_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_4bc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_4bc:32;
    } b;
} flex_cq19_h_base_addr_h_t;

#define FLEX_CQ20_H_BASE_ADDR_L                  0x000004c0
#define   CQ_H_BASE_ADDR_L_4c0_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_4c0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_4c0:32;
    } b;
} flex_cq20_h_base_addr_l_t;

#define FLEX_CQ20_H_BASE_ADDR_H                  0x000004c4
#define   CQ_H_BASE_ADDR_H_4c4_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_4c4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_4c4:32;
    } b;
} flex_cq20_h_base_addr_h_t;

#define FLEX_CQ21_H_BASE_ADDR_L                  0x000004c8
#define   CQ_H_BASE_ADDR_L_4c8_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_4c8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_4c8:32;
    } b;
} flex_cq21_h_base_addr_l_t;

#define FLEX_CQ21_H_BASE_ADDR_H                  0x000004cc
#define   CQ_H_BASE_ADDR_H_4cc_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_4cc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_4cc:32;
    } b;
} flex_cq21_h_base_addr_h_t;

#define FLEX_CQ22_H_BASE_ADDR_L                  0x000004d0
#define   CQ_H_BASE_ADDR_L_4d0_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_4d0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_4d0:32;
    } b;
} flex_cq22_h_base_addr_l_t;

#define FLEX_CQ22_H_BASE_ADDR_H                  0x000004d4
#define   CQ_H_BASE_ADDR_H_4d4_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_4d4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_4d4:32;
    } b;
} flex_cq22_h_base_addr_h_t;

#define FLEX_CQ23_H_BASE_ADDR_L                  0x000004d8
#define   CQ_H_BASE_ADDR_L_4d8_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_4d8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_4d8:32;
    } b;
} flex_cq23_h_base_addr_l_t;

#define FLEX_CQ23_H_BASE_ADDR_H                  0x000004dc
#define   CQ_H_BASE_ADDR_H_4dc_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_4dc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_4dc:32;
    } b;
} flex_cq23_h_base_addr_h_t;

#define FLEX_CQ24_H_BASE_ADDR_L                  0x000004e0
#define   CQ_H_BASE_ADDR_L_4e0_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_4e0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_4e0:32;
    } b;
} flex_cq24_h_base_addr_l_t;

#define FLEX_CQ24_H_BASE_ADDR_H                  0x000004e4
#define   CQ_H_BASE_ADDR_H_4e4_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_4e4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_4e4:32;
    } b;
} flex_cq24_h_base_addr_h_t;

#define FLEX_CQ25_H_BASE_ADDR_L                  0x000004e8
#define   CQ_H_BASE_ADDR_L_4e8_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_4e8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_4e8:32;
    } b;
} flex_cq25_h_base_addr_l_t;

#define FLEX_CQ25_H_BASE_ADDR_H                  0x000004ec
#define   CQ_H_BASE_ADDR_H_4ec_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_4ec_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_4ec:32;
    } b;
} flex_cq25_h_base_addr_h_t;

#define FLEX_CQ26_H_BASE_ADDR_L                  0x000004f0
#define   CQ_H_BASE_ADDR_L_4f0_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_4f0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_4f0:32;
    } b;
} flex_cq26_h_base_addr_l_t;

#define FLEX_CQ26_H_BASE_ADDR_H                  0x000004f4
#define   CQ_H_BASE_ADDR_H_4f4_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_4f4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_4f4:32;
    } b;
} flex_cq26_h_base_addr_h_t;

#define FLEX_CQ27_H_BASE_ADDR_L                  0x000004f8
#define   CQ_H_BASE_ADDR_L_4f8_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_4f8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_4f8:32;
    } b;
} flex_cq27_h_base_addr_l_t;

#define FLEX_CQ27_H_BASE_ADDR_H                  0x000004fc
#define   CQ_H_BASE_ADDR_H_4fc_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_4fc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_4fc:32;
    } b;
} flex_cq27_h_base_addr_h_t;

#define FLEX_CQ28_H_BASE_ADDR_L                  0x00000500
#define   CQ_H_BASE_ADDR_L_500_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_500_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_500:32;
    } b;
} flex_cq28_h_base_addr_l_t;

#define FLEX_CQ28_H_BASE_ADDR_H                  0x00000504
#define   CQ_H_BASE_ADDR_H_504_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_504_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_504:32;
    } b;
} flex_cq28_h_base_addr_h_t;

#define FLEX_CQ29_H_BASE_ADDR_L                  0x00000508
#define   CQ_H_BASE_ADDR_L_508_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_508_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_508:32;
    } b;
} flex_cq29_h_base_addr_l_t;

#define FLEX_CQ29_H_BASE_ADDR_H                  0x0000050c
#define   CQ_H_BASE_ADDR_H_50c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_50c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_50c:32;
    } b;
} flex_cq29_h_base_addr_h_t;

#define FLEX_CQ30_H_BASE_ADDR_L                  0x00000510
#define   CQ_H_BASE_ADDR_L_510_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_510_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_510:32;
    } b;
} flex_cq30_h_base_addr_l_t;

#define FLEX_CQ30_H_BASE_ADDR_H                  0x00000514
#define   CQ_H_BASE_ADDR_H_514_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_514_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_514:32;
    } b;
} flex_cq30_h_base_addr_h_t;

#define FLEX_CQ31_H_BASE_ADDR_L                  0x00000518
#define   CQ_H_BASE_ADDR_L_518_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_518_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_518:32;
    } b;
} flex_cq31_h_base_addr_l_t;

#define FLEX_CQ31_H_BASE_ADDR_H                  0x0000051c
#define   CQ_H_BASE_ADDR_H_51c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_51c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_51c:32;
    } b;
} flex_cq31_h_base_addr_h_t;

#define FLEX_CQ32_H_BASE_ADDR_L                  0x00000520
#define   CQ_H_BASE_ADDR_L_520_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_520_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_520:32;
    } b;
} flex_cq32_h_base_addr_l_t;

#define FLEX_CQ32_H_BASE_ADDR_H                  0x00000524
#define   CQ_H_BASE_ADDR_H_524_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_524_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_524:32;
    } b;
} flex_cq32_h_base_addr_h_t;

#define FLEX_CQ33_H_BASE_ADDR_L                  0x00000528
#define   CQ_H_BASE_ADDR_L_528_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_528_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_528:32;
    } b;
} flex_cq33_h_base_addr_l_t;

#define FLEX_CQ33_H_BASE_ADDR_H                  0x0000052c
#define   CQ_H_BASE_ADDR_H_52c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_52c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_52c:32;
    } b;
} flex_cq33_h_base_addr_h_t;

#define FLEX_CQ34_H_BASE_ADDR_L                  0x00000530
#define   CQ_H_BASE_ADDR_L_530_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_530_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_530:32;
    } b;
} flex_cq34_h_base_addr_l_t;

#define FLEX_CQ34_H_BASE_ADDR_H                  0x00000534
#define   CQ_H_BASE_ADDR_H_534_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_534_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_534:32;
    } b;
} flex_cq34_h_base_addr_h_t;

#define FLEX_CQ35_H_BASE_ADDR_L                  0x00000538
#define   CQ_H_BASE_ADDR_L_538_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_538_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_538:32;
    } b;
} flex_cq35_h_base_addr_l_t;

#define FLEX_CQ35_H_BASE_ADDR_H                  0x0000053c
#define   CQ_H_BASE_ADDR_H_53c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_53c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_53c:32;
    } b;
} flex_cq35_h_base_addr_h_t;

#define FLEX_CQ36_H_BASE_ADDR_L                  0x00000540
#define   CQ_H_BASE_ADDR_L_540_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_540_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_540:32;
    } b;
} flex_cq36_h_base_addr_l_t;

#define FLEX_CQ36_H_BASE_ADDR_H                  0x00000544
#define   CQ_H_BASE_ADDR_H_544_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_544_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_544:32;
    } b;
} flex_cq36_h_base_addr_h_t;

#define FLEX_CQ37_H_BASE_ADDR_L                  0x00000548
#define   CQ_H_BASE_ADDR_L_548_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_548_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_548:32;
    } b;
} flex_cq37_h_base_addr_l_t;

#define FLEX_CQ37_H_BASE_ADDR_H                  0x0000054c
#define   CQ_H_BASE_ADDR_H_54c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_54c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_54c:32;
    } b;
} flex_cq37_h_base_addr_h_t;

#define FLEX_CQ38_H_BASE_ADDR_L                  0x00000550
#define   CQ_H_BASE_ADDR_L_550_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_550_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_550:32;
    } b;
} flex_cq38_h_base_addr_l_t;

#define FLEX_CQ38_H_BASE_ADDR_H                  0x00000554
#define   CQ_H_BASE_ADDR_H_554_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_554_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_554:32;
    } b;
} flex_cq38_h_base_addr_h_t;

#define FLEX_CQ39_H_BASE_ADDR_L                  0x00000558
#define   CQ_H_BASE_ADDR_L_558_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_558_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_558:32;
    } b;
} flex_cq39_h_base_addr_l_t;

#define FLEX_CQ39_H_BASE_ADDR_H                  0x0000055c
#define   CQ_H_BASE_ADDR_H_55c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_55c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_55c:32;
    } b;
} flex_cq39_h_base_addr_h_t;

#define FLEX_CQ40_H_BASE_ADDR_L                  0x00000560
#define   CQ_H_BASE_ADDR_L_560_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_560_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_560:32;
    } b;
} flex_cq40_h_base_addr_l_t;

#define FLEX_CQ40_H_BASE_ADDR_H                  0x00000564
#define   CQ_H_BASE_ADDR_H_564_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_564_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_564:32;
    } b;
} flex_cq40_h_base_addr_h_t;

#define FLEX_CQ41_H_BASE_ADDR_L                  0x00000568
#define   CQ_H_BASE_ADDR_L_568_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_568_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_568:32;
    } b;
} flex_cq41_h_base_addr_l_t;

#define FLEX_CQ41_H_BASE_ADDR_H                  0x0000056c
#define   CQ_H_BASE_ADDR_H_56c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_56c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_56c:32;
    } b;
} flex_cq41_h_base_addr_h_t;

#define FLEX_CQ42_H_BASE_ADDR_L                  0x00000570
#define   CQ_H_BASE_ADDR_L_570_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_570_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_570:32;
    } b;
} flex_cq42_h_base_addr_l_t;

#define FLEX_CQ42_H_BASE_ADDR_H                  0x00000574
#define   CQ_H_BASE_ADDR_H_574_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_574_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_574:32;
    } b;
} flex_cq42_h_base_addr_h_t;

#define FLEX_CQ43_H_BASE_ADDR_L                  0x00000578
#define   CQ_H_BASE_ADDR_L_578_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_578_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_578:32;
    } b;
} flex_cq43_h_base_addr_l_t;

#define FLEX_CQ43_H_BASE_ADDR_H                  0x0000057c
#define   CQ_H_BASE_ADDR_H_57c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_57c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_57c:32;
    } b;
} flex_cq43_h_base_addr_h_t;

#define FLEX_CQ44_H_BASE_ADDR_L                  0x00000580
#define   CQ_H_BASE_ADDR_L_580_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_580_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_580:32;
    } b;
} flex_cq44_h_base_addr_l_t;

#define FLEX_CQ44_H_BASE_ADDR_H                  0x00000584
#define   CQ_H_BASE_ADDR_H_584_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_584_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_584:32;
    } b;
} flex_cq44_h_base_addr_h_t;

#define FLEX_CQ45_H_BASE_ADDR_L                  0x00000588
#define   CQ_H_BASE_ADDR_L_588_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_588_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_588:32;
    } b;
} flex_cq45_h_base_addr_l_t;

#define FLEX_CQ45_H_BASE_ADDR_H                  0x0000058c
#define   CQ_H_BASE_ADDR_H_58c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_58c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_58c:32;
    } b;
} flex_cq45_h_base_addr_h_t;

#define FLEX_CQ46_H_BASE_ADDR_L                  0x00000590
#define   CQ_H_BASE_ADDR_L_590_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_590_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_590:32;
    } b;
} flex_cq46_h_base_addr_l_t;

#define FLEX_CQ46_H_BASE_ADDR_H                  0x00000594
#define   CQ_H_BASE_ADDR_H_594_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_594_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_594:32;
    } b;
} flex_cq46_h_base_addr_h_t;

#define FLEX_CQ47_H_BASE_ADDR_L                  0x00000598
#define   CQ_H_BASE_ADDR_L_598_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_598_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_598:32;
    } b;
} flex_cq47_h_base_addr_l_t;

#define FLEX_CQ47_H_BASE_ADDR_H                  0x0000059c
#define   CQ_H_BASE_ADDR_H_59c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_59c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_59c:32;
    } b;
} flex_cq47_h_base_addr_h_t;

#define FLEX_CQ48_H_BASE_ADDR_L                  0x000005a0
#define   CQ_H_BASE_ADDR_L_5a0_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_5a0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_5a0:32;
    } b;
} flex_cq48_h_base_addr_l_t;

#define FLEX_CQ48_H_BASE_ADDR_H                  0x000005a4
#define   CQ_H_BASE_ADDR_H_5a4_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_5a4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_5a4:32;
    } b;
} flex_cq48_h_base_addr_h_t;

#define FLEX_CQ49_H_BASE_ADDR_L                  0x000005a8
#define   CQ_H_BASE_ADDR_L_5a8_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_5a8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_5a8:32;
    } b;
} flex_cq49_h_base_addr_l_t;

#define FLEX_CQ49_H_BASE_ADDR_H                  0x000005ac
#define   CQ_H_BASE_ADDR_H_5ac_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_5ac_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_5ac:32;
    } b;
} flex_cq49_h_base_addr_h_t;

#define FLEX_CQ50_H_BASE_ADDR_L                  0x000005b0
#define   CQ_H_BASE_ADDR_L_5b0_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_5b0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_5b0:32;
    } b;
} flex_cq50_h_base_addr_l_t;

#define FLEX_CQ50_H_BASE_ADDR_H                  0x000005b4
#define   CQ_H_BASE_ADDR_H_5b4_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_5b4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_5b4:32;
    } b;
} flex_cq50_h_base_addr_h_t;

#define FLEX_CQ51_H_BASE_ADDR_L                  0x000005b8
#define   CQ_H_BASE_ADDR_L_5b8_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_5b8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_5b8:32;
    } b;
} flex_cq51_h_base_addr_l_t;

#define FLEX_CQ51_H_BASE_ADDR_H                  0x000005bc
#define   CQ_H_BASE_ADDR_H_5bc_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_5bc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_5bc:32;
    } b;
} flex_cq51_h_base_addr_h_t;

#define FLEX_CQ52_H_BASE_ADDR_L                  0x000005c0
#define   CQ_H_BASE_ADDR_L_5c0_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_5c0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_5c0:32;
    } b;
} flex_cq52_h_base_addr_l_t;

#define FLEX_CQ52_H_BASE_ADDR_H                  0x000005c4
#define   CQ_H_BASE_ADDR_H_5c4_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_5c4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_5c4:32;
    } b;
} flex_cq52_h_base_addr_h_t;

#define FLEX_CQ53_H_BASE_ADDR_L                  0x000005c8
#define   CQ_H_BASE_ADDR_L_5c8_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_5c8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_5c8:32;
    } b;
} flex_cq53_h_base_addr_l_t;

#define FLEX_CQ53_H_BASE_ADDR_H                  0x000005cc
#define   CQ_H_BASE_ADDR_H_5cc_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_5cc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_5cc:32;
    } b;
} flex_cq53_h_base_addr_h_t;

#define FLEX_CQ54_H_BASE_ADDR_L                  0x000005d0
#define   CQ_H_BASE_ADDR_L_5d0_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_5d0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_5d0:32;
    } b;
} flex_cq54_h_base_addr_l_t;

#define FLEX_CQ54_H_BASE_ADDR_H                  0x000005d4
#define   CQ_H_BASE_ADDR_H_5d4_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_5d4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_5d4:32;
    } b;
} flex_cq54_h_base_addr_h_t;

#define FLEX_CQ55_H_BASE_ADDR_L                  0x000005d8
#define   CQ_H_BASE_ADDR_L_5d8_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_5d8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_5d8:32;
    } b;
} flex_cq55_h_base_addr_l_t;

#define FLEX_CQ55_H_BASE_ADDR_H                  0x000005dc
#define   CQ_H_BASE_ADDR_H_5dc_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_5dc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_5dc:32;
    } b;
} flex_cq55_h_base_addr_h_t;

#define FLEX_CQ56_H_BASE_ADDR_L                  0x000005e0
#define   CQ_H_BASE_ADDR_L_5e0_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_5e0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_5e0:32;
    } b;
} flex_cq56_h_base_addr_l_t;

#define FLEX_CQ56_H_BASE_ADDR_H                  0x000005e4
#define   CQ_H_BASE_ADDR_H_5e4_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_5e4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_5e4:32;
    } b;
} flex_cq56_h_base_addr_h_t;

#define FLEX_CQ57_H_BASE_ADDR_L                  0x000005e8
#define   CQ_H_BASE_ADDR_L_5e8_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_5e8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_5e8:32;
    } b;
} flex_cq57_h_base_addr_l_t;

#define FLEX_CQ57_H_BASE_ADDR_H                  0x000005ec
#define   CQ_H_BASE_ADDR_H_5ec_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_5ec_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_5ec:32;
    } b;
} flex_cq57_h_base_addr_h_t;

#define FLEX_CQ58_H_BASE_ADDR_L                  0x000005f0
#define   CQ_H_BASE_ADDR_L_5f0_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_5f0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_5f0:32;
    } b;
} flex_cq58_h_base_addr_l_t;

#define FLEX_CQ58_H_BASE_ADDR_H                  0x000005f4
#define   CQ_H_BASE_ADDR_H_5f4_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_5f4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_5f4:32;
    } b;
} flex_cq58_h_base_addr_h_t;

#define FLEX_CQ59_H_BASE_ADDR_L                  0x000005f8
#define   CQ_H_BASE_ADDR_L_5f8_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_5f8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_5f8:32;
    } b;
} flex_cq59_h_base_addr_l_t;

#define FLEX_CQ59_H_BASE_ADDR_H                  0x000005fc
#define   CQ_H_BASE_ADDR_H_5fc_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_5fc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_5fc:32;
    } b;
} flex_cq59_h_base_addr_h_t;

#define FLEX_CQ60_H_BASE_ADDR_L                  0x00000600
#define   CQ_H_BASE_ADDR_L_600_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_600_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_600:32;
    } b;
} flex_cq60_h_base_addr_l_t;

#define FLEX_CQ60_H_BASE_ADDR_H                  0x00000604
#define   CQ_H_BASE_ADDR_H_604_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_604_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_604:32;
    } b;
} flex_cq60_h_base_addr_h_t;

#define FLEX_CQ61_H_BASE_ADDR_L                  0x00000608
#define   CQ_H_BASE_ADDR_L_608_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_608_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_608:32;
    } b;
} flex_cq61_h_base_addr_l_t;

#define FLEX_CQ61_H_BASE_ADDR_H                  0x0000060c
#define   CQ_H_BASE_ADDR_H_60c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_60c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_60c:32;
    } b;
} flex_cq61_h_base_addr_h_t;

#define FLEX_CQ62_H_BASE_ADDR_L                  0x00000610
#define   CQ_H_BASE_ADDR_L_610_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_610_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_610:32;
    } b;
} flex_cq62_h_base_addr_l_t;

#define FLEX_CQ62_H_BASE_ADDR_H                  0x00000614
#define   CQ_H_BASE_ADDR_H_614_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_614_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_614:32;
    } b;
} flex_cq62_h_base_addr_h_t;

#define FLEX_CQ63_H_BASE_ADDR_L                  0x00000618
#define   CQ_H_BASE_ADDR_L_618_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_618_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_618:32;
    } b;
} flex_cq63_h_base_addr_l_t;

#define FLEX_CQ63_H_BASE_ADDR_H                  0x0000061c
#define   CQ_H_BASE_ADDR_H_61c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_61c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_61c:32;
    } b;
} flex_cq63_h_base_addr_h_t;

#define FLEX_CQ64_H_BASE_ADDR_L                  0x00000620
#define   CQ_H_BASE_ADDR_L_620_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_620_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_620:32;
    } b;
} flex_cq64_h_base_addr_l_t;

#define FLEX_CQ64_H_BASE_ADDR_H                  0x00000624
#define   CQ_H_BASE_ADDR_H_624_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_624_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_624:32;
    } b;
} flex_cq64_h_base_addr_h_t;

#define FLEX_CQ65_H_BASE_ADDR_L                  0x00000628
#define   CQ_H_BASE_ADDR_L_628_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_L_628_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_l_628:32;
    } b;
} flex_cq65_h_base_addr_l_t;

#define FLEX_CQ65_H_BASE_ADDR_H                  0x0000062c
#define   CQ_H_BASE_ADDR_H_62c_MASK              0xffffffff
#define   CQ_H_BASE_ADDR_H_62c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cq_h_base_addr_h_62c:32;
    } b;
} flex_cq65_h_base_addr_h_t;

#define FLEX_MX0_H_BASE_ADDR_L                   0x00000900
#define   MX_H_BASE_ADDR_L_MASK                  0xffffffff
#define   MX_H_BASE_ADDR_L_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l:32;
    } b;
} flex_mx0_h_base_addr_l_t;

#define FLEX_MX0_H_BASE_ADDR_H                   0x00000904
#define   MX_H_BASE_ADDR_H_MASK                  0xffffffff
#define   MX_H_BASE_ADDR_H_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h:32;
    } b;
} flex_mx0_h_base_addr_h_t;

#define FLEX_MX1_H_BASE_ADDR_L                   0x00000908
#define   MX_H_BASE_ADDR_L_908_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_908_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_908:32;
    } b;
} flex_mx1_h_base_addr_l_t;

#define FLEX_MX1_H_BASE_ADDR_H                   0x0000090c
#define   MX_H_BASE_ADDR_H_90c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_90c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_90c:32;
    } b;
} flex_mx1_h_base_addr_h_t;

#define FLEX_MX2_H_BASE_ADDR_L                   0x00000910
#define   MX_H_BASE_ADDR_L_910_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_910_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_910:32;
    } b;
} flex_mx2_h_base_addr_l_t;

#define FLEX_MX2_H_BASE_ADDR_H                   0x00000914
#define   MX_H_BASE_ADDR_H_914_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_914_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_914:32;
    } b;
} flex_mx2_h_base_addr_h_t;

#define FLEX_MX3_H_BASE_ADDR_L                   0x00000918
#define   MX_H_BASE_ADDR_L_918_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_918_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_918:32;
    } b;
} flex_mx3_h_base_addr_l_t;

#define FLEX_MX3_H_BASE_ADDR_H                   0x0000091c
#define   MX_H_BASE_ADDR_H_91c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_91c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_91c:32;
    } b;
} flex_mx3_h_base_addr_h_t;

#define FLEX_MX4_H_BASE_ADDR_L                   0x00000920
#define   MX_H_BASE_ADDR_L_920_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_920_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_920:32;
    } b;
} flex_mx4_h_base_addr_l_t;

#define FLEX_MX4_H_BASE_ADDR_H                   0x00000924
#define   MX_H_BASE_ADDR_H_924_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_924_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_924:32;
    } b;
} flex_mx4_h_base_addr_h_t;

#define FLEX_MX5_H_BASE_ADDR_L                   0x00000928
#define   MX_H_BASE_ADDR_L_928_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_928_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_928:32;
    } b;
} flex_mx5_h_base_addr_l_t;

#define FLEX_MX5_H_BASE_ADDR_H                   0x0000092c
#define   MX_H_BASE_ADDR_H_92c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_92c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_92c:32;
    } b;
} flex_mx5_h_base_addr_h_t;

#define FLEX_MX6_H_BASE_ADDR_L                   0x00000930
#define   MX_H_BASE_ADDR_L_930_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_930_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_930:32;
    } b;
} flex_mx6_h_base_addr_l_t;

#define FLEX_MX6_H_BASE_ADDR_H                   0x00000934
#define   MX_H_BASE_ADDR_H_934_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_934_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_934:32;
    } b;
} flex_mx6_h_base_addr_h_t;

#define FLEX_MX7_H_BASE_ADDR_L                   0x00000938
#define   MX_H_BASE_ADDR_L_938_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_938_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_938:32;
    } b;
} flex_mx7_h_base_addr_l_t;

#define FLEX_MX7_H_BASE_ADDR_H                   0x0000093c
#define   MX_H_BASE_ADDR_H_93c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_93c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_93c:32;
    } b;
} flex_mx7_h_base_addr_h_t;

#define FLEX_MX8_H_BASE_ADDR_L                   0x00000940
#define   MX_H_BASE_ADDR_L_940_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_940_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_940:32;
    } b;
} flex_mx8_h_base_addr_l_t;

#define FLEX_MX8_H_BASE_ADDR_H                   0x00000944
#define   MX_H_BASE_ADDR_H_944_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_944_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_944:32;
    } b;
} flex_mx8_h_base_addr_h_t;

#define FLEX_MX9_H_BASE_ADDR_L                   0x00000948
#define   MX_H_BASE_ADDR_L_948_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_948_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_948:32;
    } b;
} flex_mx9_h_base_addr_l_t;

#define FLEX_MX9_H_BASE_ADDR_H                   0x0000094c
#define   MX_H_BASE_ADDR_H_94c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_94c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_94c:32;
    } b;
} flex_mx9_h_base_addr_h_t;

#define FLEX_MX10_H_BASE_ADDR_L                  0x00000950
#define   MX_H_BASE_ADDR_L_950_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_950_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_950:32;
    } b;
} flex_mx10_h_base_addr_l_t;

#define FLEX_MX10_H_BASE_ADDR_H                  0x00000954
#define   MX_H_BASE_ADDR_H_954_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_954_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_954:32;
    } b;
} flex_mx10_h_base_addr_h_t;

#define FLEX_MX11_H_BASE_ADDR_L                  0x00000958
#define   MX_H_BASE_ADDR_L_958_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_958_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_958:32;
    } b;
} flex_mx11_h_base_addr_l_t;

#define FLEX_MX11_H_BASE_ADDR_H                  0x0000095c
#define   MX_H_BASE_ADDR_H_95c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_95c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_95c:32;
    } b;
} flex_mx11_h_base_addr_h_t;

#define FLEX_MX12_H_BASE_ADDR_L                  0x00000960
#define   MX_H_BASE_ADDR_L_960_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_960_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_960:32;
    } b;
} flex_mx12_h_base_addr_l_t;

#define FLEX_MX12_H_BASE_ADDR_H                  0x00000964
#define   MX_H_BASE_ADDR_H_964_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_964_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_964:32;
    } b;
} flex_mx12_h_base_addr_h_t;

#define FLEX_MX13_H_BASE_ADDR_L                  0x00000968
#define   MX_H_BASE_ADDR_L_968_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_968_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_968:32;
    } b;
} flex_mx13_h_base_addr_l_t;

#define FLEX_MX13_H_BASE_ADDR_H                  0x0000096c
#define   MX_H_BASE_ADDR_H_96c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_96c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_96c:32;
    } b;
} flex_mx13_h_base_addr_h_t;

#define FLEX_MX14_H_BASE_ADDR_L                  0x00000970
#define   MX_H_BASE_ADDR_L_970_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_970_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_970:32;
    } b;
} flex_mx14_h_base_addr_l_t;

#define FLEX_MX14_H_BASE_ADDR_H                  0x00000974
#define   MX_H_BASE_ADDR_H_974_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_974_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_974:32;
    } b;
} flex_mx14_h_base_addr_h_t;

#define FLEX_MX15_H_BASE_ADDR_L                  0x00000978
#define   MX_H_BASE_ADDR_L_978_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_978_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_978:32;
    } b;
} flex_mx15_h_base_addr_l_t;

#define FLEX_MX15_H_BASE_ADDR_H                  0x0000097c
#define   MX_H_BASE_ADDR_H_97c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_97c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_97c:32;
    } b;
} flex_mx15_h_base_addr_h_t;

#define FLEX_MX16_H_BASE_ADDR_L                  0x00000980
#define   MX_H_BASE_ADDR_L_980_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_980_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_980:32;
    } b;
} flex_mx16_h_base_addr_l_t;

#define FLEX_MX16_H_BASE_ADDR_H                  0x00000984
#define   MX_H_BASE_ADDR_H_984_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_984_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_984:32;
    } b;
} flex_mx16_h_base_addr_h_t;

#define FLEX_MX17_H_BASE_ADDR_L                  0x00000988
#define   MX_H_BASE_ADDR_L_988_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_988_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_988:32;
    } b;
} flex_mx17_h_base_addr_l_t;

#define FLEX_MX17_H_BASE_ADDR_H                  0x0000098c
#define   MX_H_BASE_ADDR_H_98c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_98c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_98c:32;
    } b;
} flex_mx17_h_base_addr_h_t;

#define FLEX_MX18_H_BASE_ADDR_L                  0x00000990
#define   MX_H_BASE_ADDR_L_990_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_990_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_990:32;
    } b;
} flex_mx18_h_base_addr_l_t;

#define FLEX_MX18_H_BASE_ADDR_H                  0x00000994
#define   MX_H_BASE_ADDR_H_994_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_994_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_994:32;
    } b;
} flex_mx18_h_base_addr_h_t;

#define FLEX_MX19_H_BASE_ADDR_L                  0x00000998
#define   MX_H_BASE_ADDR_L_998_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_998_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_998:32;
    } b;
} flex_mx19_h_base_addr_l_t;

#define FLEX_MX19_H_BASE_ADDR_H                  0x0000099c
#define   MX_H_BASE_ADDR_H_99c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_99c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_99c:32;
    } b;
} flex_mx19_h_base_addr_h_t;

#define FLEX_MX20_H_BASE_ADDR_L                  0x000009a0
#define   MX_H_BASE_ADDR_L_9a0_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_9a0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_9a0:32;
    } b;
} flex_mx20_h_base_addr_l_t;

#define FLEX_MX20_H_BASE_ADDR_H                  0x000009a4
#define   MX_H_BASE_ADDR_H_9a4_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_9a4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_9a4:32;
    } b;
} flex_mx20_h_base_addr_h_t;

#define FLEX_MX21_H_BASE_ADDR_L                  0x000009a8
#define   MX_H_BASE_ADDR_L_9a8_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_9a8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_9a8:32;
    } b;
} flex_mx21_h_base_addr_l_t;

#define FLEX_MX21_H_BASE_ADDR_H                  0x000009ac
#define   MX_H_BASE_ADDR_H_9ac_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_9ac_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_9ac:32;
    } b;
} flex_mx21_h_base_addr_h_t;

#define FLEX_MX22_H_BASE_ADDR_L                  0x000009b0
#define   MX_H_BASE_ADDR_L_9b0_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_9b0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_9b0:32;
    } b;
} flex_mx22_h_base_addr_l_t;

#define FLEX_MX22_H_BASE_ADDR_H                  0x000009b4
#define   MX_H_BASE_ADDR_H_9b4_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_9b4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_9b4:32;
    } b;
} flex_mx22_h_base_addr_h_t;

#define FLEX_MX23_H_BASE_ADDR_L                  0x000009b8
#define   MX_H_BASE_ADDR_L_9b8_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_9b8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_9b8:32;
    } b;
} flex_mx23_h_base_addr_l_t;

#define FLEX_MX23_H_BASE_ADDR_H                  0x000009bc
#define   MX_H_BASE_ADDR_H_9bc_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_9bc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_9bc:32;
    } b;
} flex_mx23_h_base_addr_h_t;

#define FLEX_MX24_H_BASE_ADDR_L                  0x000009c0
#define   MX_H_BASE_ADDR_L_9c0_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_9c0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_9c0:32;
    } b;
} flex_mx24_h_base_addr_l_t;

#define FLEX_MX24_H_BASE_ADDR_H                  0x000009c4
#define   MX_H_BASE_ADDR_H_9c4_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_9c4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_9c4:32;
    } b;
} flex_mx24_h_base_addr_h_t;

#define FLEX_MX25_H_BASE_ADDR_L                  0x000009c8
#define   MX_H_BASE_ADDR_L_9c8_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_9c8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_9c8:32;
    } b;
} flex_mx25_h_base_addr_l_t;

#define FLEX_MX25_H_BASE_ADDR_H                  0x000009cc
#define   MX_H_BASE_ADDR_H_9cc_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_9cc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_9cc:32;
    } b;
} flex_mx25_h_base_addr_h_t;

#define FLEX_MX26_H_BASE_ADDR_L                  0x000009d0
#define   MX_H_BASE_ADDR_L_9d0_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_9d0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_9d0:32;
    } b;
} flex_mx26_h_base_addr_l_t;

#define FLEX_MX26_H_BASE_ADDR_H                  0x000009d4
#define   MX_H_BASE_ADDR_H_9d4_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_9d4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_9d4:32;
    } b;
} flex_mx26_h_base_addr_h_t;

#define FLEX_MX27_H_BASE_ADDR_L                  0x000009d8
#define   MX_H_BASE_ADDR_L_9d8_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_9d8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_9d8:32;
    } b;
} flex_mx27_h_base_addr_l_t;

#define FLEX_MX27_H_BASE_ADDR_H                  0x000009dc
#define   MX_H_BASE_ADDR_H_9dc_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_9dc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_9dc:32;
    } b;
} flex_mx27_h_base_addr_h_t;

#define FLEX_MX28_H_BASE_ADDR_L                  0x000009e0
#define   MX_H_BASE_ADDR_L_9e0_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_9e0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_9e0:32;
    } b;
} flex_mx28_h_base_addr_l_t;

#define FLEX_MX28_H_BASE_ADDR_H                  0x000009e4
#define   MX_H_BASE_ADDR_H_9e4_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_9e4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_9e4:32;
    } b;
} flex_mx28_h_base_addr_h_t;

#define FLEX_MX29_H_BASE_ADDR_L                  0x000009e8
#define   MX_H_BASE_ADDR_L_9e8_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_9e8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_9e8:32;
    } b;
} flex_mx29_h_base_addr_l_t;

#define FLEX_MX29_H_BASE_ADDR_H                  0x000009ec
#define   MX_H_BASE_ADDR_H_9ec_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_9ec_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_9ec:32;
    } b;
} flex_mx29_h_base_addr_h_t;

#define FLEX_MX30_H_BASE_ADDR_L                  0x000009f0
#define   MX_H_BASE_ADDR_L_9f0_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_9f0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_9f0:32;
    } b;
} flex_mx30_h_base_addr_l_t;

#define FLEX_MX30_H_BASE_ADDR_H                  0x000009f4
#define   MX_H_BASE_ADDR_H_9f4_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_9f4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_9f4:32;
    } b;
} flex_mx30_h_base_addr_h_t;

#define FLEX_MX31_H_BASE_ADDR_L                  0x000009f8
#define   MX_H_BASE_ADDR_L_9f8_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_9f8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_9f8:32;
    } b;
} flex_mx31_h_base_addr_l_t;

#define FLEX_MX31_H_BASE_ADDR_H                  0x000009fc
#define   MX_H_BASE_ADDR_H_9fc_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_9fc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_9fc:32;
    } b;
} flex_mx31_h_base_addr_h_t;

#define FLEX_MX32_H_BASE_ADDR_L                  0x00000a00
#define   MX_H_BASE_ADDR_L_a00_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a00_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a00:32;
    } b;
} flex_mx32_h_base_addr_l_t;

#define FLEX_MX32_H_BASE_ADDR_H                  0x00000a04
#define   MX_H_BASE_ADDR_H_a04_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a04_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a04:32;
    } b;
} flex_mx32_h_base_addr_h_t;

#define FLEX_MX33_H_BASE_ADDR_L                  0x00000a08
#define   MX_H_BASE_ADDR_L_a08_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a08_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a08:32;
    } b;
} flex_mx33_h_base_addr_l_t;

#define FLEX_MX33_H_BASE_ADDR_H                  0x00000a0c
#define   MX_H_BASE_ADDR_H_a0c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a0c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a0c:32;
    } b;
} flex_mx33_h_base_addr_h_t;

#define FLEX_MX34_H_BASE_ADDR_L                  0x00000a10
#define   MX_H_BASE_ADDR_L_a10_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a10_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a10:32;
    } b;
} flex_mx34_h_base_addr_l_t;

#define FLEX_MX34_H_BASE_ADDR_H                  0x00000a14
#define   MX_H_BASE_ADDR_H_a14_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a14_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a14:32;
    } b;
} flex_mx34_h_base_addr_h_t;

#define FLEX_MX35_H_BASE_ADDR_L                  0x00000a18
#define   MX_H_BASE_ADDR_L_a18_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a18_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a18:32;
    } b;
} flex_mx35_h_base_addr_l_t;

#define FLEX_MX35_H_BASE_ADDR_H                  0x00000a1c
#define   MX_H_BASE_ADDR_H_a1c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a1c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a1c:32;
    } b;
} flex_mx35_h_base_addr_h_t;

#define FLEX_MX36_H_BASE_ADDR_L                  0x00000a20
#define   MX_H_BASE_ADDR_L_a20_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a20_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a20:32;
    } b;
} flex_mx36_h_base_addr_l_t;

#define FLEX_MX36_H_BASE_ADDR_H                  0x00000a24
#define   MX_H_BASE_ADDR_H_a24_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a24_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a24:32;
    } b;
} flex_mx36_h_base_addr_h_t;

#define FLEX_MX37_H_BASE_ADDR_L                  0x00000a28
#define   MX_H_BASE_ADDR_L_a28_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a28_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a28:32;
    } b;
} flex_mx37_h_base_addr_l_t;

#define FLEX_MX37_H_BASE_ADDR_H                  0x00000a2c
#define   MX_H_BASE_ADDR_H_a2c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a2c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a2c:32;
    } b;
} flex_mx37_h_base_addr_h_t;

#define FLEX_MX38_H_BASE_ADDR_L                  0x00000a30
#define   MX_H_BASE_ADDR_L_a30_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a30_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a30:32;
    } b;
} flex_mx38_h_base_addr_l_t;

#define FLEX_MX38_H_BASE_ADDR_H                  0x00000a34
#define   MX_H_BASE_ADDR_H_a34_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a34_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a34:32;
    } b;
} flex_mx38_h_base_addr_h_t;

#define FLEX_MX39_H_BASE_ADDR_L                  0x00000a38
#define   MX_H_BASE_ADDR_L_a38_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a38_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a38:32;
    } b;
} flex_mx39_h_base_addr_l_t;

#define FLEX_MX39_H_BASE_ADDR_H                  0x00000a3c
#define   MX_H_BASE_ADDR_H_a3c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a3c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a3c:32;
    } b;
} flex_mx39_h_base_addr_h_t;

#define FLEX_MX40_H_BASE_ADDR_L                  0x00000a40
#define   MX_H_BASE_ADDR_L_a40_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a40_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a40:32;
    } b;
} flex_mx40_h_base_addr_l_t;

#define FLEX_MX40_H_BASE_ADDR_H                  0x00000a44
#define   MX_H_BASE_ADDR_H_a44_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a44_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a44:32;
    } b;
} flex_mx40_h_base_addr_h_t;

#define FLEX_MX41_H_BASE_ADDR_L                  0x00000a48
#define   MX_H_BASE_ADDR_L_a48_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a48_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a48:32;
    } b;
} flex_mx41_h_base_addr_l_t;

#define FLEX_MX41_H_BASE_ADDR_H                  0x00000a4c
#define   MX_H_BASE_ADDR_H_a4c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a4c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a4c:32;
    } b;
} flex_mx41_h_base_addr_h_t;

#define FLEX_MX42_H_BASE_ADDR_L                  0x00000a50
#define   MX_H_BASE_ADDR_L_a50_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a50_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a50:32;
    } b;
} flex_mx42_h_base_addr_l_t;

#define FLEX_MX42_H_BASE_ADDR_H                  0x00000a54
#define   MX_H_BASE_ADDR_H_a54_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a54_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a54:32;
    } b;
} flex_mx42_h_base_addr_h_t;

#define FLEX_MX43_H_BASE_ADDR_L                  0x00000a58
#define   MX_H_BASE_ADDR_L_a58_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a58_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a58:32;
    } b;
} flex_mx43_h_base_addr_l_t;

#define FLEX_MX43_H_BASE_ADDR_H                  0x00000a5c
#define   MX_H_BASE_ADDR_H_a5c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a5c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a5c:32;
    } b;
} flex_mx43_h_base_addr_h_t;

#define FLEX_MX44_H_BASE_ADDR_L                  0x00000a60
#define   MX_H_BASE_ADDR_L_a60_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a60_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a60:32;
    } b;
} flex_mx44_h_base_addr_l_t;

#define FLEX_MX44_H_BASE_ADDR_H                  0x00000a64
#define   MX_H_BASE_ADDR_H_a64_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a64_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a64:32;
    } b;
} flex_mx44_h_base_addr_h_t;

#define FLEX_MX45_H_BASE_ADDR_L                  0x00000a68
#define   MX_H_BASE_ADDR_L_a68_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a68_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a68:32;
    } b;
} flex_mx45_h_base_addr_l_t;

#define FLEX_MX45_H_BASE_ADDR_H                  0x00000a6c
#define   MX_H_BASE_ADDR_H_a6c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a6c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a6c:32;
    } b;
} flex_mx45_h_base_addr_h_t;

#define FLEX_MX46_H_BASE_ADDR_L                  0x00000a70
#define   MX_H_BASE_ADDR_L_a70_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a70_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a70:32;
    } b;
} flex_mx46_h_base_addr_l_t;

#define FLEX_MX46_H_BASE_ADDR_H                  0x00000a74
#define   MX_H_BASE_ADDR_H_a74_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a74_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a74:32;
    } b;
} flex_mx46_h_base_addr_h_t;

#define FLEX_MX47_H_BASE_ADDR_L                  0x00000a78
#define   MX_H_BASE_ADDR_L_a78_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a78_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a78:32;
    } b;
} flex_mx47_h_base_addr_l_t;

#define FLEX_MX47_H_BASE_ADDR_H                  0x00000a7c
#define   MX_H_BASE_ADDR_H_a7c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a7c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a7c:32;
    } b;
} flex_mx47_h_base_addr_h_t;

#define FLEX_MX48_H_BASE_ADDR_L                  0x00000a80
#define   MX_H_BASE_ADDR_L_a80_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a80_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a80:32;
    } b;
} flex_mx48_h_base_addr_l_t;

#define FLEX_MX48_H_BASE_ADDR_H                  0x00000a84
#define   MX_H_BASE_ADDR_H_a84_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a84_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a84:32;
    } b;
} flex_mx48_h_base_addr_h_t;

#define FLEX_MX49_H_BASE_ADDR_L                  0x00000a88
#define   MX_H_BASE_ADDR_L_a88_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a88_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a88:32;
    } b;
} flex_mx49_h_base_addr_l_t;

#define FLEX_MX49_H_BASE_ADDR_H                  0x00000a8c
#define   MX_H_BASE_ADDR_H_a8c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a8c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a8c:32;
    } b;
} flex_mx49_h_base_addr_h_t;

#define FLEX_MX50_H_BASE_ADDR_L                  0x00000a90
#define   MX_H_BASE_ADDR_L_a90_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a90_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a90:32;
    } b;
} flex_mx50_h_base_addr_l_t;

#define FLEX_MX50_H_BASE_ADDR_H                  0x00000a94
#define   MX_H_BASE_ADDR_H_a94_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a94_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a94:32;
    } b;
} flex_mx50_h_base_addr_h_t;

#define FLEX_MX51_H_BASE_ADDR_L                  0x00000a98
#define   MX_H_BASE_ADDR_L_a98_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_a98_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_a98:32;
    } b;
} flex_mx51_h_base_addr_l_t;

#define FLEX_MX51_H_BASE_ADDR_H                  0x00000a9c
#define   MX_H_BASE_ADDR_H_a9c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_a9c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_a9c:32;
    } b;
} flex_mx51_h_base_addr_h_t;

#define FLEX_MX52_H_BASE_ADDR_L                  0x00000aa0
#define   MX_H_BASE_ADDR_L_aa0_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_aa0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_aa0:32;
    } b;
} flex_mx52_h_base_addr_l_t;

#define FLEX_MX52_H_BASE_ADDR_H                  0x00000aa4
#define   MX_H_BASE_ADDR_H_aa4_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_aa4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_aa4:32;
    } b;
} flex_mx52_h_base_addr_h_t;

#define FLEX_MX53_H_BASE_ADDR_L                  0x00000aa8
#define   MX_H_BASE_ADDR_L_aa8_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_aa8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_aa8:32;
    } b;
} flex_mx53_h_base_addr_l_t;

#define FLEX_MX53_H_BASE_ADDR_H                  0x00000aac
#define   MX_H_BASE_ADDR_H_aac_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_aac_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_aac:32;
    } b;
} flex_mx53_h_base_addr_h_t;

#define FLEX_MX54_H_BASE_ADDR_L                  0x00000ab0
#define   MX_H_BASE_ADDR_L_ab0_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_ab0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_ab0:32;
    } b;
} flex_mx54_h_base_addr_l_t;

#define FLEX_MX54_H_BASE_ADDR_H                  0x00000ab4
#define   MX_H_BASE_ADDR_H_ab4_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_ab4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_ab4:32;
    } b;
} flex_mx54_h_base_addr_h_t;

#define FLEX_MX55_H_BASE_ADDR_L                  0x00000ab8
#define   MX_H_BASE_ADDR_L_ab8_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_ab8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_ab8:32;
    } b;
} flex_mx55_h_base_addr_l_t;

#define FLEX_MX55_H_BASE_ADDR_H                  0x00000abc
#define   MX_H_BASE_ADDR_H_abc_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_abc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_abc:32;
    } b;
} flex_mx55_h_base_addr_h_t;

#define FLEX_MX56_H_BASE_ADDR_L                  0x00000ac0
#define   MX_H_BASE_ADDR_L_ac0_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_ac0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_ac0:32;
    } b;
} flex_mx56_h_base_addr_l_t;

#define FLEX_MX56_H_BASE_ADDR_H                  0x00000ac4
#define   MX_H_BASE_ADDR_H_ac4_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_ac4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_ac4:32;
    } b;
} flex_mx56_h_base_addr_h_t;

#define FLEX_MX57_H_BASE_ADDR_L                  0x00000ac8
#define   MX_H_BASE_ADDR_L_ac8_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_ac8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_ac8:32;
    } b;
} flex_mx57_h_base_addr_l_t;

#define FLEX_MX57_H_BASE_ADDR_H                  0x00000acc
#define   MX_H_BASE_ADDR_H_acc_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_acc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_acc:32;
    } b;
} flex_mx57_h_base_addr_h_t;

#define FLEX_MX58_H_BASE_ADDR_L                  0x00000ad0
#define   MX_H_BASE_ADDR_L_ad0_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_ad0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_ad0:32;
    } b;
} flex_mx58_h_base_addr_l_t;

#define FLEX_MX58_H_BASE_ADDR_H                  0x00000ad4
#define   MX_H_BASE_ADDR_H_ad4_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_ad4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_ad4:32;
    } b;
} flex_mx58_h_base_addr_h_t;

#define FLEX_MX59_H_BASE_ADDR_L                  0x00000ad8
#define   MX_H_BASE_ADDR_L_ad8_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_ad8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_ad8:32;
    } b;
} flex_mx59_h_base_addr_l_t;

#define FLEX_MX59_H_BASE_ADDR_H                  0x00000adc
#define   MX_H_BASE_ADDR_H_adc_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_adc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_adc:32;
    } b;
} flex_mx59_h_base_addr_h_t;

#define FLEX_MX60_H_BASE_ADDR_L                  0x00000ae0
#define   MX_H_BASE_ADDR_L_ae0_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_ae0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_ae0:32;
    } b;
} flex_mx60_h_base_addr_l_t;

#define FLEX_MX60_H_BASE_ADDR_H                  0x00000ae4
#define   MX_H_BASE_ADDR_H_ae4_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_ae4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_ae4:32;
    } b;
} flex_mx60_h_base_addr_h_t;

#define FLEX_MX61_H_BASE_ADDR_L                  0x00000ae8
#define   MX_H_BASE_ADDR_L_ae8_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_ae8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_ae8:32;
    } b;
} flex_mx61_h_base_addr_l_t;

#define FLEX_MX61_H_BASE_ADDR_H                  0x00000aec
#define   MX_H_BASE_ADDR_H_aec_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_aec_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_aec:32;
    } b;
} flex_mx61_h_base_addr_h_t;

#define FLEX_MX62_H_BASE_ADDR_L                  0x00000af0
#define   MX_H_BASE_ADDR_L_af0_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_af0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_af0:32;
    } b;
} flex_mx62_h_base_addr_l_t;

#define FLEX_MX62_H_BASE_ADDR_H                  0x00000af4
#define   MX_H_BASE_ADDR_H_af4_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_af4_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_af4:32;
    } b;
} flex_mx62_h_base_addr_h_t;

#define FLEX_MX63_H_BASE_ADDR_L                  0x00000af8
#define   MX_H_BASE_ADDR_L_af8_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_af8_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_af8:32;
    } b;
} flex_mx63_h_base_addr_l_t;

#define FLEX_MX63_H_BASE_ADDR_H                  0x00000afc
#define   MX_H_BASE_ADDR_H_afc_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_afc_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_afc:32;
    } b;
} flex_mx63_h_base_addr_h_t;

#define FLEX_MX64_H_BASE_ADDR_L                  0x00000b00
#define   MX_H_BASE_ADDR_L_b00_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_b00_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_b00:32;
    } b;
} flex_mx64_h_base_addr_l_t;

#define FLEX_MX64_H_BASE_ADDR_H                  0x00000b04
#define   MX_H_BASE_ADDR_H_b04_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_b04_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_b04:32;
    } b;
} flex_mx64_h_base_addr_h_t;

#define FLEX_MX65_H_BASE_ADDR_L                  0x00000b08
#define   MX_H_BASE_ADDR_L_b08_MASK              0xffffffff
#define   MX_H_BASE_ADDR_L_b08_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_l_b08:32;
    } b;
} flex_mx65_h_base_addr_l_t;

#define FLEX_MX65_H_BASE_ADDR_H                  0x00000b0c
#define   MX_H_BASE_ADDR_H_b0c_MASK              0xffffffff
#define   MX_H_BASE_ADDR_H_b0c_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 mx_h_base_addr_h_b0c:32;
    } b;
} flex_mx65_h_base_addr_h_t;

#define FLEX_MX_V0_MESSAGE                       0x00000d20
#define   FLEX_MX_MESSAGE_MASK                   0xffffffff
#define   FLEX_MX_MESSAGE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message:32;
    } b;
} flex_mx_v0_message_t;

#define FLEX_MX_V1_MESSAGE                       0x00000d24
#define   FLEX_MX_MESSAGE_d24_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d24_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d24:32;
    } b;
} flex_mx_v1_message_t;

#define FLEX_MX_V2_MESSAGE                       0x00000d28
#define   FLEX_MX_MESSAGE_d28_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d28_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d28:32;
    } b;
} flex_mx_v2_message_t;

#define FLEX_MX_V3_MESSAGE                       0x00000d2c
#define   FLEX_MX_MESSAGE_d2c_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d2c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d2c:32;
    } b;
} flex_mx_v3_message_t;

#define FLEX_MX_V4_MESSAGE                       0x00000d30
#define   FLEX_MX_MESSAGE_d30_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d30_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d30:32;
    } b;
} flex_mx_v4_message_t;

#define FLEX_MX_V5_MESSAGE                       0x00000d34
#define   FLEX_MX_MESSAGE_d34_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d34_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d34:32;
    } b;
} flex_mx_v5_message_t;

#define FLEX_MX_V6_MESSAGE                       0x00000d38
#define   FLEX_MX_MESSAGE_d38_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d38_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d38:32;
    } b;
} flex_mx_v6_message_t;

#define FLEX_MX_V7_MESSAGE                       0x00000d3c
#define   FLEX_MX_MESSAGE_d3c_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d3c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d3c:32;
    } b;
} flex_mx_v7_message_t;

#define FLEX_MX_V8_MESSAGE                       0x00000d40
#define   FLEX_MX_MESSAGE_d40_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d40_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d40:32;
    } b;
} flex_mx_v8_message_t;

#define FLEX_MX_V9_MESSAGE                       0x00000d44
#define   FLEX_MX_MESSAGE_d44_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d44_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d44:32;
    } b;
} flex_mx_v9_message_t;

#define FLEX_MX_V10_MESSAGE                      0x00000d48
#define   FLEX_MX_MESSAGE_d48_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d48_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d48:32;
    } b;
} flex_mx_v10_message_t;

#define FLEX_MX_V11_MESSAGE                      0x00000d4c
#define   FLEX_MX_MESSAGE_d4c_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d4c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d4c:32;
    } b;
} flex_mx_v11_message_t;

#define FLEX_MX_V12_MESSAGE                      0x00000d50
#define   FLEX_MX_MESSAGE_d50_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d50_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d50:32;
    } b;
} flex_mx_v12_message_t;

#define FLEX_MX_V13_MESSAGE                      0x00000d54
#define   FLEX_MX_MESSAGE_d54_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d54_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d54:32;
    } b;
} flex_mx_v13_message_t;

#define FLEX_MX_V14_MESSAGE                      0x00000d58
#define   FLEX_MX_MESSAGE_d58_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d58_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d58:32;
    } b;
} flex_mx_v14_message_t;

#define FLEX_MX_V15_MESSAGE                      0x00000d5c
#define   FLEX_MX_MESSAGE_d5c_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d5c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d5c:32;
    } b;
} flex_mx_v15_message_t;

#define FLEX_MX_V16_MESSAGE                      0x00000d60
#define   FLEX_MX_MESSAGE_d60_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d60_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d60:32;
    } b;
} flex_mx_v16_message_t;

#define FLEX_MX_V17_MESSAGE                      0x00000d64
#define   FLEX_MX_MESSAGE_d64_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d64_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d64:32;
    } b;
} flex_mx_v17_message_t;

#define FLEX_MX_V18_MESSAGE                      0x00000d68
#define   FLEX_MX_MESSAGE_d68_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d68_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d68:32;
    } b;
} flex_mx_v18_message_t;

#define FLEX_MX_V19_MESSAGE                      0x00000d6c
#define   FLEX_MX_MESSAGE_d6c_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d6c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d6c:32;
    } b;
} flex_mx_v19_message_t;

#define FLEX_MX_V20_MESSAGE                      0x00000d70
#define   FLEX_MX_MESSAGE_d70_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d70_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d70:32;
    } b;
} flex_mx_v20_message_t;

#define FLEX_MX_V21_MESSAGE                      0x00000d74
#define   FLEX_MX_MESSAGE_d74_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d74_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d74:32;
    } b;
} flex_mx_v21_message_t;

#define FLEX_MX_V22_MESSAGE                      0x00000d78
#define   FLEX_MX_MESSAGE_d78_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d78_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d78:32;
    } b;
} flex_mx_v22_message_t;

#define FLEX_MX_V23_MESSAGE                      0x00000d7c
#define   FLEX_MX_MESSAGE_d7c_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d7c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d7c:32;
    } b;
} flex_mx_v23_message_t;

#define FLEX_MX_V24_MESSAGE                      0x00000d80
#define   FLEX_MX_MESSAGE_d80_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d80_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d80:32;
    } b;
} flex_mx_v24_message_t;

#define FLEX_MX_V25_MESSAGE                      0x00000d84
#define   FLEX_MX_MESSAGE_d84_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d84_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d84:32;
    } b;
} flex_mx_v25_message_t;

#define FLEX_MX_V26_MESSAGE                      0x00000d88
#define   FLEX_MX_MESSAGE_d88_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d88_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d88:32;
    } b;
} flex_mx_v26_message_t;

#define FLEX_MX_V27_MESSAGE                      0x00000d8c
#define   FLEX_MX_MESSAGE_d8c_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d8c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d8c:32;
    } b;
} flex_mx_v27_message_t;

#define FLEX_MX_V28_MESSAGE                      0x00000d90
#define   FLEX_MX_MESSAGE_d90_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d90_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d90:32;
    } b;
} flex_mx_v28_message_t;

#define FLEX_MX_V29_MESSAGE                      0x00000d94
#define   FLEX_MX_MESSAGE_d94_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d94_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d94:32;
    } b;
} flex_mx_v29_message_t;

#define FLEX_MX_V30_MESSAGE                      0x00000d98
#define   FLEX_MX_MESSAGE_d98_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d98_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d98:32;
    } b;
} flex_mx_v30_message_t;

#define FLEX_MX_V31_MESSAGE                      0x00000d9c
#define   FLEX_MX_MESSAGE_d9c_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_d9c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_d9c:32;
    } b;
} flex_mx_v31_message_t;

#define FLEX_MX_V32_MESSAGE                      0x00000da0
#define   FLEX_MX_MESSAGE_da0_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_da0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_da0:32;
    } b;
} flex_mx_v32_message_t;

#define FLEX_MX_V33_MESSAGE                      0x00000da4
#define   FLEX_MX_MESSAGE_da4_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_da4_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_da4:32;
    } b;
} flex_mx_v33_message_t;

#define FLEX_MX_V34_MESSAGE                      0x00000da8
#define   FLEX_MX_MESSAGE_da8_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_da8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_da8:32;
    } b;
} flex_mx_v34_message_t;

#define FLEX_MX_V35_MESSAGE                      0x00000dac
#define   FLEX_MX_MESSAGE_dac_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_dac_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_dac:32;
    } b;
} flex_mx_v35_message_t;

#define FLEX_MX_V36_MESSAGE                      0x00000db0
#define   FLEX_MX_MESSAGE_db0_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_db0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_db0:32;
    } b;
} flex_mx_v36_message_t;

#define FLEX_MX_V37_MESSAGE                      0x00000db4
#define   FLEX_MX_MESSAGE_db4_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_db4_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_db4:32;
    } b;
} flex_mx_v37_message_t;

#define FLEX_MX_V38_MESSAGE                      0x00000db8
#define   FLEX_MX_MESSAGE_db8_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_db8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_db8:32;
    } b;
} flex_mx_v38_message_t;

#define FLEX_MX_V39_MESSAGE                      0x00000dbc
#define   FLEX_MX_MESSAGE_dbc_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_dbc_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_dbc:32;
    } b;
} flex_mx_v39_message_t;

#define FLEX_MX_V40_MESSAGE                      0x00000dc0
#define   FLEX_MX_MESSAGE_dc0_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_dc0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_dc0:32;
    } b;
} flex_mx_v40_message_t;

#define FLEX_MX_V41_MESSAGE                      0x00000dc4
#define   FLEX_MX_MESSAGE_dc4_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_dc4_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_dc4:32;
    } b;
} flex_mx_v41_message_t;

#define FLEX_MX_V42_MESSAGE                      0x00000dc8
#define   FLEX_MX_MESSAGE_dc8_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_dc8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_dc8:32;
    } b;
} flex_mx_v42_message_t;

#define FLEX_MX_V43_MESSAGE                      0x00000dcc
#define   FLEX_MX_MESSAGE_dcc_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_dcc_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_dcc:32;
    } b;
} flex_mx_v43_message_t;

#define FLEX_MX_V44_MESSAGE                      0x00000dd0
#define   FLEX_MX_MESSAGE_dd0_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_dd0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_dd0:32;
    } b;
} flex_mx_v44_message_t;

#define FLEX_MX_V45_MESSAGE                      0x00000dd4
#define   FLEX_MX_MESSAGE_dd4_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_dd4_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_dd4:32;
    } b;
} flex_mx_v45_message_t;

#define FLEX_MX_V46_MESSAGE                      0x00000dd8
#define   FLEX_MX_MESSAGE_dd8_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_dd8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_dd8:32;
    } b;
} flex_mx_v46_message_t;

#define FLEX_MX_V47_MESSAGE                      0x00000ddc
#define   FLEX_MX_MESSAGE_ddc_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_ddc_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_ddc:32;
    } b;
} flex_mx_v47_message_t;

#define FLEX_MX_V48_MESSAGE                      0x00000de0
#define   FLEX_MX_MESSAGE_de0_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_de0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_de0:32;
    } b;
} flex_mx_v48_message_t;

#define FLEX_MX_V49_MESSAGE                      0x00000de4
#define   FLEX_MX_MESSAGE_de4_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_de4_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_de4:32;
    } b;
} flex_mx_v49_message_t;

#define FLEX_MX_V50_MESSAGE                      0x00000de8
#define   FLEX_MX_MESSAGE_de8_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_de8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_de8:32;
    } b;
} flex_mx_v50_message_t;

#define FLEX_MX_V51_MESSAGE                      0x00000dec
#define   FLEX_MX_MESSAGE_dec_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_dec_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_dec:32;
    } b;
} flex_mx_v51_message_t;

#define FLEX_MX_V52_MESSAGE                      0x00000df0
#define   FLEX_MX_MESSAGE_df0_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_df0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_df0:32;
    } b;
} flex_mx_v52_message_t;

#define FLEX_MX_V53_MESSAGE                      0x00000df4
#define   FLEX_MX_MESSAGE_df4_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_df4_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_df4:32;
    } b;
} flex_mx_v53_message_t;

#define FLEX_MX_V54_MESSAGE                      0x00000df8
#define   FLEX_MX_MESSAGE_df8_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_df8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_df8:32;
    } b;
} flex_mx_v54_message_t;

#define FLEX_MX_V55_MESSAGE                      0x00000dfc
#define   FLEX_MX_MESSAGE_dfc_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_dfc_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_dfc:32;
    } b;
} flex_mx_v55_message_t;

#define FLEX_MX_V56_MESSAGE                      0x00000e00
#define   FLEX_MX_MESSAGE_e00_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_e00_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_e00:32;
    } b;
} flex_mx_v56_message_t;

#define FLEX_MX_V57_MESSAGE                      0x00000e04
#define   FLEX_MX_MESSAGE_e04_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_e04_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_e04:32;
    } b;
} flex_mx_v57_message_t;

#define FLEX_MX_V58_MESSAGE                      0x00000e08
#define   FLEX_MX_MESSAGE_e08_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_e08_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_e08:32;
    } b;
} flex_mx_v58_message_t;

#define FLEX_MX_V59_MESSAGE                      0x00000e0c
#define   FLEX_MX_MESSAGE_e0c_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_e0c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_e0c:32;
    } b;
} flex_mx_v59_message_t;

#define FLEX_MX_V60_MESSAGE                      0x00000e10
#define   FLEX_MX_MESSAGE_e10_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_e10_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_e10:32;
    } b;
} flex_mx_v60_message_t;

#define FLEX_MX_V61_MESSAGE                      0x00000e14
#define   FLEX_MX_MESSAGE_e14_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_e14_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_e14:32;
    } b;
} flex_mx_v61_message_t;

#define FLEX_MX_V62_MESSAGE                      0x00000e18
#define   FLEX_MX_MESSAGE_e18_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_e18_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_e18:32;
    } b;
} flex_mx_v62_message_t;

#define FLEX_MX_V63_MESSAGE                      0x00000e1c
#define   FLEX_MX_MESSAGE_e1c_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_e1c_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_e1c:32;
    } b;
} flex_mx_v63_message_t;

#define FLEX_MX_V64_MESSAGE                      0x00000e20
#define   FLEX_MX_MESSAGE_e20_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_e20_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_e20:32;
    } b;
} flex_mx_v64_message_t;

#define FLEX_MX_V65_MESSAGE                      0x00000e24
#define   FLEX_MX_MESSAGE_e24_MASK               0xffffffff
#define   FLEX_MX_MESSAGE_e24_SHIFT                       0
typedef union {
    u32 all;
    struct {
        u32 flex_mx_message_e24:32;
    } b;
} flex_mx_v65_message_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ flex_sq0_h_base_addr_l_t flex_sq0_h_base_addr_l;
    /* 0x0004 */ flex_sq0_h_base_addr_h_t flex_sq0_h_base_addr_h;
    /* 0x0008 */ flex_sq1_h_base_addr_l_t flex_sq1_h_base_addr_l;
    /* 0x000c */ flex_sq1_h_base_addr_h_t flex_sq1_h_base_addr_h;
    /* 0x0010 */ flex_sq2_h_base_addr_l_t flex_sq2_h_base_addr_l;
    /* 0x0014 */ flex_sq2_h_base_addr_h_t flex_sq2_h_base_addr_h;
    /* 0x0018 */ flex_sq3_h_base_addr_l_t flex_sq3_h_base_addr_l;
    /* 0x001c */ flex_sq3_h_base_addr_h_t flex_sq3_h_base_addr_h;
    /* 0x0020 */ flex_sq4_h_base_addr_l_t flex_sq4_h_base_addr_l;
    /* 0x0024 */ flex_sq4_h_base_addr_h_t flex_sq4_h_base_addr_h;
    /* 0x0028 */ flex_sq5_h_base_addr_l_t flex_sq5_h_base_addr_l;
    /* 0x002c */ flex_sq5_h_base_addr_h_t flex_sq5_h_base_addr_h;
    /* 0x0030 */ flex_sq6_h_base_addr_l_t flex_sq6_h_base_addr_l;
    /* 0x0034 */ flex_sq6_h_base_addr_h_t flex_sq6_h_base_addr_h;
    /* 0x0038 */ flex_sq7_h_base_addr_l_t flex_sq7_h_base_addr_l;
    /* 0x003c */ flex_sq7_h_base_addr_h_t flex_sq7_h_base_addr_h;
    /* 0x0040 */ flex_sq8_h_base_addr_l_t flex_sq8_h_base_addr_l;
    /* 0x0044 */ flex_sq8_h_base_addr_h_t flex_sq8_h_base_addr_h;
    /* 0x0048 */ flex_sq9_h_base_addr_l_t flex_sq9_h_base_addr_l;
    /* 0x004c */ flex_sq9_h_base_addr_h_t flex_sq9_h_base_addr_h;
    /* 0x0050 */ flex_sq10_h_base_addr_l_t flex_sq10_h_base_addr_l;
    /* 0x0054 */ flex_sq10_h_base_addr_h_t flex_sq10_h_base_addr_h;
    /* 0x0058 */ flex_sq11_h_base_addr_l_t flex_sq11_h_base_addr_l;
    /* 0x005c */ flex_sq11_h_base_addr_h_t flex_sq11_h_base_addr_h;
    /* 0x0060 */ flex_sq12_h_base_addr_l_t flex_sq12_h_base_addr_l;
    /* 0x0064 */ flex_sq12_h_base_addr_h_t flex_sq12_h_base_addr_h;
    /* 0x0068 */ flex_sq13_h_base_addr_l_t flex_sq13_h_base_addr_l;
    /* 0x006c */ flex_sq13_h_base_addr_h_t flex_sq13_h_base_addr_h;
    /* 0x0070 */ flex_sq14_h_base_addr_l_t flex_sq14_h_base_addr_l;
    /* 0x0074 */ flex_sq14_h_base_addr_h_t flex_sq14_h_base_addr_h;
    /* 0x0078 */ flex_sq15_h_base_addr_l_t flex_sq15_h_base_addr_l;
    /* 0x007c */ flex_sq15_h_base_addr_h_t flex_sq15_h_base_addr_h;
    /* 0x0080 */ flex_sq16_h_base_addr_l_t flex_sq16_h_base_addr_l;
    /* 0x0084 */ flex_sq16_h_base_addr_h_t flex_sq16_h_base_addr_h;
    /* 0x0088 */ flex_sq17_h_base_addr_l_t flex_sq17_h_base_addr_l;
    /* 0x008c */ flex_sq17_h_base_addr_h_t flex_sq17_h_base_addr_h;
    /* 0x0090 */ flex_sq18_h_base_addr_l_t flex_sq18_h_base_addr_l;
    /* 0x0094 */ flex_sq18_h_base_addr_h_t flex_sq18_h_base_addr_h;
    /* 0x0098 */ flex_sq19_h_base_addr_l_t flex_sq19_h_base_addr_l;
    /* 0x009c */ flex_sq19_h_base_addr_h_t flex_sq19_h_base_addr_h;
    /* 0x00a0 */ flex_sq20_h_base_addr_l_t flex_sq20_h_base_addr_l;
    /* 0x00a4 */ flex_sq20_h_base_addr_h_t flex_sq20_h_base_addr_h;
    /* 0x00a8 */ flex_sq21_h_base_addr_l_t flex_sq21_h_base_addr_l;
    /* 0x00ac */ flex_sq21_h_base_addr_h_t flex_sq21_h_base_addr_h;
    /* 0x00b0 */ flex_sq22_h_base_addr_l_t flex_sq22_h_base_addr_l;
    /* 0x00b4 */ flex_sq22_h_base_addr_h_t flex_sq22_h_base_addr_h;
    /* 0x00b8 */ flex_sq23_h_base_addr_l_t flex_sq23_h_base_addr_l;
    /* 0x00bc */ flex_sq23_h_base_addr_h_t flex_sq23_h_base_addr_h;
    /* 0x00c0 */ flex_sq24_h_base_addr_l_t flex_sq24_h_base_addr_l;
    /* 0x00c4 */ flex_sq24_h_base_addr_h_t flex_sq24_h_base_addr_h;
    /* 0x00c8 */ flex_sq25_h_base_addr_l_t flex_sq25_h_base_addr_l;
    /* 0x00cc */ flex_sq25_h_base_addr_h_t flex_sq25_h_base_addr_h;
    /* 0x00d0 */ flex_sq26_h_base_addr_l_t flex_sq26_h_base_addr_l;
    /* 0x00d4 */ flex_sq26_h_base_addr_h_t flex_sq26_h_base_addr_h;
    /* 0x00d8 */ flex_sq27_h_base_addr_l_t flex_sq27_h_base_addr_l;
    /* 0x00dc */ flex_sq27_h_base_addr_h_t flex_sq27_h_base_addr_h;
    /* 0x00e0 */ flex_sq28_h_base_addr_l_t flex_sq28_h_base_addr_l;
    /* 0x00e4 */ flex_sq28_h_base_addr_h_t flex_sq28_h_base_addr_h;
    /* 0x00e8 */ flex_sq29_h_base_addr_l_t flex_sq29_h_base_addr_l;
    /* 0x00ec */ flex_sq29_h_base_addr_h_t flex_sq29_h_base_addr_h;
    /* 0x00f0 */ flex_sq30_h_base_addr_l_t flex_sq30_h_base_addr_l;
    /* 0x00f4 */ flex_sq30_h_base_addr_h_t flex_sq30_h_base_addr_h;
    /* 0x00f8 */ flex_sq31_h_base_addr_l_t flex_sq31_h_base_addr_l;
    /* 0x00fc */ flex_sq31_h_base_addr_h_t flex_sq31_h_base_addr_h;
    /* 0x0100 */ flex_sq32_h_base_addr_l_t flex_sq32_h_base_addr_l;
    /* 0x0104 */ flex_sq32_h_base_addr_h_t flex_sq32_h_base_addr_h;
    /* 0x0108 */ flex_sq33_h_base_addr_l_t flex_sq33_h_base_addr_l;
    /* 0x010c */ flex_sq33_h_base_addr_h_t flex_sq33_h_base_addr_h;
    /* 0x0110 */ flex_sq34_h_base_addr_l_t flex_sq34_h_base_addr_l;
    /* 0x0114 */ flex_sq34_h_base_addr_h_t flex_sq34_h_base_addr_h;
    /* 0x0118 */ flex_sq35_h_base_addr_l_t flex_sq35_h_base_addr_l;
    /* 0x011c */ flex_sq35_h_base_addr_h_t flex_sq35_h_base_addr_h;
    /* 0x0120 */ flex_sq36_h_base_addr_l_t flex_sq36_h_base_addr_l;
    /* 0x0124 */ flex_sq36_h_base_addr_h_t flex_sq36_h_base_addr_h;
    /* 0x0128 */ flex_sq37_h_base_addr_l_t flex_sq37_h_base_addr_l;
    /* 0x012c */ flex_sq37_h_base_addr_h_t flex_sq37_h_base_addr_h;
    /* 0x0130 */ flex_sq38_h_base_addr_l_t flex_sq38_h_base_addr_l;
    /* 0x0134 */ flex_sq38_h_base_addr_h_t flex_sq38_h_base_addr_h;
    /* 0x0138 */ flex_sq39_h_base_addr_l_t flex_sq39_h_base_addr_l;
    /* 0x013c */ flex_sq39_h_base_addr_h_t flex_sq39_h_base_addr_h;
    /* 0x0140 */ flex_sq40_h_base_addr_l_t flex_sq40_h_base_addr_l;
    /* 0x0144 */ flex_sq40_h_base_addr_h_t flex_sq40_h_base_addr_h;
    /* 0x0148 */ flex_sq41_h_base_addr_l_t flex_sq41_h_base_addr_l;
    /* 0x014c */ flex_sq41_h_base_addr_h_t flex_sq41_h_base_addr_h;
    /* 0x0150 */ flex_sq42_h_base_addr_l_t flex_sq42_h_base_addr_l;
    /* 0x0154 */ flex_sq42_h_base_addr_h_t flex_sq42_h_base_addr_h;
    /* 0x0158 */ flex_sq43_h_base_addr_l_t flex_sq43_h_base_addr_l;
    /* 0x015c */ flex_sq43_h_base_addr_h_t flex_sq43_h_base_addr_h;
    /* 0x0160 */ flex_sq44_h_base_addr_l_t flex_sq44_h_base_addr_l;
    /* 0x0164 */ flex_sq44_h_base_addr_h_t flex_sq44_h_base_addr_h;
    /* 0x0168 */ flex_sq45_h_base_addr_l_t flex_sq45_h_base_addr_l;
    /* 0x016c */ flex_sq45_h_base_addr_h_t flex_sq45_h_base_addr_h;
    /* 0x0170 */ flex_sq46_h_base_addr_l_t flex_sq46_h_base_addr_l;
    /* 0x0174 */ flex_sq46_h_base_addr_h_t flex_sq46_h_base_addr_h;
    /* 0x0178 */ flex_sq47_h_base_addr_l_t flex_sq47_h_base_addr_l;
    /* 0x017c */ flex_sq47_h_base_addr_h_t flex_sq47_h_base_addr_h;
    /* 0x0180 */ flex_sq48_h_base_addr_l_t flex_sq48_h_base_addr_l;
    /* 0x0184 */ flex_sq48_h_base_addr_h_t flex_sq48_h_base_addr_h;
    /* 0x0188 */ flex_sq49_h_base_addr_l_t flex_sq49_h_base_addr_l;
    /* 0x018c */ flex_sq49_h_base_addr_h_t flex_sq49_h_base_addr_h;
    /* 0x0190 */ flex_sq50_h_base_addr_l_t flex_sq50_h_base_addr_l;
    /* 0x0194 */ flex_sq50_h_base_addr_h_t flex_sq50_h_base_addr_h;
    /* 0x0198 */ flex_sq51_h_base_addr_l_t flex_sq51_h_base_addr_l;
    /* 0x019c */ flex_sq51_h_base_addr_h_t flex_sq51_h_base_addr_h;
    /* 0x01a0 */ flex_sq52_h_base_addr_l_t flex_sq52_h_base_addr_l;
    /* 0x01a4 */ flex_sq52_h_base_addr_h_t flex_sq52_h_base_addr_h;
    /* 0x01a8 */ flex_sq53_h_base_addr_l_t flex_sq53_h_base_addr_l;
    /* 0x01ac */ flex_sq53_h_base_addr_h_t flex_sq53_h_base_addr_h;
    /* 0x01b0 */ flex_sq54_h_base_addr_l_t flex_sq54_h_base_addr_l;
    /* 0x01b4 */ flex_sq54_h_base_addr_h_t flex_sq54_h_base_addr_h;
    /* 0x01b8 */ flex_sq55_h_base_addr_l_t flex_sq55_h_base_addr_l;
    /* 0x01bc */ flex_sq55_h_base_addr_h_t flex_sq55_h_base_addr_h;
    /* 0x01c0 */ flex_sq56_h_base_addr_l_t flex_sq56_h_base_addr_l;
    /* 0x01c4 */ flex_sq56_h_base_addr_h_t flex_sq56_h_base_addr_h;
    /* 0x01c8 */ flex_sq57_h_base_addr_l_t flex_sq57_h_base_addr_l;
    /* 0x01cc */ flex_sq57_h_base_addr_h_t flex_sq57_h_base_addr_h;
    /* 0x01d0 */ flex_sq58_h_base_addr_l_t flex_sq58_h_base_addr_l;
    /* 0x01d4 */ flex_sq58_h_base_addr_h_t flex_sq58_h_base_addr_h;
    /* 0x01d8 */ flex_sq59_h_base_addr_l_t flex_sq59_h_base_addr_l;
    /* 0x01dc */ flex_sq59_h_base_addr_h_t flex_sq59_h_base_addr_h;
    /* 0x01e0 */ flex_sq60_h_base_addr_l_t flex_sq60_h_base_addr_l;
    /* 0x01e4 */ flex_sq60_h_base_addr_h_t flex_sq60_h_base_addr_h;
    /* 0x01e8 */ flex_sq61_h_base_addr_l_t flex_sq61_h_base_addr_l;
    /* 0x01ec */ flex_sq61_h_base_addr_h_t flex_sq61_h_base_addr_h;
    /* 0x01f0 */ flex_sq62_h_base_addr_l_t flex_sq62_h_base_addr_l;
    /* 0x01f4 */ flex_sq62_h_base_addr_h_t flex_sq62_h_base_addr_h;
    /* 0x01f8 */ flex_sq63_h_base_addr_l_t flex_sq63_h_base_addr_l;
    /* 0x01fc */ flex_sq63_h_base_addr_h_t flex_sq63_h_base_addr_h;
    /* 0x0200 */ flex_sq64_h_base_addr_l_t flex_sq64_h_base_addr_l;
    /* 0x0204 */ flex_sq64_h_base_addr_h_t flex_sq64_h_base_addr_h;
    /* 0x0208 */ flex_sq65_h_base_addr_l_t flex_sq65_h_base_addr_l;
    /* 0x020c */ flex_sq65_h_base_addr_h_t flex_sq65_h_base_addr_h;
    /* 0x0210 */ u32 rsvd_210 [132];
    /* 0x0420 */ flex_cq0_h_base_addr_l_t flex_cq0_h_base_addr_l;
    /* 0x0424 */ flex_cq0_h_base_addr_h_t flex_cq0_h_base_addr_h;
    /* 0x0428 */ flex_cq1_h_base_addr_l_t flex_cq1_h_base_addr_l;
    /* 0x042c */ flex_cq1_h_base_addr_h_t flex_cq1_h_base_addr_h;
    /* 0x0430 */ flex_cq2_h_base_addr_l_t flex_cq2_h_base_addr_l;
    /* 0x0434 */ flex_cq2_h_base_addr_h_t flex_cq2_h_base_addr_h;
    /* 0x0438 */ flex_cq3_h_base_addr_l_t flex_cq3_h_base_addr_l;
    /* 0x043c */ flex_cq3_h_base_addr_h_t flex_cq3_h_base_addr_h;
    /* 0x0440 */ flex_cq4_h_base_addr_l_t flex_cq4_h_base_addr_l;
    /* 0x0444 */ flex_cq4_h_base_addr_h_t flex_cq4_h_base_addr_h;
    /* 0x0448 */ flex_cq5_h_base_addr_l_t flex_cq5_h_base_addr_l;
    /* 0x044c */ flex_cq5_h_base_addr_h_t flex_cq5_h_base_addr_h;
    /* 0x0450 */ flex_cq6_h_base_addr_l_t flex_cq6_h_base_addr_l;
    /* 0x0454 */ flex_cq6_h_base_addr_h_t flex_cq6_h_base_addr_h;
    /* 0x0458 */ flex_cq7_h_base_addr_l_t flex_cq7_h_base_addr_l;
    /* 0x045c */ flex_cq7_h_base_addr_h_t flex_cq7_h_base_addr_h;
    /* 0x0460 */ flex_cq8_h_base_addr_l_t flex_cq8_h_base_addr_l;
    /* 0x0464 */ flex_cq8_h_base_addr_h_t flex_cq8_h_base_addr_h;
    /* 0x0468 */ flex_cq9_h_base_addr_l_t flex_cq9_h_base_addr_l;
    /* 0x046c */ flex_cq9_h_base_addr_h_t flex_cq9_h_base_addr_h;
    /* 0x0470 */ flex_cq10_h_base_addr_l_t flex_cq10_h_base_addr_l;
    /* 0x0474 */ flex_cq10_h_base_addr_h_t flex_cq10_h_base_addr_h;
    /* 0x0478 */ flex_cq11_h_base_addr_l_t flex_cq11_h_base_addr_l;
    /* 0x047c */ flex_cq11_h_base_addr_h_t flex_cq11_h_base_addr_h;
    /* 0x0480 */ flex_cq12_h_base_addr_l_t flex_cq12_h_base_addr_l;
    /* 0x0484 */ flex_cq12_h_base_addr_h_t flex_cq12_h_base_addr_h;
    /* 0x0488 */ flex_cq13_h_base_addr_l_t flex_cq13_h_base_addr_l;
    /* 0x048c */ flex_cq13_h_base_addr_h_t flex_cq13_h_base_addr_h;
    /* 0x0490 */ flex_cq14_h_base_addr_l_t flex_cq14_h_base_addr_l;
    /* 0x0494 */ flex_cq14_h_base_addr_h_t flex_cq14_h_base_addr_h;
    /* 0x0498 */ flex_cq15_h_base_addr_l_t flex_cq15_h_base_addr_l;
    /* 0x049c */ flex_cq15_h_base_addr_h_t flex_cq15_h_base_addr_h;
    /* 0x04a0 */ flex_cq16_h_base_addr_l_t flex_cq16_h_base_addr_l;
    /* 0x04a4 */ flex_cq16_h_base_addr_h_t flex_cq16_h_base_addr_h;
    /* 0x04a8 */ flex_cq17_h_base_addr_l_t flex_cq17_h_base_addr_l;
    /* 0x04ac */ flex_cq17_h_base_addr_h_t flex_cq17_h_base_addr_h;
    /* 0x04b0 */ flex_cq18_h_base_addr_l_t flex_cq18_h_base_addr_l;
    /* 0x04b4 */ flex_cq18_h_base_addr_h_t flex_cq18_h_base_addr_h;
    /* 0x04b8 */ flex_cq19_h_base_addr_l_t flex_cq19_h_base_addr_l;
    /* 0x04bc */ flex_cq19_h_base_addr_h_t flex_cq19_h_base_addr_h;
    /* 0x04c0 */ flex_cq20_h_base_addr_l_t flex_cq20_h_base_addr_l;
    /* 0x04c4 */ flex_cq20_h_base_addr_h_t flex_cq20_h_base_addr_h;
    /* 0x04c8 */ flex_cq21_h_base_addr_l_t flex_cq21_h_base_addr_l;
    /* 0x04cc */ flex_cq21_h_base_addr_h_t flex_cq21_h_base_addr_h;
    /* 0x04d0 */ flex_cq22_h_base_addr_l_t flex_cq22_h_base_addr_l;
    /* 0x04d4 */ flex_cq22_h_base_addr_h_t flex_cq22_h_base_addr_h;
    /* 0x04d8 */ flex_cq23_h_base_addr_l_t flex_cq23_h_base_addr_l;
    /* 0x04dc */ flex_cq23_h_base_addr_h_t flex_cq23_h_base_addr_h;
    /* 0x04e0 */ flex_cq24_h_base_addr_l_t flex_cq24_h_base_addr_l;
    /* 0x04e4 */ flex_cq24_h_base_addr_h_t flex_cq24_h_base_addr_h;
    /* 0x04e8 */ flex_cq25_h_base_addr_l_t flex_cq25_h_base_addr_l;
    /* 0x04ec */ flex_cq25_h_base_addr_h_t flex_cq25_h_base_addr_h;
    /* 0x04f0 */ flex_cq26_h_base_addr_l_t flex_cq26_h_base_addr_l;
    /* 0x04f4 */ flex_cq26_h_base_addr_h_t flex_cq26_h_base_addr_h;
    /* 0x04f8 */ flex_cq27_h_base_addr_l_t flex_cq27_h_base_addr_l;
    /* 0x04fc */ flex_cq27_h_base_addr_h_t flex_cq27_h_base_addr_h;
    /* 0x0500 */ flex_cq28_h_base_addr_l_t flex_cq28_h_base_addr_l;
    /* 0x0504 */ flex_cq28_h_base_addr_h_t flex_cq28_h_base_addr_h;
    /* 0x0508 */ flex_cq29_h_base_addr_l_t flex_cq29_h_base_addr_l;
    /* 0x050c */ flex_cq29_h_base_addr_h_t flex_cq29_h_base_addr_h;
    /* 0x0510 */ flex_cq30_h_base_addr_l_t flex_cq30_h_base_addr_l;
    /* 0x0514 */ flex_cq30_h_base_addr_h_t flex_cq30_h_base_addr_h;
    /* 0x0518 */ flex_cq31_h_base_addr_l_t flex_cq31_h_base_addr_l;
    /* 0x051c */ flex_cq31_h_base_addr_h_t flex_cq31_h_base_addr_h;
    /* 0x0520 */ flex_cq32_h_base_addr_l_t flex_cq32_h_base_addr_l;
    /* 0x0524 */ flex_cq32_h_base_addr_h_t flex_cq32_h_base_addr_h;
    /* 0x0528 */ flex_cq33_h_base_addr_l_t flex_cq33_h_base_addr_l;
    /* 0x052c */ flex_cq33_h_base_addr_h_t flex_cq33_h_base_addr_h;
    /* 0x0530 */ flex_cq34_h_base_addr_l_t flex_cq34_h_base_addr_l;
    /* 0x0534 */ flex_cq34_h_base_addr_h_t flex_cq34_h_base_addr_h;
    /* 0x0538 */ flex_cq35_h_base_addr_l_t flex_cq35_h_base_addr_l;
    /* 0x053c */ flex_cq35_h_base_addr_h_t flex_cq35_h_base_addr_h;
    /* 0x0540 */ flex_cq36_h_base_addr_l_t flex_cq36_h_base_addr_l;
    /* 0x0544 */ flex_cq36_h_base_addr_h_t flex_cq36_h_base_addr_h;
    /* 0x0548 */ flex_cq37_h_base_addr_l_t flex_cq37_h_base_addr_l;
    /* 0x054c */ flex_cq37_h_base_addr_h_t flex_cq37_h_base_addr_h;
    /* 0x0550 */ flex_cq38_h_base_addr_l_t flex_cq38_h_base_addr_l;
    /* 0x0554 */ flex_cq38_h_base_addr_h_t flex_cq38_h_base_addr_h;
    /* 0x0558 */ flex_cq39_h_base_addr_l_t flex_cq39_h_base_addr_l;
    /* 0x055c */ flex_cq39_h_base_addr_h_t flex_cq39_h_base_addr_h;
    /* 0x0560 */ flex_cq40_h_base_addr_l_t flex_cq40_h_base_addr_l;
    /* 0x0564 */ flex_cq40_h_base_addr_h_t flex_cq40_h_base_addr_h;
    /* 0x0568 */ flex_cq41_h_base_addr_l_t flex_cq41_h_base_addr_l;
    /* 0x056c */ flex_cq41_h_base_addr_h_t flex_cq41_h_base_addr_h;
    /* 0x0570 */ flex_cq42_h_base_addr_l_t flex_cq42_h_base_addr_l;
    /* 0x0574 */ flex_cq42_h_base_addr_h_t flex_cq42_h_base_addr_h;
    /* 0x0578 */ flex_cq43_h_base_addr_l_t flex_cq43_h_base_addr_l;
    /* 0x057c */ flex_cq43_h_base_addr_h_t flex_cq43_h_base_addr_h;
    /* 0x0580 */ flex_cq44_h_base_addr_l_t flex_cq44_h_base_addr_l;
    /* 0x0584 */ flex_cq44_h_base_addr_h_t flex_cq44_h_base_addr_h;
    /* 0x0588 */ flex_cq45_h_base_addr_l_t flex_cq45_h_base_addr_l;
    /* 0x058c */ flex_cq45_h_base_addr_h_t flex_cq45_h_base_addr_h;
    /* 0x0590 */ flex_cq46_h_base_addr_l_t flex_cq46_h_base_addr_l;
    /* 0x0594 */ flex_cq46_h_base_addr_h_t flex_cq46_h_base_addr_h;
    /* 0x0598 */ flex_cq47_h_base_addr_l_t flex_cq47_h_base_addr_l;
    /* 0x059c */ flex_cq47_h_base_addr_h_t flex_cq47_h_base_addr_h;
    /* 0x05a0 */ flex_cq48_h_base_addr_l_t flex_cq48_h_base_addr_l;
    /* 0x05a4 */ flex_cq48_h_base_addr_h_t flex_cq48_h_base_addr_h;
    /* 0x05a8 */ flex_cq49_h_base_addr_l_t flex_cq49_h_base_addr_l;
    /* 0x05ac */ flex_cq49_h_base_addr_h_t flex_cq49_h_base_addr_h;
    /* 0x05b0 */ flex_cq50_h_base_addr_l_t flex_cq50_h_base_addr_l;
    /* 0x05b4 */ flex_cq50_h_base_addr_h_t flex_cq50_h_base_addr_h;
    /* 0x05b8 */ flex_cq51_h_base_addr_l_t flex_cq51_h_base_addr_l;
    /* 0x05bc */ flex_cq51_h_base_addr_h_t flex_cq51_h_base_addr_h;
    /* 0x05c0 */ flex_cq52_h_base_addr_l_t flex_cq52_h_base_addr_l;
    /* 0x05c4 */ flex_cq52_h_base_addr_h_t flex_cq52_h_base_addr_h;
    /* 0x05c8 */ flex_cq53_h_base_addr_l_t flex_cq53_h_base_addr_l;
    /* 0x05cc */ flex_cq53_h_base_addr_h_t flex_cq53_h_base_addr_h;
    /* 0x05d0 */ flex_cq54_h_base_addr_l_t flex_cq54_h_base_addr_l;
    /* 0x05d4 */ flex_cq54_h_base_addr_h_t flex_cq54_h_base_addr_h;
    /* 0x05d8 */ flex_cq55_h_base_addr_l_t flex_cq55_h_base_addr_l;
    /* 0x05dc */ flex_cq55_h_base_addr_h_t flex_cq55_h_base_addr_h;
    /* 0x05e0 */ flex_cq56_h_base_addr_l_t flex_cq56_h_base_addr_l;
    /* 0x05e4 */ flex_cq56_h_base_addr_h_t flex_cq56_h_base_addr_h;
    /* 0x05e8 */ flex_cq57_h_base_addr_l_t flex_cq57_h_base_addr_l;
    /* 0x05ec */ flex_cq57_h_base_addr_h_t flex_cq57_h_base_addr_h;
    /* 0x05f0 */ flex_cq58_h_base_addr_l_t flex_cq58_h_base_addr_l;
    /* 0x05f4 */ flex_cq58_h_base_addr_h_t flex_cq58_h_base_addr_h;
    /* 0x05f8 */ flex_cq59_h_base_addr_l_t flex_cq59_h_base_addr_l;
    /* 0x05fc */ flex_cq59_h_base_addr_h_t flex_cq59_h_base_addr_h;
    /* 0x0600 */ flex_cq60_h_base_addr_l_t flex_cq60_h_base_addr_l;
    /* 0x0604 */ flex_cq60_h_base_addr_h_t flex_cq60_h_base_addr_h;
    /* 0x0608 */ flex_cq61_h_base_addr_l_t flex_cq61_h_base_addr_l;
    /* 0x060c */ flex_cq61_h_base_addr_h_t flex_cq61_h_base_addr_h;
    /* 0x0610 */ flex_cq62_h_base_addr_l_t flex_cq62_h_base_addr_l;
    /* 0x0614 */ flex_cq62_h_base_addr_h_t flex_cq62_h_base_addr_h;
    /* 0x0618 */ flex_cq63_h_base_addr_l_t flex_cq63_h_base_addr_l;
    /* 0x061c */ flex_cq63_h_base_addr_h_t flex_cq63_h_base_addr_h;
    /* 0x0620 */ flex_cq64_h_base_addr_l_t flex_cq64_h_base_addr_l;
    /* 0x0624 */ flex_cq64_h_base_addr_h_t flex_cq64_h_base_addr_h;
    /* 0x0628 */ flex_cq65_h_base_addr_l_t flex_cq65_h_base_addr_l;
    /* 0x062c */ flex_cq65_h_base_addr_h_t flex_cq65_h_base_addr_h;
    /* 0x0630 */ u32 rsvd_630 [180];
    /* 0x0900 */ flex_mx0_h_base_addr_l_t flex_mx0_h_base_addr_l;
    /* 0x0904 */ flex_mx0_h_base_addr_h_t flex_mx0_h_base_addr_h;
    /* 0x0908 */ flex_mx1_h_base_addr_l_t flex_mx1_h_base_addr_l;
    /* 0x090c */ flex_mx1_h_base_addr_h_t flex_mx1_h_base_addr_h;
    /* 0x0910 */ flex_mx2_h_base_addr_l_t flex_mx2_h_base_addr_l;
    /* 0x0914 */ flex_mx2_h_base_addr_h_t flex_mx2_h_base_addr_h;
    /* 0x0918 */ flex_mx3_h_base_addr_l_t flex_mx3_h_base_addr_l;
    /* 0x091c */ flex_mx3_h_base_addr_h_t flex_mx3_h_base_addr_h;
    /* 0x0920 */ flex_mx4_h_base_addr_l_t flex_mx4_h_base_addr_l;
    /* 0x0924 */ flex_mx4_h_base_addr_h_t flex_mx4_h_base_addr_h;
    /* 0x0928 */ flex_mx5_h_base_addr_l_t flex_mx5_h_base_addr_l;
    /* 0x092c */ flex_mx5_h_base_addr_h_t flex_mx5_h_base_addr_h;
    /* 0x0930 */ flex_mx6_h_base_addr_l_t flex_mx6_h_base_addr_l;
    /* 0x0934 */ flex_mx6_h_base_addr_h_t flex_mx6_h_base_addr_h;
    /* 0x0938 */ flex_mx7_h_base_addr_l_t flex_mx7_h_base_addr_l;
    /* 0x093c */ flex_mx7_h_base_addr_h_t flex_mx7_h_base_addr_h;
    /* 0x0940 */ flex_mx8_h_base_addr_l_t flex_mx8_h_base_addr_l;
    /* 0x0944 */ flex_mx8_h_base_addr_h_t flex_mx8_h_base_addr_h;
    /* 0x0948 */ flex_mx9_h_base_addr_l_t flex_mx9_h_base_addr_l;
    /* 0x094c */ flex_mx9_h_base_addr_h_t flex_mx9_h_base_addr_h;
    /* 0x0950 */ flex_mx10_h_base_addr_l_t flex_mx10_h_base_addr_l;
    /* 0x0954 */ flex_mx10_h_base_addr_h_t flex_mx10_h_base_addr_h;
    /* 0x0958 */ flex_mx11_h_base_addr_l_t flex_mx11_h_base_addr_l;
    /* 0x095c */ flex_mx11_h_base_addr_h_t flex_mx11_h_base_addr_h;
    /* 0x0960 */ flex_mx12_h_base_addr_l_t flex_mx12_h_base_addr_l;
    /* 0x0964 */ flex_mx12_h_base_addr_h_t flex_mx12_h_base_addr_h;
    /* 0x0968 */ flex_mx13_h_base_addr_l_t flex_mx13_h_base_addr_l;
    /* 0x096c */ flex_mx13_h_base_addr_h_t flex_mx13_h_base_addr_h;
    /* 0x0970 */ flex_mx14_h_base_addr_l_t flex_mx14_h_base_addr_l;
    /* 0x0974 */ flex_mx14_h_base_addr_h_t flex_mx14_h_base_addr_h;
    /* 0x0978 */ flex_mx15_h_base_addr_l_t flex_mx15_h_base_addr_l;
    /* 0x097c */ flex_mx15_h_base_addr_h_t flex_mx15_h_base_addr_h;
    /* 0x0980 */ flex_mx16_h_base_addr_l_t flex_mx16_h_base_addr_l;
    /* 0x0984 */ flex_mx16_h_base_addr_h_t flex_mx16_h_base_addr_h;
    /* 0x0988 */ flex_mx17_h_base_addr_l_t flex_mx17_h_base_addr_l;
    /* 0x098c */ flex_mx17_h_base_addr_h_t flex_mx17_h_base_addr_h;
    /* 0x0990 */ flex_mx18_h_base_addr_l_t flex_mx18_h_base_addr_l;
    /* 0x0994 */ flex_mx18_h_base_addr_h_t flex_mx18_h_base_addr_h;
    /* 0x0998 */ flex_mx19_h_base_addr_l_t flex_mx19_h_base_addr_l;
    /* 0x099c */ flex_mx19_h_base_addr_h_t flex_mx19_h_base_addr_h;
    /* 0x09a0 */ flex_mx20_h_base_addr_l_t flex_mx20_h_base_addr_l;
    /* 0x09a4 */ flex_mx20_h_base_addr_h_t flex_mx20_h_base_addr_h;
    /* 0x09a8 */ flex_mx21_h_base_addr_l_t flex_mx21_h_base_addr_l;
    /* 0x09ac */ flex_mx21_h_base_addr_h_t flex_mx21_h_base_addr_h;
    /* 0x09b0 */ flex_mx22_h_base_addr_l_t flex_mx22_h_base_addr_l;
    /* 0x09b4 */ flex_mx22_h_base_addr_h_t flex_mx22_h_base_addr_h;
    /* 0x09b8 */ flex_mx23_h_base_addr_l_t flex_mx23_h_base_addr_l;
    /* 0x09bc */ flex_mx23_h_base_addr_h_t flex_mx23_h_base_addr_h;
    /* 0x09c0 */ flex_mx24_h_base_addr_l_t flex_mx24_h_base_addr_l;
    /* 0x09c4 */ flex_mx24_h_base_addr_h_t flex_mx24_h_base_addr_h;
    /* 0x09c8 */ flex_mx25_h_base_addr_l_t flex_mx25_h_base_addr_l;
    /* 0x09cc */ flex_mx25_h_base_addr_h_t flex_mx25_h_base_addr_h;
    /* 0x09d0 */ flex_mx26_h_base_addr_l_t flex_mx26_h_base_addr_l;
    /* 0x09d4 */ flex_mx26_h_base_addr_h_t flex_mx26_h_base_addr_h;
    /* 0x09d8 */ flex_mx27_h_base_addr_l_t flex_mx27_h_base_addr_l;
    /* 0x09dc */ flex_mx27_h_base_addr_h_t flex_mx27_h_base_addr_h;
    /* 0x09e0 */ flex_mx28_h_base_addr_l_t flex_mx28_h_base_addr_l;
    /* 0x09e4 */ flex_mx28_h_base_addr_h_t flex_mx28_h_base_addr_h;
    /* 0x09e8 */ flex_mx29_h_base_addr_l_t flex_mx29_h_base_addr_l;
    /* 0x09ec */ flex_mx29_h_base_addr_h_t flex_mx29_h_base_addr_h;
    /* 0x09f0 */ flex_mx30_h_base_addr_l_t flex_mx30_h_base_addr_l;
    /* 0x09f4 */ flex_mx30_h_base_addr_h_t flex_mx30_h_base_addr_h;
    /* 0x09f8 */ flex_mx31_h_base_addr_l_t flex_mx31_h_base_addr_l;
    /* 0x09fc */ flex_mx31_h_base_addr_h_t flex_mx31_h_base_addr_h;
    /* 0x0a00 */ flex_mx32_h_base_addr_l_t flex_mx32_h_base_addr_l;
    /* 0x0a04 */ flex_mx32_h_base_addr_h_t flex_mx32_h_base_addr_h;
    /* 0x0a08 */ flex_mx33_h_base_addr_l_t flex_mx33_h_base_addr_l;
    /* 0x0a0c */ flex_mx33_h_base_addr_h_t flex_mx33_h_base_addr_h;
    /* 0x0a10 */ flex_mx34_h_base_addr_l_t flex_mx34_h_base_addr_l;
    /* 0x0a14 */ flex_mx34_h_base_addr_h_t flex_mx34_h_base_addr_h;
    /* 0x0a18 */ flex_mx35_h_base_addr_l_t flex_mx35_h_base_addr_l;
    /* 0x0a1c */ flex_mx35_h_base_addr_h_t flex_mx35_h_base_addr_h;
    /* 0x0a20 */ flex_mx36_h_base_addr_l_t flex_mx36_h_base_addr_l;
    /* 0x0a24 */ flex_mx36_h_base_addr_h_t flex_mx36_h_base_addr_h;
    /* 0x0a28 */ flex_mx37_h_base_addr_l_t flex_mx37_h_base_addr_l;
    /* 0x0a2c */ flex_mx37_h_base_addr_h_t flex_mx37_h_base_addr_h;
    /* 0x0a30 */ flex_mx38_h_base_addr_l_t flex_mx38_h_base_addr_l;
    /* 0x0a34 */ flex_mx38_h_base_addr_h_t flex_mx38_h_base_addr_h;
    /* 0x0a38 */ flex_mx39_h_base_addr_l_t flex_mx39_h_base_addr_l;
    /* 0x0a3c */ flex_mx39_h_base_addr_h_t flex_mx39_h_base_addr_h;
    /* 0x0a40 */ flex_mx40_h_base_addr_l_t flex_mx40_h_base_addr_l;
    /* 0x0a44 */ flex_mx40_h_base_addr_h_t flex_mx40_h_base_addr_h;
    /* 0x0a48 */ flex_mx41_h_base_addr_l_t flex_mx41_h_base_addr_l;
    /* 0x0a4c */ flex_mx41_h_base_addr_h_t flex_mx41_h_base_addr_h;
    /* 0x0a50 */ flex_mx42_h_base_addr_l_t flex_mx42_h_base_addr_l;
    /* 0x0a54 */ flex_mx42_h_base_addr_h_t flex_mx42_h_base_addr_h;
    /* 0x0a58 */ flex_mx43_h_base_addr_l_t flex_mx43_h_base_addr_l;
    /* 0x0a5c */ flex_mx43_h_base_addr_h_t flex_mx43_h_base_addr_h;
    /* 0x0a60 */ flex_mx44_h_base_addr_l_t flex_mx44_h_base_addr_l;
    /* 0x0a64 */ flex_mx44_h_base_addr_h_t flex_mx44_h_base_addr_h;
    /* 0x0a68 */ flex_mx45_h_base_addr_l_t flex_mx45_h_base_addr_l;
    /* 0x0a6c */ flex_mx45_h_base_addr_h_t flex_mx45_h_base_addr_h;
    /* 0x0a70 */ flex_mx46_h_base_addr_l_t flex_mx46_h_base_addr_l;
    /* 0x0a74 */ flex_mx46_h_base_addr_h_t flex_mx46_h_base_addr_h;
    /* 0x0a78 */ flex_mx47_h_base_addr_l_t flex_mx47_h_base_addr_l;
    /* 0x0a7c */ flex_mx47_h_base_addr_h_t flex_mx47_h_base_addr_h;
    /* 0x0a80 */ flex_mx48_h_base_addr_l_t flex_mx48_h_base_addr_l;
    /* 0x0a84 */ flex_mx48_h_base_addr_h_t flex_mx48_h_base_addr_h;
    /* 0x0a88 */ flex_mx49_h_base_addr_l_t flex_mx49_h_base_addr_l;
    /* 0x0a8c */ flex_mx49_h_base_addr_h_t flex_mx49_h_base_addr_h;
    /* 0x0a90 */ flex_mx50_h_base_addr_l_t flex_mx50_h_base_addr_l;
    /* 0x0a94 */ flex_mx50_h_base_addr_h_t flex_mx50_h_base_addr_h;
    /* 0x0a98 */ flex_mx51_h_base_addr_l_t flex_mx51_h_base_addr_l;
    /* 0x0a9c */ flex_mx51_h_base_addr_h_t flex_mx51_h_base_addr_h;
    /* 0x0aa0 */ flex_mx52_h_base_addr_l_t flex_mx52_h_base_addr_l;
    /* 0x0aa4 */ flex_mx52_h_base_addr_h_t flex_mx52_h_base_addr_h;
    /* 0x0aa8 */ flex_mx53_h_base_addr_l_t flex_mx53_h_base_addr_l;
    /* 0x0aac */ flex_mx53_h_base_addr_h_t flex_mx53_h_base_addr_h;
    /* 0x0ab0 */ flex_mx54_h_base_addr_l_t flex_mx54_h_base_addr_l;
    /* 0x0ab4 */ flex_mx54_h_base_addr_h_t flex_mx54_h_base_addr_h;
    /* 0x0ab8 */ flex_mx55_h_base_addr_l_t flex_mx55_h_base_addr_l;
    /* 0x0abc */ flex_mx55_h_base_addr_h_t flex_mx55_h_base_addr_h;
    /* 0x0ac0 */ flex_mx56_h_base_addr_l_t flex_mx56_h_base_addr_l;
    /* 0x0ac4 */ flex_mx56_h_base_addr_h_t flex_mx56_h_base_addr_h;
    /* 0x0ac8 */ flex_mx57_h_base_addr_l_t flex_mx57_h_base_addr_l;
    /* 0x0acc */ flex_mx57_h_base_addr_h_t flex_mx57_h_base_addr_h;
    /* 0x0ad0 */ flex_mx58_h_base_addr_l_t flex_mx58_h_base_addr_l;
    /* 0x0ad4 */ flex_mx58_h_base_addr_h_t flex_mx58_h_base_addr_h;
    /* 0x0ad8 */ flex_mx59_h_base_addr_l_t flex_mx59_h_base_addr_l;
    /* 0x0adc */ flex_mx59_h_base_addr_h_t flex_mx59_h_base_addr_h;
    /* 0x0ae0 */ flex_mx60_h_base_addr_l_t flex_mx60_h_base_addr_l;
    /* 0x0ae4 */ flex_mx60_h_base_addr_h_t flex_mx60_h_base_addr_h;
    /* 0x0ae8 */ flex_mx61_h_base_addr_l_t flex_mx61_h_base_addr_l;
    /* 0x0aec */ flex_mx61_h_base_addr_h_t flex_mx61_h_base_addr_h;
    /* 0x0af0 */ flex_mx62_h_base_addr_l_t flex_mx62_h_base_addr_l;
    /* 0x0af4 */ flex_mx62_h_base_addr_h_t flex_mx62_h_base_addr_h;
    /* 0x0af8 */ flex_mx63_h_base_addr_l_t flex_mx63_h_base_addr_l;
    /* 0x0afc */ flex_mx63_h_base_addr_h_t flex_mx63_h_base_addr_h;
    /* 0x0b00 */ flex_mx64_h_base_addr_l_t flex_mx64_h_base_addr_l;
    /* 0x0b04 */ flex_mx64_h_base_addr_h_t flex_mx64_h_base_addr_h;
    /* 0x0b08 */ flex_mx65_h_base_addr_l_t flex_mx65_h_base_addr_l;
    /* 0x0b0c */ flex_mx65_h_base_addr_h_t flex_mx65_h_base_addr_h;
    /* 0x0b10 */ u32 rsvd_b10 [132];
    /* 0x0d20 */ flex_mx_v0_message_t flex_mx_v0_message;
    /* 0x0d24 */ flex_mx_v1_message_t flex_mx_v1_message;
    /* 0x0d28 */ flex_mx_v2_message_t flex_mx_v2_message;
    /* 0x0d2c */ flex_mx_v3_message_t flex_mx_v3_message;
    /* 0x0d30 */ flex_mx_v4_message_t flex_mx_v4_message;
    /* 0x0d34 */ flex_mx_v5_message_t flex_mx_v5_message;
    /* 0x0d38 */ flex_mx_v6_message_t flex_mx_v6_message;
    /* 0x0d3c */ flex_mx_v7_message_t flex_mx_v7_message;
    /* 0x0d40 */ flex_mx_v8_message_t flex_mx_v8_message;
    /* 0x0d44 */ flex_mx_v9_message_t flex_mx_v9_message;
    /* 0x0d48 */ flex_mx_v10_message_t flex_mx_v10_message;
    /* 0x0d4c */ flex_mx_v11_message_t flex_mx_v11_message;
    /* 0x0d50 */ flex_mx_v12_message_t flex_mx_v12_message;
    /* 0x0d54 */ flex_mx_v13_message_t flex_mx_v13_message;
    /* 0x0d58 */ flex_mx_v14_message_t flex_mx_v14_message;
    /* 0x0d5c */ flex_mx_v15_message_t flex_mx_v15_message;
    /* 0x0d60 */ flex_mx_v16_message_t flex_mx_v16_message;
    /* 0x0d64 */ flex_mx_v17_message_t flex_mx_v17_message;
    /* 0x0d68 */ flex_mx_v18_message_t flex_mx_v18_message;
    /* 0x0d6c */ flex_mx_v19_message_t flex_mx_v19_message;
    /* 0x0d70 */ flex_mx_v20_message_t flex_mx_v20_message;
    /* 0x0d74 */ flex_mx_v21_message_t flex_mx_v21_message;
    /* 0x0d78 */ flex_mx_v22_message_t flex_mx_v22_message;
    /* 0x0d7c */ flex_mx_v23_message_t flex_mx_v23_message;
    /* 0x0d80 */ flex_mx_v24_message_t flex_mx_v24_message;
    /* 0x0d84 */ flex_mx_v25_message_t flex_mx_v25_message;
    /* 0x0d88 */ flex_mx_v26_message_t flex_mx_v26_message;
    /* 0x0d8c */ flex_mx_v27_message_t flex_mx_v27_message;
    /* 0x0d90 */ flex_mx_v28_message_t flex_mx_v28_message;
    /* 0x0d94 */ flex_mx_v29_message_t flex_mx_v29_message;
    /* 0x0d98 */ flex_mx_v30_message_t flex_mx_v30_message;
    /* 0x0d9c */ flex_mx_v31_message_t flex_mx_v31_message;
    /* 0x0da0 */ flex_mx_v32_message_t flex_mx_v32_message;
    /* 0x0da4 */ flex_mx_v33_message_t flex_mx_v33_message;
    /* 0x0da8 */ flex_mx_v34_message_t flex_mx_v34_message;
    /* 0x0dac */ flex_mx_v35_message_t flex_mx_v35_message;
    /* 0x0db0 */ flex_mx_v36_message_t flex_mx_v36_message;
    /* 0x0db4 */ flex_mx_v37_message_t flex_mx_v37_message;
    /* 0x0db8 */ flex_mx_v38_message_t flex_mx_v38_message;
    /* 0x0dbc */ flex_mx_v39_message_t flex_mx_v39_message;
    /* 0x0dc0 */ flex_mx_v40_message_t flex_mx_v40_message;
    /* 0x0dc4 */ flex_mx_v41_message_t flex_mx_v41_message;
    /* 0x0dc8 */ flex_mx_v42_message_t flex_mx_v42_message;
    /* 0x0dcc */ flex_mx_v43_message_t flex_mx_v43_message;
    /* 0x0dd0 */ flex_mx_v44_message_t flex_mx_v44_message;
    /* 0x0dd4 */ flex_mx_v45_message_t flex_mx_v45_message;
    /* 0x0dd8 */ flex_mx_v46_message_t flex_mx_v46_message;
    /* 0x0ddc */ flex_mx_v47_message_t flex_mx_v47_message;
    /* 0x0de0 */ flex_mx_v48_message_t flex_mx_v48_message;
    /* 0x0de4 */ flex_mx_v49_message_t flex_mx_v49_message;
    /* 0x0de8 */ flex_mx_v50_message_t flex_mx_v50_message;
    /* 0x0dec */ flex_mx_v51_message_t flex_mx_v51_message;
    /* 0x0df0 */ flex_mx_v52_message_t flex_mx_v52_message;
    /* 0x0df4 */ flex_mx_v53_message_t flex_mx_v53_message;
    /* 0x0df8 */ flex_mx_v54_message_t flex_mx_v54_message;
    /* 0x0dfc */ flex_mx_v55_message_t flex_mx_v55_message;
    /* 0x0e00 */ flex_mx_v56_message_t flex_mx_v56_message;
    /* 0x0e04 */ flex_mx_v57_message_t flex_mx_v57_message;
    /* 0x0e08 */ flex_mx_v58_message_t flex_mx_v58_message;
    /* 0x0e0c */ flex_mx_v59_message_t flex_mx_v59_message;
    /* 0x0e10 */ flex_mx_v60_message_t flex_mx_v60_message;
    /* 0x0e14 */ flex_mx_v61_message_t flex_mx_v61_message;
    /* 0x0e18 */ flex_mx_v62_message_t flex_mx_v62_message;
    /* 0x0e1c */ flex_mx_v63_message_t flex_mx_v63_message;
    /* 0x0e20 */ flex_mx_v64_message_t flex_mx_v64_message;
    /* 0x0e24 */ flex_mx_v65_message_t flex_mx_v65_message;
} flex_addr_regs_t;


#endif /* rev 0 */