//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _FLEX_MAP_H_
#define _FLEX_MAP_H_

#define FLEX_SQ0_MAPPING                         0x00000000
#define   MAPPING_VALID_MASK                     0x00008000
#define   MAPPING_VALID_SHIFT                            15
#define   CONTROLLER_ID_MASK                     0x00003f00
#define   CONTROLLER_ID_SHIFT                             8
#define   SQ_ID_MASK                             0x0000007f
#define   SQ_ID_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 sq_id:7;
        u32 rsvd_7:1;
        u32 controller_id:6;
        u32 rsvd_14:1;
        u32 mapping_valid:1;
        u32 rsvd_16:16;
    } b;
} flex_sq0_mapping_t;

#define FLEX_SQ1_MAPPING                         0x00000004
#define   MAPPING_VALID_4_MASK                   0x00008000
#define   MAPPING_VALID_4_SHIFT                          15
#define   CONTROLLER_ID_4_MASK                   0x00003f00
#define   CONTROLLER_ID_4_SHIFT                           8
#define   SQ_ID_4_MASK                           0x0000007f
#define   SQ_ID_4_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 sq_id_4:7;
        u32 rsvd_7:1;
        u32 controller_id_4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_4:1;
        u32 rsvd_16:16;
    } b;
} flex_sq1_mapping_t;

#define FLEX_SQ2_MAPPING                         0x00000008
#define   MAPPING_VALID_8_MASK                   0x00008000
#define   MAPPING_VALID_8_SHIFT                          15
#define   CONTROLLER_ID_8_MASK                   0x00003f00
#define   CONTROLLER_ID_8_SHIFT                           8
#define   SQ_ID_8_MASK                           0x0000007f
#define   SQ_ID_8_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 sq_id_8:7;
        u32 rsvd_7:1;
        u32 controller_id_8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_8:1;
        u32 rsvd_16:16;
    } b;
} flex_sq2_mapping_t;

#define FLEX_SQ3_MAPPING                         0x0000000c
#define   MAPPING_VALID_c_MASK                   0x00008000
#define   MAPPING_VALID_c_SHIFT                          15
#define   CONTROLLER_ID_c_MASK                   0x00003f00
#define   CONTROLLER_ID_c_SHIFT                           8
#define   SQ_ID_c_MASK                           0x0000007f
#define   SQ_ID_c_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 sq_id_c:7;
        u32 rsvd_7:1;
        u32 controller_id_c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_c:1;
        u32 rsvd_16:16;
    } b;
} flex_sq3_mapping_t;

#define FLEX_SQ4_MAPPING                         0x00000010
#define   MAPPING_VALID_10_MASK                  0x00008000
#define   MAPPING_VALID_10_SHIFT                         15
#define   CONTROLLER_ID_10_MASK                  0x00003f00
#define   CONTROLLER_ID_10_SHIFT                          8
#define   SQ_ID_10_MASK                          0x0000007f
#define   SQ_ID_10_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_10:7;
        u32 rsvd_7:1;
        u32 controller_id_10:6;
        u32 rsvd_14:1;
        u32 mapping_valid_10:1;
        u32 rsvd_16:16;
    } b;
} flex_sq4_mapping_t;

#define FLEX_SQ5_MAPPING                         0x00000014
#define   MAPPING_VALID_14_MASK                  0x00008000
#define   MAPPING_VALID_14_SHIFT                         15
#define   CONTROLLER_ID_14_MASK                  0x00003f00
#define   CONTROLLER_ID_14_SHIFT                          8
#define   SQ_ID_14_MASK                          0x0000007f
#define   SQ_ID_14_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_14:7;
        u32 rsvd_7:1;
        u32 controller_id_14:6;
        u32 rsvd_14:1;
        u32 mapping_valid_14:1;
        u32 rsvd_16:16;
    } b;
} flex_sq5_mapping_t;

#define FLEX_SQ6_MAPPING                         0x00000018
#define   MAPPING_VALID_18_MASK                  0x00008000
#define   MAPPING_VALID_18_SHIFT                         15
#define   CONTROLLER_ID_18_MASK                  0x00003f00
#define   CONTROLLER_ID_18_SHIFT                          8
#define   SQ_ID_18_MASK                          0x0000007f
#define   SQ_ID_18_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_18:7;
        u32 rsvd_7:1;
        u32 controller_id_18:6;
        u32 rsvd_14:1;
        u32 mapping_valid_18:1;
        u32 rsvd_16:16;
    } b;
} flex_sq6_mapping_t;

#define FLEX_SQ7_MAPPING                         0x0000001c
#define   MAPPING_VALID_1c_MASK                  0x00008000
#define   MAPPING_VALID_1c_SHIFT                         15
#define   CONTROLLER_ID_1c_MASK                  0x00003f00
#define   CONTROLLER_ID_1c_SHIFT                          8
#define   SQ_ID_1c_MASK                          0x0000007f
#define   SQ_ID_1c_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_1c:7;
        u32 rsvd_7:1;
        u32 controller_id_1c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_1c:1;
        u32 rsvd_16:16;
    } b;
} flex_sq7_mapping_t;

#define FLEX_SQ8_MAPPING                         0x00000020
#define   MAPPING_VALID_20_MASK                  0x00008000
#define   MAPPING_VALID_20_SHIFT                         15
#define   CONTROLLER_ID_20_MASK                  0x00003f00
#define   CONTROLLER_ID_20_SHIFT                          8
#define   SQ_ID_20_MASK                          0x0000007f
#define   SQ_ID_20_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_20:7;
        u32 rsvd_7:1;
        u32 controller_id_20:6;
        u32 rsvd_14:1;
        u32 mapping_valid_20:1;
        u32 rsvd_16:16;
    } b;
} flex_sq8_mapping_t;

#define FLEX_SQ9_MAPPING                         0x00000024
#define   MAPPING_VALID_24_MASK                  0x00008000
#define   MAPPING_VALID_24_SHIFT                         15
#define   CONTROLLER_ID_24_MASK                  0x00003f00
#define   CONTROLLER_ID_24_SHIFT                          8
#define   SQ_ID_24_MASK                          0x0000007f
#define   SQ_ID_24_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_24:7;
        u32 rsvd_7:1;
        u32 controller_id_24:6;
        u32 rsvd_14:1;
        u32 mapping_valid_24:1;
        u32 rsvd_16:16;
    } b;
} flex_sq9_mapping_t;

#define FLEX_SQ10_MAPPING                        0x00000028
#define   MAPPING_VALID_28_MASK                  0x00008000
#define   MAPPING_VALID_28_SHIFT                         15
#define   CONTROLLER_ID_28_MASK                  0x00003f00
#define   CONTROLLER_ID_28_SHIFT                          8
#define   SQ_ID_28_MASK                          0x0000007f
#define   SQ_ID_28_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_28:7;
        u32 rsvd_7:1;
        u32 controller_id_28:6;
        u32 rsvd_14:1;
        u32 mapping_valid_28:1;
        u32 rsvd_16:16;
    } b;
} flex_sq10_mapping_t;

#define FLEX_SQ11_MAPPING                        0x0000002c
#define   MAPPING_VALID_2c_MASK                  0x00008000
#define   MAPPING_VALID_2c_SHIFT                         15
#define   CONTROLLER_ID_2c_MASK                  0x00003f00
#define   CONTROLLER_ID_2c_SHIFT                          8
#define   SQ_ID_2c_MASK                          0x0000007f
#define   SQ_ID_2c_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_2c:7;
        u32 rsvd_7:1;
        u32 controller_id_2c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_2c:1;
        u32 rsvd_16:16;
    } b;
} flex_sq11_mapping_t;

#define FLEX_SQ12_MAPPING                        0x00000030
#define   MAPPING_VALID_30_MASK                  0x00008000
#define   MAPPING_VALID_30_SHIFT                         15
#define   CONTROLLER_ID_30_MASK                  0x00003f00
#define   CONTROLLER_ID_30_SHIFT                          8
#define   SQ_ID_30_MASK                          0x0000007f
#define   SQ_ID_30_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_30:7;
        u32 rsvd_7:1;
        u32 controller_id_30:6;
        u32 rsvd_14:1;
        u32 mapping_valid_30:1;
        u32 rsvd_16:16;
    } b;
} flex_sq12_mapping_t;

#define FLEX_SQ13_MAPPING                        0x00000034
#define   MAPPING_VALID_34_MASK                  0x00008000
#define   MAPPING_VALID_34_SHIFT                         15
#define   CONTROLLER_ID_34_MASK                  0x00003f00
#define   CONTROLLER_ID_34_SHIFT                          8
#define   SQ_ID_34_MASK                          0x0000007f
#define   SQ_ID_34_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_34:7;
        u32 rsvd_7:1;
        u32 controller_id_34:6;
        u32 rsvd_14:1;
        u32 mapping_valid_34:1;
        u32 rsvd_16:16;
    } b;
} flex_sq13_mapping_t;

#define FLEX_SQ14_MAPPING                        0x00000038
#define   MAPPING_VALID_38_MASK                  0x00008000
#define   MAPPING_VALID_38_SHIFT                         15
#define   CONTROLLER_ID_38_MASK                  0x00003f00
#define   CONTROLLER_ID_38_SHIFT                          8
#define   SQ_ID_38_MASK                          0x0000007f
#define   SQ_ID_38_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_38:7;
        u32 rsvd_7:1;
        u32 controller_id_38:6;
        u32 rsvd_14:1;
        u32 mapping_valid_38:1;
        u32 rsvd_16:16;
    } b;
} flex_sq14_mapping_t;

#define FLEX_SQ15_MAPPING                        0x0000003c
#define   MAPPING_VALID_3c_MASK                  0x00008000
#define   MAPPING_VALID_3c_SHIFT                         15
#define   CONTROLLER_ID_3c_MASK                  0x00003f00
#define   CONTROLLER_ID_3c_SHIFT                          8
#define   SQ_ID_3c_MASK                          0x0000007f
#define   SQ_ID_3c_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_3c:7;
        u32 rsvd_7:1;
        u32 controller_id_3c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3c:1;
        u32 rsvd_16:16;
    } b;
} flex_sq15_mapping_t;

#define FLEX_SQ16_MAPPING                        0x00000040
#define   MAPPING_VALID_40_MASK                  0x00008000
#define   MAPPING_VALID_40_SHIFT                         15
#define   CONTROLLER_ID_40_MASK                  0x00003f00
#define   CONTROLLER_ID_40_SHIFT                          8
#define   SQ_ID_40_MASK                          0x0000007f
#define   SQ_ID_40_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_40:7;
        u32 rsvd_7:1;
        u32 controller_id_40:6;
        u32 rsvd_14:1;
        u32 mapping_valid_40:1;
        u32 rsvd_16:16;
    } b;
} flex_sq16_mapping_t;

#define FLEX_SQ17_MAPPING                        0x00000044
#define   MAPPING_VALID_44_MASK                  0x00008000
#define   MAPPING_VALID_44_SHIFT                         15
#define   CONTROLLER_ID_44_MASK                  0x00003f00
#define   CONTROLLER_ID_44_SHIFT                          8
#define   SQ_ID_44_MASK                          0x0000007f
#define   SQ_ID_44_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_44:7;
        u32 rsvd_7:1;
        u32 controller_id_44:6;
        u32 rsvd_14:1;
        u32 mapping_valid_44:1;
        u32 rsvd_16:16;
    } b;
} flex_sq17_mapping_t;

#define FLEX_SQ18_MAPPING                        0x00000048
#define   MAPPING_VALID_48_MASK                  0x00008000
#define   MAPPING_VALID_48_SHIFT                         15
#define   CONTROLLER_ID_48_MASK                  0x00003f00
#define   CONTROLLER_ID_48_SHIFT                          8
#define   SQ_ID_48_MASK                          0x0000007f
#define   SQ_ID_48_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_48:7;
        u32 rsvd_7:1;
        u32 controller_id_48:6;
        u32 rsvd_14:1;
        u32 mapping_valid_48:1;
        u32 rsvd_16:16;
    } b;
} flex_sq18_mapping_t;

#define FLEX_SQ19_MAPPING                        0x0000004c
#define   MAPPING_VALID_4c_MASK                  0x00008000
#define   MAPPING_VALID_4c_SHIFT                         15
#define   CONTROLLER_ID_4c_MASK                  0x00003f00
#define   CONTROLLER_ID_4c_SHIFT                          8
#define   SQ_ID_4c_MASK                          0x0000007f
#define   SQ_ID_4c_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_4c:7;
        u32 rsvd_7:1;
        u32 controller_id_4c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_4c:1;
        u32 rsvd_16:16;
    } b;
} flex_sq19_mapping_t;

#define FLEX_SQ20_MAPPING                        0x00000050
#define   MAPPING_VALID_50_MASK                  0x00008000
#define   MAPPING_VALID_50_SHIFT                         15
#define   CONTROLLER_ID_50_MASK                  0x00003f00
#define   CONTROLLER_ID_50_SHIFT                          8
#define   SQ_ID_50_MASK                          0x0000007f
#define   SQ_ID_50_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_50:7;
        u32 rsvd_7:1;
        u32 controller_id_50:6;
        u32 rsvd_14:1;
        u32 mapping_valid_50:1;
        u32 rsvd_16:16;
    } b;
} flex_sq20_mapping_t;

#define FLEX_SQ21_MAPPING                        0x00000054
#define   MAPPING_VALID_54_MASK                  0x00008000
#define   MAPPING_VALID_54_SHIFT                         15
#define   CONTROLLER_ID_54_MASK                  0x00003f00
#define   CONTROLLER_ID_54_SHIFT                          8
#define   SQ_ID_54_MASK                          0x0000007f
#define   SQ_ID_54_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_54:7;
        u32 rsvd_7:1;
        u32 controller_id_54:6;
        u32 rsvd_14:1;
        u32 mapping_valid_54:1;
        u32 rsvd_16:16;
    } b;
} flex_sq21_mapping_t;

#define FLEX_SQ22_MAPPING                        0x00000058
#define   MAPPING_VALID_58_MASK                  0x00008000
#define   MAPPING_VALID_58_SHIFT                         15
#define   CONTROLLER_ID_58_MASK                  0x00003f00
#define   CONTROLLER_ID_58_SHIFT                          8
#define   SQ_ID_58_MASK                          0x0000007f
#define   SQ_ID_58_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_58:7;
        u32 rsvd_7:1;
        u32 controller_id_58:6;
        u32 rsvd_14:1;
        u32 mapping_valid_58:1;
        u32 rsvd_16:16;
    } b;
} flex_sq22_mapping_t;

#define FLEX_SQ23_MAPPING                        0x0000005c
#define   MAPPING_VALID_5c_MASK                  0x00008000
#define   MAPPING_VALID_5c_SHIFT                         15
#define   CONTROLLER_ID_5c_MASK                  0x00003f00
#define   CONTROLLER_ID_5c_SHIFT                          8
#define   SQ_ID_5c_MASK                          0x0000007f
#define   SQ_ID_5c_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_5c:7;
        u32 rsvd_7:1;
        u32 controller_id_5c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_5c:1;
        u32 rsvd_16:16;
    } b;
} flex_sq23_mapping_t;

#define FLEX_SQ24_MAPPING                        0x00000060
#define   MAPPING_VALID_60_MASK                  0x00008000
#define   MAPPING_VALID_60_SHIFT                         15
#define   CONTROLLER_ID_60_MASK                  0x00003f00
#define   CONTROLLER_ID_60_SHIFT                          8
#define   SQ_ID_60_MASK                          0x0000007f
#define   SQ_ID_60_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_60:7;
        u32 rsvd_7:1;
        u32 controller_id_60:6;
        u32 rsvd_14:1;
        u32 mapping_valid_60:1;
        u32 rsvd_16:16;
    } b;
} flex_sq24_mapping_t;

#define FLEX_SQ25_MAPPING                        0x00000064
#define   MAPPING_VALID_64_MASK                  0x00008000
#define   MAPPING_VALID_64_SHIFT                         15
#define   CONTROLLER_ID_64_MASK                  0x00003f00
#define   CONTROLLER_ID_64_SHIFT                          8
#define   SQ_ID_64_MASK                          0x0000007f
#define   SQ_ID_64_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_64:7;
        u32 rsvd_7:1;
        u32 controller_id_64:6;
        u32 rsvd_14:1;
        u32 mapping_valid_64:1;
        u32 rsvd_16:16;
    } b;
} flex_sq25_mapping_t;

#define FLEX_SQ26_MAPPING                        0x00000068
#define   MAPPING_VALID_68_MASK                  0x00008000
#define   MAPPING_VALID_68_SHIFT                         15
#define   CONTROLLER_ID_68_MASK                  0x00003f00
#define   CONTROLLER_ID_68_SHIFT                          8
#define   SQ_ID_68_MASK                          0x0000007f
#define   SQ_ID_68_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_68:7;
        u32 rsvd_7:1;
        u32 controller_id_68:6;
        u32 rsvd_14:1;
        u32 mapping_valid_68:1;
        u32 rsvd_16:16;
    } b;
} flex_sq26_mapping_t;

#define FLEX_SQ27_MAPPING                        0x0000006c
#define   MAPPING_VALID_6c_MASK                  0x00008000
#define   MAPPING_VALID_6c_SHIFT                         15
#define   CONTROLLER_ID_6c_MASK                  0x00003f00
#define   CONTROLLER_ID_6c_SHIFT                          8
#define   SQ_ID_6c_MASK                          0x0000007f
#define   SQ_ID_6c_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_6c:7;
        u32 rsvd_7:1;
        u32 controller_id_6c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6c:1;
        u32 rsvd_16:16;
    } b;
} flex_sq27_mapping_t;

#define FLEX_SQ28_MAPPING                        0x00000070
#define   MAPPING_VALID_70_MASK                  0x00008000
#define   MAPPING_VALID_70_SHIFT                         15
#define   CONTROLLER_ID_70_MASK                  0x00003f00
#define   CONTROLLER_ID_70_SHIFT                          8
#define   SQ_ID_70_MASK                          0x0000007f
#define   SQ_ID_70_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_70:7;
        u32 rsvd_7:1;
        u32 controller_id_70:6;
        u32 rsvd_14:1;
        u32 mapping_valid_70:1;
        u32 rsvd_16:16;
    } b;
} flex_sq28_mapping_t;

#define FLEX_SQ29_MAPPING                        0x00000074
#define   MAPPING_VALID_74_MASK                  0x00008000
#define   MAPPING_VALID_74_SHIFT                         15
#define   CONTROLLER_ID_74_MASK                  0x00003f00
#define   CONTROLLER_ID_74_SHIFT                          8
#define   SQ_ID_74_MASK                          0x0000007f
#define   SQ_ID_74_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_74:7;
        u32 rsvd_7:1;
        u32 controller_id_74:6;
        u32 rsvd_14:1;
        u32 mapping_valid_74:1;
        u32 rsvd_16:16;
    } b;
} flex_sq29_mapping_t;

#define FLEX_SQ30_MAPPING                        0x00000078
#define   MAPPING_VALID_78_MASK                  0x00008000
#define   MAPPING_VALID_78_SHIFT                         15
#define   CONTROLLER_ID_78_MASK                  0x00003f00
#define   CONTROLLER_ID_78_SHIFT                          8
#define   SQ_ID_78_MASK                          0x0000007f
#define   SQ_ID_78_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_78:7;
        u32 rsvd_7:1;
        u32 controller_id_78:6;
        u32 rsvd_14:1;
        u32 mapping_valid_78:1;
        u32 rsvd_16:16;
    } b;
} flex_sq30_mapping_t;

#define FLEX_SQ31_MAPPING                        0x0000007c
#define   MAPPING_VALID_7c_MASK                  0x00008000
#define   MAPPING_VALID_7c_SHIFT                         15
#define   CONTROLLER_ID_7c_MASK                  0x00003f00
#define   CONTROLLER_ID_7c_SHIFT                          8
#define   SQ_ID_7c_MASK                          0x0000007f
#define   SQ_ID_7c_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_7c:7;
        u32 rsvd_7:1;
        u32 controller_id_7c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_7c:1;
        u32 rsvd_16:16;
    } b;
} flex_sq31_mapping_t;

#define FLEX_SQ32_MAPPING                        0x00000080
#define   MAPPING_VALID_80_MASK                  0x00008000
#define   MAPPING_VALID_80_SHIFT                         15
#define   CONTROLLER_ID_80_MASK                  0x00003f00
#define   CONTROLLER_ID_80_SHIFT                          8
#define   SQ_ID_80_MASK                          0x0000007f
#define   SQ_ID_80_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_80:7;
        u32 rsvd_7:1;
        u32 controller_id_80:6;
        u32 rsvd_14:1;
        u32 mapping_valid_80:1;
        u32 rsvd_16:16;
    } b;
} flex_sq32_mapping_t;

#define FLEX_SQ33_MAPPING                        0x00000084
#define   MAPPING_VALID_84_MASK                  0x00008000
#define   MAPPING_VALID_84_SHIFT                         15
#define   CONTROLLER_ID_84_MASK                  0x00003f00
#define   CONTROLLER_ID_84_SHIFT                          8
#define   SQ_ID_84_MASK                          0x0000007f
#define   SQ_ID_84_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_84:7;
        u32 rsvd_7:1;
        u32 controller_id_84:6;
        u32 rsvd_14:1;
        u32 mapping_valid_84:1;
        u32 rsvd_16:16;
    } b;
} flex_sq33_mapping_t;

#define FLEX_SQ34_MAPPING                        0x00000088
#define   MAPPING_VALID_88_MASK                  0x00008000
#define   MAPPING_VALID_88_SHIFT                         15
#define   CONTROLLER_ID_88_MASK                  0x00003f00
#define   CONTROLLER_ID_88_SHIFT                          8
#define   SQ_ID_88_MASK                          0x0000007f
#define   SQ_ID_88_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_88:7;
        u32 rsvd_7:1;
        u32 controller_id_88:6;
        u32 rsvd_14:1;
        u32 mapping_valid_88:1;
        u32 rsvd_16:16;
    } b;
} flex_sq34_mapping_t;

#define FLEX_SQ35_MAPPING                        0x0000008c
#define   MAPPING_VALID_8c_MASK                  0x00008000
#define   MAPPING_VALID_8c_SHIFT                         15
#define   CONTROLLER_ID_8c_MASK                  0x00003f00
#define   CONTROLLER_ID_8c_SHIFT                          8
#define   SQ_ID_8c_MASK                          0x0000007f
#define   SQ_ID_8c_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_8c:7;
        u32 rsvd_7:1;
        u32 controller_id_8c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_8c:1;
        u32 rsvd_16:16;
    } b;
} flex_sq35_mapping_t;

#define FLEX_SQ36_MAPPING                        0x00000090
#define   MAPPING_VALID_90_MASK                  0x00008000
#define   MAPPING_VALID_90_SHIFT                         15
#define   CONTROLLER_ID_90_MASK                  0x00003f00
#define   CONTROLLER_ID_90_SHIFT                          8
#define   SQ_ID_90_MASK                          0x0000007f
#define   SQ_ID_90_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_90:7;
        u32 rsvd_7:1;
        u32 controller_id_90:6;
        u32 rsvd_14:1;
        u32 mapping_valid_90:1;
        u32 rsvd_16:16;
    } b;
} flex_sq36_mapping_t;

#define FLEX_SQ37_MAPPING                        0x00000094
#define   MAPPING_VALID_94_MASK                  0x00008000
#define   MAPPING_VALID_94_SHIFT                         15
#define   CONTROLLER_ID_94_MASK                  0x00003f00
#define   CONTROLLER_ID_94_SHIFT                          8
#define   SQ_ID_94_MASK                          0x0000007f
#define   SQ_ID_94_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_94:7;
        u32 rsvd_7:1;
        u32 controller_id_94:6;
        u32 rsvd_14:1;
        u32 mapping_valid_94:1;
        u32 rsvd_16:16;
    } b;
} flex_sq37_mapping_t;

#define FLEX_SQ38_MAPPING                        0x00000098
#define   MAPPING_VALID_98_MASK                  0x00008000
#define   MAPPING_VALID_98_SHIFT                         15
#define   CONTROLLER_ID_98_MASK                  0x00003f00
#define   CONTROLLER_ID_98_SHIFT                          8
#define   SQ_ID_98_MASK                          0x0000007f
#define   SQ_ID_98_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_98:7;
        u32 rsvd_7:1;
        u32 controller_id_98:6;
        u32 rsvd_14:1;
        u32 mapping_valid_98:1;
        u32 rsvd_16:16;
    } b;
} flex_sq38_mapping_t;

#define FLEX_SQ39_MAPPING                        0x0000009c
#define   MAPPING_VALID_9c_MASK                  0x00008000
#define   MAPPING_VALID_9c_SHIFT                         15
#define   CONTROLLER_ID_9c_MASK                  0x00003f00
#define   CONTROLLER_ID_9c_SHIFT                          8
#define   SQ_ID_9c_MASK                          0x0000007f
#define   SQ_ID_9c_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_9c:7;
        u32 rsvd_7:1;
        u32 controller_id_9c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_9c:1;
        u32 rsvd_16:16;
    } b;
} flex_sq39_mapping_t;

#define FLEX_SQ40_MAPPING                        0x000000a0
#define   MAPPING_VALID_a0_MASK                  0x00008000
#define   MAPPING_VALID_a0_SHIFT                         15
#define   CONTROLLER_ID_a0_MASK                  0x00003f00
#define   CONTROLLER_ID_a0_SHIFT                          8
#define   SQ_ID_a0_MASK                          0x0000007f
#define   SQ_ID_a0_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_a0:7;
        u32 rsvd_7:1;
        u32 controller_id_a0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_a0:1;
        u32 rsvd_16:16;
    } b;
} flex_sq40_mapping_t;

#define FLEX_SQ41_MAPPING                        0x000000a4
#define   MAPPING_VALID_a4_MASK                  0x00008000
#define   MAPPING_VALID_a4_SHIFT                         15
#define   CONTROLLER_ID_a4_MASK                  0x00003f00
#define   CONTROLLER_ID_a4_SHIFT                          8
#define   SQ_ID_a4_MASK                          0x0000007f
#define   SQ_ID_a4_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_a4:7;
        u32 rsvd_7:1;
        u32 controller_id_a4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_a4:1;
        u32 rsvd_16:16;
    } b;
} flex_sq41_mapping_t;

#define FLEX_SQ42_MAPPING                        0x000000a8
#define   MAPPING_VALID_a8_MASK                  0x00008000
#define   MAPPING_VALID_a8_SHIFT                         15
#define   CONTROLLER_ID_a8_MASK                  0x00003f00
#define   CONTROLLER_ID_a8_SHIFT                          8
#define   SQ_ID_a8_MASK                          0x0000007f
#define   SQ_ID_a8_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_a8:7;
        u32 rsvd_7:1;
        u32 controller_id_a8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_a8:1;
        u32 rsvd_16:16;
    } b;
} flex_sq42_mapping_t;

#define FLEX_SQ43_MAPPING                        0x000000ac
#define   MAPPING_VALID_ac_MASK                  0x00008000
#define   MAPPING_VALID_ac_SHIFT                         15
#define   CONTROLLER_ID_ac_MASK                  0x00003f00
#define   CONTROLLER_ID_ac_SHIFT                          8
#define   SQ_ID_ac_MASK                          0x0000007f
#define   SQ_ID_ac_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_ac:7;
        u32 rsvd_7:1;
        u32 controller_id_ac:6;
        u32 rsvd_14:1;
        u32 mapping_valid_ac:1;
        u32 rsvd_16:16;
    } b;
} flex_sq43_mapping_t;

#define FLEX_SQ44_MAPPING                        0x000000b0
#define   MAPPING_VALID_b0_MASK                  0x00008000
#define   MAPPING_VALID_b0_SHIFT                         15
#define   CONTROLLER_ID_b0_MASK                  0x00003f00
#define   CONTROLLER_ID_b0_SHIFT                          8
#define   SQ_ID_b0_MASK                          0x0000007f
#define   SQ_ID_b0_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_b0:7;
        u32 rsvd_7:1;
        u32 controller_id_b0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_b0:1;
        u32 rsvd_16:16;
    } b;
} flex_sq44_mapping_t;

#define FLEX_SQ45_MAPPING                        0x000000b4
#define   MAPPING_VALID_b4_MASK                  0x00008000
#define   MAPPING_VALID_b4_SHIFT                         15
#define   CONTROLLER_ID_b4_MASK                  0x00003f00
#define   CONTROLLER_ID_b4_SHIFT                          8
#define   SQ_ID_b4_MASK                          0x0000007f
#define   SQ_ID_b4_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_b4:7;
        u32 rsvd_7:1;
        u32 controller_id_b4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_b4:1;
        u32 rsvd_16:16;
    } b;
} flex_sq45_mapping_t;

#define FLEX_SQ46_MAPPING                        0x000000b8
#define   MAPPING_VALID_b8_MASK                  0x00008000
#define   MAPPING_VALID_b8_SHIFT                         15
#define   CONTROLLER_ID_b8_MASK                  0x00003f00
#define   CONTROLLER_ID_b8_SHIFT                          8
#define   SQ_ID_b8_MASK                          0x0000007f
#define   SQ_ID_b8_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_b8:7;
        u32 rsvd_7:1;
        u32 controller_id_b8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_b8:1;
        u32 rsvd_16:16;
    } b;
} flex_sq46_mapping_t;

#define FLEX_SQ47_MAPPING                        0x000000bc
#define   MAPPING_VALID_bc_MASK                  0x00008000
#define   MAPPING_VALID_bc_SHIFT                         15
#define   CONTROLLER_ID_bc_MASK                  0x00003f00
#define   CONTROLLER_ID_bc_SHIFT                          8
#define   SQ_ID_bc_MASK                          0x0000007f
#define   SQ_ID_bc_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_bc:7;
        u32 rsvd_7:1;
        u32 controller_id_bc:6;
        u32 rsvd_14:1;
        u32 mapping_valid_bc:1;
        u32 rsvd_16:16;
    } b;
} flex_sq47_mapping_t;

#define FLEX_SQ48_MAPPING                        0x000000c0
#define   MAPPING_VALID_c0_MASK                  0x00008000
#define   MAPPING_VALID_c0_SHIFT                         15
#define   CONTROLLER_ID_c0_MASK                  0x00003f00
#define   CONTROLLER_ID_c0_SHIFT                          8
#define   SQ_ID_c0_MASK                          0x0000007f
#define   SQ_ID_c0_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_c0:7;
        u32 rsvd_7:1;
        u32 controller_id_c0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_c0:1;
        u32 rsvd_16:16;
    } b;
} flex_sq48_mapping_t;

#define FLEX_SQ49_MAPPING                        0x000000c4
#define   MAPPING_VALID_c4_MASK                  0x00008000
#define   MAPPING_VALID_c4_SHIFT                         15
#define   CONTROLLER_ID_c4_MASK                  0x00003f00
#define   CONTROLLER_ID_c4_SHIFT                          8
#define   SQ_ID_c4_MASK                          0x0000007f
#define   SQ_ID_c4_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_c4:7;
        u32 rsvd_7:1;
        u32 controller_id_c4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_c4:1;
        u32 rsvd_16:16;
    } b;
} flex_sq49_mapping_t;

#define FLEX_SQ50_MAPPING                        0x000000c8
#define   MAPPING_VALID_c8_MASK                  0x00008000
#define   MAPPING_VALID_c8_SHIFT                         15
#define   CONTROLLER_ID_c8_MASK                  0x00003f00
#define   CONTROLLER_ID_c8_SHIFT                          8
#define   SQ_ID_c8_MASK                          0x0000007f
#define   SQ_ID_c8_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_c8:7;
        u32 rsvd_7:1;
        u32 controller_id_c8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_c8:1;
        u32 rsvd_16:16;
    } b;
} flex_sq50_mapping_t;

#define FLEX_SQ51_MAPPING                        0x000000cc
#define   MAPPING_VALID_cc_MASK                  0x00008000
#define   MAPPING_VALID_cc_SHIFT                         15
#define   CONTROLLER_ID_cc_MASK                  0x00003f00
#define   CONTROLLER_ID_cc_SHIFT                          8
#define   SQ_ID_cc_MASK                          0x0000007f
#define   SQ_ID_cc_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_cc:7;
        u32 rsvd_7:1;
        u32 controller_id_cc:6;
        u32 rsvd_14:1;
        u32 mapping_valid_cc:1;
        u32 rsvd_16:16;
    } b;
} flex_sq51_mapping_t;

#define FLEX_SQ52_MAPPING                        0x000000d0
#define   MAPPING_VALID_d0_MASK                  0x00008000
#define   MAPPING_VALID_d0_SHIFT                         15
#define   CONTROLLER_ID_d0_MASK                  0x00003f00
#define   CONTROLLER_ID_d0_SHIFT                          8
#define   SQ_ID_d0_MASK                          0x0000007f
#define   SQ_ID_d0_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_d0:7;
        u32 rsvd_7:1;
        u32 controller_id_d0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_d0:1;
        u32 rsvd_16:16;
    } b;
} flex_sq52_mapping_t;

#define FLEX_SQ53_MAPPING                        0x000000d4
#define   MAPPING_VALID_d4_MASK                  0x00008000
#define   MAPPING_VALID_d4_SHIFT                         15
#define   CONTROLLER_ID_d4_MASK                  0x00003f00
#define   CONTROLLER_ID_d4_SHIFT                          8
#define   SQ_ID_d4_MASK                          0x0000007f
#define   SQ_ID_d4_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_d4:7;
        u32 rsvd_7:1;
        u32 controller_id_d4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_d4:1;
        u32 rsvd_16:16;
    } b;
} flex_sq53_mapping_t;

#define FLEX_SQ54_MAPPING                        0x000000d8
#define   MAPPING_VALID_d8_MASK                  0x00008000
#define   MAPPING_VALID_d8_SHIFT                         15
#define   CONTROLLER_ID_d8_MASK                  0x00003f00
#define   CONTROLLER_ID_d8_SHIFT                          8
#define   SQ_ID_d8_MASK                          0x0000007f
#define   SQ_ID_d8_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_d8:7;
        u32 rsvd_7:1;
        u32 controller_id_d8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_d8:1;
        u32 rsvd_16:16;
    } b;
} flex_sq54_mapping_t;

#define FLEX_SQ55_MAPPING                        0x000000dc
#define   MAPPING_VALID_dc_MASK                  0x00008000
#define   MAPPING_VALID_dc_SHIFT                         15
#define   CONTROLLER_ID_dc_MASK                  0x00003f00
#define   CONTROLLER_ID_dc_SHIFT                          8
#define   SQ_ID_dc_MASK                          0x0000007f
#define   SQ_ID_dc_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_dc:7;
        u32 rsvd_7:1;
        u32 controller_id_dc:6;
        u32 rsvd_14:1;
        u32 mapping_valid_dc:1;
        u32 rsvd_16:16;
    } b;
} flex_sq55_mapping_t;

#define FLEX_SQ56_MAPPING                        0x000000e0
#define   MAPPING_VALID_e0_MASK                  0x00008000
#define   MAPPING_VALID_e0_SHIFT                         15
#define   CONTROLLER_ID_e0_MASK                  0x00003f00
#define   CONTROLLER_ID_e0_SHIFT                          8
#define   SQ_ID_e0_MASK                          0x0000007f
#define   SQ_ID_e0_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_e0:7;
        u32 rsvd_7:1;
        u32 controller_id_e0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_e0:1;
        u32 rsvd_16:16;
    } b;
} flex_sq56_mapping_t;

#define FLEX_SQ57_MAPPING                        0x000000e4
#define   MAPPING_VALID_e4_MASK                  0x00008000
#define   MAPPING_VALID_e4_SHIFT                         15
#define   CONTROLLER_ID_e4_MASK                  0x00003f00
#define   CONTROLLER_ID_e4_SHIFT                          8
#define   SQ_ID_e4_MASK                          0x0000007f
#define   SQ_ID_e4_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_e4:7;
        u32 rsvd_7:1;
        u32 controller_id_e4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_e4:1;
        u32 rsvd_16:16;
    } b;
} flex_sq57_mapping_t;

#define FLEX_SQ58_MAPPING                        0x000000e8
#define   MAPPING_VALID_e8_MASK                  0x00008000
#define   MAPPING_VALID_e8_SHIFT                         15
#define   CONTROLLER_ID_e8_MASK                  0x00003f00
#define   CONTROLLER_ID_e8_SHIFT                          8
#define   SQ_ID_e8_MASK                          0x0000007f
#define   SQ_ID_e8_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_e8:7;
        u32 rsvd_7:1;
        u32 controller_id_e8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_e8:1;
        u32 rsvd_16:16;
    } b;
} flex_sq58_mapping_t;

#define FLEX_SQ59_MAPPING                        0x000000ec
#define   MAPPING_VALID_ec_MASK                  0x00008000
#define   MAPPING_VALID_ec_SHIFT                         15
#define   CONTROLLER_ID_ec_MASK                  0x00003f00
#define   CONTROLLER_ID_ec_SHIFT                          8
#define   SQ_ID_ec_MASK                          0x0000007f
#define   SQ_ID_ec_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_ec:7;
        u32 rsvd_7:1;
        u32 controller_id_ec:6;
        u32 rsvd_14:1;
        u32 mapping_valid_ec:1;
        u32 rsvd_16:16;
    } b;
} flex_sq59_mapping_t;

#define FLEX_SQ60_MAPPING                        0x000000f0
#define   MAPPING_VALID_f0_MASK                  0x00008000
#define   MAPPING_VALID_f0_SHIFT                         15
#define   CONTROLLER_ID_f0_MASK                  0x00003f00
#define   CONTROLLER_ID_f0_SHIFT                          8
#define   SQ_ID_f0_MASK                          0x0000007f
#define   SQ_ID_f0_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_f0:7;
        u32 rsvd_7:1;
        u32 controller_id_f0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_f0:1;
        u32 rsvd_16:16;
    } b;
} flex_sq60_mapping_t;

#define FLEX_SQ61_MAPPING                        0x000000f4
#define   MAPPING_VALID_f4_MASK                  0x00008000
#define   MAPPING_VALID_f4_SHIFT                         15
#define   CONTROLLER_ID_f4_MASK                  0x00003f00
#define   CONTROLLER_ID_f4_SHIFT                          8
#define   SQ_ID_f4_MASK                          0x0000007f
#define   SQ_ID_f4_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_f4:7;
        u32 rsvd_7:1;
        u32 controller_id_f4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_f4:1;
        u32 rsvd_16:16;
    } b;
} flex_sq61_mapping_t;

#define FLEX_SQ62_MAPPING                        0x000000f8
#define   MAPPING_VALID_f8_MASK                  0x00008000
#define   MAPPING_VALID_f8_SHIFT                         15
#define   CONTROLLER_ID_f8_MASK                  0x00003f00
#define   CONTROLLER_ID_f8_SHIFT                          8
#define   SQ_ID_f8_MASK                          0x0000007f
#define   SQ_ID_f8_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_f8:7;
        u32 rsvd_7:1;
        u32 controller_id_f8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_f8:1;
        u32 rsvd_16:16;
    } b;
} flex_sq62_mapping_t;

#define FLEX_SQ63_MAPPING                        0x000000fc
#define   MAPPING_VALID_fc_MASK                  0x00008000
#define   MAPPING_VALID_fc_SHIFT                         15
#define   CONTROLLER_ID_fc_MASK                  0x00003f00
#define   CONTROLLER_ID_fc_SHIFT                          8
#define   SQ_ID_fc_MASK                          0x0000007f
#define   SQ_ID_fc_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq_id_fc:7;
        u32 rsvd_7:1;
        u32 controller_id_fc:6;
        u32 rsvd_14:1;
        u32 mapping_valid_fc:1;
        u32 rsvd_16:16;
    } b;
} flex_sq63_mapping_t;

#define FLEX_SQ64_MAPPING                        0x00000100
#define   MAPPING_VALID_100_MASK                 0x00008000
#define   MAPPING_VALID_100_SHIFT                        15
#define   CONTROLLER_ID_100_MASK                 0x00003f00
#define   CONTROLLER_ID_100_SHIFT                         8
#define   SQ_ID_100_MASK                         0x0000007f
#define   SQ_ID_100_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 sq_id_100:7;
        u32 rsvd_7:1;
        u32 controller_id_100:6;
        u32 rsvd_14:1;
        u32 mapping_valid_100:1;
        u32 rsvd_16:16;
    } b;
} flex_sq64_mapping_t;

#define FLEX_SQ65_MAPPING                        0x00000104
#define   MAPPING_VALID_104_MASK                 0x00008000
#define   MAPPING_VALID_104_SHIFT                        15
#define   CONTROLLER_ID_104_MASK                 0x00003f00
#define   CONTROLLER_ID_104_SHIFT                         8
#define   SQ_ID_104_MASK                         0x0000007f
#define   SQ_ID_104_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 sq_id_104:7;
        u32 rsvd_7:1;
        u32 controller_id_104:6;
        u32 rsvd_14:1;
        u32 mapping_valid_104:1;
        u32 rsvd_16:16;
    } b;
} flex_sq65_mapping_t;

#define FLEX_CQ0_MAPPING                         0x00000300
#define   MAPPING_VALID_300_MASK                 0x00008000
#define   MAPPING_VALID_300_SHIFT                        15
#define   CONTROLLER_ID_300_MASK                 0x00003f00
#define   CONTROLLER_ID_300_SHIFT                         8
#define   CQ_ID_MASK                             0x0000007f
#define   CQ_ID_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 cq_id:7;
        u32 rsvd_7:1;
        u32 controller_id_300:6;
        u32 rsvd_14:1;
        u32 mapping_valid_300:1;
        u32 rsvd_16:16;
    } b;
} flex_cq0_mapping_t;

#define FLEX_CQ1_MAPPING                         0x00000304
#define   MAPPING_VALID_304_MASK                 0x00008000
#define   MAPPING_VALID_304_SHIFT                        15
#define   CONTROLLER_ID_304_MASK                 0x00003f00
#define   CONTROLLER_ID_304_SHIFT                         8
#define   CQ_ID_304_MASK                         0x0000007f
#define   CQ_ID_304_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_304:7;
        u32 rsvd_7:1;
        u32 controller_id_304:6;
        u32 rsvd_14:1;
        u32 mapping_valid_304:1;
        u32 rsvd_16:16;
    } b;
} flex_cq1_mapping_t;

#define FLEX_CQ2_MAPPING                         0x00000308
#define   MAPPING_VALID_308_MASK                 0x00008000
#define   MAPPING_VALID_308_SHIFT                        15
#define   CONTROLLER_ID_308_MASK                 0x00003f00
#define   CONTROLLER_ID_308_SHIFT                         8
#define   CQ_ID_308_MASK                         0x0000007f
#define   CQ_ID_308_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_308:7;
        u32 rsvd_7:1;
        u32 controller_id_308:6;
        u32 rsvd_14:1;
        u32 mapping_valid_308:1;
        u32 rsvd_16:16;
    } b;
} flex_cq2_mapping_t;

#define FLEX_CQ3_MAPPING                         0x0000030c
#define   MAPPING_VALID_30c_MASK                 0x00008000
#define   MAPPING_VALID_30c_SHIFT                        15
#define   CONTROLLER_ID_30c_MASK                 0x00003f00
#define   CONTROLLER_ID_30c_SHIFT                         8
#define   CQ_ID_30c_MASK                         0x0000007f
#define   CQ_ID_30c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_30c:7;
        u32 rsvd_7:1;
        u32 controller_id_30c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_30c:1;
        u32 rsvd_16:16;
    } b;
} flex_cq3_mapping_t;

#define FLEX_CQ4_MAPPING                         0x00000310
#define   MAPPING_VALID_310_MASK                 0x00008000
#define   MAPPING_VALID_310_SHIFT                        15
#define   CONTROLLER_ID_310_MASK                 0x00003f00
#define   CONTROLLER_ID_310_SHIFT                         8
#define   CQ_ID_310_MASK                         0x0000007f
#define   CQ_ID_310_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_310:7;
        u32 rsvd_7:1;
        u32 controller_id_310:6;
        u32 rsvd_14:1;
        u32 mapping_valid_310:1;
        u32 rsvd_16:16;
    } b;
} flex_cq4_mapping_t;

#define FLEX_CQ5_MAPPING                         0x00000314
#define   MAPPING_VALID_314_MASK                 0x00008000
#define   MAPPING_VALID_314_SHIFT                        15
#define   CONTROLLER_ID_314_MASK                 0x00003f00
#define   CONTROLLER_ID_314_SHIFT                         8
#define   CQ_ID_314_MASK                         0x0000007f
#define   CQ_ID_314_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_314:7;
        u32 rsvd_7:1;
        u32 controller_id_314:6;
        u32 rsvd_14:1;
        u32 mapping_valid_314:1;
        u32 rsvd_16:16;
    } b;
} flex_cq5_mapping_t;

#define FLEX_CQ6_MAPPING                         0x00000318
#define   MAPPING_VALID_318_MASK                 0x00008000
#define   MAPPING_VALID_318_SHIFT                        15
#define   CONTROLLER_ID_318_MASK                 0x00003f00
#define   CONTROLLER_ID_318_SHIFT                         8
#define   CQ_ID_318_MASK                         0x0000007f
#define   CQ_ID_318_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_318:7;
        u32 rsvd_7:1;
        u32 controller_id_318:6;
        u32 rsvd_14:1;
        u32 mapping_valid_318:1;
        u32 rsvd_16:16;
    } b;
} flex_cq6_mapping_t;

#define FLEX_CQ7_MAPPING                         0x0000031c
#define   MAPPING_VALID_31c_MASK                 0x00008000
#define   MAPPING_VALID_31c_SHIFT                        15
#define   CONTROLLER_ID_31c_MASK                 0x00003f00
#define   CONTROLLER_ID_31c_SHIFT                         8
#define   CQ_ID_31c_MASK                         0x0000007f
#define   CQ_ID_31c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_31c:7;
        u32 rsvd_7:1;
        u32 controller_id_31c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_31c:1;
        u32 rsvd_16:16;
    } b;
} flex_cq7_mapping_t;

#define FLEX_CQ8_MAPPING                         0x00000320
#define   MAPPING_VALID_320_MASK                 0x00008000
#define   MAPPING_VALID_320_SHIFT                        15
#define   CONTROLLER_ID_320_MASK                 0x00003f00
#define   CONTROLLER_ID_320_SHIFT                         8
#define   CQ_ID_320_MASK                         0x0000007f
#define   CQ_ID_320_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_320:7;
        u32 rsvd_7:1;
        u32 controller_id_320:6;
        u32 rsvd_14:1;
        u32 mapping_valid_320:1;
        u32 rsvd_16:16;
    } b;
} flex_cq8_mapping_t;

#define FLEX_CQ9_MAPPING                         0x00000324
#define   MAPPING_VALID_324_MASK                 0x00008000
#define   MAPPING_VALID_324_SHIFT                        15
#define   CONTROLLER_ID_324_MASK                 0x00003f00
#define   CONTROLLER_ID_324_SHIFT                         8
#define   CQ_ID_324_MASK                         0x0000007f
#define   CQ_ID_324_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_324:7;
        u32 rsvd_7:1;
        u32 controller_id_324:6;
        u32 rsvd_14:1;
        u32 mapping_valid_324:1;
        u32 rsvd_16:16;
    } b;
} flex_cq9_mapping_t;

#define FLEX_CQ10_MAPPING                        0x00000328
#define   MAPPING_VALID_328_MASK                 0x00008000
#define   MAPPING_VALID_328_SHIFT                        15
#define   CONTROLLER_ID_328_MASK                 0x00003f00
#define   CONTROLLER_ID_328_SHIFT                         8
#define   CQ_ID_328_MASK                         0x0000007f
#define   CQ_ID_328_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_328:7;
        u32 rsvd_7:1;
        u32 controller_id_328:6;
        u32 rsvd_14:1;
        u32 mapping_valid_328:1;
        u32 rsvd_16:16;
    } b;
} flex_cq10_mapping_t;

#define FLEX_CQ11_MAPPING                        0x0000032c
#define   MAPPING_VALID_32c_MASK                 0x00008000
#define   MAPPING_VALID_32c_SHIFT                        15
#define   CONTROLLER_ID_32c_MASK                 0x00003f00
#define   CONTROLLER_ID_32c_SHIFT                         8
#define   CQ_ID_32c_MASK                         0x0000007f
#define   CQ_ID_32c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_32c:7;
        u32 rsvd_7:1;
        u32 controller_id_32c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_32c:1;
        u32 rsvd_16:16;
    } b;
} flex_cq11_mapping_t;

#define FLEX_CQ12_MAPPING                        0x00000330
#define   MAPPING_VALID_330_MASK                 0x00008000
#define   MAPPING_VALID_330_SHIFT                        15
#define   CONTROLLER_ID_330_MASK                 0x00003f00
#define   CONTROLLER_ID_330_SHIFT                         8
#define   CQ_ID_330_MASK                         0x0000007f
#define   CQ_ID_330_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_330:7;
        u32 rsvd_7:1;
        u32 controller_id_330:6;
        u32 rsvd_14:1;
        u32 mapping_valid_330:1;
        u32 rsvd_16:16;
    } b;
} flex_cq12_mapping_t;

#define FLEX_CQ13_MAPPING                        0x00000334
#define   MAPPING_VALID_334_MASK                 0x00008000
#define   MAPPING_VALID_334_SHIFT                        15
#define   CONTROLLER_ID_334_MASK                 0x00003f00
#define   CONTROLLER_ID_334_SHIFT                         8
#define   CQ_ID_334_MASK                         0x0000007f
#define   CQ_ID_334_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_334:7;
        u32 rsvd_7:1;
        u32 controller_id_334:6;
        u32 rsvd_14:1;
        u32 mapping_valid_334:1;
        u32 rsvd_16:16;
    } b;
} flex_cq13_mapping_t;

#define FLEX_CQ14_MAPPING                        0x00000338
#define   MAPPING_VALID_338_MASK                 0x00008000
#define   MAPPING_VALID_338_SHIFT                        15
#define   CONTROLLER_ID_338_MASK                 0x00003f00
#define   CONTROLLER_ID_338_SHIFT                         8
#define   CQ_ID_338_MASK                         0x0000007f
#define   CQ_ID_338_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_338:7;
        u32 rsvd_7:1;
        u32 controller_id_338:6;
        u32 rsvd_14:1;
        u32 mapping_valid_338:1;
        u32 rsvd_16:16;
    } b;
} flex_cq14_mapping_t;

#define FLEX_CQ15_MAPPING                        0x0000033c
#define   MAPPING_VALID_33c_MASK                 0x00008000
#define   MAPPING_VALID_33c_SHIFT                        15
#define   CONTROLLER_ID_33c_MASK                 0x00003f00
#define   CONTROLLER_ID_33c_SHIFT                         8
#define   CQ_ID_33c_MASK                         0x0000007f
#define   CQ_ID_33c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_33c:7;
        u32 rsvd_7:1;
        u32 controller_id_33c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_33c:1;
        u32 rsvd_16:16;
    } b;
} flex_cq15_mapping_t;

#define FLEX_CQ16_MAPPING                        0x00000340
#define   MAPPING_VALID_340_MASK                 0x00008000
#define   MAPPING_VALID_340_SHIFT                        15
#define   CONTROLLER_ID_340_MASK                 0x00003f00
#define   CONTROLLER_ID_340_SHIFT                         8
#define   CQ_ID_340_MASK                         0x0000007f
#define   CQ_ID_340_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_340:7;
        u32 rsvd_7:1;
        u32 controller_id_340:6;
        u32 rsvd_14:1;
        u32 mapping_valid_340:1;
        u32 rsvd_16:16;
    } b;
} flex_cq16_mapping_t;

#define FLEX_CQ17_MAPPING                        0x00000344
#define   MAPPING_VALID_344_MASK                 0x00008000
#define   MAPPING_VALID_344_SHIFT                        15
#define   CONTROLLER_ID_344_MASK                 0x00003f00
#define   CONTROLLER_ID_344_SHIFT                         8
#define   CQ_ID_344_MASK                         0x0000007f
#define   CQ_ID_344_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_344:7;
        u32 rsvd_7:1;
        u32 controller_id_344:6;
        u32 rsvd_14:1;
        u32 mapping_valid_344:1;
        u32 rsvd_16:16;
    } b;
} flex_cq17_mapping_t;

#define FLEX_CQ18_MAPPING                        0x00000348
#define   MAPPING_VALID_348_MASK                 0x00008000
#define   MAPPING_VALID_348_SHIFT                        15
#define   CONTROLLER_ID_348_MASK                 0x00003f00
#define   CONTROLLER_ID_348_SHIFT                         8
#define   CQ_ID_348_MASK                         0x0000007f
#define   CQ_ID_348_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_348:7;
        u32 rsvd_7:1;
        u32 controller_id_348:6;
        u32 rsvd_14:1;
        u32 mapping_valid_348:1;
        u32 rsvd_16:16;
    } b;
} flex_cq18_mapping_t;

#define FLEX_CQ19_MAPPING                        0x0000034c
#define   MAPPING_VALID_34c_MASK                 0x00008000
#define   MAPPING_VALID_34c_SHIFT                        15
#define   CONTROLLER_ID_34c_MASK                 0x00003f00
#define   CONTROLLER_ID_34c_SHIFT                         8
#define   CQ_ID_34c_MASK                         0x0000007f
#define   CQ_ID_34c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_34c:7;
        u32 rsvd_7:1;
        u32 controller_id_34c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_34c:1;
        u32 rsvd_16:16;
    } b;
} flex_cq19_mapping_t;

#define FLEX_CQ20_MAPPING                        0x00000350
#define   MAPPING_VALID_350_MASK                 0x00008000
#define   MAPPING_VALID_350_SHIFT                        15
#define   CONTROLLER_ID_350_MASK                 0x00003f00
#define   CONTROLLER_ID_350_SHIFT                         8
#define   CQ_ID_350_MASK                         0x0000007f
#define   CQ_ID_350_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_350:7;
        u32 rsvd_7:1;
        u32 controller_id_350:6;
        u32 rsvd_14:1;
        u32 mapping_valid_350:1;
        u32 rsvd_16:16;
    } b;
} flex_cq20_mapping_t;

#define FLEX_CQ21_MAPPING                        0x00000354
#define   MAPPING_VALID_354_MASK                 0x00008000
#define   MAPPING_VALID_354_SHIFT                        15
#define   CONTROLLER_ID_354_MASK                 0x00003f00
#define   CONTROLLER_ID_354_SHIFT                         8
#define   CQ_ID_354_MASK                         0x0000007f
#define   CQ_ID_354_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_354:7;
        u32 rsvd_7:1;
        u32 controller_id_354:6;
        u32 rsvd_14:1;
        u32 mapping_valid_354:1;
        u32 rsvd_16:16;
    } b;
} flex_cq21_mapping_t;

#define FLEX_CQ22_MAPPING                        0x00000358
#define   MAPPING_VALID_358_MASK                 0x00008000
#define   MAPPING_VALID_358_SHIFT                        15
#define   CONTROLLER_ID_358_MASK                 0x00003f00
#define   CONTROLLER_ID_358_SHIFT                         8
#define   CQ_ID_358_MASK                         0x0000007f
#define   CQ_ID_358_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_358:7;
        u32 rsvd_7:1;
        u32 controller_id_358:6;
        u32 rsvd_14:1;
        u32 mapping_valid_358:1;
        u32 rsvd_16:16;
    } b;
} flex_cq22_mapping_t;

#define FLEX_CQ23_MAPPING                        0x0000035c
#define   MAPPING_VALID_35c_MASK                 0x00008000
#define   MAPPING_VALID_35c_SHIFT                        15
#define   CONTROLLER_ID_35c_MASK                 0x00003f00
#define   CONTROLLER_ID_35c_SHIFT                         8
#define   CQ_ID_35c_MASK                         0x0000007f
#define   CQ_ID_35c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_35c:7;
        u32 rsvd_7:1;
        u32 controller_id_35c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_35c:1;
        u32 rsvd_16:16;
    } b;
} flex_cq23_mapping_t;

#define FLEX_CQ24_MAPPING                        0x00000360
#define   MAPPING_VALID_360_MASK                 0x00008000
#define   MAPPING_VALID_360_SHIFT                        15
#define   CONTROLLER_ID_360_MASK                 0x00003f00
#define   CONTROLLER_ID_360_SHIFT                         8
#define   CQ_ID_360_MASK                         0x0000007f
#define   CQ_ID_360_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_360:7;
        u32 rsvd_7:1;
        u32 controller_id_360:6;
        u32 rsvd_14:1;
        u32 mapping_valid_360:1;
        u32 rsvd_16:16;
    } b;
} flex_cq24_mapping_t;

#define FLEX_CQ25_MAPPING                        0x00000364
#define   MAPPING_VALID_364_MASK                 0x00008000
#define   MAPPING_VALID_364_SHIFT                        15
#define   CONTROLLER_ID_364_MASK                 0x00003f00
#define   CONTROLLER_ID_364_SHIFT                         8
#define   CQ_ID_364_MASK                         0x0000007f
#define   CQ_ID_364_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_364:7;
        u32 rsvd_7:1;
        u32 controller_id_364:6;
        u32 rsvd_14:1;
        u32 mapping_valid_364:1;
        u32 rsvd_16:16;
    } b;
} flex_cq25_mapping_t;

#define FLEX_CQ26_MAPPING                        0x00000368
#define   MAPPING_VALID_368_MASK                 0x00008000
#define   MAPPING_VALID_368_SHIFT                        15
#define   CONTROLLER_ID_368_MASK                 0x00003f00
#define   CONTROLLER_ID_368_SHIFT                         8
#define   CQ_ID_368_MASK                         0x0000007f
#define   CQ_ID_368_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_368:7;
        u32 rsvd_7:1;
        u32 controller_id_368:6;
        u32 rsvd_14:1;
        u32 mapping_valid_368:1;
        u32 rsvd_16:16;
    } b;
} flex_cq26_mapping_t;

#define FLEX_CQ27_MAPPING                        0x0000036c
#define   MAPPING_VALID_36c_MASK                 0x00008000
#define   MAPPING_VALID_36c_SHIFT                        15
#define   CONTROLLER_ID_36c_MASK                 0x00003f00
#define   CONTROLLER_ID_36c_SHIFT                         8
#define   CQ_ID_36c_MASK                         0x0000007f
#define   CQ_ID_36c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_36c:7;
        u32 rsvd_7:1;
        u32 controller_id_36c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_36c:1;
        u32 rsvd_16:16;
    } b;
} flex_cq27_mapping_t;

#define FLEX_CQ28_MAPPING                        0x00000370
#define   MAPPING_VALID_370_MASK                 0x00008000
#define   MAPPING_VALID_370_SHIFT                        15
#define   CONTROLLER_ID_370_MASK                 0x00003f00
#define   CONTROLLER_ID_370_SHIFT                         8
#define   CQ_ID_370_MASK                         0x0000007f
#define   CQ_ID_370_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_370:7;
        u32 rsvd_7:1;
        u32 controller_id_370:6;
        u32 rsvd_14:1;
        u32 mapping_valid_370:1;
        u32 rsvd_16:16;
    } b;
} flex_cq28_mapping_t;

#define FLEX_CQ29_MAPPING                        0x00000374
#define   MAPPING_VALID_374_MASK                 0x00008000
#define   MAPPING_VALID_374_SHIFT                        15
#define   CONTROLLER_ID_374_MASK                 0x00003f00
#define   CONTROLLER_ID_374_SHIFT                         8
#define   CQ_ID_374_MASK                         0x0000007f
#define   CQ_ID_374_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_374:7;
        u32 rsvd_7:1;
        u32 controller_id_374:6;
        u32 rsvd_14:1;
        u32 mapping_valid_374:1;
        u32 rsvd_16:16;
    } b;
} flex_cq29_mapping_t;

#define FLEX_CQ30_MAPPING                        0x00000378
#define   MAPPING_VALID_378_MASK                 0x00008000
#define   MAPPING_VALID_378_SHIFT                        15
#define   CONTROLLER_ID_378_MASK                 0x00003f00
#define   CONTROLLER_ID_378_SHIFT                         8
#define   CQ_ID_378_MASK                         0x0000007f
#define   CQ_ID_378_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_378:7;
        u32 rsvd_7:1;
        u32 controller_id_378:6;
        u32 rsvd_14:1;
        u32 mapping_valid_378:1;
        u32 rsvd_16:16;
    } b;
} flex_cq30_mapping_t;

#define FLEX_CQ31_MAPPING                        0x0000037c
#define   MAPPING_VALID_37c_MASK                 0x00008000
#define   MAPPING_VALID_37c_SHIFT                        15
#define   CONTROLLER_ID_37c_MASK                 0x00003f00
#define   CONTROLLER_ID_37c_SHIFT                         8
#define   CQ_ID_37c_MASK                         0x0000007f
#define   CQ_ID_37c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_37c:7;
        u32 rsvd_7:1;
        u32 controller_id_37c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_37c:1;
        u32 rsvd_16:16;
    } b;
} flex_cq31_mapping_t;

#define FLEX_CQ32_MAPPING                        0x00000380
#define   MAPPING_VALID_380_MASK                 0x00008000
#define   MAPPING_VALID_380_SHIFT                        15
#define   CONTROLLER_ID_380_MASK                 0x00003f00
#define   CONTROLLER_ID_380_SHIFT                         8
#define   CQ_ID_380_MASK                         0x0000007f
#define   CQ_ID_380_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_380:7;
        u32 rsvd_7:1;
        u32 controller_id_380:6;
        u32 rsvd_14:1;
        u32 mapping_valid_380:1;
        u32 rsvd_16:16;
    } b;
} flex_cq32_mapping_t;

#define FLEX_CQ33_MAPPING                        0x00000384
#define   MAPPING_VALID_384_MASK                 0x00008000
#define   MAPPING_VALID_384_SHIFT                        15
#define   CONTROLLER_ID_384_MASK                 0x00003f00
#define   CONTROLLER_ID_384_SHIFT                         8
#define   CQ_ID_384_MASK                         0x0000007f
#define   CQ_ID_384_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_384:7;
        u32 rsvd_7:1;
        u32 controller_id_384:6;
        u32 rsvd_14:1;
        u32 mapping_valid_384:1;
        u32 rsvd_16:16;
    } b;
} flex_cq33_mapping_t;

#define FLEX_CQ34_MAPPING                        0x00000388
#define   MAPPING_VALID_388_MASK                 0x00008000
#define   MAPPING_VALID_388_SHIFT                        15
#define   CONTROLLER_ID_388_MASK                 0x00003f00
#define   CONTROLLER_ID_388_SHIFT                         8
#define   CQ_ID_388_MASK                         0x0000007f
#define   CQ_ID_388_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_388:7;
        u32 rsvd_7:1;
        u32 controller_id_388:6;
        u32 rsvd_14:1;
        u32 mapping_valid_388:1;
        u32 rsvd_16:16;
    } b;
} flex_cq34_mapping_t;

#define FLEX_CQ35_MAPPING                        0x0000038c
#define   MAPPING_VALID_38c_MASK                 0x00008000
#define   MAPPING_VALID_38c_SHIFT                        15
#define   CONTROLLER_ID_38c_MASK                 0x00003f00
#define   CONTROLLER_ID_38c_SHIFT                         8
#define   CQ_ID_38c_MASK                         0x0000007f
#define   CQ_ID_38c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_38c:7;
        u32 rsvd_7:1;
        u32 controller_id_38c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_38c:1;
        u32 rsvd_16:16;
    } b;
} flex_cq35_mapping_t;

#define FLEX_CQ36_MAPPING                        0x00000390
#define   MAPPING_VALID_390_MASK                 0x00008000
#define   MAPPING_VALID_390_SHIFT                        15
#define   CONTROLLER_ID_390_MASK                 0x00003f00
#define   CONTROLLER_ID_390_SHIFT                         8
#define   CQ_ID_390_MASK                         0x0000007f
#define   CQ_ID_390_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_390:7;
        u32 rsvd_7:1;
        u32 controller_id_390:6;
        u32 rsvd_14:1;
        u32 mapping_valid_390:1;
        u32 rsvd_16:16;
    } b;
} flex_cq36_mapping_t;

#define FLEX_CQ37_MAPPING                        0x00000394
#define   MAPPING_VALID_394_MASK                 0x00008000
#define   MAPPING_VALID_394_SHIFT                        15
#define   CONTROLLER_ID_394_MASK                 0x00003f00
#define   CONTROLLER_ID_394_SHIFT                         8
#define   CQ_ID_394_MASK                         0x0000007f
#define   CQ_ID_394_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_394:7;
        u32 rsvd_7:1;
        u32 controller_id_394:6;
        u32 rsvd_14:1;
        u32 mapping_valid_394:1;
        u32 rsvd_16:16;
    } b;
} flex_cq37_mapping_t;

#define FLEX_CQ38_MAPPING                        0x00000398
#define   MAPPING_VALID_398_MASK                 0x00008000
#define   MAPPING_VALID_398_SHIFT                        15
#define   CONTROLLER_ID_398_MASK                 0x00003f00
#define   CONTROLLER_ID_398_SHIFT                         8
#define   CQ_ID_398_MASK                         0x0000007f
#define   CQ_ID_398_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_398:7;
        u32 rsvd_7:1;
        u32 controller_id_398:6;
        u32 rsvd_14:1;
        u32 mapping_valid_398:1;
        u32 rsvd_16:16;
    } b;
} flex_cq38_mapping_t;

#define FLEX_CQ39_MAPPING                        0x0000039c
#define   MAPPING_VALID_39c_MASK                 0x00008000
#define   MAPPING_VALID_39c_SHIFT                        15
#define   CONTROLLER_ID_39c_MASK                 0x00003f00
#define   CONTROLLER_ID_39c_SHIFT                         8
#define   CQ_ID_39c_MASK                         0x0000007f
#define   CQ_ID_39c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_39c:7;
        u32 rsvd_7:1;
        u32 controller_id_39c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_39c:1;
        u32 rsvd_16:16;
    } b;
} flex_cq39_mapping_t;

#define FLEX_CQ40_MAPPING                        0x000003a0
#define   MAPPING_VALID_3a0_MASK                 0x00008000
#define   MAPPING_VALID_3a0_SHIFT                        15
#define   CONTROLLER_ID_3a0_MASK                 0x00003f00
#define   CONTROLLER_ID_3a0_SHIFT                         8
#define   CQ_ID_3a0_MASK                         0x0000007f
#define   CQ_ID_3a0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3a0:7;
        u32 rsvd_7:1;
        u32 controller_id_3a0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3a0:1;
        u32 rsvd_16:16;
    } b;
} flex_cq40_mapping_t;

#define FLEX_CQ41_MAPPING                        0x000003a4
#define   MAPPING_VALID_3a4_MASK                 0x00008000
#define   MAPPING_VALID_3a4_SHIFT                        15
#define   CONTROLLER_ID_3a4_MASK                 0x00003f00
#define   CONTROLLER_ID_3a4_SHIFT                         8
#define   CQ_ID_3a4_MASK                         0x0000007f
#define   CQ_ID_3a4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3a4:7;
        u32 rsvd_7:1;
        u32 controller_id_3a4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3a4:1;
        u32 rsvd_16:16;
    } b;
} flex_cq41_mapping_t;

#define FLEX_CQ42_MAPPING                        0x000003a8
#define   MAPPING_VALID_3a8_MASK                 0x00008000
#define   MAPPING_VALID_3a8_SHIFT                        15
#define   CONTROLLER_ID_3a8_MASK                 0x00003f00
#define   CONTROLLER_ID_3a8_SHIFT                         8
#define   CQ_ID_3a8_MASK                         0x0000007f
#define   CQ_ID_3a8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3a8:7;
        u32 rsvd_7:1;
        u32 controller_id_3a8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3a8:1;
        u32 rsvd_16:16;
    } b;
} flex_cq42_mapping_t;

#define FLEX_CQ43_MAPPING                        0x000003ac
#define   MAPPING_VALID_3ac_MASK                 0x00008000
#define   MAPPING_VALID_3ac_SHIFT                        15
#define   CONTROLLER_ID_3ac_MASK                 0x00003f00
#define   CONTROLLER_ID_3ac_SHIFT                         8
#define   CQ_ID_3ac_MASK                         0x0000007f
#define   CQ_ID_3ac_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3ac:7;
        u32 rsvd_7:1;
        u32 controller_id_3ac:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3ac:1;
        u32 rsvd_16:16;
    } b;
} flex_cq43_mapping_t;

#define FLEX_CQ44_MAPPING                        0x000003b0
#define   MAPPING_VALID_3b0_MASK                 0x00008000
#define   MAPPING_VALID_3b0_SHIFT                        15
#define   CONTROLLER_ID_3b0_MASK                 0x00003f00
#define   CONTROLLER_ID_3b0_SHIFT                         8
#define   CQ_ID_3b0_MASK                         0x0000007f
#define   CQ_ID_3b0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3b0:7;
        u32 rsvd_7:1;
        u32 controller_id_3b0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3b0:1;
        u32 rsvd_16:16;
    } b;
} flex_cq44_mapping_t;

#define FLEX_CQ45_MAPPING                        0x000003b4
#define   MAPPING_VALID_3b4_MASK                 0x00008000
#define   MAPPING_VALID_3b4_SHIFT                        15
#define   CONTROLLER_ID_3b4_MASK                 0x00003f00
#define   CONTROLLER_ID_3b4_SHIFT                         8
#define   CQ_ID_3b4_MASK                         0x0000007f
#define   CQ_ID_3b4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3b4:7;
        u32 rsvd_7:1;
        u32 controller_id_3b4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3b4:1;
        u32 rsvd_16:16;
    } b;
} flex_cq45_mapping_t;

#define FLEX_CQ46_MAPPING                        0x000003b8
#define   MAPPING_VALID_3b8_MASK                 0x00008000
#define   MAPPING_VALID_3b8_SHIFT                        15
#define   CONTROLLER_ID_3b8_MASK                 0x00003f00
#define   CONTROLLER_ID_3b8_SHIFT                         8
#define   CQ_ID_3b8_MASK                         0x0000007f
#define   CQ_ID_3b8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3b8:7;
        u32 rsvd_7:1;
        u32 controller_id_3b8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3b8:1;
        u32 rsvd_16:16;
    } b;
} flex_cq46_mapping_t;

#define FLEX_CQ47_MAPPING                        0x000003bc
#define   MAPPING_VALID_3bc_MASK                 0x00008000
#define   MAPPING_VALID_3bc_SHIFT                        15
#define   CONTROLLER_ID_3bc_MASK                 0x00003f00
#define   CONTROLLER_ID_3bc_SHIFT                         8
#define   CQ_ID_3bc_MASK                         0x0000007f
#define   CQ_ID_3bc_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3bc:7;
        u32 rsvd_7:1;
        u32 controller_id_3bc:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3bc:1;
        u32 rsvd_16:16;
    } b;
} flex_cq47_mapping_t;

#define FLEX_CQ48_MAPPING                        0x000003c0
#define   MAPPING_VALID_3c0_MASK                 0x00008000
#define   MAPPING_VALID_3c0_SHIFT                        15
#define   CONTROLLER_ID_3c0_MASK                 0x00003f00
#define   CONTROLLER_ID_3c0_SHIFT                         8
#define   CQ_ID_3c0_MASK                         0x0000007f
#define   CQ_ID_3c0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3c0:7;
        u32 rsvd_7:1;
        u32 controller_id_3c0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3c0:1;
        u32 rsvd_16:16;
    } b;
} flex_cq48_mapping_t;

#define FLEX_CQ49_MAPPING                        0x000003c4
#define   MAPPING_VALID_3c4_MASK                 0x00008000
#define   MAPPING_VALID_3c4_SHIFT                        15
#define   CONTROLLER_ID_3c4_MASK                 0x00003f00
#define   CONTROLLER_ID_3c4_SHIFT                         8
#define   CQ_ID_3c4_MASK                         0x0000007f
#define   CQ_ID_3c4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3c4:7;
        u32 rsvd_7:1;
        u32 controller_id_3c4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3c4:1;
        u32 rsvd_16:16;
    } b;
} flex_cq49_mapping_t;

#define FLEX_CQ50_MAPPING                        0x000003c8
#define   MAPPING_VALID_3c8_MASK                 0x00008000
#define   MAPPING_VALID_3c8_SHIFT                        15
#define   CONTROLLER_ID_3c8_MASK                 0x00003f00
#define   CONTROLLER_ID_3c8_SHIFT                         8
#define   CQ_ID_3c8_MASK                         0x0000007f
#define   CQ_ID_3c8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3c8:7;
        u32 rsvd_7:1;
        u32 controller_id_3c8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3c8:1;
        u32 rsvd_16:16;
    } b;
} flex_cq50_mapping_t;

#define FLEX_CQ51_MAPPING                        0x000003cc
#define   MAPPING_VALID_3cc_MASK                 0x00008000
#define   MAPPING_VALID_3cc_SHIFT                        15
#define   CONTROLLER_ID_3cc_MASK                 0x00003f00
#define   CONTROLLER_ID_3cc_SHIFT                         8
#define   CQ_ID_3cc_MASK                         0x0000007f
#define   CQ_ID_3cc_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3cc:7;
        u32 rsvd_7:1;
        u32 controller_id_3cc:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3cc:1;
        u32 rsvd_16:16;
    } b;
} flex_cq51_mapping_t;

#define FLEX_CQ52_MAPPING                        0x000003d0
#define   MAPPING_VALID_3d0_MASK                 0x00008000
#define   MAPPING_VALID_3d0_SHIFT                        15
#define   CONTROLLER_ID_3d0_MASK                 0x00003f00
#define   CONTROLLER_ID_3d0_SHIFT                         8
#define   CQ_ID_3d0_MASK                         0x0000007f
#define   CQ_ID_3d0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3d0:7;
        u32 rsvd_7:1;
        u32 controller_id_3d0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3d0:1;
        u32 rsvd_16:16;
    } b;
} flex_cq52_mapping_t;

#define FLEX_CQ53_MAPPING                        0x000003d4
#define   MAPPING_VALID_3d4_MASK                 0x00008000
#define   MAPPING_VALID_3d4_SHIFT                        15
#define   CONTROLLER_ID_3d4_MASK                 0x00003f00
#define   CONTROLLER_ID_3d4_SHIFT                         8
#define   CQ_ID_3d4_MASK                         0x0000007f
#define   CQ_ID_3d4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3d4:7;
        u32 rsvd_7:1;
        u32 controller_id_3d4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3d4:1;
        u32 rsvd_16:16;
    } b;
} flex_cq53_mapping_t;

#define FLEX_CQ54_MAPPING                        0x000003d8
#define   MAPPING_VALID_3d8_MASK                 0x00008000
#define   MAPPING_VALID_3d8_SHIFT                        15
#define   CONTROLLER_ID_3d8_MASK                 0x00003f00
#define   CONTROLLER_ID_3d8_SHIFT                         8
#define   CQ_ID_3d8_MASK                         0x0000007f
#define   CQ_ID_3d8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3d8:7;
        u32 rsvd_7:1;
        u32 controller_id_3d8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3d8:1;
        u32 rsvd_16:16;
    } b;
} flex_cq54_mapping_t;

#define FLEX_CQ55_MAPPING                        0x000003dc
#define   MAPPING_VALID_3dc_MASK                 0x00008000
#define   MAPPING_VALID_3dc_SHIFT                        15
#define   CONTROLLER_ID_3dc_MASK                 0x00003f00
#define   CONTROLLER_ID_3dc_SHIFT                         8
#define   CQ_ID_3dc_MASK                         0x0000007f
#define   CQ_ID_3dc_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3dc:7;
        u32 rsvd_7:1;
        u32 controller_id_3dc:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3dc:1;
        u32 rsvd_16:16;
    } b;
} flex_cq55_mapping_t;

#define FLEX_CQ56_MAPPING                        0x000003e0
#define   MAPPING_VALID_3e0_MASK                 0x00008000
#define   MAPPING_VALID_3e0_SHIFT                        15
#define   CONTROLLER_ID_3e0_MASK                 0x00003f00
#define   CONTROLLER_ID_3e0_SHIFT                         8
#define   CQ_ID_3e0_MASK                         0x0000007f
#define   CQ_ID_3e0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3e0:7;
        u32 rsvd_7:1;
        u32 controller_id_3e0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3e0:1;
        u32 rsvd_16:16;
    } b;
} flex_cq56_mapping_t;

#define FLEX_CQ57_MAPPING                        0x000003e4
#define   MAPPING_VALID_3e4_MASK                 0x00008000
#define   MAPPING_VALID_3e4_SHIFT                        15
#define   CONTROLLER_ID_3e4_MASK                 0x00003f00
#define   CONTROLLER_ID_3e4_SHIFT                         8
#define   CQ_ID_3e4_MASK                         0x0000007f
#define   CQ_ID_3e4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3e4:7;
        u32 rsvd_7:1;
        u32 controller_id_3e4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3e4:1;
        u32 rsvd_16:16;
    } b;
} flex_cq57_mapping_t;

#define FLEX_CQ58_MAPPING                        0x000003e8
#define   MAPPING_VALID_3e8_MASK                 0x00008000
#define   MAPPING_VALID_3e8_SHIFT                        15
#define   CONTROLLER_ID_3e8_MASK                 0x00003f00
#define   CONTROLLER_ID_3e8_SHIFT                         8
#define   CQ_ID_3e8_MASK                         0x0000007f
#define   CQ_ID_3e8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3e8:7;
        u32 rsvd_7:1;
        u32 controller_id_3e8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3e8:1;
        u32 rsvd_16:16;
    } b;
} flex_cq58_mapping_t;

#define FLEX_CQ59_MAPPING                        0x000003ec
#define   MAPPING_VALID_3ec_MASK                 0x00008000
#define   MAPPING_VALID_3ec_SHIFT                        15
#define   CONTROLLER_ID_3ec_MASK                 0x00003f00
#define   CONTROLLER_ID_3ec_SHIFT                         8
#define   CQ_ID_3ec_MASK                         0x0000007f
#define   CQ_ID_3ec_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3ec:7;
        u32 rsvd_7:1;
        u32 controller_id_3ec:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3ec:1;
        u32 rsvd_16:16;
    } b;
} flex_cq59_mapping_t;

#define FLEX_CQ60_MAPPING                        0x000003f0
#define   MAPPING_VALID_3f0_MASK                 0x00008000
#define   MAPPING_VALID_3f0_SHIFT                        15
#define   CONTROLLER_ID_3f0_MASK                 0x00003f00
#define   CONTROLLER_ID_3f0_SHIFT                         8
#define   CQ_ID_3f0_MASK                         0x0000007f
#define   CQ_ID_3f0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3f0:7;
        u32 rsvd_7:1;
        u32 controller_id_3f0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3f0:1;
        u32 rsvd_16:16;
    } b;
} flex_cq60_mapping_t;

#define FLEX_CQ61_MAPPING                        0x000003f4
#define   MAPPING_VALID_3f4_MASK                 0x00008000
#define   MAPPING_VALID_3f4_SHIFT                        15
#define   CONTROLLER_ID_3f4_MASK                 0x00003f00
#define   CONTROLLER_ID_3f4_SHIFT                         8
#define   CQ_ID_3f4_MASK                         0x0000007f
#define   CQ_ID_3f4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3f4:7;
        u32 rsvd_7:1;
        u32 controller_id_3f4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3f4:1;
        u32 rsvd_16:16;
    } b;
} flex_cq61_mapping_t;

#define FLEX_CQ62_MAPPING                        0x000003f8
#define   MAPPING_VALID_3f8_MASK                 0x00008000
#define   MAPPING_VALID_3f8_SHIFT                        15
#define   CONTROLLER_ID_3f8_MASK                 0x00003f00
#define   CONTROLLER_ID_3f8_SHIFT                         8
#define   CQ_ID_3f8_MASK                         0x0000007f
#define   CQ_ID_3f8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3f8:7;
        u32 rsvd_7:1;
        u32 controller_id_3f8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3f8:1;
        u32 rsvd_16:16;
    } b;
} flex_cq62_mapping_t;

#define FLEX_CQ63_MAPPING                        0x000003fc
#define   MAPPING_VALID_3fc_MASK                 0x00008000
#define   MAPPING_VALID_3fc_SHIFT                        15
#define   CONTROLLER_ID_3fc_MASK                 0x00003f00
#define   CONTROLLER_ID_3fc_SHIFT                         8
#define   CQ_ID_3fc_MASK                         0x0000007f
#define   CQ_ID_3fc_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_3fc:7;
        u32 rsvd_7:1;
        u32 controller_id_3fc:6;
        u32 rsvd_14:1;
        u32 mapping_valid_3fc:1;
        u32 rsvd_16:16;
    } b;
} flex_cq63_mapping_t;

#define FLEX_CQ64_MAPPING                        0x00000400
#define   MAPPING_VALID_400_MASK                 0x00008000
#define   MAPPING_VALID_400_SHIFT                        15
#define   CONTROLLER_ID_400_MASK                 0x00003f00
#define   CONTROLLER_ID_400_SHIFT                         8
#define   CQ_ID_400_MASK                         0x0000007f
#define   CQ_ID_400_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_400:7;
        u32 rsvd_7:1;
        u32 controller_id_400:6;
        u32 rsvd_14:1;
        u32 mapping_valid_400:1;
        u32 rsvd_16:16;
    } b;
} flex_cq64_mapping_t;

#define FLEX_CQ65_MAPPING                        0x00000404
#define   MAPPING_VALID_404_MASK                 0x00008000
#define   MAPPING_VALID_404_SHIFT                        15
#define   CONTROLLER_ID_404_MASK                 0x00003f00
#define   CONTROLLER_ID_404_SHIFT                         8
#define   CQ_ID_404_MASK                         0x0000007f
#define   CQ_ID_404_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cq_id_404:7;
        u32 rsvd_7:1;
        u32 controller_id_404:6;
        u32 rsvd_14:1;
        u32 mapping_valid_404:1;
        u32 rsvd_16:16;
    } b;
} flex_cq65_mapping_t;

#define FLEX_MX0_MAPPING                         0x00000600
#define   MAPPING_VALID_600_MASK                 0x00008000
#define   MAPPING_VALID_600_SHIFT                        15
#define   CONTROLLER_ID_600_MASK                 0x00003f00
#define   CONTROLLER_ID_600_SHIFT                         8
#define   MX_ID_MASK                             0x0000007f
#define   MX_ID_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 mx_id:7;
        u32 rsvd_7:1;
        u32 controller_id_600:6;
        u32 rsvd_14:1;
        u32 mapping_valid_600:1;
        u32 rsvd_16:16;
    } b;
} flex_mx0_mapping_t;

#define FLEX_MX1_MAPPING                         0x00000604
#define   MAPPING_VALID_604_MASK                 0x00008000
#define   MAPPING_VALID_604_SHIFT                        15
#define   CONTROLLER_ID_604_MASK                 0x00003f00
#define   CONTROLLER_ID_604_SHIFT                         8
#define   MX_ID_604_MASK                         0x0000007f
#define   MX_ID_604_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_604:7;
        u32 rsvd_7:1;
        u32 controller_id_604:6;
        u32 rsvd_14:1;
        u32 mapping_valid_604:1;
        u32 rsvd_16:16;
    } b;
} flex_mx1_mapping_t;

#define FLEX_MX2_MAPPING                         0x00000608
#define   MAPPING_VALID_608_MASK                 0x00008000
#define   MAPPING_VALID_608_SHIFT                        15
#define   CONTROLLER_ID_608_MASK                 0x00003f00
#define   CONTROLLER_ID_608_SHIFT                         8
#define   MX_ID_608_MASK                         0x0000007f
#define   MX_ID_608_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_608:7;
        u32 rsvd_7:1;
        u32 controller_id_608:6;
        u32 rsvd_14:1;
        u32 mapping_valid_608:1;
        u32 rsvd_16:16;
    } b;
} flex_mx2_mapping_t;

#define FLEX_MX3_MAPPING                         0x0000060c
#define   MAPPING_VALID_60c_MASK                 0x00008000
#define   MAPPING_VALID_60c_SHIFT                        15
#define   CONTROLLER_ID_60c_MASK                 0x00003f00
#define   CONTROLLER_ID_60c_SHIFT                         8
#define   MX_ID_60c_MASK                         0x0000007f
#define   MX_ID_60c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_60c:7;
        u32 rsvd_7:1;
        u32 controller_id_60c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_60c:1;
        u32 rsvd_16:16;
    } b;
} flex_mx3_mapping_t;

#define FLEX_MX4_MAPPING                         0x00000610
#define   MAPPING_VALID_610_MASK                 0x00008000
#define   MAPPING_VALID_610_SHIFT                        15
#define   CONTROLLER_ID_610_MASK                 0x00003f00
#define   CONTROLLER_ID_610_SHIFT                         8
#define   MX_ID_610_MASK                         0x0000007f
#define   MX_ID_610_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_610:7;
        u32 rsvd_7:1;
        u32 controller_id_610:6;
        u32 rsvd_14:1;
        u32 mapping_valid_610:1;
        u32 rsvd_16:16;
    } b;
} flex_mx4_mapping_t;

#define FLEX_MX5_MAPPING                         0x00000614
#define   MAPPING_VALID_614_MASK                 0x00008000
#define   MAPPING_VALID_614_SHIFT                        15
#define   CONTROLLER_ID_614_MASK                 0x00003f00
#define   CONTROLLER_ID_614_SHIFT                         8
#define   MX_ID_614_MASK                         0x0000007f
#define   MX_ID_614_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_614:7;
        u32 rsvd_7:1;
        u32 controller_id_614:6;
        u32 rsvd_14:1;
        u32 mapping_valid_614:1;
        u32 rsvd_16:16;
    } b;
} flex_mx5_mapping_t;

#define FLEX_MX6_MAPPING                         0x00000618
#define   MAPPING_VALID_618_MASK                 0x00008000
#define   MAPPING_VALID_618_SHIFT                        15
#define   CONTROLLER_ID_618_MASK                 0x00003f00
#define   CONTROLLER_ID_618_SHIFT                         8
#define   MX_ID_618_MASK                         0x0000007f
#define   MX_ID_618_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_618:7;
        u32 rsvd_7:1;
        u32 controller_id_618:6;
        u32 rsvd_14:1;
        u32 mapping_valid_618:1;
        u32 rsvd_16:16;
    } b;
} flex_mx6_mapping_t;

#define FLEX_MX7_MAPPING                         0x0000061c
#define   MAPPING_VALID_61c_MASK                 0x00008000
#define   MAPPING_VALID_61c_SHIFT                        15
#define   CONTROLLER_ID_61c_MASK                 0x00003f00
#define   CONTROLLER_ID_61c_SHIFT                         8
#define   MX_ID_61c_MASK                         0x0000007f
#define   MX_ID_61c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_61c:7;
        u32 rsvd_7:1;
        u32 controller_id_61c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_61c:1;
        u32 rsvd_16:16;
    } b;
} flex_mx7_mapping_t;

#define FLEX_MX8_MAPPING                         0x00000620
#define   MAPPING_VALID_620_MASK                 0x00008000
#define   MAPPING_VALID_620_SHIFT                        15
#define   CONTROLLER_ID_620_MASK                 0x00003f00
#define   CONTROLLER_ID_620_SHIFT                         8
#define   MX_ID_620_MASK                         0x0000007f
#define   MX_ID_620_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_620:7;
        u32 rsvd_7:1;
        u32 controller_id_620:6;
        u32 rsvd_14:1;
        u32 mapping_valid_620:1;
        u32 rsvd_16:16;
    } b;
} flex_mx8_mapping_t;

#define FLEX_MX9_MAPPING                         0x00000624
#define   MAPPING_VALID_624_MASK                 0x00008000
#define   MAPPING_VALID_624_SHIFT                        15
#define   CONTROLLER_ID_624_MASK                 0x00003f00
#define   CONTROLLER_ID_624_SHIFT                         8
#define   MX_ID_624_MASK                         0x0000007f
#define   MX_ID_624_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_624:7;
        u32 rsvd_7:1;
        u32 controller_id_624:6;
        u32 rsvd_14:1;
        u32 mapping_valid_624:1;
        u32 rsvd_16:16;
    } b;
} flex_mx9_mapping_t;

#define FLEX_MX10_MAPPING                        0x00000628
#define   MAPPING_VALID_628_MASK                 0x00008000
#define   MAPPING_VALID_628_SHIFT                        15
#define   CONTROLLER_ID_628_MASK                 0x00003f00
#define   CONTROLLER_ID_628_SHIFT                         8
#define   MX_ID_628_MASK                         0x0000007f
#define   MX_ID_628_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_628:7;
        u32 rsvd_7:1;
        u32 controller_id_628:6;
        u32 rsvd_14:1;
        u32 mapping_valid_628:1;
        u32 rsvd_16:16;
    } b;
} flex_mx10_mapping_t;

#define FLEX_MX11_MAPPING                        0x0000062c
#define   MAPPING_VALID_62c_MASK                 0x00008000
#define   MAPPING_VALID_62c_SHIFT                        15
#define   CONTROLLER_ID_62c_MASK                 0x00003f00
#define   CONTROLLER_ID_62c_SHIFT                         8
#define   MX_ID_62c_MASK                         0x0000007f
#define   MX_ID_62c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_62c:7;
        u32 rsvd_7:1;
        u32 controller_id_62c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_62c:1;
        u32 rsvd_16:16;
    } b;
} flex_mx11_mapping_t;

#define FLEX_MX12_MAPPING                        0x00000630
#define   MAPPING_VALID_630_MASK                 0x00008000
#define   MAPPING_VALID_630_SHIFT                        15
#define   CONTROLLER_ID_630_MASK                 0x00003f00
#define   CONTROLLER_ID_630_SHIFT                         8
#define   MX_ID_630_MASK                         0x0000007f
#define   MX_ID_630_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_630:7;
        u32 rsvd_7:1;
        u32 controller_id_630:6;
        u32 rsvd_14:1;
        u32 mapping_valid_630:1;
        u32 rsvd_16:16;
    } b;
} flex_mx12_mapping_t;

#define FLEX_MX13_MAPPING                        0x00000634
#define   MAPPING_VALID_634_MASK                 0x00008000
#define   MAPPING_VALID_634_SHIFT                        15
#define   CONTROLLER_ID_634_MASK                 0x00003f00
#define   CONTROLLER_ID_634_SHIFT                         8
#define   MX_ID_634_MASK                         0x0000007f
#define   MX_ID_634_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_634:7;
        u32 rsvd_7:1;
        u32 controller_id_634:6;
        u32 rsvd_14:1;
        u32 mapping_valid_634:1;
        u32 rsvd_16:16;
    } b;
} flex_mx13_mapping_t;

#define FLEX_MX14_MAPPING                        0x00000638
#define   MAPPING_VALID_638_MASK                 0x00008000
#define   MAPPING_VALID_638_SHIFT                        15
#define   CONTROLLER_ID_638_MASK                 0x00003f00
#define   CONTROLLER_ID_638_SHIFT                         8
#define   MX_ID_638_MASK                         0x0000007f
#define   MX_ID_638_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_638:7;
        u32 rsvd_7:1;
        u32 controller_id_638:6;
        u32 rsvd_14:1;
        u32 mapping_valid_638:1;
        u32 rsvd_16:16;
    } b;
} flex_mx14_mapping_t;

#define FLEX_MX15_MAPPING                        0x0000063c
#define   MAPPING_VALID_63c_MASK                 0x00008000
#define   MAPPING_VALID_63c_SHIFT                        15
#define   CONTROLLER_ID_63c_MASK                 0x00003f00
#define   CONTROLLER_ID_63c_SHIFT                         8
#define   MX_ID_63c_MASK                         0x0000007f
#define   MX_ID_63c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_63c:7;
        u32 rsvd_7:1;
        u32 controller_id_63c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_63c:1;
        u32 rsvd_16:16;
    } b;
} flex_mx15_mapping_t;

#define FLEX_MX16_MAPPING                        0x00000640
#define   MAPPING_VALID_640_MASK                 0x00008000
#define   MAPPING_VALID_640_SHIFT                        15
#define   CONTROLLER_ID_640_MASK                 0x00003f00
#define   CONTROLLER_ID_640_SHIFT                         8
#define   MX_ID_640_MASK                         0x0000007f
#define   MX_ID_640_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_640:7;
        u32 rsvd_7:1;
        u32 controller_id_640:6;
        u32 rsvd_14:1;
        u32 mapping_valid_640:1;
        u32 rsvd_16:16;
    } b;
} flex_mx16_mapping_t;

#define FLEX_MX17_MAPPING                        0x00000644
#define   MAPPING_VALID_644_MASK                 0x00008000
#define   MAPPING_VALID_644_SHIFT                        15
#define   CONTROLLER_ID_644_MASK                 0x00003f00
#define   CONTROLLER_ID_644_SHIFT                         8
#define   MX_ID_644_MASK                         0x0000007f
#define   MX_ID_644_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_644:7;
        u32 rsvd_7:1;
        u32 controller_id_644:6;
        u32 rsvd_14:1;
        u32 mapping_valid_644:1;
        u32 rsvd_16:16;
    } b;
} flex_mx17_mapping_t;

#define FLEX_MX18_MAPPING                        0x00000648
#define   MAPPING_VALID_648_MASK                 0x00008000
#define   MAPPING_VALID_648_SHIFT                        15
#define   CONTROLLER_ID_648_MASK                 0x00003f00
#define   CONTROLLER_ID_648_SHIFT                         8
#define   MX_ID_648_MASK                         0x0000007f
#define   MX_ID_648_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_648:7;
        u32 rsvd_7:1;
        u32 controller_id_648:6;
        u32 rsvd_14:1;
        u32 mapping_valid_648:1;
        u32 rsvd_16:16;
    } b;
} flex_mx18_mapping_t;

#define FLEX_MX19_MAPPING                        0x0000064c
#define   MAPPING_VALID_64c_MASK                 0x00008000
#define   MAPPING_VALID_64c_SHIFT                        15
#define   CONTROLLER_ID_64c_MASK                 0x00003f00
#define   CONTROLLER_ID_64c_SHIFT                         8
#define   MX_ID_64c_MASK                         0x0000007f
#define   MX_ID_64c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_64c:7;
        u32 rsvd_7:1;
        u32 controller_id_64c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_64c:1;
        u32 rsvd_16:16;
    } b;
} flex_mx19_mapping_t;

#define FLEX_MX20_MAPPING                        0x00000650
#define   MAPPING_VALID_650_MASK                 0x00008000
#define   MAPPING_VALID_650_SHIFT                        15
#define   CONTROLLER_ID_650_MASK                 0x00003f00
#define   CONTROLLER_ID_650_SHIFT                         8
#define   MX_ID_650_MASK                         0x0000007f
#define   MX_ID_650_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_650:7;
        u32 rsvd_7:1;
        u32 controller_id_650:6;
        u32 rsvd_14:1;
        u32 mapping_valid_650:1;
        u32 rsvd_16:16;
    } b;
} flex_mx20_mapping_t;

#define FLEX_MX21_MAPPING                        0x00000654
#define   MAPPING_VALID_654_MASK                 0x00008000
#define   MAPPING_VALID_654_SHIFT                        15
#define   CONTROLLER_ID_654_MASK                 0x00003f00
#define   CONTROLLER_ID_654_SHIFT                         8
#define   MX_ID_654_MASK                         0x0000007f
#define   MX_ID_654_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_654:7;
        u32 rsvd_7:1;
        u32 controller_id_654:6;
        u32 rsvd_14:1;
        u32 mapping_valid_654:1;
        u32 rsvd_16:16;
    } b;
} flex_mx21_mapping_t;

#define FLEX_MX22_MAPPING                        0x00000658
#define   MAPPING_VALID_658_MASK                 0x00008000
#define   MAPPING_VALID_658_SHIFT                        15
#define   CONTROLLER_ID_658_MASK                 0x00003f00
#define   CONTROLLER_ID_658_SHIFT                         8
#define   MX_ID_658_MASK                         0x0000007f
#define   MX_ID_658_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_658:7;
        u32 rsvd_7:1;
        u32 controller_id_658:6;
        u32 rsvd_14:1;
        u32 mapping_valid_658:1;
        u32 rsvd_16:16;
    } b;
} flex_mx22_mapping_t;

#define FLEX_MX23_MAPPING                        0x0000065c
#define   MAPPING_VALID_65c_MASK                 0x00008000
#define   MAPPING_VALID_65c_SHIFT                        15
#define   CONTROLLER_ID_65c_MASK                 0x00003f00
#define   CONTROLLER_ID_65c_SHIFT                         8
#define   MX_ID_65c_MASK                         0x0000007f
#define   MX_ID_65c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_65c:7;
        u32 rsvd_7:1;
        u32 controller_id_65c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_65c:1;
        u32 rsvd_16:16;
    } b;
} flex_mx23_mapping_t;

#define FLEX_MX24_MAPPING                        0x00000660
#define   MAPPING_VALID_660_MASK                 0x00008000
#define   MAPPING_VALID_660_SHIFT                        15
#define   CONTROLLER_ID_660_MASK                 0x00003f00
#define   CONTROLLER_ID_660_SHIFT                         8
#define   MX_ID_660_MASK                         0x0000007f
#define   MX_ID_660_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_660:7;
        u32 rsvd_7:1;
        u32 controller_id_660:6;
        u32 rsvd_14:1;
        u32 mapping_valid_660:1;
        u32 rsvd_16:16;
    } b;
} flex_mx24_mapping_t;

#define FLEX_MX25_MAPPING                        0x00000664
#define   MAPPING_VALID_664_MASK                 0x00008000
#define   MAPPING_VALID_664_SHIFT                        15
#define   CONTROLLER_ID_664_MASK                 0x00003f00
#define   CONTROLLER_ID_664_SHIFT                         8
#define   MX_ID_664_MASK                         0x0000007f
#define   MX_ID_664_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_664:7;
        u32 rsvd_7:1;
        u32 controller_id_664:6;
        u32 rsvd_14:1;
        u32 mapping_valid_664:1;
        u32 rsvd_16:16;
    } b;
} flex_mx25_mapping_t;

#define FLEX_MX26_MAPPING                        0x00000668
#define   MAPPING_VALID_668_MASK                 0x00008000
#define   MAPPING_VALID_668_SHIFT                        15
#define   CONTROLLER_ID_668_MASK                 0x00003f00
#define   CONTROLLER_ID_668_SHIFT                         8
#define   MX_ID_668_MASK                         0x0000007f
#define   MX_ID_668_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_668:7;
        u32 rsvd_7:1;
        u32 controller_id_668:6;
        u32 rsvd_14:1;
        u32 mapping_valid_668:1;
        u32 rsvd_16:16;
    } b;
} flex_mx26_mapping_t;

#define FLEX_MX27_MAPPING                        0x0000066c
#define   MAPPING_VALID_66c_MASK                 0x00008000
#define   MAPPING_VALID_66c_SHIFT                        15
#define   CONTROLLER_ID_66c_MASK                 0x00003f00
#define   CONTROLLER_ID_66c_SHIFT                         8
#define   MX_ID_66c_MASK                         0x0000007f
#define   MX_ID_66c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_66c:7;
        u32 rsvd_7:1;
        u32 controller_id_66c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_66c:1;
        u32 rsvd_16:16;
    } b;
} flex_mx27_mapping_t;

#define FLEX_MX28_MAPPING                        0x00000670
#define   MAPPING_VALID_670_MASK                 0x00008000
#define   MAPPING_VALID_670_SHIFT                        15
#define   CONTROLLER_ID_670_MASK                 0x00003f00
#define   CONTROLLER_ID_670_SHIFT                         8
#define   MX_ID_670_MASK                         0x0000007f
#define   MX_ID_670_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_670:7;
        u32 rsvd_7:1;
        u32 controller_id_670:6;
        u32 rsvd_14:1;
        u32 mapping_valid_670:1;
        u32 rsvd_16:16;
    } b;
} flex_mx28_mapping_t;

#define FLEX_MX29_MAPPING                        0x00000674
#define   MAPPING_VALID_674_MASK                 0x00008000
#define   MAPPING_VALID_674_SHIFT                        15
#define   CONTROLLER_ID_674_MASK                 0x00003f00
#define   CONTROLLER_ID_674_SHIFT                         8
#define   MX_ID_674_MASK                         0x0000007f
#define   MX_ID_674_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_674:7;
        u32 rsvd_7:1;
        u32 controller_id_674:6;
        u32 rsvd_14:1;
        u32 mapping_valid_674:1;
        u32 rsvd_16:16;
    } b;
} flex_mx29_mapping_t;

#define FLEX_MX30_MAPPING                        0x00000678
#define   MAPPING_VALID_678_MASK                 0x00008000
#define   MAPPING_VALID_678_SHIFT                        15
#define   CONTROLLER_ID_678_MASK                 0x00003f00
#define   CONTROLLER_ID_678_SHIFT                         8
#define   MX_ID_678_MASK                         0x0000007f
#define   MX_ID_678_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_678:7;
        u32 rsvd_7:1;
        u32 controller_id_678:6;
        u32 rsvd_14:1;
        u32 mapping_valid_678:1;
        u32 rsvd_16:16;
    } b;
} flex_mx30_mapping_t;

#define FLEX_MX31_MAPPING                        0x0000067c
#define   MAPPING_VALID_67c_MASK                 0x00008000
#define   MAPPING_VALID_67c_SHIFT                        15
#define   CONTROLLER_ID_67c_MASK                 0x00003f00
#define   CONTROLLER_ID_67c_SHIFT                         8
#define   MX_ID_67c_MASK                         0x0000007f
#define   MX_ID_67c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_67c:7;
        u32 rsvd_7:1;
        u32 controller_id_67c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_67c:1;
        u32 rsvd_16:16;
    } b;
} flex_mx31_mapping_t;

#define FLEX_MX32_MAPPING                        0x00000680
#define   MAPPING_VALID_680_MASK                 0x00008000
#define   MAPPING_VALID_680_SHIFT                        15
#define   CONTROLLER_ID_680_MASK                 0x00003f00
#define   CONTROLLER_ID_680_SHIFT                         8
#define   MX_ID_680_MASK                         0x0000007f
#define   MX_ID_680_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_680:7;
        u32 rsvd_7:1;
        u32 controller_id_680:6;
        u32 rsvd_14:1;
        u32 mapping_valid_680:1;
        u32 rsvd_16:16;
    } b;
} flex_mx32_mapping_t;

#define FLEX_MX33_MAPPING                        0x00000684
#define   MAPPING_VALID_684_MASK                 0x00008000
#define   MAPPING_VALID_684_SHIFT                        15
#define   CONTROLLER_ID_684_MASK                 0x00003f00
#define   CONTROLLER_ID_684_SHIFT                         8
#define   MX_ID_684_MASK                         0x0000007f
#define   MX_ID_684_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_684:7;
        u32 rsvd_7:1;
        u32 controller_id_684:6;
        u32 rsvd_14:1;
        u32 mapping_valid_684:1;
        u32 rsvd_16:16;
    } b;
} flex_mx33_mapping_t;

#define FLEX_MX34_MAPPING                        0x00000688
#define   MAPPING_VALID_688_MASK                 0x00008000
#define   MAPPING_VALID_688_SHIFT                        15
#define   CONTROLLER_ID_688_MASK                 0x00003f00
#define   CONTROLLER_ID_688_SHIFT                         8
#define   MX_ID_688_MASK                         0x0000007f
#define   MX_ID_688_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_688:7;
        u32 rsvd_7:1;
        u32 controller_id_688:6;
        u32 rsvd_14:1;
        u32 mapping_valid_688:1;
        u32 rsvd_16:16;
    } b;
} flex_mx34_mapping_t;

#define FLEX_MX35_MAPPING                        0x0000068c
#define   MAPPING_VALID_68c_MASK                 0x00008000
#define   MAPPING_VALID_68c_SHIFT                        15
#define   CONTROLLER_ID_68c_MASK                 0x00003f00
#define   CONTROLLER_ID_68c_SHIFT                         8
#define   MX_ID_68c_MASK                         0x0000007f
#define   MX_ID_68c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_68c:7;
        u32 rsvd_7:1;
        u32 controller_id_68c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_68c:1;
        u32 rsvd_16:16;
    } b;
} flex_mx35_mapping_t;

#define FLEX_MX36_MAPPING                        0x00000690
#define   MAPPING_VALID_690_MASK                 0x00008000
#define   MAPPING_VALID_690_SHIFT                        15
#define   CONTROLLER_ID_690_MASK                 0x00003f00
#define   CONTROLLER_ID_690_SHIFT                         8
#define   MX_ID_690_MASK                         0x0000007f
#define   MX_ID_690_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_690:7;
        u32 rsvd_7:1;
        u32 controller_id_690:6;
        u32 rsvd_14:1;
        u32 mapping_valid_690:1;
        u32 rsvd_16:16;
    } b;
} flex_mx36_mapping_t;

#define FLEX_MX37_MAPPING                        0x00000694
#define   MAPPING_VALID_694_MASK                 0x00008000
#define   MAPPING_VALID_694_SHIFT                        15
#define   CONTROLLER_ID_694_MASK                 0x00003f00
#define   CONTROLLER_ID_694_SHIFT                         8
#define   MX_ID_694_MASK                         0x0000007f
#define   MX_ID_694_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_694:7;
        u32 rsvd_7:1;
        u32 controller_id_694:6;
        u32 rsvd_14:1;
        u32 mapping_valid_694:1;
        u32 rsvd_16:16;
    } b;
} flex_mx37_mapping_t;

#define FLEX_MX38_MAPPING                        0x00000698
#define   MAPPING_VALID_698_MASK                 0x00008000
#define   MAPPING_VALID_698_SHIFT                        15
#define   CONTROLLER_ID_698_MASK                 0x00003f00
#define   CONTROLLER_ID_698_SHIFT                         8
#define   MX_ID_698_MASK                         0x0000007f
#define   MX_ID_698_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_698:7;
        u32 rsvd_7:1;
        u32 controller_id_698:6;
        u32 rsvd_14:1;
        u32 mapping_valid_698:1;
        u32 rsvd_16:16;
    } b;
} flex_mx38_mapping_t;

#define FLEX_MX39_MAPPING                        0x0000069c
#define   MAPPING_VALID_69c_MASK                 0x00008000
#define   MAPPING_VALID_69c_SHIFT                        15
#define   CONTROLLER_ID_69c_MASK                 0x00003f00
#define   CONTROLLER_ID_69c_SHIFT                         8
#define   MX_ID_69c_MASK                         0x0000007f
#define   MX_ID_69c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_69c:7;
        u32 rsvd_7:1;
        u32 controller_id_69c:6;
        u32 rsvd_14:1;
        u32 mapping_valid_69c:1;
        u32 rsvd_16:16;
    } b;
} flex_mx39_mapping_t;

#define FLEX_MX40_MAPPING                        0x000006a0
#define   MAPPING_VALID_6a0_MASK                 0x00008000
#define   MAPPING_VALID_6a0_SHIFT                        15
#define   CONTROLLER_ID_6a0_MASK                 0x00003f00
#define   CONTROLLER_ID_6a0_SHIFT                         8
#define   MX_ID_6a0_MASK                         0x0000007f
#define   MX_ID_6a0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6a0:7;
        u32 rsvd_7:1;
        u32 controller_id_6a0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6a0:1;
        u32 rsvd_16:16;
    } b;
} flex_mx40_mapping_t;

#define FLEX_MX41_MAPPING                        0x000006a4
#define   MAPPING_VALID_6a4_MASK                 0x00008000
#define   MAPPING_VALID_6a4_SHIFT                        15
#define   CONTROLLER_ID_6a4_MASK                 0x00003f00
#define   CONTROLLER_ID_6a4_SHIFT                         8
#define   MX_ID_6a4_MASK                         0x0000007f
#define   MX_ID_6a4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6a4:7;
        u32 rsvd_7:1;
        u32 controller_id_6a4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6a4:1;
        u32 rsvd_16:16;
    } b;
} flex_mx41_mapping_t;

#define FLEX_MX42_MAPPING                        0x000006a8
#define   MAPPING_VALID_6a8_MASK                 0x00008000
#define   MAPPING_VALID_6a8_SHIFT                        15
#define   CONTROLLER_ID_6a8_MASK                 0x00003f00
#define   CONTROLLER_ID_6a8_SHIFT                         8
#define   MX_ID_6a8_MASK                         0x0000007f
#define   MX_ID_6a8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6a8:7;
        u32 rsvd_7:1;
        u32 controller_id_6a8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6a8:1;
        u32 rsvd_16:16;
    } b;
} flex_mx42_mapping_t;

#define FLEX_MX43_MAPPING                        0x000006ac
#define   MAPPING_VALID_6ac_MASK                 0x00008000
#define   MAPPING_VALID_6ac_SHIFT                        15
#define   CONTROLLER_ID_6ac_MASK                 0x00003f00
#define   CONTROLLER_ID_6ac_SHIFT                         8
#define   MX_ID_6ac_MASK                         0x0000007f
#define   MX_ID_6ac_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6ac:7;
        u32 rsvd_7:1;
        u32 controller_id_6ac:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6ac:1;
        u32 rsvd_16:16;
    } b;
} flex_mx43_mapping_t;

#define FLEX_MX44_MAPPING                        0x000006b0
#define   MAPPING_VALID_6b0_MASK                 0x00008000
#define   MAPPING_VALID_6b0_SHIFT                        15
#define   CONTROLLER_ID_6b0_MASK                 0x00003f00
#define   CONTROLLER_ID_6b0_SHIFT                         8
#define   MX_ID_6b0_MASK                         0x0000007f
#define   MX_ID_6b0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6b0:7;
        u32 rsvd_7:1;
        u32 controller_id_6b0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6b0:1;
        u32 rsvd_16:16;
    } b;
} flex_mx44_mapping_t;

#define FLEX_MX45_MAPPING                        0x000006b4
#define   MAPPING_VALID_6b4_MASK                 0x00008000
#define   MAPPING_VALID_6b4_SHIFT                        15
#define   CONTROLLER_ID_6b4_MASK                 0x00003f00
#define   CONTROLLER_ID_6b4_SHIFT                         8
#define   MX_ID_6b4_MASK                         0x0000007f
#define   MX_ID_6b4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6b4:7;
        u32 rsvd_7:1;
        u32 controller_id_6b4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6b4:1;
        u32 rsvd_16:16;
    } b;
} flex_mx45_mapping_t;

#define FLEX_MX46_MAPPING                        0x000006b8
#define   MAPPING_VALID_6b8_MASK                 0x00008000
#define   MAPPING_VALID_6b8_SHIFT                        15
#define   CONTROLLER_ID_6b8_MASK                 0x00003f00
#define   CONTROLLER_ID_6b8_SHIFT                         8
#define   MX_ID_6b8_MASK                         0x0000007f
#define   MX_ID_6b8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6b8:7;
        u32 rsvd_7:1;
        u32 controller_id_6b8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6b8:1;
        u32 rsvd_16:16;
    } b;
} flex_mx46_mapping_t;

#define FLEX_MX47_MAPPING                        0x000006bc
#define   MAPPING_VALID_6bc_MASK                 0x00008000
#define   MAPPING_VALID_6bc_SHIFT                        15
#define   CONTROLLER_ID_6bc_MASK                 0x00003f00
#define   CONTROLLER_ID_6bc_SHIFT                         8
#define   MX_ID_6bc_MASK                         0x0000007f
#define   MX_ID_6bc_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6bc:7;
        u32 rsvd_7:1;
        u32 controller_id_6bc:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6bc:1;
        u32 rsvd_16:16;
    } b;
} flex_mx47_mapping_t;

#define FLEX_MX48_MAPPING                        0x000006c0
#define   MAPPING_VALID_6c0_MASK                 0x00008000
#define   MAPPING_VALID_6c0_SHIFT                        15
#define   CONTROLLER_ID_6c0_MASK                 0x00003f00
#define   CONTROLLER_ID_6c0_SHIFT                         8
#define   MX_ID_6c0_MASK                         0x0000007f
#define   MX_ID_6c0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6c0:7;
        u32 rsvd_7:1;
        u32 controller_id_6c0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6c0:1;
        u32 rsvd_16:16;
    } b;
} flex_mx48_mapping_t;

#define FLEX_MX49_MAPPING                        0x000006c4
#define   MAPPING_VALID_6c4_MASK                 0x00008000
#define   MAPPING_VALID_6c4_SHIFT                        15
#define   CONTROLLER_ID_6c4_MASK                 0x00003f00
#define   CONTROLLER_ID_6c4_SHIFT                         8
#define   MX_ID_6c4_MASK                         0x0000007f
#define   MX_ID_6c4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6c4:7;
        u32 rsvd_7:1;
        u32 controller_id_6c4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6c4:1;
        u32 rsvd_16:16;
    } b;
} flex_mx49_mapping_t;

#define FLEX_MX50_MAPPING                        0x000006c8
#define   MAPPING_VALID_6c8_MASK                 0x00008000
#define   MAPPING_VALID_6c8_SHIFT                        15
#define   CONTROLLER_ID_6c8_MASK                 0x00003f00
#define   CONTROLLER_ID_6c8_SHIFT                         8
#define   MX_ID_6c8_MASK                         0x0000007f
#define   MX_ID_6c8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6c8:7;
        u32 rsvd_7:1;
        u32 controller_id_6c8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6c8:1;
        u32 rsvd_16:16;
    } b;
} flex_mx50_mapping_t;

#define FLEX_MX51_MAPPING                        0x000006cc
#define   MAPPING_VALID_6cc_MASK                 0x00008000
#define   MAPPING_VALID_6cc_SHIFT                        15
#define   CONTROLLER_ID_6cc_MASK                 0x00003f00
#define   CONTROLLER_ID_6cc_SHIFT                         8
#define   MX_ID_6cc_MASK                         0x0000007f
#define   MX_ID_6cc_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6cc:7;
        u32 rsvd_7:1;
        u32 controller_id_6cc:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6cc:1;
        u32 rsvd_16:16;
    } b;
} flex_mx51_mapping_t;

#define FLEX_MX52_MAPPING                        0x000006d0
#define   MAPPING_VALID_6d0_MASK                 0x00008000
#define   MAPPING_VALID_6d0_SHIFT                        15
#define   CONTROLLER_ID_6d0_MASK                 0x00003f00
#define   CONTROLLER_ID_6d0_SHIFT                         8
#define   MX_ID_6d0_MASK                         0x0000007f
#define   MX_ID_6d0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6d0:7;
        u32 rsvd_7:1;
        u32 controller_id_6d0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6d0:1;
        u32 rsvd_16:16;
    } b;
} flex_mx52_mapping_t;

#define FLEX_MX53_MAPPING                        0x000006d4
#define   MAPPING_VALID_6d4_MASK                 0x00008000
#define   MAPPING_VALID_6d4_SHIFT                        15
#define   CONTROLLER_ID_6d4_MASK                 0x00003f00
#define   CONTROLLER_ID_6d4_SHIFT                         8
#define   MX_ID_6d4_MASK                         0x0000007f
#define   MX_ID_6d4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6d4:7;
        u32 rsvd_7:1;
        u32 controller_id_6d4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6d4:1;
        u32 rsvd_16:16;
    } b;
} flex_mx53_mapping_t;

#define FLEX_MX54_MAPPING                        0x000006d8
#define   MAPPING_VALID_6d8_MASK                 0x00008000
#define   MAPPING_VALID_6d8_SHIFT                        15
#define   CONTROLLER_ID_6d8_MASK                 0x00003f00
#define   CONTROLLER_ID_6d8_SHIFT                         8
#define   MX_ID_6d8_MASK                         0x0000007f
#define   MX_ID_6d8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6d8:7;
        u32 rsvd_7:1;
        u32 controller_id_6d8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6d8:1;
        u32 rsvd_16:16;
    } b;
} flex_mx54_mapping_t;

#define FLEX_MX55_MAPPING                        0x000006dc
#define   MAPPING_VALID_6dc_MASK                 0x00008000
#define   MAPPING_VALID_6dc_SHIFT                        15
#define   CONTROLLER_ID_6dc_MASK                 0x00003f00
#define   CONTROLLER_ID_6dc_SHIFT                         8
#define   MX_ID_6dc_MASK                         0x0000007f
#define   MX_ID_6dc_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6dc:7;
        u32 rsvd_7:1;
        u32 controller_id_6dc:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6dc:1;
        u32 rsvd_16:16;
    } b;
} flex_mx55_mapping_t;

#define FLEX_MX56_MAPPING                        0x000006e0
#define   MAPPING_VALID_6e0_MASK                 0x00008000
#define   MAPPING_VALID_6e0_SHIFT                        15
#define   CONTROLLER_ID_6e0_MASK                 0x00003f00
#define   CONTROLLER_ID_6e0_SHIFT                         8
#define   MX_ID_6e0_MASK                         0x0000007f
#define   MX_ID_6e0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6e0:7;
        u32 rsvd_7:1;
        u32 controller_id_6e0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6e0:1;
        u32 rsvd_16:16;
    } b;
} flex_mx56_mapping_t;

#define FLEX_MX57_MAPPING                        0x000006e4
#define   MAPPING_VALID_6e4_MASK                 0x00008000
#define   MAPPING_VALID_6e4_SHIFT                        15
#define   CONTROLLER_ID_6e4_MASK                 0x00003f00
#define   CONTROLLER_ID_6e4_SHIFT                         8
#define   MX_ID_6e4_MASK                         0x0000007f
#define   MX_ID_6e4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6e4:7;
        u32 rsvd_7:1;
        u32 controller_id_6e4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6e4:1;
        u32 rsvd_16:16;
    } b;
} flex_mx57_mapping_t;

#define FLEX_MX58_MAPPING                        0x000006e8
#define   MAPPING_VALID_6e8_MASK                 0x00008000
#define   MAPPING_VALID_6e8_SHIFT                        15
#define   CONTROLLER_ID_6e8_MASK                 0x00003f00
#define   CONTROLLER_ID_6e8_SHIFT                         8
#define   MX_ID_6e8_MASK                         0x0000007f
#define   MX_ID_6e8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6e8:7;
        u32 rsvd_7:1;
        u32 controller_id_6e8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6e8:1;
        u32 rsvd_16:16;
    } b;
} flex_mx58_mapping_t;

#define FLEX_MX59_MAPPING                        0x000006ec
#define   MAPPING_VALID_6ec_MASK                 0x00008000
#define   MAPPING_VALID_6ec_SHIFT                        15
#define   CONTROLLER_ID_6ec_MASK                 0x00003f00
#define   CONTROLLER_ID_6ec_SHIFT                         8
#define   MX_ID_6ec_MASK                         0x0000007f
#define   MX_ID_6ec_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6ec:7;
        u32 rsvd_7:1;
        u32 controller_id_6ec:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6ec:1;
        u32 rsvd_16:16;
    } b;
} flex_mx59_mapping_t;

#define FLEX_MX60_MAPPING                        0x000006f0
#define   MAPPING_VALID_6f0_MASK                 0x00008000
#define   MAPPING_VALID_6f0_SHIFT                        15
#define   CONTROLLER_ID_6f0_MASK                 0x00003f00
#define   CONTROLLER_ID_6f0_SHIFT                         8
#define   MX_ID_6f0_MASK                         0x0000007f
#define   MX_ID_6f0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6f0:7;
        u32 rsvd_7:1;
        u32 controller_id_6f0:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6f0:1;
        u32 rsvd_16:16;
    } b;
} flex_mx60_mapping_t;

#define FLEX_MX61_MAPPING                        0x000006f4
#define   MAPPING_VALID_6f4_MASK                 0x00008000
#define   MAPPING_VALID_6f4_SHIFT                        15
#define   CONTROLLER_ID_6f4_MASK                 0x00003f00
#define   CONTROLLER_ID_6f4_SHIFT                         8
#define   MX_ID_6f4_MASK                         0x0000007f
#define   MX_ID_6f4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6f4:7;
        u32 rsvd_7:1;
        u32 controller_id_6f4:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6f4:1;
        u32 rsvd_16:16;
    } b;
} flex_mx61_mapping_t;

#define FLEX_MX62_MAPPING                        0x000006f8
#define   MAPPING_VALID_6f8_MASK                 0x00008000
#define   MAPPING_VALID_6f8_SHIFT                        15
#define   CONTROLLER_ID_6f8_MASK                 0x00003f00
#define   CONTROLLER_ID_6f8_SHIFT                         8
#define   MX_ID_6f8_MASK                         0x0000007f
#define   MX_ID_6f8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6f8:7;
        u32 rsvd_7:1;
        u32 controller_id_6f8:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6f8:1;
        u32 rsvd_16:16;
    } b;
} flex_mx62_mapping_t;

#define FLEX_MX63_MAPPING                        0x000006fc
#define   MAPPING_VALID_6fc_MASK                 0x00008000
#define   MAPPING_VALID_6fc_SHIFT                        15
#define   CONTROLLER_ID_6fc_MASK                 0x00003f00
#define   CONTROLLER_ID_6fc_SHIFT                         8
#define   MX_ID_6fc_MASK                         0x0000007f
#define   MX_ID_6fc_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_6fc:7;
        u32 rsvd_7:1;
        u32 controller_id_6fc:6;
        u32 rsvd_14:1;
        u32 mapping_valid_6fc:1;
        u32 rsvd_16:16;
    } b;
} flex_mx63_mapping_t;

#define FLEX_MX64_MAPPING                        0x00000700
#define   MAPPING_VALID_700_MASK                 0x00008000
#define   MAPPING_VALID_700_SHIFT                        15
#define   CONTROLLER_ID_700_MASK                 0x00003f00
#define   CONTROLLER_ID_700_SHIFT                         8
#define   MX_ID_700_MASK                         0x0000007f
#define   MX_ID_700_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mx_id_700:7;
        u32 rsvd_7:1;
        u32 controller_id_700:6;
        u32 rsvd_14:1;
        u32 mapping_valid_700:1;
        u32 rsvd_16:16;
    } b;
} flex_mx64_mapping_t;

#define FLEX_MX65_MAPPING                        0x00000704
#define   MAPPING_VALID_704_MASK                 0x00008000
#define   MAPPING_VALID_704_SHIFT                        15
#define   CONTROLLER_ID_704_MASK                 0x00003f00
#define   CONTROLLER_ID_704_SHIFT                         8
#define   MX_ID_704_MASK                         0x0000007f
#define   MX_ID_704_SHIFT                                 0
typedef union {
    u32 all;
    struct {
        u32 mx_id_704:7;
        u32 rsvd_7:1;
        u32 controller_id_704:6;
        u32 rsvd_14:1;
        u32 mapping_valid_704:1;
        u32 rsvd_16:16;
    } b;
} flex_mx65_mapping_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ flex_sq0_mapping_t flex_sq0_mapping;
    /* 0x0004 */ flex_sq1_mapping_t flex_sq1_mapping;
    /* 0x0008 */ flex_sq2_mapping_t flex_sq2_mapping;
    /* 0x000c */ flex_sq3_mapping_t flex_sq3_mapping;
    /* 0x0010 */ flex_sq4_mapping_t flex_sq4_mapping;
    /* 0x0014 */ flex_sq5_mapping_t flex_sq5_mapping;
    /* 0x0018 */ flex_sq6_mapping_t flex_sq6_mapping;
    /* 0x001c */ flex_sq7_mapping_t flex_sq7_mapping;
    /* 0x0020 */ flex_sq8_mapping_t flex_sq8_mapping;
    /* 0x0024 */ flex_sq9_mapping_t flex_sq9_mapping;
    /* 0x0028 */ flex_sq10_mapping_t flex_sq10_mapping;
    /* 0x002c */ flex_sq11_mapping_t flex_sq11_mapping;
    /* 0x0030 */ flex_sq12_mapping_t flex_sq12_mapping;
    /* 0x0034 */ flex_sq13_mapping_t flex_sq13_mapping;
    /* 0x0038 */ flex_sq14_mapping_t flex_sq14_mapping;
    /* 0x003c */ flex_sq15_mapping_t flex_sq15_mapping;
    /* 0x0040 */ flex_sq16_mapping_t flex_sq16_mapping;
    /* 0x0044 */ flex_sq17_mapping_t flex_sq17_mapping;
    /* 0x0048 */ flex_sq18_mapping_t flex_sq18_mapping;
    /* 0x004c */ flex_sq19_mapping_t flex_sq19_mapping;
    /* 0x0050 */ flex_sq20_mapping_t flex_sq20_mapping;
    /* 0x0054 */ flex_sq21_mapping_t flex_sq21_mapping;
    /* 0x0058 */ flex_sq22_mapping_t flex_sq22_mapping;
    /* 0x005c */ flex_sq23_mapping_t flex_sq23_mapping;
    /* 0x0060 */ flex_sq24_mapping_t flex_sq24_mapping;
    /* 0x0064 */ flex_sq25_mapping_t flex_sq25_mapping;
    /* 0x0068 */ flex_sq26_mapping_t flex_sq26_mapping;
    /* 0x006c */ flex_sq27_mapping_t flex_sq27_mapping;
    /* 0x0070 */ flex_sq28_mapping_t flex_sq28_mapping;
    /* 0x0074 */ flex_sq29_mapping_t flex_sq29_mapping;
    /* 0x0078 */ flex_sq30_mapping_t flex_sq30_mapping;
    /* 0x007c */ flex_sq31_mapping_t flex_sq31_mapping;
    /* 0x0080 */ flex_sq32_mapping_t flex_sq32_mapping;
    /* 0x0084 */ flex_sq33_mapping_t flex_sq33_mapping;
    /* 0x0088 */ flex_sq34_mapping_t flex_sq34_mapping;
    /* 0x008c */ flex_sq35_mapping_t flex_sq35_mapping;
    /* 0x0090 */ flex_sq36_mapping_t flex_sq36_mapping;
    /* 0x0094 */ flex_sq37_mapping_t flex_sq37_mapping;
    /* 0x0098 */ flex_sq38_mapping_t flex_sq38_mapping;
    /* 0x009c */ flex_sq39_mapping_t flex_sq39_mapping;
    /* 0x00a0 */ flex_sq40_mapping_t flex_sq40_mapping;
    /* 0x00a4 */ flex_sq41_mapping_t flex_sq41_mapping;
    /* 0x00a8 */ flex_sq42_mapping_t flex_sq42_mapping;
    /* 0x00ac */ flex_sq43_mapping_t flex_sq43_mapping;
    /* 0x00b0 */ flex_sq44_mapping_t flex_sq44_mapping;
    /* 0x00b4 */ flex_sq45_mapping_t flex_sq45_mapping;
    /* 0x00b8 */ flex_sq46_mapping_t flex_sq46_mapping;
    /* 0x00bc */ flex_sq47_mapping_t flex_sq47_mapping;
    /* 0x00c0 */ flex_sq48_mapping_t flex_sq48_mapping;
    /* 0x00c4 */ flex_sq49_mapping_t flex_sq49_mapping;
    /* 0x00c8 */ flex_sq50_mapping_t flex_sq50_mapping;
    /* 0x00cc */ flex_sq51_mapping_t flex_sq51_mapping;
    /* 0x00d0 */ flex_sq52_mapping_t flex_sq52_mapping;
    /* 0x00d4 */ flex_sq53_mapping_t flex_sq53_mapping;
    /* 0x00d8 */ flex_sq54_mapping_t flex_sq54_mapping;
    /* 0x00dc */ flex_sq55_mapping_t flex_sq55_mapping;
    /* 0x00e0 */ flex_sq56_mapping_t flex_sq56_mapping;
    /* 0x00e4 */ flex_sq57_mapping_t flex_sq57_mapping;
    /* 0x00e8 */ flex_sq58_mapping_t flex_sq58_mapping;
    /* 0x00ec */ flex_sq59_mapping_t flex_sq59_mapping;
    /* 0x00f0 */ flex_sq60_mapping_t flex_sq60_mapping;
    /* 0x00f4 */ flex_sq61_mapping_t flex_sq61_mapping;
    /* 0x00f8 */ flex_sq62_mapping_t flex_sq62_mapping;
    /* 0x00fc */ flex_sq63_mapping_t flex_sq63_mapping;
    /* 0x0100 */ flex_sq64_mapping_t flex_sq64_mapping;
    /* 0x0104 */ flex_sq65_mapping_t flex_sq65_mapping;
    /* 0x0108 */ u32 rsvd_108 [126];
    /* 0x0300 */ flex_cq0_mapping_t flex_cq0_mapping;
    /* 0x0304 */ flex_cq1_mapping_t flex_cq1_mapping;
    /* 0x0308 */ flex_cq2_mapping_t flex_cq2_mapping;
    /* 0x030c */ flex_cq3_mapping_t flex_cq3_mapping;
    /* 0x0310 */ flex_cq4_mapping_t flex_cq4_mapping;
    /* 0x0314 */ flex_cq5_mapping_t flex_cq5_mapping;
    /* 0x0318 */ flex_cq6_mapping_t flex_cq6_mapping;
    /* 0x031c */ flex_cq7_mapping_t flex_cq7_mapping;
    /* 0x0320 */ flex_cq8_mapping_t flex_cq8_mapping;
    /* 0x0324 */ flex_cq9_mapping_t flex_cq9_mapping;
    /* 0x0328 */ flex_cq10_mapping_t flex_cq10_mapping;
    /* 0x032c */ flex_cq11_mapping_t flex_cq11_mapping;
    /* 0x0330 */ flex_cq12_mapping_t flex_cq12_mapping;
    /* 0x0334 */ flex_cq13_mapping_t flex_cq13_mapping;
    /* 0x0338 */ flex_cq14_mapping_t flex_cq14_mapping;
    /* 0x033c */ flex_cq15_mapping_t flex_cq15_mapping;
    /* 0x0340 */ flex_cq16_mapping_t flex_cq16_mapping;
    /* 0x0344 */ flex_cq17_mapping_t flex_cq17_mapping;
    /* 0x0348 */ flex_cq18_mapping_t flex_cq18_mapping;
    /* 0x034c */ flex_cq19_mapping_t flex_cq19_mapping;
    /* 0x0350 */ flex_cq20_mapping_t flex_cq20_mapping;
    /* 0x0354 */ flex_cq21_mapping_t flex_cq21_mapping;
    /* 0x0358 */ flex_cq22_mapping_t flex_cq22_mapping;
    /* 0x035c */ flex_cq23_mapping_t flex_cq23_mapping;
    /* 0x0360 */ flex_cq24_mapping_t flex_cq24_mapping;
    /* 0x0364 */ flex_cq25_mapping_t flex_cq25_mapping;
    /* 0x0368 */ flex_cq26_mapping_t flex_cq26_mapping;
    /* 0x036c */ flex_cq27_mapping_t flex_cq27_mapping;
    /* 0x0370 */ flex_cq28_mapping_t flex_cq28_mapping;
    /* 0x0374 */ flex_cq29_mapping_t flex_cq29_mapping;
    /* 0x0378 */ flex_cq30_mapping_t flex_cq30_mapping;
    /* 0x037c */ flex_cq31_mapping_t flex_cq31_mapping;
    /* 0x0380 */ flex_cq32_mapping_t flex_cq32_mapping;
    /* 0x0384 */ flex_cq33_mapping_t flex_cq33_mapping;
    /* 0x0388 */ flex_cq34_mapping_t flex_cq34_mapping;
    /* 0x038c */ flex_cq35_mapping_t flex_cq35_mapping;
    /* 0x0390 */ flex_cq36_mapping_t flex_cq36_mapping;
    /* 0x0394 */ flex_cq37_mapping_t flex_cq37_mapping;
    /* 0x0398 */ flex_cq38_mapping_t flex_cq38_mapping;
    /* 0x039c */ flex_cq39_mapping_t flex_cq39_mapping;
    /* 0x03a0 */ flex_cq40_mapping_t flex_cq40_mapping;
    /* 0x03a4 */ flex_cq41_mapping_t flex_cq41_mapping;
    /* 0x03a8 */ flex_cq42_mapping_t flex_cq42_mapping;
    /* 0x03ac */ flex_cq43_mapping_t flex_cq43_mapping;
    /* 0x03b0 */ flex_cq44_mapping_t flex_cq44_mapping;
    /* 0x03b4 */ flex_cq45_mapping_t flex_cq45_mapping;
    /* 0x03b8 */ flex_cq46_mapping_t flex_cq46_mapping;
    /* 0x03bc */ flex_cq47_mapping_t flex_cq47_mapping;
    /* 0x03c0 */ flex_cq48_mapping_t flex_cq48_mapping;
    /* 0x03c4 */ flex_cq49_mapping_t flex_cq49_mapping;
    /* 0x03c8 */ flex_cq50_mapping_t flex_cq50_mapping;
    /* 0x03cc */ flex_cq51_mapping_t flex_cq51_mapping;
    /* 0x03d0 */ flex_cq52_mapping_t flex_cq52_mapping;
    /* 0x03d4 */ flex_cq53_mapping_t flex_cq53_mapping;
    /* 0x03d8 */ flex_cq54_mapping_t flex_cq54_mapping;
    /* 0x03dc */ flex_cq55_mapping_t flex_cq55_mapping;
    /* 0x03e0 */ flex_cq56_mapping_t flex_cq56_mapping;
    /* 0x03e4 */ flex_cq57_mapping_t flex_cq57_mapping;
    /* 0x03e8 */ flex_cq58_mapping_t flex_cq58_mapping;
    /* 0x03ec */ flex_cq59_mapping_t flex_cq59_mapping;
    /* 0x03f0 */ flex_cq60_mapping_t flex_cq60_mapping;
    /* 0x03f4 */ flex_cq61_mapping_t flex_cq61_mapping;
    /* 0x03f8 */ flex_cq62_mapping_t flex_cq62_mapping;
    /* 0x03fc */ flex_cq63_mapping_t flex_cq63_mapping;
    /* 0x0400 */ flex_cq64_mapping_t flex_cq64_mapping;
    /* 0x0404 */ flex_cq65_mapping_t flex_cq65_mapping;
    /* 0x0408 */ u32 rsvd_408 [126];
    /* 0x0600 */ flex_mx0_mapping_t flex_mx0_mapping;
    /* 0x0604 */ flex_mx1_mapping_t flex_mx1_mapping;
    /* 0x0608 */ flex_mx2_mapping_t flex_mx2_mapping;
    /* 0x060c */ flex_mx3_mapping_t flex_mx3_mapping;
    /* 0x0610 */ flex_mx4_mapping_t flex_mx4_mapping;
    /* 0x0614 */ flex_mx5_mapping_t flex_mx5_mapping;
    /* 0x0618 */ flex_mx6_mapping_t flex_mx6_mapping;
    /* 0x061c */ flex_mx7_mapping_t flex_mx7_mapping;
    /* 0x0620 */ flex_mx8_mapping_t flex_mx8_mapping;
    /* 0x0624 */ flex_mx9_mapping_t flex_mx9_mapping;
    /* 0x0628 */ flex_mx10_mapping_t flex_mx10_mapping;
    /* 0x062c */ flex_mx11_mapping_t flex_mx11_mapping;
    /* 0x0630 */ flex_mx12_mapping_t flex_mx12_mapping;
    /* 0x0634 */ flex_mx13_mapping_t flex_mx13_mapping;
    /* 0x0638 */ flex_mx14_mapping_t flex_mx14_mapping;
    /* 0x063c */ flex_mx15_mapping_t flex_mx15_mapping;
    /* 0x0640 */ flex_mx16_mapping_t flex_mx16_mapping;
    /* 0x0644 */ flex_mx17_mapping_t flex_mx17_mapping;
    /* 0x0648 */ flex_mx18_mapping_t flex_mx18_mapping;
    /* 0x064c */ flex_mx19_mapping_t flex_mx19_mapping;
    /* 0x0650 */ flex_mx20_mapping_t flex_mx20_mapping;
    /* 0x0654 */ flex_mx21_mapping_t flex_mx21_mapping;
    /* 0x0658 */ flex_mx22_mapping_t flex_mx22_mapping;
    /* 0x065c */ flex_mx23_mapping_t flex_mx23_mapping;
    /* 0x0660 */ flex_mx24_mapping_t flex_mx24_mapping;
    /* 0x0664 */ flex_mx25_mapping_t flex_mx25_mapping;
    /* 0x0668 */ flex_mx26_mapping_t flex_mx26_mapping;
    /* 0x066c */ flex_mx27_mapping_t flex_mx27_mapping;
    /* 0x0670 */ flex_mx28_mapping_t flex_mx28_mapping;
    /* 0x0674 */ flex_mx29_mapping_t flex_mx29_mapping;
    /* 0x0678 */ flex_mx30_mapping_t flex_mx30_mapping;
    /* 0x067c */ flex_mx31_mapping_t flex_mx31_mapping;
    /* 0x0680 */ flex_mx32_mapping_t flex_mx32_mapping;
    /* 0x0684 */ flex_mx33_mapping_t flex_mx33_mapping;
    /* 0x0688 */ flex_mx34_mapping_t flex_mx34_mapping;
    /* 0x068c */ flex_mx35_mapping_t flex_mx35_mapping;
    /* 0x0690 */ flex_mx36_mapping_t flex_mx36_mapping;
    /* 0x0694 */ flex_mx37_mapping_t flex_mx37_mapping;
    /* 0x0698 */ flex_mx38_mapping_t flex_mx38_mapping;
    /* 0x069c */ flex_mx39_mapping_t flex_mx39_mapping;
    /* 0x06a0 */ flex_mx40_mapping_t flex_mx40_mapping;
    /* 0x06a4 */ flex_mx41_mapping_t flex_mx41_mapping;
    /* 0x06a8 */ flex_mx42_mapping_t flex_mx42_mapping;
    /* 0x06ac */ flex_mx43_mapping_t flex_mx43_mapping;
    /* 0x06b0 */ flex_mx44_mapping_t flex_mx44_mapping;
    /* 0x06b4 */ flex_mx45_mapping_t flex_mx45_mapping;
    /* 0x06b8 */ flex_mx46_mapping_t flex_mx46_mapping;
    /* 0x06bc */ flex_mx47_mapping_t flex_mx47_mapping;
    /* 0x06c0 */ flex_mx48_mapping_t flex_mx48_mapping;
    /* 0x06c4 */ flex_mx49_mapping_t flex_mx49_mapping;
    /* 0x06c8 */ flex_mx50_mapping_t flex_mx50_mapping;
    /* 0x06cc */ flex_mx51_mapping_t flex_mx51_mapping;
    /* 0x06d0 */ flex_mx52_mapping_t flex_mx52_mapping;
    /* 0x06d4 */ flex_mx53_mapping_t flex_mx53_mapping;
    /* 0x06d8 */ flex_mx54_mapping_t flex_mx54_mapping;
    /* 0x06dc */ flex_mx55_mapping_t flex_mx55_mapping;
    /* 0x06e0 */ flex_mx56_mapping_t flex_mx56_mapping;
    /* 0x06e4 */ flex_mx57_mapping_t flex_mx57_mapping;
    /* 0x06e8 */ flex_mx58_mapping_t flex_mx58_mapping;
    /* 0x06ec */ flex_mx59_mapping_t flex_mx59_mapping;
    /* 0x06f0 */ flex_mx60_mapping_t flex_mx60_mapping;
    /* 0x06f4 */ flex_mx61_mapping_t flex_mx61_mapping;
    /* 0x06f8 */ flex_mx62_mapping_t flex_mx62_mapping;
    /* 0x06fc */ flex_mx63_mapping_t flex_mx63_mapping;
    /* 0x0700 */ flex_mx64_mapping_t flex_mx64_mapping;
    /* 0x0704 */ flex_mx65_mapping_t flex_mx65_mapping;
} flex_map_regs_t;


#endif /* rev 0 */