//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _FLEX_DBL_H_
#define _FLEX_DBL_H_

#define FLEX_SQ0_DB_REG                          0x00000000
#define   SQ_HEAD_PTR_MASK                       0x0fff0000
#define   SQ_HEAD_PTR_SHIFT                              16
#define   SQ_TAIL_PTR_MASK                       0x00000fff
#define   SQ_TAIL_PTR_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr:12;
        u32 rsvd_28:4;
    } b;
} flex_sq0_db_reg_t;

#define FLEX_SQ1_DB_REG                          0x00000004
#define   SQ_HEAD_PTR_4_MASK                     0x0fff0000
#define   SQ_HEAD_PTR_4_SHIFT                            16
#define   SQ_TAIL_PTR_4_MASK                     0x00000fff
#define   SQ_TAIL_PTR_4_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_4:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_4:12;
        u32 rsvd_28:4;
    } b;
} flex_sq1_db_reg_t;

#define FLEX_SQ2_DB_REG                          0x00000008
#define   SQ_HEAD_PTR_8_MASK                     0x0fff0000
#define   SQ_HEAD_PTR_8_SHIFT                            16
#define   SQ_TAIL_PTR_8_MASK                     0x00000fff
#define   SQ_TAIL_PTR_8_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_8:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_8:12;
        u32 rsvd_28:4;
    } b;
} flex_sq2_db_reg_t;

#define FLEX_SQ3_DB_REG                          0x0000000c
#define   SQ_HEAD_PTR_c_MASK                     0x0fff0000
#define   SQ_HEAD_PTR_c_SHIFT                            16
#define   SQ_TAIL_PTR_c_MASK                     0x00000fff
#define   SQ_TAIL_PTR_c_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_c:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_c:12;
        u32 rsvd_28:4;
    } b;
} flex_sq3_db_reg_t;

#define FLEX_SQ4_DB_REG                          0x00000010
#define   SQ_HEAD_PTR_10_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_10_SHIFT                           16
#define   SQ_TAIL_PTR_10_MASK                    0x00000fff
#define   SQ_TAIL_PTR_10_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_10:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_10:12;
        u32 rsvd_28:4;
    } b;
} flex_sq4_db_reg_t;

#define FLEX_SQ5_DB_REG                          0x00000014
#define   SQ_HEAD_PTR_14_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_14_SHIFT                           16
#define   SQ_TAIL_PTR_14_MASK                    0x00000fff
#define   SQ_TAIL_PTR_14_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_14:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_14:12;
        u32 rsvd_28:4;
    } b;
} flex_sq5_db_reg_t;

#define FLEX_SQ6_DB_REG                          0x00000018
#define   SQ_HEAD_PTR_18_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_18_SHIFT                           16
#define   SQ_TAIL_PTR_18_MASK                    0x00000fff
#define   SQ_TAIL_PTR_18_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_18:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_18:12;
        u32 rsvd_28:4;
    } b;
} flex_sq6_db_reg_t;

#define FLEX_SQ7_DB_REG                          0x0000001c
#define   SQ_HEAD_PTR_1c_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_1c_SHIFT                           16
#define   SQ_TAIL_PTR_1c_MASK                    0x00000fff
#define   SQ_TAIL_PTR_1c_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_1c:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_1c:12;
        u32 rsvd_28:4;
    } b;
} flex_sq7_db_reg_t;

#define FLEX_SQ8_DB_REG                          0x00000020
#define   SQ_HEAD_PTR_20_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_20_SHIFT                           16
#define   SQ_TAIL_PTR_20_MASK                    0x00000fff
#define   SQ_TAIL_PTR_20_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_20:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_20:12;
        u32 rsvd_28:4;
    } b;
} flex_sq8_db_reg_t;

#define FLEX_SQ9_DB_REG                          0x00000024
#define   SQ_HEAD_PTR_24_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_24_SHIFT                           16
#define   SQ_TAIL_PTR_24_MASK                    0x00000fff
#define   SQ_TAIL_PTR_24_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_24:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_24:12;
        u32 rsvd_28:4;
    } b;
} flex_sq9_db_reg_t;

#define FLEX_SQ10_DB_REG                         0x00000028
#define   SQ_HEAD_PTR_28_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_28_SHIFT                           16
#define   SQ_TAIL_PTR_28_MASK                    0x00000fff
#define   SQ_TAIL_PTR_28_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_28:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_28:12;
        u32 rsvd_28:4;
    } b;
} flex_sq10_db_reg_t;

#define FLEX_SQ11_DB_REG                         0x0000002c
#define   SQ_HEAD_PTR_2c_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_2c_SHIFT                           16
#define   SQ_TAIL_PTR_2c_MASK                    0x00000fff
#define   SQ_TAIL_PTR_2c_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_2c:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_2c:12;
        u32 rsvd_28:4;
    } b;
} flex_sq11_db_reg_t;

#define FLEX_SQ12_DB_REG                         0x00000030
#define   SQ_HEAD_PTR_30_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_30_SHIFT                           16
#define   SQ_TAIL_PTR_30_MASK                    0x00000fff
#define   SQ_TAIL_PTR_30_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_30:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_30:12;
        u32 rsvd_28:4;
    } b;
} flex_sq12_db_reg_t;

#define FLEX_SQ13_DB_REG                         0x00000034
#define   SQ_HEAD_PTR_34_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_34_SHIFT                           16
#define   SQ_TAIL_PTR_34_MASK                    0x00000fff
#define   SQ_TAIL_PTR_34_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_34:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_34:12;
        u32 rsvd_28:4;
    } b;
} flex_sq13_db_reg_t;

#define FLEX_SQ14_DB_REG                         0x00000038
#define   SQ_HEAD_PTR_38_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_38_SHIFT                           16
#define   SQ_TAIL_PTR_38_MASK                    0x00000fff
#define   SQ_TAIL_PTR_38_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_38:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_38:12;
        u32 rsvd_28:4;
    } b;
} flex_sq14_db_reg_t;

#define FLEX_SQ15_DB_REG                         0x0000003c
#define   SQ_HEAD_PTR_3c_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_3c_SHIFT                           16
#define   SQ_TAIL_PTR_3c_MASK                    0x00000fff
#define   SQ_TAIL_PTR_3c_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_3c:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_3c:12;
        u32 rsvd_28:4;
    } b;
} flex_sq15_db_reg_t;

#define FLEX_SQ16_DB_REG                         0x00000040
#define   SQ_HEAD_PTR_40_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_40_SHIFT                           16
#define   SQ_TAIL_PTR_40_MASK                    0x00000fff
#define   SQ_TAIL_PTR_40_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_40:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_40:12;
        u32 rsvd_28:4;
    } b;
} flex_sq16_db_reg_t;

#define FLEX_SQ17_DB_REG                         0x00000044
#define   SQ_HEAD_PTR_44_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_44_SHIFT                           16
#define   SQ_TAIL_PTR_44_MASK                    0x00000fff
#define   SQ_TAIL_PTR_44_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_44:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_44:12;
        u32 rsvd_28:4;
    } b;
} flex_sq17_db_reg_t;

#define FLEX_SQ18_DB_REG                         0x00000048
#define   SQ_HEAD_PTR_48_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_48_SHIFT                           16
#define   SQ_TAIL_PTR_48_MASK                    0x00000fff
#define   SQ_TAIL_PTR_48_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_48:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_48:12;
        u32 rsvd_28:4;
    } b;
} flex_sq18_db_reg_t;

#define FLEX_SQ19_DB_REG                         0x0000004c
#define   SQ_HEAD_PTR_4c_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_4c_SHIFT                           16
#define   SQ_TAIL_PTR_4c_MASK                    0x00000fff
#define   SQ_TAIL_PTR_4c_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_4c:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_4c:12;
        u32 rsvd_28:4;
    } b;
} flex_sq19_db_reg_t;

#define FLEX_SQ20_DB_REG                         0x00000050
#define   SQ_HEAD_PTR_50_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_50_SHIFT                           16
#define   SQ_TAIL_PTR_50_MASK                    0x00000fff
#define   SQ_TAIL_PTR_50_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_50:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_50:12;
        u32 rsvd_28:4;
    } b;
} flex_sq20_db_reg_t;

#define FLEX_SQ21_DB_REG                         0x00000054
#define   SQ_HEAD_PTR_54_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_54_SHIFT                           16
#define   SQ_TAIL_PTR_54_MASK                    0x00000fff
#define   SQ_TAIL_PTR_54_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_54:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_54:12;
        u32 rsvd_28:4;
    } b;
} flex_sq21_db_reg_t;

#define FLEX_SQ22_DB_REG                         0x00000058
#define   SQ_HEAD_PTR_58_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_58_SHIFT                           16
#define   SQ_TAIL_PTR_58_MASK                    0x00000fff
#define   SQ_TAIL_PTR_58_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_58:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_58:12;
        u32 rsvd_28:4;
    } b;
} flex_sq22_db_reg_t;

#define FLEX_SQ23_DB_REG                         0x0000005c
#define   SQ_HEAD_PTR_5c_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_5c_SHIFT                           16
#define   SQ_TAIL_PTR_5c_MASK                    0x00000fff
#define   SQ_TAIL_PTR_5c_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_5c:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_5c:12;
        u32 rsvd_28:4;
    } b;
} flex_sq23_db_reg_t;

#define FLEX_SQ24_DB_REG                         0x00000060
#define   SQ_HEAD_PTR_60_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_60_SHIFT                           16
#define   SQ_TAIL_PTR_60_MASK                    0x00000fff
#define   SQ_TAIL_PTR_60_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_60:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_60:12;
        u32 rsvd_28:4;
    } b;
} flex_sq24_db_reg_t;

#define FLEX_SQ25_DB_REG                         0x00000064
#define   SQ_HEAD_PTR_64_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_64_SHIFT                           16
#define   SQ_TAIL_PTR_64_MASK                    0x00000fff
#define   SQ_TAIL_PTR_64_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_64:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_64:12;
        u32 rsvd_28:4;
    } b;
} flex_sq25_db_reg_t;

#define FLEX_SQ26_DB_REG                         0x00000068
#define   SQ_HEAD_PTR_68_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_68_SHIFT                           16
#define   SQ_TAIL_PTR_68_MASK                    0x00000fff
#define   SQ_TAIL_PTR_68_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_68:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_68:12;
        u32 rsvd_28:4;
    } b;
} flex_sq26_db_reg_t;

#define FLEX_SQ27_DB_REG                         0x0000006c
#define   SQ_HEAD_PTR_6c_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_6c_SHIFT                           16
#define   SQ_TAIL_PTR_6c_MASK                    0x00000fff
#define   SQ_TAIL_PTR_6c_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_6c:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_6c:12;
        u32 rsvd_28:4;
    } b;
} flex_sq27_db_reg_t;

#define FLEX_SQ28_DB_REG                         0x00000070
#define   SQ_HEAD_PTR_70_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_70_SHIFT                           16
#define   SQ_TAIL_PTR_70_MASK                    0x00000fff
#define   SQ_TAIL_PTR_70_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_70:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_70:12;
        u32 rsvd_28:4;
    } b;
} flex_sq28_db_reg_t;

#define FLEX_SQ29_DB_REG                         0x00000074
#define   SQ_HEAD_PTR_74_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_74_SHIFT                           16
#define   SQ_TAIL_PTR_74_MASK                    0x00000fff
#define   SQ_TAIL_PTR_74_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_74:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_74:12;
        u32 rsvd_28:4;
    } b;
} flex_sq29_db_reg_t;

#define FLEX_SQ30_DB_REG                         0x00000078
#define   SQ_HEAD_PTR_78_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_78_SHIFT                           16
#define   SQ_TAIL_PTR_78_MASK                    0x00000fff
#define   SQ_TAIL_PTR_78_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_78:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_78:12;
        u32 rsvd_28:4;
    } b;
} flex_sq30_db_reg_t;

#define FLEX_SQ31_DB_REG                         0x0000007c
#define   SQ_HEAD_PTR_7c_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_7c_SHIFT                           16
#define   SQ_TAIL_PTR_7c_MASK                    0x00000fff
#define   SQ_TAIL_PTR_7c_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_7c:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_7c:12;
        u32 rsvd_28:4;
    } b;
} flex_sq31_db_reg_t;

#define FLEX_SQ32_DB_REG                         0x00000080
#define   SQ_HEAD_PTR_80_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_80_SHIFT                           16
#define   SQ_TAIL_PTR_80_MASK                    0x00000fff
#define   SQ_TAIL_PTR_80_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_80:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_80:12;
        u32 rsvd_28:4;
    } b;
} flex_sq32_db_reg_t;

#define FLEX_SQ33_DB_REG                         0x00000084
#define   SQ_HEAD_PTR_84_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_84_SHIFT                           16
#define   SQ_TAIL_PTR_84_MASK                    0x00000fff
#define   SQ_TAIL_PTR_84_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_84:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_84:12;
        u32 rsvd_28:4;
    } b;
} flex_sq33_db_reg_t;

#define FLEX_SQ34_DB_REG                         0x00000088
#define   SQ_HEAD_PTR_88_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_88_SHIFT                           16
#define   SQ_TAIL_PTR_88_MASK                    0x00000fff
#define   SQ_TAIL_PTR_88_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_88:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_88:12;
        u32 rsvd_28:4;
    } b;
} flex_sq34_db_reg_t;

#define FLEX_SQ35_DB_REG                         0x0000008c
#define   SQ_HEAD_PTR_8c_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_8c_SHIFT                           16
#define   SQ_TAIL_PTR_8c_MASK                    0x00000fff
#define   SQ_TAIL_PTR_8c_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_8c:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_8c:12;
        u32 rsvd_28:4;
    } b;
} flex_sq35_db_reg_t;

#define FLEX_SQ36_DB_REG                         0x00000090
#define   SQ_HEAD_PTR_90_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_90_SHIFT                           16
#define   SQ_TAIL_PTR_90_MASK                    0x00000fff
#define   SQ_TAIL_PTR_90_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_90:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_90:12;
        u32 rsvd_28:4;
    } b;
} flex_sq36_db_reg_t;

#define FLEX_SQ37_DB_REG                         0x00000094
#define   SQ_HEAD_PTR_94_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_94_SHIFT                           16
#define   SQ_TAIL_PTR_94_MASK                    0x00000fff
#define   SQ_TAIL_PTR_94_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_94:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_94:12;
        u32 rsvd_28:4;
    } b;
} flex_sq37_db_reg_t;

#define FLEX_SQ38_DB_REG                         0x00000098
#define   SQ_HEAD_PTR_98_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_98_SHIFT                           16
#define   SQ_TAIL_PTR_98_MASK                    0x00000fff
#define   SQ_TAIL_PTR_98_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_98:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_98:12;
        u32 rsvd_28:4;
    } b;
} flex_sq38_db_reg_t;

#define FLEX_SQ39_DB_REG                         0x0000009c
#define   SQ_HEAD_PTR_9c_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_9c_SHIFT                           16
#define   SQ_TAIL_PTR_9c_MASK                    0x00000fff
#define   SQ_TAIL_PTR_9c_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_9c:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_9c:12;
        u32 rsvd_28:4;
    } b;
} flex_sq39_db_reg_t;

#define FLEX_SQ40_DB_REG                         0x000000a0
#define   SQ_HEAD_PTR_a0_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_a0_SHIFT                           16
#define   SQ_TAIL_PTR_a0_MASK                    0x00000fff
#define   SQ_TAIL_PTR_a0_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_a0:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_a0:12;
        u32 rsvd_28:4;
    } b;
} flex_sq40_db_reg_t;

#define FLEX_SQ41_DB_REG                         0x000000a4
#define   SQ_HEAD_PTR_a4_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_a4_SHIFT                           16
#define   SQ_TAIL_PTR_a4_MASK                    0x00000fff
#define   SQ_TAIL_PTR_a4_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_a4:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_a4:12;
        u32 rsvd_28:4;
    } b;
} flex_sq41_db_reg_t;

#define FLEX_SQ42_DB_REG                         0x000000a8
#define   SQ_HEAD_PTR_a8_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_a8_SHIFT                           16
#define   SQ_TAIL_PTR_a8_MASK                    0x00000fff
#define   SQ_TAIL_PTR_a8_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_a8:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_a8:12;
        u32 rsvd_28:4;
    } b;
} flex_sq42_db_reg_t;

#define FLEX_SQ43_DB_REG                         0x000000ac
#define   SQ_HEAD_PTR_ac_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_ac_SHIFT                           16
#define   SQ_TAIL_PTR_ac_MASK                    0x00000fff
#define   SQ_TAIL_PTR_ac_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_ac:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_ac:12;
        u32 rsvd_28:4;
    } b;
} flex_sq43_db_reg_t;

#define FLEX_SQ44_DB_REG                         0x000000b0
#define   SQ_HEAD_PTR_b0_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_b0_SHIFT                           16
#define   SQ_TAIL_PTR_b0_MASK                    0x00000fff
#define   SQ_TAIL_PTR_b0_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_b0:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_b0:12;
        u32 rsvd_28:4;
    } b;
} flex_sq44_db_reg_t;

#define FLEX_SQ45_DB_REG                         0x000000b4
#define   SQ_HEAD_PTR_b4_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_b4_SHIFT                           16
#define   SQ_TAIL_PTR_b4_MASK                    0x00000fff
#define   SQ_TAIL_PTR_b4_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_b4:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_b4:12;
        u32 rsvd_28:4;
    } b;
} flex_sq45_db_reg_t;

#define FLEX_SQ46_DB_REG                         0x000000b8
#define   SQ_HEAD_PTR_b8_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_b8_SHIFT                           16
#define   SQ_TAIL_PTR_b8_MASK                    0x00000fff
#define   SQ_TAIL_PTR_b8_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_b8:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_b8:12;
        u32 rsvd_28:4;
    } b;
} flex_sq46_db_reg_t;

#define FLEX_SQ47_DB_REG                         0x000000bc
#define   SQ_HEAD_PTR_bc_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_bc_SHIFT                           16
#define   SQ_TAIL_PTR_bc_MASK                    0x00000fff
#define   SQ_TAIL_PTR_bc_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_bc:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_bc:12;
        u32 rsvd_28:4;
    } b;
} flex_sq47_db_reg_t;

#define FLEX_SQ48_DB_REG                         0x000000c0
#define   SQ_HEAD_PTR_c0_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_c0_SHIFT                           16
#define   SQ_TAIL_PTR_c0_MASK                    0x00000fff
#define   SQ_TAIL_PTR_c0_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_c0:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_c0:12;
        u32 rsvd_28:4;
    } b;
} flex_sq48_db_reg_t;

#define FLEX_SQ49_DB_REG                         0x000000c4
#define   SQ_HEAD_PTR_c4_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_c4_SHIFT                           16
#define   SQ_TAIL_PTR_c4_MASK                    0x00000fff
#define   SQ_TAIL_PTR_c4_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_c4:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_c4:12;
        u32 rsvd_28:4;
    } b;
} flex_sq49_db_reg_t;

#define FLEX_SQ50_DB_REG                         0x000000c8
#define   SQ_HEAD_PTR_c8_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_c8_SHIFT                           16
#define   SQ_TAIL_PTR_c8_MASK                    0x00000fff
#define   SQ_TAIL_PTR_c8_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_c8:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_c8:12;
        u32 rsvd_28:4;
    } b;
} flex_sq50_db_reg_t;

#define FLEX_SQ51_DB_REG                         0x000000cc
#define   SQ_HEAD_PTR_cc_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_cc_SHIFT                           16
#define   SQ_TAIL_PTR_cc_MASK                    0x00000fff
#define   SQ_TAIL_PTR_cc_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_cc:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_cc:12;
        u32 rsvd_28:4;
    } b;
} flex_sq51_db_reg_t;

#define FLEX_SQ52_DB_REG                         0x000000d0
#define   SQ_HEAD_PTR_d0_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_d0_SHIFT                           16
#define   SQ_TAIL_PTR_d0_MASK                    0x00000fff
#define   SQ_TAIL_PTR_d0_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_d0:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_d0:12;
        u32 rsvd_28:4;
    } b;
} flex_sq52_db_reg_t;

#define FLEX_SQ53_DB_REG                         0x000000d4
#define   SQ_HEAD_PTR_d4_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_d4_SHIFT                           16
#define   SQ_TAIL_PTR_d4_MASK                    0x00000fff
#define   SQ_TAIL_PTR_d4_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_d4:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_d4:12;
        u32 rsvd_28:4;
    } b;
} flex_sq53_db_reg_t;

#define FLEX_SQ54_DB_REG                         0x000000d8
#define   SQ_HEAD_PTR_d8_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_d8_SHIFT                           16
#define   SQ_TAIL_PTR_d8_MASK                    0x00000fff
#define   SQ_TAIL_PTR_d8_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_d8:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_d8:12;
        u32 rsvd_28:4;
    } b;
} flex_sq54_db_reg_t;

#define FLEX_SQ55_DB_REG                         0x000000dc
#define   SQ_HEAD_PTR_dc_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_dc_SHIFT                           16
#define   SQ_TAIL_PTR_dc_MASK                    0x00000fff
#define   SQ_TAIL_PTR_dc_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_dc:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_dc:12;
        u32 rsvd_28:4;
    } b;
} flex_sq55_db_reg_t;

#define FLEX_SQ56_DB_REG                         0x000000e0
#define   SQ_HEAD_PTR_e0_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_e0_SHIFT                           16
#define   SQ_TAIL_PTR_e0_MASK                    0x00000fff
#define   SQ_TAIL_PTR_e0_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_e0:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_e0:12;
        u32 rsvd_28:4;
    } b;
} flex_sq56_db_reg_t;

#define FLEX_SQ57_DB_REG                         0x000000e4
#define   SQ_HEAD_PTR_e4_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_e4_SHIFT                           16
#define   SQ_TAIL_PTR_e4_MASK                    0x00000fff
#define   SQ_TAIL_PTR_e4_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_e4:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_e4:12;
        u32 rsvd_28:4;
    } b;
} flex_sq57_db_reg_t;

#define FLEX_SQ58_DB_REG                         0x000000e8
#define   SQ_HEAD_PTR_e8_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_e8_SHIFT                           16
#define   SQ_TAIL_PTR_e8_MASK                    0x00000fff
#define   SQ_TAIL_PTR_e8_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_e8:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_e8:12;
        u32 rsvd_28:4;
    } b;
} flex_sq58_db_reg_t;

#define FLEX_SQ59_DB_REG                         0x000000ec
#define   SQ_HEAD_PTR_ec_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_ec_SHIFT                           16
#define   SQ_TAIL_PTR_ec_MASK                    0x00000fff
#define   SQ_TAIL_PTR_ec_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_ec:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_ec:12;
        u32 rsvd_28:4;
    } b;
} flex_sq59_db_reg_t;

#define FLEX_SQ60_DB_REG                         0x000000f0
#define   SQ_HEAD_PTR_f0_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_f0_SHIFT                           16
#define   SQ_TAIL_PTR_f0_MASK                    0x00000fff
#define   SQ_TAIL_PTR_f0_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_f0:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_f0:12;
        u32 rsvd_28:4;
    } b;
} flex_sq60_db_reg_t;

#define FLEX_SQ61_DB_REG                         0x000000f4
#define   SQ_HEAD_PTR_f4_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_f4_SHIFT                           16
#define   SQ_TAIL_PTR_f4_MASK                    0x00000fff
#define   SQ_TAIL_PTR_f4_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_f4:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_f4:12;
        u32 rsvd_28:4;
    } b;
} flex_sq61_db_reg_t;

#define FLEX_SQ62_DB_REG                         0x000000f8
#define   SQ_HEAD_PTR_f8_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_f8_SHIFT                           16
#define   SQ_TAIL_PTR_f8_MASK                    0x00000fff
#define   SQ_TAIL_PTR_f8_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_f8:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_f8:12;
        u32 rsvd_28:4;
    } b;
} flex_sq62_db_reg_t;

#define FLEX_SQ63_DB_REG                         0x000000fc
#define   SQ_HEAD_PTR_fc_MASK                    0x0fff0000
#define   SQ_HEAD_PTR_fc_SHIFT                           16
#define   SQ_TAIL_PTR_fc_MASK                    0x00000fff
#define   SQ_TAIL_PTR_fc_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_fc:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_fc:12;
        u32 rsvd_28:4;
    } b;
} flex_sq63_db_reg_t;

#define FLEX_SQ64_DB_REG                         0x00000100
#define   SQ_HEAD_PTR_100_MASK                   0x0fff0000
#define   SQ_HEAD_PTR_100_SHIFT                          16
#define   SQ_TAIL_PTR_100_MASK                   0x00000fff
#define   SQ_TAIL_PTR_100_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_100:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_100:12;
        u32 rsvd_28:4;
    } b;
} flex_sq64_db_reg_t;

#define FLEX_SQ65_DB_REG                         0x00000104
#define   SQ_HEAD_PTR_104_MASK                   0x0fff0000
#define   SQ_HEAD_PTR_104_SHIFT                          16
#define   SQ_TAIL_PTR_104_MASK                   0x00000fff
#define   SQ_TAIL_PTR_104_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_ptr_104:12;
        u32 rsvd_12:4;
        u32 sq_head_ptr_104:12;
        u32 rsvd_28:4;
    } b;
} flex_sq65_db_reg_t;

#define FLEX_CQ0_DB_REG                          0x00000300
#define   CQ_TAIL_PTR_MASK                       0x0fff0000
#define   CQ_TAIL_PTR_SHIFT                              16
#define   CQ_HEAD_PTR_MASK                       0x00000fff
#define   CQ_HEAD_PTR_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr:12;
        u32 rsvd_28:4;
    } b;
} flex_cq0_db_reg_t;

#define FLEX_CQ1_DB_REG                          0x00000304
#define   CQ_TAIL_PTR_304_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_304_SHIFT                          16
#define   CQ_HEAD_PTR_304_MASK                   0x00000fff
#define   CQ_HEAD_PTR_304_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_304:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_304:12;
        u32 rsvd_28:4;
    } b;
} flex_cq1_db_reg_t;

#define FLEX_CQ2_DB_REG                          0x00000308
#define   CQ_TAIL_PTR_308_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_308_SHIFT                          16
#define   CQ_HEAD_PTR_308_MASK                   0x00000fff
#define   CQ_HEAD_PTR_308_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_308:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_308:12;
        u32 rsvd_28:4;
    } b;
} flex_cq2_db_reg_t;

#define FLEX_CQ3_DB_REG                          0x0000030c
#define   CQ_TAIL_PTR_30c_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_30c_SHIFT                          16
#define   CQ_HEAD_PTR_30c_MASK                   0x00000fff
#define   CQ_HEAD_PTR_30c_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_30c:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_30c:12;
        u32 rsvd_28:4;
    } b;
} flex_cq3_db_reg_t;

#define FLEX_CQ4_DB_REG                          0x00000310
#define   CQ_TAIL_PTR_310_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_310_SHIFT                          16
#define   CQ_HEAD_PTR_310_MASK                   0x00000fff
#define   CQ_HEAD_PTR_310_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_310:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_310:12;
        u32 rsvd_28:4;
    } b;
} flex_cq4_db_reg_t;

#define FLEX_CQ5_DB_REG                          0x00000314
#define   CQ_TAIL_PTR_314_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_314_SHIFT                          16
#define   CQ_HEAD_PTR_314_MASK                   0x00000fff
#define   CQ_HEAD_PTR_314_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_314:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_314:12;
        u32 rsvd_28:4;
    } b;
} flex_cq5_db_reg_t;

#define FLEX_CQ6_DB_REG                          0x00000318
#define   CQ_TAIL_PTR_318_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_318_SHIFT                          16
#define   CQ_HEAD_PTR_318_MASK                   0x00000fff
#define   CQ_HEAD_PTR_318_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_318:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_318:12;
        u32 rsvd_28:4;
    } b;
} flex_cq6_db_reg_t;

#define FLEX_CQ7_DB_REG                          0x0000031c
#define   CQ_TAIL_PTR_31c_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_31c_SHIFT                          16
#define   CQ_HEAD_PTR_31c_MASK                   0x00000fff
#define   CQ_HEAD_PTR_31c_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_31c:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_31c:12;
        u32 rsvd_28:4;
    } b;
} flex_cq7_db_reg_t;

#define FLEX_CQ8_DB_REG                          0x00000320
#define   CQ_TAIL_PTR_320_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_320_SHIFT                          16
#define   CQ_HEAD_PTR_320_MASK                   0x00000fff
#define   CQ_HEAD_PTR_320_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_320:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_320:12;
        u32 rsvd_28:4;
    } b;
} flex_cq8_db_reg_t;

#define FLEX_CQ9_DB_REG                          0x00000324
#define   CQ_TAIL_PTR_324_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_324_SHIFT                          16
#define   CQ_HEAD_PTR_324_MASK                   0x00000fff
#define   CQ_HEAD_PTR_324_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_324:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_324:12;
        u32 rsvd_28:4;
    } b;
} flex_cq9_db_reg_t;

#define FLEX_CQ10_DB_REG                         0x00000328
#define   CQ_TAIL_PTR_328_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_328_SHIFT                          16
#define   CQ_HEAD_PTR_328_MASK                   0x00000fff
#define   CQ_HEAD_PTR_328_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_328:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_328:12;
        u32 rsvd_28:4;
    } b;
} flex_cq10_db_reg_t;

#define FLEX_CQ11_DB_REG                         0x0000032c
#define   CQ_TAIL_PTR_32c_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_32c_SHIFT                          16
#define   CQ_HEAD_PTR_32c_MASK                   0x00000fff
#define   CQ_HEAD_PTR_32c_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_32c:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_32c:12;
        u32 rsvd_28:4;
    } b;
} flex_cq11_db_reg_t;

#define FLEX_CQ12_DB_REG                         0x00000330
#define   CQ_TAIL_PTR_330_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_330_SHIFT                          16
#define   CQ_HEAD_PTR_330_MASK                   0x00000fff
#define   CQ_HEAD_PTR_330_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_330:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_330:12;
        u32 rsvd_28:4;
    } b;
} flex_cq12_db_reg_t;

#define FLEX_CQ13_DB_REG                         0x00000334
#define   CQ_TAIL_PTR_334_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_334_SHIFT                          16
#define   CQ_HEAD_PTR_334_MASK                   0x00000fff
#define   CQ_HEAD_PTR_334_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_334:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_334:12;
        u32 rsvd_28:4;
    } b;
} flex_cq13_db_reg_t;

#define FLEX_CQ14_DB_REG                         0x00000338
#define   CQ_TAIL_PTR_338_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_338_SHIFT                          16
#define   CQ_HEAD_PTR_338_MASK                   0x00000fff
#define   CQ_HEAD_PTR_338_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_338:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_338:12;
        u32 rsvd_28:4;
    } b;
} flex_cq14_db_reg_t;

#define FLEX_CQ15_DB_REG                         0x0000033c
#define   CQ_TAIL_PTR_33c_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_33c_SHIFT                          16
#define   CQ_HEAD_PTR_33c_MASK                   0x00000fff
#define   CQ_HEAD_PTR_33c_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_33c:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_33c:12;
        u32 rsvd_28:4;
    } b;
} flex_cq15_db_reg_t;

#define FLEX_CQ16_DB_REG                         0x00000340
#define   CQ_TAIL_PTR_340_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_340_SHIFT                          16
#define   CQ_HEAD_PTR_340_MASK                   0x00000fff
#define   CQ_HEAD_PTR_340_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_340:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_340:12;
        u32 rsvd_28:4;
    } b;
} flex_cq16_db_reg_t;

#define FLEX_CQ17_DB_REG                         0x00000344
#define   CQ_TAIL_PTR_344_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_344_SHIFT                          16
#define   CQ_HEAD_PTR_344_MASK                   0x00000fff
#define   CQ_HEAD_PTR_344_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_344:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_344:12;
        u32 rsvd_28:4;
    } b;
} flex_cq17_db_reg_t;

#define FLEX_CQ18_DB_REG                         0x00000348
#define   CQ_TAIL_PTR_348_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_348_SHIFT                          16
#define   CQ_HEAD_PTR_348_MASK                   0x00000fff
#define   CQ_HEAD_PTR_348_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_348:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_348:12;
        u32 rsvd_28:4;
    } b;
} flex_cq18_db_reg_t;

#define FLEX_CQ19_DB_REG                         0x0000034c
#define   CQ_TAIL_PTR_34c_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_34c_SHIFT                          16
#define   CQ_HEAD_PTR_34c_MASK                   0x00000fff
#define   CQ_HEAD_PTR_34c_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_34c:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_34c:12;
        u32 rsvd_28:4;
    } b;
} flex_cq19_db_reg_t;

#define FLEX_CQ20_DB_REG                         0x00000350
#define   CQ_TAIL_PTR_350_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_350_SHIFT                          16
#define   CQ_HEAD_PTR_350_MASK                   0x00000fff
#define   CQ_HEAD_PTR_350_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_350:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_350:12;
        u32 rsvd_28:4;
    } b;
} flex_cq20_db_reg_t;

#define FLEX_CQ21_DB_REG                         0x00000354
#define   CQ_TAIL_PTR_354_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_354_SHIFT                          16
#define   CQ_HEAD_PTR_354_MASK                   0x00000fff
#define   CQ_HEAD_PTR_354_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_354:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_354:12;
        u32 rsvd_28:4;
    } b;
} flex_cq21_db_reg_t;

#define FLEX_CQ22_DB_REG                         0x00000358
#define   CQ_TAIL_PTR_358_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_358_SHIFT                          16
#define   CQ_HEAD_PTR_358_MASK                   0x00000fff
#define   CQ_HEAD_PTR_358_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_358:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_358:12;
        u32 rsvd_28:4;
    } b;
} flex_cq22_db_reg_t;

#define FLEX_CQ23_DB_REG                         0x0000035c
#define   CQ_TAIL_PTR_35c_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_35c_SHIFT                          16
#define   CQ_HEAD_PTR_35c_MASK                   0x00000fff
#define   CQ_HEAD_PTR_35c_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_35c:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_35c:12;
        u32 rsvd_28:4;
    } b;
} flex_cq23_db_reg_t;

#define FLEX_CQ24_DB_REG                         0x00000360
#define   CQ_TAIL_PTR_360_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_360_SHIFT                          16
#define   CQ_HEAD_PTR_360_MASK                   0x00000fff
#define   CQ_HEAD_PTR_360_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_360:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_360:12;
        u32 rsvd_28:4;
    } b;
} flex_cq24_db_reg_t;

#define FLEX_CQ25_DB_REG                         0x00000364
#define   CQ_TAIL_PTR_364_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_364_SHIFT                          16
#define   CQ_HEAD_PTR_364_MASK                   0x00000fff
#define   CQ_HEAD_PTR_364_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_364:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_364:12;
        u32 rsvd_28:4;
    } b;
} flex_cq25_db_reg_t;

#define FLEX_CQ26_DB_REG                         0x00000368
#define   CQ_TAIL_PTR_368_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_368_SHIFT                          16
#define   CQ_HEAD_PTR_368_MASK                   0x00000fff
#define   CQ_HEAD_PTR_368_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_368:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_368:12;
        u32 rsvd_28:4;
    } b;
} flex_cq26_db_reg_t;

#define FLEX_CQ27_DB_REG                         0x0000036c
#define   CQ_TAIL_PTR_36c_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_36c_SHIFT                          16
#define   CQ_HEAD_PTR_36c_MASK                   0x00000fff
#define   CQ_HEAD_PTR_36c_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_36c:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_36c:12;
        u32 rsvd_28:4;
    } b;
} flex_cq27_db_reg_t;

#define FLEX_CQ28_DB_REG                         0x00000370
#define   CQ_TAIL_PTR_370_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_370_SHIFT                          16
#define   CQ_HEAD_PTR_370_MASK                   0x00000fff
#define   CQ_HEAD_PTR_370_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_370:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_370:12;
        u32 rsvd_28:4;
    } b;
} flex_cq28_db_reg_t;

#define FLEX_CQ29_DB_REG                         0x00000374
#define   CQ_TAIL_PTR_374_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_374_SHIFT                          16
#define   CQ_HEAD_PTR_374_MASK                   0x00000fff
#define   CQ_HEAD_PTR_374_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_374:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_374:12;
        u32 rsvd_28:4;
    } b;
} flex_cq29_db_reg_t;

#define FLEX_CQ30_DB_REG                         0x00000378
#define   CQ_TAIL_PTR_378_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_378_SHIFT                          16
#define   CQ_HEAD_PTR_378_MASK                   0x00000fff
#define   CQ_HEAD_PTR_378_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_378:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_378:12;
        u32 rsvd_28:4;
    } b;
} flex_cq30_db_reg_t;

#define FLEX_CQ31_DB_REG                         0x0000037c
#define   CQ_TAIL_PTR_37c_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_37c_SHIFT                          16
#define   CQ_HEAD_PTR_37c_MASK                   0x00000fff
#define   CQ_HEAD_PTR_37c_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_37c:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_37c:12;
        u32 rsvd_28:4;
    } b;
} flex_cq31_db_reg_t;

#define FLEX_CQ32_DB_REG                         0x00000380
#define   CQ_TAIL_PTR_380_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_380_SHIFT                          16
#define   CQ_HEAD_PTR_380_MASK                   0x00000fff
#define   CQ_HEAD_PTR_380_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_380:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_380:12;
        u32 rsvd_28:4;
    } b;
} flex_cq32_db_reg_t;

#define FLEX_CQ33_DB_REG                         0x00000384
#define   CQ_TAIL_PTR_384_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_384_SHIFT                          16
#define   CQ_HEAD_PTR_384_MASK                   0x00000fff
#define   CQ_HEAD_PTR_384_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_384:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_384:12;
        u32 rsvd_28:4;
    } b;
} flex_cq33_db_reg_t;

#define FLEX_CQ34_DB_REG                         0x00000388
#define   CQ_TAIL_PTR_388_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_388_SHIFT                          16
#define   CQ_HEAD_PTR_388_MASK                   0x00000fff
#define   CQ_HEAD_PTR_388_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_388:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_388:12;
        u32 rsvd_28:4;
    } b;
} flex_cq34_db_reg_t;

#define FLEX_CQ35_DB_REG                         0x0000038c
#define   CQ_TAIL_PTR_38c_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_38c_SHIFT                          16
#define   CQ_HEAD_PTR_38c_MASK                   0x00000fff
#define   CQ_HEAD_PTR_38c_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_38c:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_38c:12;
        u32 rsvd_28:4;
    } b;
} flex_cq35_db_reg_t;

#define FLEX_CQ36_DB_REG                         0x00000390
#define   CQ_TAIL_PTR_390_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_390_SHIFT                          16
#define   CQ_HEAD_PTR_390_MASK                   0x00000fff
#define   CQ_HEAD_PTR_390_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_390:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_390:12;
        u32 rsvd_28:4;
    } b;
} flex_cq36_db_reg_t;

#define FLEX_CQ37_DB_REG                         0x00000394
#define   CQ_TAIL_PTR_394_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_394_SHIFT                          16
#define   CQ_HEAD_PTR_394_MASK                   0x00000fff
#define   CQ_HEAD_PTR_394_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_394:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_394:12;
        u32 rsvd_28:4;
    } b;
} flex_cq37_db_reg_t;

#define FLEX_CQ38_DB_REG                         0x00000398
#define   CQ_TAIL_PTR_398_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_398_SHIFT                          16
#define   CQ_HEAD_PTR_398_MASK                   0x00000fff
#define   CQ_HEAD_PTR_398_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_398:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_398:12;
        u32 rsvd_28:4;
    } b;
} flex_cq38_db_reg_t;

#define FLEX_CQ39_DB_REG                         0x0000039c
#define   CQ_TAIL_PTR_39c_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_39c_SHIFT                          16
#define   CQ_HEAD_PTR_39c_MASK                   0x00000fff
#define   CQ_HEAD_PTR_39c_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_39c:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_39c:12;
        u32 rsvd_28:4;
    } b;
} flex_cq39_db_reg_t;

#define FLEX_CQ40_DB_REG                         0x000003a0
#define   CQ_TAIL_PTR_3a0_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3a0_SHIFT                          16
#define   CQ_HEAD_PTR_3a0_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3a0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3a0:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3a0:12;
        u32 rsvd_28:4;
    } b;
} flex_cq40_db_reg_t;

#define FLEX_CQ41_DB_REG                         0x000003a4
#define   CQ_TAIL_PTR_3a4_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3a4_SHIFT                          16
#define   CQ_HEAD_PTR_3a4_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3a4_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3a4:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3a4:12;
        u32 rsvd_28:4;
    } b;
} flex_cq41_db_reg_t;

#define FLEX_CQ42_DB_REG                         0x000003a8
#define   CQ_TAIL_PTR_3a8_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3a8_SHIFT                          16
#define   CQ_HEAD_PTR_3a8_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3a8_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3a8:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3a8:12;
        u32 rsvd_28:4;
    } b;
} flex_cq42_db_reg_t;

#define FLEX_CQ43_DB_REG                         0x000003ac
#define   CQ_TAIL_PTR_3ac_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3ac_SHIFT                          16
#define   CQ_HEAD_PTR_3ac_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3ac_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3ac:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3ac:12;
        u32 rsvd_28:4;
    } b;
} flex_cq43_db_reg_t;

#define FLEX_CQ44_DB_REG                         0x000003b0
#define   CQ_TAIL_PTR_3b0_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3b0_SHIFT                          16
#define   CQ_HEAD_PTR_3b0_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3b0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3b0:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3b0:12;
        u32 rsvd_28:4;
    } b;
} flex_cq44_db_reg_t;

#define FLEX_CQ45_DB_REG                         0x000003b4
#define   CQ_TAIL_PTR_3b4_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3b4_SHIFT                          16
#define   CQ_HEAD_PTR_3b4_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3b4_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3b4:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3b4:12;
        u32 rsvd_28:4;
    } b;
} flex_cq45_db_reg_t;

#define FLEX_CQ46_DB_REG                         0x000003b8
#define   CQ_TAIL_PTR_3b8_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3b8_SHIFT                          16
#define   CQ_HEAD_PTR_3b8_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3b8_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3b8:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3b8:12;
        u32 rsvd_28:4;
    } b;
} flex_cq46_db_reg_t;

#define FLEX_CQ47_DB_REG                         0x000003bc
#define   CQ_TAIL_PTR_3bc_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3bc_SHIFT                          16
#define   CQ_HEAD_PTR_3bc_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3bc_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3bc:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3bc:12;
        u32 rsvd_28:4;
    } b;
} flex_cq47_db_reg_t;

#define FLEX_CQ48_DB_REG                         0x000003c0
#define   CQ_TAIL_PTR_3c0_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3c0_SHIFT                          16
#define   CQ_HEAD_PTR_3c0_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3c0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3c0:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3c0:12;
        u32 rsvd_28:4;
    } b;
} flex_cq48_db_reg_t;

#define FLEX_CQ49_DB_REG                         0x000003c4
#define   CQ_TAIL_PTR_3c4_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3c4_SHIFT                          16
#define   CQ_HEAD_PTR_3c4_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3c4_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3c4:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3c4:12;
        u32 rsvd_28:4;
    } b;
} flex_cq49_db_reg_t;

#define FLEX_CQ50_DB_REG                         0x000003c8
#define   CQ_TAIL_PTR_3c8_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3c8_SHIFT                          16
#define   CQ_HEAD_PTR_3c8_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3c8_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3c8:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3c8:12;
        u32 rsvd_28:4;
    } b;
} flex_cq50_db_reg_t;

#define FLEX_CQ51_DB_REG                         0x000003cc
#define   CQ_TAIL_PTR_3cc_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3cc_SHIFT                          16
#define   CQ_HEAD_PTR_3cc_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3cc_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3cc:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3cc:12;
        u32 rsvd_28:4;
    } b;
} flex_cq51_db_reg_t;

#define FLEX_CQ52_DB_REG                         0x000003d0
#define   CQ_TAIL_PTR_3d0_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3d0_SHIFT                          16
#define   CQ_HEAD_PTR_3d0_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3d0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3d0:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3d0:12;
        u32 rsvd_28:4;
    } b;
} flex_cq52_db_reg_t;

#define FLEX_CQ53_DB_REG                         0x000003d4
#define   CQ_TAIL_PTR_3d4_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3d4_SHIFT                          16
#define   CQ_HEAD_PTR_3d4_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3d4_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3d4:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3d4:12;
        u32 rsvd_28:4;
    } b;
} flex_cq53_db_reg_t;

#define FLEX_CQ54_DB_REG                         0x000003d8
#define   CQ_TAIL_PTR_3d8_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3d8_SHIFT                          16
#define   CQ_HEAD_PTR_3d8_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3d8_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3d8:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3d8:12;
        u32 rsvd_28:4;
    } b;
} flex_cq54_db_reg_t;

#define FLEX_CQ55_DB_REG                         0x000003dc
#define   CQ_TAIL_PTR_3dc_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3dc_SHIFT                          16
#define   CQ_HEAD_PTR_3dc_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3dc_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3dc:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3dc:12;
        u32 rsvd_28:4;
    } b;
} flex_cq55_db_reg_t;

#define FLEX_CQ56_DB_REG                         0x000003e0
#define   CQ_TAIL_PTR_3e0_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3e0_SHIFT                          16
#define   CQ_HEAD_PTR_3e0_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3e0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3e0:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3e0:12;
        u32 rsvd_28:4;
    } b;
} flex_cq56_db_reg_t;

#define FLEX_CQ57_DB_REG                         0x000003e4
#define   CQ_TAIL_PTR_3e4_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3e4_SHIFT                          16
#define   CQ_HEAD_PTR_3e4_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3e4_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3e4:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3e4:12;
        u32 rsvd_28:4;
    } b;
} flex_cq57_db_reg_t;

#define FLEX_CQ58_DB_REG                         0x000003e8
#define   CQ_TAIL_PTR_3e8_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3e8_SHIFT                          16
#define   CQ_HEAD_PTR_3e8_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3e8_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3e8:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3e8:12;
        u32 rsvd_28:4;
    } b;
} flex_cq58_db_reg_t;

#define FLEX_CQ59_DB_REG                         0x000003ec
#define   CQ_TAIL_PTR_3ec_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3ec_SHIFT                          16
#define   CQ_HEAD_PTR_3ec_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3ec_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3ec:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3ec:12;
        u32 rsvd_28:4;
    } b;
} flex_cq59_db_reg_t;

#define FLEX_CQ60_DB_REG                         0x000003f0
#define   CQ_TAIL_PTR_3f0_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3f0_SHIFT                          16
#define   CQ_HEAD_PTR_3f0_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3f0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3f0:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3f0:12;
        u32 rsvd_28:4;
    } b;
} flex_cq60_db_reg_t;

#define FLEX_CQ61_DB_REG                         0x000003f4
#define   CQ_TAIL_PTR_3f4_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3f4_SHIFT                          16
#define   CQ_HEAD_PTR_3f4_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3f4_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3f4:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3f4:12;
        u32 rsvd_28:4;
    } b;
} flex_cq61_db_reg_t;

#define FLEX_CQ62_DB_REG                         0x000003f8
#define   CQ_TAIL_PTR_3f8_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3f8_SHIFT                          16
#define   CQ_HEAD_PTR_3f8_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3f8_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3f8:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3f8:12;
        u32 rsvd_28:4;
    } b;
} flex_cq62_db_reg_t;

#define FLEX_CQ63_DB_REG                         0x000003fc
#define   CQ_TAIL_PTR_3fc_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_3fc_SHIFT                          16
#define   CQ_HEAD_PTR_3fc_MASK                   0x00000fff
#define   CQ_HEAD_PTR_3fc_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_3fc:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_3fc:12;
        u32 rsvd_28:4;
    } b;
} flex_cq63_db_reg_t;

#define FLEX_CQ64_DB_REG                         0x00000400
#define   CQ_TAIL_PTR_400_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_400_SHIFT                          16
#define   CQ_HEAD_PTR_400_MASK                   0x00000fff
#define   CQ_HEAD_PTR_400_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_400:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_400:12;
        u32 rsvd_28:4;
    } b;
} flex_cq64_db_reg_t;

#define FLEX_CQ65_DB_REG                         0x00000404
#define   CQ_TAIL_PTR_404_MASK                   0x0fff0000
#define   CQ_TAIL_PTR_404_SHIFT                          16
#define   CQ_HEAD_PTR_404_MASK                   0x00000fff
#define   CQ_HEAD_PTR_404_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cq_head_ptr_404:12;
        u32 rsvd_12:4;
        u32 cq_tail_ptr_404:12;
        u32 rsvd_28:4;
    } b;
} flex_cq65_db_reg_t;

#define FLEX_SQCQ0_SIZE                          0x00000600
#define   CQ_SIZE_MASK                           0x0fff0000
#define   CQ_SIZE_SHIFT                                  16
#define   SQ_SIZE_MASK                           0x00000fff
#define   SQ_SIZE_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 sq_size:12;
        u32 rsvd_12:4;
        u32 cq_size:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq0_size_t;

#define FLEX_SQCQ1_SIZE                          0x00000604
#define   CQ_SIZE_604_MASK                       0x0fff0000
#define   CQ_SIZE_604_SHIFT                              16
#define   SQ_SIZE_604_MASK                       0x00000fff
#define   SQ_SIZE_604_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_604:12;
        u32 rsvd_12:4;
        u32 cq_size_604:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq1_size_t;

#define FLEX_SQCQ2_SIZE                          0x00000608
#define   CQ_SIZE_608_MASK                       0x0fff0000
#define   CQ_SIZE_608_SHIFT                              16
#define   SQ_SIZE_608_MASK                       0x00000fff
#define   SQ_SIZE_608_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_608:12;
        u32 rsvd_12:4;
        u32 cq_size_608:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq2_size_t;

#define FLEX_SQCQ3_SIZE                          0x0000060c
#define   CQ_SIZE_60c_MASK                       0x0fff0000
#define   CQ_SIZE_60c_SHIFT                              16
#define   SQ_SIZE_60c_MASK                       0x00000fff
#define   SQ_SIZE_60c_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_60c:12;
        u32 rsvd_12:4;
        u32 cq_size_60c:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq3_size_t;

#define FLEX_SQCQ4_SIZE                          0x00000610
#define   CQ_SIZE_610_MASK                       0x0fff0000
#define   CQ_SIZE_610_SHIFT                              16
#define   SQ_SIZE_610_MASK                       0x00000fff
#define   SQ_SIZE_610_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_610:12;
        u32 rsvd_12:4;
        u32 cq_size_610:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq4_size_t;

#define FLEX_SQCQ5_SIZE                          0x00000614
#define   CQ_SIZE_614_MASK                       0x0fff0000
#define   CQ_SIZE_614_SHIFT                              16
#define   SQ_SIZE_614_MASK                       0x00000fff
#define   SQ_SIZE_614_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_614:12;
        u32 rsvd_12:4;
        u32 cq_size_614:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq5_size_t;

#define FLEX_SQCQ6_SIZE                          0x00000618
#define   CQ_SIZE_618_MASK                       0x0fff0000
#define   CQ_SIZE_618_SHIFT                              16
#define   SQ_SIZE_618_MASK                       0x00000fff
#define   SQ_SIZE_618_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_618:12;
        u32 rsvd_12:4;
        u32 cq_size_618:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq6_size_t;

#define FLEX_SQCQ7_SIZE                          0x0000061c
#define   CQ_SIZE_61c_MASK                       0x0fff0000
#define   CQ_SIZE_61c_SHIFT                              16
#define   SQ_SIZE_61c_MASK                       0x00000fff
#define   SQ_SIZE_61c_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_61c:12;
        u32 rsvd_12:4;
        u32 cq_size_61c:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq7_size_t;

#define FLEX_SQCQ8_SIZE                          0x00000620
#define   CQ_SIZE_620_MASK                       0x0fff0000
#define   CQ_SIZE_620_SHIFT                              16
#define   SQ_SIZE_620_MASK                       0x00000fff
#define   SQ_SIZE_620_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_620:12;
        u32 rsvd_12:4;
        u32 cq_size_620:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq8_size_t;

#define FLEX_SQCQ9_SIZE                          0x00000624
#define   CQ_SIZE_624_MASK                       0x0fff0000
#define   CQ_SIZE_624_SHIFT                              16
#define   SQ_SIZE_624_MASK                       0x00000fff
#define   SQ_SIZE_624_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_624:12;
        u32 rsvd_12:4;
        u32 cq_size_624:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq9_size_t;

#define FLEX_SQCQ10_SIZE                         0x00000628
#define   CQ_SIZE_628_MASK                       0x0fff0000
#define   CQ_SIZE_628_SHIFT                              16
#define   SQ_SIZE_628_MASK                       0x00000fff
#define   SQ_SIZE_628_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_628:12;
        u32 rsvd_12:4;
        u32 cq_size_628:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq10_size_t;

#define FLEX_SQCQ11_SIZE                         0x0000062c
#define   CQ_SIZE_62c_MASK                       0x0fff0000
#define   CQ_SIZE_62c_SHIFT                              16
#define   SQ_SIZE_62c_MASK                       0x00000fff
#define   SQ_SIZE_62c_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_62c:12;
        u32 rsvd_12:4;
        u32 cq_size_62c:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq11_size_t;

#define FLEX_SQCQ12_SIZE                         0x00000630
#define   CQ_SIZE_630_MASK                       0x0fff0000
#define   CQ_SIZE_630_SHIFT                              16
#define   SQ_SIZE_630_MASK                       0x00000fff
#define   SQ_SIZE_630_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_630:12;
        u32 rsvd_12:4;
        u32 cq_size_630:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq12_size_t;

#define FLEX_SQCQ13_SIZE                         0x00000634
#define   CQ_SIZE_634_MASK                       0x0fff0000
#define   CQ_SIZE_634_SHIFT                              16
#define   SQ_SIZE_634_MASK                       0x00000fff
#define   SQ_SIZE_634_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_634:12;
        u32 rsvd_12:4;
        u32 cq_size_634:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq13_size_t;

#define FLEX_SQCQ14_SIZE                         0x00000638
#define   CQ_SIZE_638_MASK                       0x0fff0000
#define   CQ_SIZE_638_SHIFT                              16
#define   SQ_SIZE_638_MASK                       0x00000fff
#define   SQ_SIZE_638_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_638:12;
        u32 rsvd_12:4;
        u32 cq_size_638:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq14_size_t;

#define FLEX_SQCQ15_SIZE                         0x0000063c
#define   CQ_SIZE_63c_MASK                       0x0fff0000
#define   CQ_SIZE_63c_SHIFT                              16
#define   SQ_SIZE_63c_MASK                       0x00000fff
#define   SQ_SIZE_63c_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_63c:12;
        u32 rsvd_12:4;
        u32 cq_size_63c:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq15_size_t;

#define FLEX_SQCQ16_SIZE                         0x00000640
#define   CQ_SIZE_640_MASK                       0x0fff0000
#define   CQ_SIZE_640_SHIFT                              16
#define   SQ_SIZE_640_MASK                       0x00000fff
#define   SQ_SIZE_640_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_640:12;
        u32 rsvd_12:4;
        u32 cq_size_640:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq16_size_t;

#define FLEX_SQCQ17_SIZE                         0x00000644
#define   CQ_SIZE_644_MASK                       0x0fff0000
#define   CQ_SIZE_644_SHIFT                              16
#define   SQ_SIZE_644_MASK                       0x00000fff
#define   SQ_SIZE_644_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_644:12;
        u32 rsvd_12:4;
        u32 cq_size_644:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq17_size_t;

#define FLEX_SQCQ18_SIZE                         0x00000648
#define   CQ_SIZE_648_MASK                       0x0fff0000
#define   CQ_SIZE_648_SHIFT                              16
#define   SQ_SIZE_648_MASK                       0x00000fff
#define   SQ_SIZE_648_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_648:12;
        u32 rsvd_12:4;
        u32 cq_size_648:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq18_size_t;

#define FLEX_SQCQ19_SIZE                         0x0000064c
#define   CQ_SIZE_64c_MASK                       0x0fff0000
#define   CQ_SIZE_64c_SHIFT                              16
#define   SQ_SIZE_64c_MASK                       0x00000fff
#define   SQ_SIZE_64c_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_64c:12;
        u32 rsvd_12:4;
        u32 cq_size_64c:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq19_size_t;

#define FLEX_SQCQ20_SIZE                         0x00000650
#define   CQ_SIZE_650_MASK                       0x0fff0000
#define   CQ_SIZE_650_SHIFT                              16
#define   SQ_SIZE_650_MASK                       0x00000fff
#define   SQ_SIZE_650_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_650:12;
        u32 rsvd_12:4;
        u32 cq_size_650:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq20_size_t;

#define FLEX_SQCQ21_SIZE                         0x00000654
#define   CQ_SIZE_654_MASK                       0x0fff0000
#define   CQ_SIZE_654_SHIFT                              16
#define   SQ_SIZE_654_MASK                       0x00000fff
#define   SQ_SIZE_654_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_654:12;
        u32 rsvd_12:4;
        u32 cq_size_654:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq21_size_t;

#define FLEX_SQCQ22_SIZE                         0x00000658
#define   CQ_SIZE_658_MASK                       0x0fff0000
#define   CQ_SIZE_658_SHIFT                              16
#define   SQ_SIZE_658_MASK                       0x00000fff
#define   SQ_SIZE_658_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_658:12;
        u32 rsvd_12:4;
        u32 cq_size_658:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq22_size_t;

#define FLEX_SQCQ23_SIZE                         0x0000065c
#define   CQ_SIZE_65c_MASK                       0x0fff0000
#define   CQ_SIZE_65c_SHIFT                              16
#define   SQ_SIZE_65c_MASK                       0x00000fff
#define   SQ_SIZE_65c_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_65c:12;
        u32 rsvd_12:4;
        u32 cq_size_65c:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq23_size_t;

#define FLEX_SQCQ24_SIZE                         0x00000660
#define   CQ_SIZE_660_MASK                       0x0fff0000
#define   CQ_SIZE_660_SHIFT                              16
#define   SQ_SIZE_660_MASK                       0x00000fff
#define   SQ_SIZE_660_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_660:12;
        u32 rsvd_12:4;
        u32 cq_size_660:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq24_size_t;

#define FLEX_SQCQ25_SIZE                         0x00000664
#define   CQ_SIZE_664_MASK                       0x0fff0000
#define   CQ_SIZE_664_SHIFT                              16
#define   SQ_SIZE_664_MASK                       0x00000fff
#define   SQ_SIZE_664_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_664:12;
        u32 rsvd_12:4;
        u32 cq_size_664:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq25_size_t;

#define FLEX_SQCQ26_SIZE                         0x00000668
#define   CQ_SIZE_668_MASK                       0x0fff0000
#define   CQ_SIZE_668_SHIFT                              16
#define   SQ_SIZE_668_MASK                       0x00000fff
#define   SQ_SIZE_668_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_668:12;
        u32 rsvd_12:4;
        u32 cq_size_668:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq26_size_t;

#define FLEX_SQCQ27_SIZE                         0x0000066c
#define   CQ_SIZE_66c_MASK                       0x0fff0000
#define   CQ_SIZE_66c_SHIFT                              16
#define   SQ_SIZE_66c_MASK                       0x00000fff
#define   SQ_SIZE_66c_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_66c:12;
        u32 rsvd_12:4;
        u32 cq_size_66c:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq27_size_t;

#define FLEX_SQCQ28_SIZE                         0x00000670
#define   CQ_SIZE_670_MASK                       0x0fff0000
#define   CQ_SIZE_670_SHIFT                              16
#define   SQ_SIZE_670_MASK                       0x00000fff
#define   SQ_SIZE_670_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_670:12;
        u32 rsvd_12:4;
        u32 cq_size_670:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq28_size_t;

#define FLEX_SQCQ29_SIZE                         0x00000674
#define   CQ_SIZE_674_MASK                       0x0fff0000
#define   CQ_SIZE_674_SHIFT                              16
#define   SQ_SIZE_674_MASK                       0x00000fff
#define   SQ_SIZE_674_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_674:12;
        u32 rsvd_12:4;
        u32 cq_size_674:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq29_size_t;

#define FLEX_SQCQ30_SIZE                         0x00000678
#define   CQ_SIZE_678_MASK                       0x0fff0000
#define   CQ_SIZE_678_SHIFT                              16
#define   SQ_SIZE_678_MASK                       0x00000fff
#define   SQ_SIZE_678_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_678:12;
        u32 rsvd_12:4;
        u32 cq_size_678:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq30_size_t;

#define FLEX_SQCQ31_SIZE                         0x0000067c
#define   CQ_SIZE_67c_MASK                       0x0fff0000
#define   CQ_SIZE_67c_SHIFT                              16
#define   SQ_SIZE_67c_MASK                       0x00000fff
#define   SQ_SIZE_67c_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_67c:12;
        u32 rsvd_12:4;
        u32 cq_size_67c:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq31_size_t;

#define FLEX_SQCQ32_SIZE                         0x00000680
#define   CQ_SIZE_680_MASK                       0x0fff0000
#define   CQ_SIZE_680_SHIFT                              16
#define   SQ_SIZE_680_MASK                       0x00000fff
#define   SQ_SIZE_680_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_680:12;
        u32 rsvd_12:4;
        u32 cq_size_680:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq32_size_t;

#define FLEX_SQCQ33_SIZE                         0x00000684
#define   CQ_SIZE_684_MASK                       0x0fff0000
#define   CQ_SIZE_684_SHIFT                              16
#define   SQ_SIZE_684_MASK                       0x00000fff
#define   SQ_SIZE_684_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_684:12;
        u32 rsvd_12:4;
        u32 cq_size_684:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq33_size_t;

#define FLEX_SQCQ34_SIZE                         0x00000688
#define   CQ_SIZE_688_MASK                       0x0fff0000
#define   CQ_SIZE_688_SHIFT                              16
#define   SQ_SIZE_688_MASK                       0x00000fff
#define   SQ_SIZE_688_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_688:12;
        u32 rsvd_12:4;
        u32 cq_size_688:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq34_size_t;

#define FLEX_SQCQ35_SIZE                         0x0000068c
#define   CQ_SIZE_68c_MASK                       0x0fff0000
#define   CQ_SIZE_68c_SHIFT                              16
#define   SQ_SIZE_68c_MASK                       0x00000fff
#define   SQ_SIZE_68c_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_68c:12;
        u32 rsvd_12:4;
        u32 cq_size_68c:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq35_size_t;

#define FLEX_SQCQ36_SIZE                         0x00000690
#define   CQ_SIZE_690_MASK                       0x0fff0000
#define   CQ_SIZE_690_SHIFT                              16
#define   SQ_SIZE_690_MASK                       0x00000fff
#define   SQ_SIZE_690_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_690:12;
        u32 rsvd_12:4;
        u32 cq_size_690:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq36_size_t;

#define FLEX_SQCQ37_SIZE                         0x00000694
#define   CQ_SIZE_694_MASK                       0x0fff0000
#define   CQ_SIZE_694_SHIFT                              16
#define   SQ_SIZE_694_MASK                       0x00000fff
#define   SQ_SIZE_694_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_694:12;
        u32 rsvd_12:4;
        u32 cq_size_694:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq37_size_t;

#define FLEX_SQCQ38_SIZE                         0x00000698
#define   CQ_SIZE_698_MASK                       0x0fff0000
#define   CQ_SIZE_698_SHIFT                              16
#define   SQ_SIZE_698_MASK                       0x00000fff
#define   SQ_SIZE_698_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_698:12;
        u32 rsvd_12:4;
        u32 cq_size_698:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq38_size_t;

#define FLEX_SQCQ39_SIZE                         0x0000069c
#define   CQ_SIZE_69c_MASK                       0x0fff0000
#define   CQ_SIZE_69c_SHIFT                              16
#define   SQ_SIZE_69c_MASK                       0x00000fff
#define   SQ_SIZE_69c_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_69c:12;
        u32 rsvd_12:4;
        u32 cq_size_69c:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq39_size_t;

#define FLEX_SQCQ40_SIZE                         0x000006a0
#define   CQ_SIZE_6a0_MASK                       0x0fff0000
#define   CQ_SIZE_6a0_SHIFT                              16
#define   SQ_SIZE_6a0_MASK                       0x00000fff
#define   SQ_SIZE_6a0_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6a0:12;
        u32 rsvd_12:4;
        u32 cq_size_6a0:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq40_size_t;

#define FLEX_SQCQ41_SIZE                         0x000006a4
#define   CQ_SIZE_6a4_MASK                       0x0fff0000
#define   CQ_SIZE_6a4_SHIFT                              16
#define   SQ_SIZE_6a4_MASK                       0x00000fff
#define   SQ_SIZE_6a4_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6a4:12;
        u32 rsvd_12:4;
        u32 cq_size_6a4:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq41_size_t;

#define FLEX_SQCQ42_SIZE                         0x000006a8
#define   CQ_SIZE_6a8_MASK                       0x0fff0000
#define   CQ_SIZE_6a8_SHIFT                              16
#define   SQ_SIZE_6a8_MASK                       0x00000fff
#define   SQ_SIZE_6a8_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6a8:12;
        u32 rsvd_12:4;
        u32 cq_size_6a8:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq42_size_t;

#define FLEX_SQCQ43_SIZE                         0x000006ac
#define   CQ_SIZE_6ac_MASK                       0x0fff0000
#define   CQ_SIZE_6ac_SHIFT                              16
#define   SQ_SIZE_6ac_MASK                       0x00000fff
#define   SQ_SIZE_6ac_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6ac:12;
        u32 rsvd_12:4;
        u32 cq_size_6ac:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq43_size_t;

#define FLEX_SQCQ44_SIZE                         0x000006b0
#define   CQ_SIZE_6b0_MASK                       0x0fff0000
#define   CQ_SIZE_6b0_SHIFT                              16
#define   SQ_SIZE_6b0_MASK                       0x00000fff
#define   SQ_SIZE_6b0_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6b0:12;
        u32 rsvd_12:4;
        u32 cq_size_6b0:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq44_size_t;

#define FLEX_SQCQ45_SIZE                         0x000006b4
#define   CQ_SIZE_6b4_MASK                       0x0fff0000
#define   CQ_SIZE_6b4_SHIFT                              16
#define   SQ_SIZE_6b4_MASK                       0x00000fff
#define   SQ_SIZE_6b4_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6b4:12;
        u32 rsvd_12:4;
        u32 cq_size_6b4:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq45_size_t;

#define FLEX_SQCQ46_SIZE                         0x000006b8
#define   CQ_SIZE_6b8_MASK                       0x0fff0000
#define   CQ_SIZE_6b8_SHIFT                              16
#define   SQ_SIZE_6b8_MASK                       0x00000fff
#define   SQ_SIZE_6b8_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6b8:12;
        u32 rsvd_12:4;
        u32 cq_size_6b8:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq46_size_t;

#define FLEX_SQCQ47_SIZE                         0x000006bc
#define   CQ_SIZE_6bc_MASK                       0x0fff0000
#define   CQ_SIZE_6bc_SHIFT                              16
#define   SQ_SIZE_6bc_MASK                       0x00000fff
#define   SQ_SIZE_6bc_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6bc:12;
        u32 rsvd_12:4;
        u32 cq_size_6bc:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq47_size_t;

#define FLEX_SQCQ48_SIZE                         0x000006c0
#define   CQ_SIZE_6c0_MASK                       0x0fff0000
#define   CQ_SIZE_6c0_SHIFT                              16
#define   SQ_SIZE_6c0_MASK                       0x00000fff
#define   SQ_SIZE_6c0_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6c0:12;
        u32 rsvd_12:4;
        u32 cq_size_6c0:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq48_size_t;

#define FLEX_SQCQ49_SIZE                         0x000006c4
#define   CQ_SIZE_6c4_MASK                       0x0fff0000
#define   CQ_SIZE_6c4_SHIFT                              16
#define   SQ_SIZE_6c4_MASK                       0x00000fff
#define   SQ_SIZE_6c4_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6c4:12;
        u32 rsvd_12:4;
        u32 cq_size_6c4:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq49_size_t;

#define FLEX_SQCQ50_SIZE                         0x000006c8
#define   CQ_SIZE_6c8_MASK                       0x0fff0000
#define   CQ_SIZE_6c8_SHIFT                              16
#define   SQ_SIZE_6c8_MASK                       0x00000fff
#define   SQ_SIZE_6c8_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6c8:12;
        u32 rsvd_12:4;
        u32 cq_size_6c8:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq50_size_t;

#define FLEX_SQCQ51_SIZE                         0x000006cc
#define   CQ_SIZE_6cc_MASK                       0x0fff0000
#define   CQ_SIZE_6cc_SHIFT                              16
#define   SQ_SIZE_6cc_MASK                       0x00000fff
#define   SQ_SIZE_6cc_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6cc:12;
        u32 rsvd_12:4;
        u32 cq_size_6cc:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq51_size_t;

#define FLEX_SQCQ52_SIZE                         0x000006d0
#define   CQ_SIZE_6d0_MASK                       0x0fff0000
#define   CQ_SIZE_6d0_SHIFT                              16
#define   SQ_SIZE_6d0_MASK                       0x00000fff
#define   SQ_SIZE_6d0_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6d0:12;
        u32 rsvd_12:4;
        u32 cq_size_6d0:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq52_size_t;

#define FLEX_SQCQ53_SIZE                         0x000006d4
#define   CQ_SIZE_6d4_MASK                       0x0fff0000
#define   CQ_SIZE_6d4_SHIFT                              16
#define   SQ_SIZE_6d4_MASK                       0x00000fff
#define   SQ_SIZE_6d4_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6d4:12;
        u32 rsvd_12:4;
        u32 cq_size_6d4:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq53_size_t;

#define FLEX_SQCQ54_SIZE                         0x000006d8
#define   CQ_SIZE_6d8_MASK                       0x0fff0000
#define   CQ_SIZE_6d8_SHIFT                              16
#define   SQ_SIZE_6d8_MASK                       0x00000fff
#define   SQ_SIZE_6d8_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6d8:12;
        u32 rsvd_12:4;
        u32 cq_size_6d8:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq54_size_t;

#define FLEX_SQCQ55_SIZE                         0x000006dc
#define   CQ_SIZE_6dc_MASK                       0x0fff0000
#define   CQ_SIZE_6dc_SHIFT                              16
#define   SQ_SIZE_6dc_MASK                       0x00000fff
#define   SQ_SIZE_6dc_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6dc:12;
        u32 rsvd_12:4;
        u32 cq_size_6dc:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq55_size_t;

#define FLEX_SQCQ56_SIZE                         0x000006e0
#define   CQ_SIZE_6e0_MASK                       0x0fff0000
#define   CQ_SIZE_6e0_SHIFT                              16
#define   SQ_SIZE_6e0_MASK                       0x00000fff
#define   SQ_SIZE_6e0_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6e0:12;
        u32 rsvd_12:4;
        u32 cq_size_6e0:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq56_size_t;

#define FLEX_SQCQ57_SIZE                         0x000006e4
#define   CQ_SIZE_6e4_MASK                       0x0fff0000
#define   CQ_SIZE_6e4_SHIFT                              16
#define   SQ_SIZE_6e4_MASK                       0x00000fff
#define   SQ_SIZE_6e4_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6e4:12;
        u32 rsvd_12:4;
        u32 cq_size_6e4:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq57_size_t;

#define FLEX_SQCQ58_SIZE                         0x000006e8
#define   CQ_SIZE_6e8_MASK                       0x0fff0000
#define   CQ_SIZE_6e8_SHIFT                              16
#define   SQ_SIZE_6e8_MASK                       0x00000fff
#define   SQ_SIZE_6e8_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6e8:12;
        u32 rsvd_12:4;
        u32 cq_size_6e8:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq58_size_t;

#define FLEX_SQCQ59_SIZE                         0x000006ec
#define   CQ_SIZE_6ec_MASK                       0x0fff0000
#define   CQ_SIZE_6ec_SHIFT                              16
#define   SQ_SIZE_6ec_MASK                       0x00000fff
#define   SQ_SIZE_6ec_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6ec:12;
        u32 rsvd_12:4;
        u32 cq_size_6ec:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq59_size_t;

#define FLEX_SQCQ60_SIZE                         0x000006f0
#define   CQ_SIZE_6f0_MASK                       0x0fff0000
#define   CQ_SIZE_6f0_SHIFT                              16
#define   SQ_SIZE_6f0_MASK                       0x00000fff
#define   SQ_SIZE_6f0_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6f0:12;
        u32 rsvd_12:4;
        u32 cq_size_6f0:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq60_size_t;

#define FLEX_SQCQ61_SIZE                         0x000006f4
#define   CQ_SIZE_6f4_MASK                       0x0fff0000
#define   CQ_SIZE_6f4_SHIFT                              16
#define   SQ_SIZE_6f4_MASK                       0x00000fff
#define   SQ_SIZE_6f4_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6f4:12;
        u32 rsvd_12:4;
        u32 cq_size_6f4:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq61_size_t;

#define FLEX_SQCQ62_SIZE                         0x000006f8
#define   CQ_SIZE_6f8_MASK                       0x0fff0000
#define   CQ_SIZE_6f8_SHIFT                              16
#define   SQ_SIZE_6f8_MASK                       0x00000fff
#define   SQ_SIZE_6f8_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6f8:12;
        u32 rsvd_12:4;
        u32 cq_size_6f8:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq62_size_t;

#define FLEX_SQCQ63_SIZE                         0x000006fc
#define   CQ_SIZE_6fc_MASK                       0x0fff0000
#define   CQ_SIZE_6fc_SHIFT                              16
#define   SQ_SIZE_6fc_MASK                       0x00000fff
#define   SQ_SIZE_6fc_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_6fc:12;
        u32 rsvd_12:4;
        u32 cq_size_6fc:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq63_size_t;

#define FLEX_SQCQ64_SIZE                         0x00000700
#define   CQ_SIZE_700_MASK                       0x0fff0000
#define   CQ_SIZE_700_SHIFT                              16
#define   SQ_SIZE_700_MASK                       0x00000fff
#define   SQ_SIZE_700_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_size_700:12;
        u32 rsvd_12:4;
        u32 cq_size_700:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq64_size_t;

#define FLEX_SQCQ65_SIZE                         0x00000704
#define   CQ_SIZE_704_MASK                       0x0fff0000
#define   CQ_SIZE_704_SHIFT                              16
#define   SQ_SIZE_704_MASK                       0x00000fff
#define   SQ_SIZE_704_SHIFT                               0
typedef union {
    u32 all;
    struct {
        u32 sq_size_704:12;
        u32 rsvd_12:4;
        u32 cq_size_704:12;
        u32 rsvd_28:4;
    } b;
} flex_sqcq65_size_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ flex_sq0_db_reg_t flex_sq0_db_reg;
    /* 0x0004 */ flex_sq1_db_reg_t flex_sq1_db_reg;
    /* 0x0008 */ flex_sq2_db_reg_t flex_sq2_db_reg;
    /* 0x000c */ flex_sq3_db_reg_t flex_sq3_db_reg;
    /* 0x0010 */ flex_sq4_db_reg_t flex_sq4_db_reg;
    /* 0x0014 */ flex_sq5_db_reg_t flex_sq5_db_reg;
    /* 0x0018 */ flex_sq6_db_reg_t flex_sq6_db_reg;
    /* 0x001c */ flex_sq7_db_reg_t flex_sq7_db_reg;
    /* 0x0020 */ flex_sq8_db_reg_t flex_sq8_db_reg;
    /* 0x0024 */ flex_sq9_db_reg_t flex_sq9_db_reg;
    /* 0x0028 */ flex_sq10_db_reg_t flex_sq10_db_reg;
    /* 0x002c */ flex_sq11_db_reg_t flex_sq11_db_reg;
    /* 0x0030 */ flex_sq12_db_reg_t flex_sq12_db_reg;
    /* 0x0034 */ flex_sq13_db_reg_t flex_sq13_db_reg;
    /* 0x0038 */ flex_sq14_db_reg_t flex_sq14_db_reg;
    /* 0x003c */ flex_sq15_db_reg_t flex_sq15_db_reg;
    /* 0x0040 */ flex_sq16_db_reg_t flex_sq16_db_reg;
    /* 0x0044 */ flex_sq17_db_reg_t flex_sq17_db_reg;
    /* 0x0048 */ flex_sq18_db_reg_t flex_sq18_db_reg;
    /* 0x004c */ flex_sq19_db_reg_t flex_sq19_db_reg;
    /* 0x0050 */ flex_sq20_db_reg_t flex_sq20_db_reg;
    /* 0x0054 */ flex_sq21_db_reg_t flex_sq21_db_reg;
    /* 0x0058 */ flex_sq22_db_reg_t flex_sq22_db_reg;
    /* 0x005c */ flex_sq23_db_reg_t flex_sq23_db_reg;
    /* 0x0060 */ flex_sq24_db_reg_t flex_sq24_db_reg;
    /* 0x0064 */ flex_sq25_db_reg_t flex_sq25_db_reg;
    /* 0x0068 */ flex_sq26_db_reg_t flex_sq26_db_reg;
    /* 0x006c */ flex_sq27_db_reg_t flex_sq27_db_reg;
    /* 0x0070 */ flex_sq28_db_reg_t flex_sq28_db_reg;
    /* 0x0074 */ flex_sq29_db_reg_t flex_sq29_db_reg;
    /* 0x0078 */ flex_sq30_db_reg_t flex_sq30_db_reg;
    /* 0x007c */ flex_sq31_db_reg_t flex_sq31_db_reg;
    /* 0x0080 */ flex_sq32_db_reg_t flex_sq32_db_reg;
    /* 0x0084 */ flex_sq33_db_reg_t flex_sq33_db_reg;
    /* 0x0088 */ flex_sq34_db_reg_t flex_sq34_db_reg;
    /* 0x008c */ flex_sq35_db_reg_t flex_sq35_db_reg;
    /* 0x0090 */ flex_sq36_db_reg_t flex_sq36_db_reg;
    /* 0x0094 */ flex_sq37_db_reg_t flex_sq37_db_reg;
    /* 0x0098 */ flex_sq38_db_reg_t flex_sq38_db_reg;
    /* 0x009c */ flex_sq39_db_reg_t flex_sq39_db_reg;
    /* 0x00a0 */ flex_sq40_db_reg_t flex_sq40_db_reg;
    /* 0x00a4 */ flex_sq41_db_reg_t flex_sq41_db_reg;
    /* 0x00a8 */ flex_sq42_db_reg_t flex_sq42_db_reg;
    /* 0x00ac */ flex_sq43_db_reg_t flex_sq43_db_reg;
    /* 0x00b0 */ flex_sq44_db_reg_t flex_sq44_db_reg;
    /* 0x00b4 */ flex_sq45_db_reg_t flex_sq45_db_reg;
    /* 0x00b8 */ flex_sq46_db_reg_t flex_sq46_db_reg;
    /* 0x00bc */ flex_sq47_db_reg_t flex_sq47_db_reg;
    /* 0x00c0 */ flex_sq48_db_reg_t flex_sq48_db_reg;
    /* 0x00c4 */ flex_sq49_db_reg_t flex_sq49_db_reg;
    /* 0x00c8 */ flex_sq50_db_reg_t flex_sq50_db_reg;
    /* 0x00cc */ flex_sq51_db_reg_t flex_sq51_db_reg;
    /* 0x00d0 */ flex_sq52_db_reg_t flex_sq52_db_reg;
    /* 0x00d4 */ flex_sq53_db_reg_t flex_sq53_db_reg;
    /* 0x00d8 */ flex_sq54_db_reg_t flex_sq54_db_reg;
    /* 0x00dc */ flex_sq55_db_reg_t flex_sq55_db_reg;
    /* 0x00e0 */ flex_sq56_db_reg_t flex_sq56_db_reg;
    /* 0x00e4 */ flex_sq57_db_reg_t flex_sq57_db_reg;
    /* 0x00e8 */ flex_sq58_db_reg_t flex_sq58_db_reg;
    /* 0x00ec */ flex_sq59_db_reg_t flex_sq59_db_reg;
    /* 0x00f0 */ flex_sq60_db_reg_t flex_sq60_db_reg;
    /* 0x00f4 */ flex_sq61_db_reg_t flex_sq61_db_reg;
    /* 0x00f8 */ flex_sq62_db_reg_t flex_sq62_db_reg;
    /* 0x00fc */ flex_sq63_db_reg_t flex_sq63_db_reg;
    /* 0x0100 */ flex_sq64_db_reg_t flex_sq64_db_reg;
    /* 0x0104 */ flex_sq65_db_reg_t flex_sq65_db_reg;
    /* 0x0108 */ u32 rsvd_108 [126];
    /* 0x0300 */ flex_cq0_db_reg_t flex_cq0_db_reg;
    /* 0x0304 */ flex_cq1_db_reg_t flex_cq1_db_reg;
    /* 0x0308 */ flex_cq2_db_reg_t flex_cq2_db_reg;
    /* 0x030c */ flex_cq3_db_reg_t flex_cq3_db_reg;
    /* 0x0310 */ flex_cq4_db_reg_t flex_cq4_db_reg;
    /* 0x0314 */ flex_cq5_db_reg_t flex_cq5_db_reg;
    /* 0x0318 */ flex_cq6_db_reg_t flex_cq6_db_reg;
    /* 0x031c */ flex_cq7_db_reg_t flex_cq7_db_reg;
    /* 0x0320 */ flex_cq8_db_reg_t flex_cq8_db_reg;
    /* 0x0324 */ flex_cq9_db_reg_t flex_cq9_db_reg;
    /* 0x0328 */ flex_cq10_db_reg_t flex_cq10_db_reg;
    /* 0x032c */ flex_cq11_db_reg_t flex_cq11_db_reg;
    /* 0x0330 */ flex_cq12_db_reg_t flex_cq12_db_reg;
    /* 0x0334 */ flex_cq13_db_reg_t flex_cq13_db_reg;
    /* 0x0338 */ flex_cq14_db_reg_t flex_cq14_db_reg;
    /* 0x033c */ flex_cq15_db_reg_t flex_cq15_db_reg;
    /* 0x0340 */ flex_cq16_db_reg_t flex_cq16_db_reg;
    /* 0x0344 */ flex_cq17_db_reg_t flex_cq17_db_reg;
    /* 0x0348 */ flex_cq18_db_reg_t flex_cq18_db_reg;
    /* 0x034c */ flex_cq19_db_reg_t flex_cq19_db_reg;
    /* 0x0350 */ flex_cq20_db_reg_t flex_cq20_db_reg;
    /* 0x0354 */ flex_cq21_db_reg_t flex_cq21_db_reg;
    /* 0x0358 */ flex_cq22_db_reg_t flex_cq22_db_reg;
    /* 0x035c */ flex_cq23_db_reg_t flex_cq23_db_reg;
    /* 0x0360 */ flex_cq24_db_reg_t flex_cq24_db_reg;
    /* 0x0364 */ flex_cq25_db_reg_t flex_cq25_db_reg;
    /* 0x0368 */ flex_cq26_db_reg_t flex_cq26_db_reg;
    /* 0x036c */ flex_cq27_db_reg_t flex_cq27_db_reg;
    /* 0x0370 */ flex_cq28_db_reg_t flex_cq28_db_reg;
    /* 0x0374 */ flex_cq29_db_reg_t flex_cq29_db_reg;
    /* 0x0378 */ flex_cq30_db_reg_t flex_cq30_db_reg;
    /* 0x037c */ flex_cq31_db_reg_t flex_cq31_db_reg;
    /* 0x0380 */ flex_cq32_db_reg_t flex_cq32_db_reg;
    /* 0x0384 */ flex_cq33_db_reg_t flex_cq33_db_reg;
    /* 0x0388 */ flex_cq34_db_reg_t flex_cq34_db_reg;
    /* 0x038c */ flex_cq35_db_reg_t flex_cq35_db_reg;
    /* 0x0390 */ flex_cq36_db_reg_t flex_cq36_db_reg;
    /* 0x0394 */ flex_cq37_db_reg_t flex_cq37_db_reg;
    /* 0x0398 */ flex_cq38_db_reg_t flex_cq38_db_reg;
    /* 0x039c */ flex_cq39_db_reg_t flex_cq39_db_reg;
    /* 0x03a0 */ flex_cq40_db_reg_t flex_cq40_db_reg;
    /* 0x03a4 */ flex_cq41_db_reg_t flex_cq41_db_reg;
    /* 0x03a8 */ flex_cq42_db_reg_t flex_cq42_db_reg;
    /* 0x03ac */ flex_cq43_db_reg_t flex_cq43_db_reg;
    /* 0x03b0 */ flex_cq44_db_reg_t flex_cq44_db_reg;
    /* 0x03b4 */ flex_cq45_db_reg_t flex_cq45_db_reg;
    /* 0x03b8 */ flex_cq46_db_reg_t flex_cq46_db_reg;
    /* 0x03bc */ flex_cq47_db_reg_t flex_cq47_db_reg;
    /* 0x03c0 */ flex_cq48_db_reg_t flex_cq48_db_reg;
    /* 0x03c4 */ flex_cq49_db_reg_t flex_cq49_db_reg;
    /* 0x03c8 */ flex_cq50_db_reg_t flex_cq50_db_reg;
    /* 0x03cc */ flex_cq51_db_reg_t flex_cq51_db_reg;
    /* 0x03d0 */ flex_cq52_db_reg_t flex_cq52_db_reg;
    /* 0x03d4 */ flex_cq53_db_reg_t flex_cq53_db_reg;
    /* 0x03d8 */ flex_cq54_db_reg_t flex_cq54_db_reg;
    /* 0x03dc */ flex_cq55_db_reg_t flex_cq55_db_reg;
    /* 0x03e0 */ flex_cq56_db_reg_t flex_cq56_db_reg;
    /* 0x03e4 */ flex_cq57_db_reg_t flex_cq57_db_reg;
    /* 0x03e8 */ flex_cq58_db_reg_t flex_cq58_db_reg;
    /* 0x03ec */ flex_cq59_db_reg_t flex_cq59_db_reg;
    /* 0x03f0 */ flex_cq60_db_reg_t flex_cq60_db_reg;
    /* 0x03f4 */ flex_cq61_db_reg_t flex_cq61_db_reg;
    /* 0x03f8 */ flex_cq62_db_reg_t flex_cq62_db_reg;
    /* 0x03fc */ flex_cq63_db_reg_t flex_cq63_db_reg;
    /* 0x0400 */ flex_cq64_db_reg_t flex_cq64_db_reg;
    /* 0x0404 */ flex_cq65_db_reg_t flex_cq65_db_reg;
    /* 0x0408 */ u32 rsvd_408 [126];
    /* 0x0600 */ flex_sqcq0_size_t flex_sqcq0_size;
    /* 0x0604 */ flex_sqcq1_size_t flex_sqcq1_size;
    /* 0x0608 */ flex_sqcq2_size_t flex_sqcq2_size;
    /* 0x060c */ flex_sqcq3_size_t flex_sqcq3_size;
    /* 0x0610 */ flex_sqcq4_size_t flex_sqcq4_size;
    /* 0x0614 */ flex_sqcq5_size_t flex_sqcq5_size;
    /* 0x0618 */ flex_sqcq6_size_t flex_sqcq6_size;
    /* 0x061c */ flex_sqcq7_size_t flex_sqcq7_size;
    /* 0x0620 */ flex_sqcq8_size_t flex_sqcq8_size;
    /* 0x0624 */ flex_sqcq9_size_t flex_sqcq9_size;
    /* 0x0628 */ flex_sqcq10_size_t flex_sqcq10_size;
    /* 0x062c */ flex_sqcq11_size_t flex_sqcq11_size;
    /* 0x0630 */ flex_sqcq12_size_t flex_sqcq12_size;
    /* 0x0634 */ flex_sqcq13_size_t flex_sqcq13_size;
    /* 0x0638 */ flex_sqcq14_size_t flex_sqcq14_size;
    /* 0x063c */ flex_sqcq15_size_t flex_sqcq15_size;
    /* 0x0640 */ flex_sqcq16_size_t flex_sqcq16_size;
    /* 0x0644 */ flex_sqcq17_size_t flex_sqcq17_size;
    /* 0x0648 */ flex_sqcq18_size_t flex_sqcq18_size;
    /* 0x064c */ flex_sqcq19_size_t flex_sqcq19_size;
    /* 0x0650 */ flex_sqcq20_size_t flex_sqcq20_size;
    /* 0x0654 */ flex_sqcq21_size_t flex_sqcq21_size;
    /* 0x0658 */ flex_sqcq22_size_t flex_sqcq22_size;
    /* 0x065c */ flex_sqcq23_size_t flex_sqcq23_size;
    /* 0x0660 */ flex_sqcq24_size_t flex_sqcq24_size;
    /* 0x0664 */ flex_sqcq25_size_t flex_sqcq25_size;
    /* 0x0668 */ flex_sqcq26_size_t flex_sqcq26_size;
    /* 0x066c */ flex_sqcq27_size_t flex_sqcq27_size;
    /* 0x0670 */ flex_sqcq28_size_t flex_sqcq28_size;
    /* 0x0674 */ flex_sqcq29_size_t flex_sqcq29_size;
    /* 0x0678 */ flex_sqcq30_size_t flex_sqcq30_size;
    /* 0x067c */ flex_sqcq31_size_t flex_sqcq31_size;
    /* 0x0680 */ flex_sqcq32_size_t flex_sqcq32_size;
    /* 0x0684 */ flex_sqcq33_size_t flex_sqcq33_size;
    /* 0x0688 */ flex_sqcq34_size_t flex_sqcq34_size;
    /* 0x068c */ flex_sqcq35_size_t flex_sqcq35_size;
    /* 0x0690 */ flex_sqcq36_size_t flex_sqcq36_size;
    /* 0x0694 */ flex_sqcq37_size_t flex_sqcq37_size;
    /* 0x0698 */ flex_sqcq38_size_t flex_sqcq38_size;
    /* 0x069c */ flex_sqcq39_size_t flex_sqcq39_size;
    /* 0x06a0 */ flex_sqcq40_size_t flex_sqcq40_size;
    /* 0x06a4 */ flex_sqcq41_size_t flex_sqcq41_size;
    /* 0x06a8 */ flex_sqcq42_size_t flex_sqcq42_size;
    /* 0x06ac */ flex_sqcq43_size_t flex_sqcq43_size;
    /* 0x06b0 */ flex_sqcq44_size_t flex_sqcq44_size;
    /* 0x06b4 */ flex_sqcq45_size_t flex_sqcq45_size;
    /* 0x06b8 */ flex_sqcq46_size_t flex_sqcq46_size;
    /* 0x06bc */ flex_sqcq47_size_t flex_sqcq47_size;
    /* 0x06c0 */ flex_sqcq48_size_t flex_sqcq48_size;
    /* 0x06c4 */ flex_sqcq49_size_t flex_sqcq49_size;
    /* 0x06c8 */ flex_sqcq50_size_t flex_sqcq50_size;
    /* 0x06cc */ flex_sqcq51_size_t flex_sqcq51_size;
    /* 0x06d0 */ flex_sqcq52_size_t flex_sqcq52_size;
    /* 0x06d4 */ flex_sqcq53_size_t flex_sqcq53_size;
    /* 0x06d8 */ flex_sqcq54_size_t flex_sqcq54_size;
    /* 0x06dc */ flex_sqcq55_size_t flex_sqcq55_size;
    /* 0x06e0 */ flex_sqcq56_size_t flex_sqcq56_size;
    /* 0x06e4 */ flex_sqcq57_size_t flex_sqcq57_size;
    /* 0x06e8 */ flex_sqcq58_size_t flex_sqcq58_size;
    /* 0x06ec */ flex_sqcq59_size_t flex_sqcq59_size;
    /* 0x06f0 */ flex_sqcq60_size_t flex_sqcq60_size;
    /* 0x06f4 */ flex_sqcq61_size_t flex_sqcq61_size;
    /* 0x06f8 */ flex_sqcq62_size_t flex_sqcq62_size;
    /* 0x06fc */ flex_sqcq63_size_t flex_sqcq63_size;
    /* 0x0700 */ flex_sqcq64_size_t flex_sqcq64_size;
    /* 0x0704 */ flex_sqcq65_size_t flex_sqcq65_size;
} flex_dbl_regs_t;


#endif /* rev 0 */