//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _PF_REG_H_
#define _PF_REG_H_

#define CONTROLLER_CAP_LOW                       0x00000000
#define   CAP_TO_MASK                            0xff000000
#define   CAP_TO_SHIFT                                   24
#define   CAP_AMS_MASK                           0x00060000
#define   CAP_AMS_SHIFT                                  17
#define   CAP_CQR_MASK                           0x00010000
#define   CAP_CQR_SHIFT                                  16
#define   CAP_MQES_MASK                          0x0000ffff
#define   CAP_MQES_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 cap_mqes:16;
        u32 cap_cqr:1;
        u32 cap_ams:2;
        u32 rsvd_19:5;
        u32 cap_to:8;
    } b;
} controller_cap_low_t;

#define CONTROLLER_CAP_HIGH                      0x00000004
#define   CAP_MPSMAX_MASK                        0x00f00000
#define   CAP_MPSMAX_SHIFT                               20
#define   CAP_MPSMIN_MASK                        0x000f0000
#define   CAP_MPSMIN_SHIFT                               16
#define   CAP_BPS_MASK                           0x00002000
#define   CAP_BPS_SHIFT                                  13
#define   CAP_CSS_MASK                           0x00001fe0
#define   CAP_CSS_SHIFT                                   5
#define   CAP_NSSRS_MASK                         0x00000010
#define   CAP_NSSRS_SHIFT                                 4
#define   CAP_DSTRD_MASK                         0x0000000f
#define   CAP_DSTRD_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cap_dstrd:4;
        u32 cap_nssrs:1;
        u32 cap_css:8;
        u32 cap_bps:1;
        u32 rsvd_14:2;
        u32 cap_mpsmin:4;
        u32 cap_mpsmax:4;
        u32 rsvd_24:8;
    } b;
} controller_cap_high_t;

#define NVME_VERSION                             0x00000008
#define   VS_MJR_MASK                            0xffff0000
#define   VS_MJR_SHIFT                                   16
#define   VS_MNR_MASK                            0x0000ff00
#define   VS_MNR_SHIFT                                    8
#define   VS_TER_MASK                            0x000000ff
#define   VS_TER_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 vs_ter:8;
        u32 vs_mnr:8;
        u32 vs_mjr:16;
    } b;
} nvme_version_t;

#define INT_MASK_SET                             0x0000000c
#define   IVMS_MASK                              0xffffffff
#define   IVMS_SHIFT                                      0

typedef union {
    u32 all;
    struct {
        u32 ivms:32;
    } b;
} int_mask_set_t;

#define INT_MASK_CLEAR                           0x00000010
#define   IVMC_MASK                              0xffffffff
#define   IVMC_SHIFT                                      0

typedef union {
    u32 all;
    struct {
        u32 ivmc:32;
    } b;
} int_mask_clear_t;

#define CONTROLLER_CONFG                         0x00000014
#define   CC_IOCQES_MASK                         0x00f00000
#define   CC_IOCQES_SHIFT                                20
#define   CC_IOSQES_MASK                         0x000f0000
#define   CC_IOSQES_SHIFT                                16
#define   CC_SHN_MASK                            0x0000c000
#define   CC_SHN_SHIFT                                   14
#define   CC_AMS_MASK                            0x00003800
#define   CC_AMS_SHIFT                                   11
#define   CC_MPS_MASK                            0x00000780
#define   CC_MPS_SHIFT                                    7
#define   CC_CSS_MASK                            0x00000070
#define   CC_CSS_SHIFT                                    4
#define   CC_EN_MASK                             0x00000001
#define   CC_EN_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 cc_en:1;
        u32 rsvd_1:3;
        u32 cc_css:3;
        u32 cc_mps:4;
        u32 cc_ams:3;
        u32 cc_shn:2;
        u32 cc_iosqes:4;
        u32 cc_iocqes:4;
        u32 rsvd_24:8;
    } b;
} controller_confg_t;

#define CONTROLLER_STATUS                        0x0000001c
#define   CSTS_PP_MASK                           0x00000020
#define   CSTS_PP_SHIFT                                   5
#define   CSTS_NSSRO_MASK                        0x00000010
#define   CSTS_NSSRO_SHIFT                                4
#define   CSTS_SHST_MASK                         0x0000000c
#define   CSTS_SHST_SHIFT                                 2
#define   CSTS_CFS_MASK                          0x00000002
#define   CSTS_CFS_SHIFT                                  1
#define   CSTS_RDY_MASK                          0x00000001
#define   CSTS_RDY_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 csts_rdy:1;
        u32 csts_cfs:1;
        u32 csts_shst:2;
        u32 csts_nssro:1;
        u32 csts_pp:1;
        u32 rsvd_6:26;
    } b;
} controller_status_t;

#define NVM_SUBSYS_RESET                         0x00000020
#define   NSSRC_MASK                             0xffffffff
#define   NSSRC_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 nssrc:32;
    } b;
} nvm_subsys_reset_t;

#define ADM_QUEUE_ATTRI                          0x00000024
#define   AQA_ACQS_MASK                          0x0fff0000
#define   AQA_ACQS_SHIFT                                 16
#define   AQA_ASQS_MASK                          0x00000fff
#define   AQA_ASQS_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 aqa_asqs:12;
        u32 rsvd_12:4;
        u32 aqa_acqs:12;
        u32 rsvd_28:4;
    } b;
} adm_queue_attri_t;

#define ADMIN_SQ_BASE_ADDR_L                     0x00000028
#define   ASQ_ASQB_L_MASK                        0xfffff000
#define   ASQ_ASQB_L_SHIFT                               12

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:12;
        u32 asq_asqb_l:20;
    } b;
} admin_sq_base_addr_l_t;

#define ADMIN_SQ_BASE_ADDR_H                     0x0000002c
#define   ASQ_ASQB_H_MASK                        0xffffffff
#define   ASQ_ASQB_H_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 asq_asqb_h:32;
    } b;
} admin_sq_base_addr_h_t;

#define ADMIN_CQ_BASE_ADDR_L                     0x00000030
#define   ACQ_ACQB_L_MASK                        0xfffff000
#define   ACQ_ACQB_L_SHIFT                               12

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:12;
        u32 acq_acqb_l:20;
    } b;
} admin_cq_base_addr_l_t;

#define ADMIN_CQ_BASE_ADDR_H                     0x00000034
#define   ACQ_ACQB_H_MASK                        0xffffffff
#define   ACQ_ACQB_H_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 acq_acqb_h:32;
    } b;
} admin_cq_base_addr_h_t;

#define BOOT_PART_INFO                           0x00000040
#define   BPINFO_ABPID_MASK                      0x80000000
#define   BPINFO_ABPID_SHIFT                             31
#define   BPINFO_BRS_MASK                        0x03000000
#define   BPINFO_BRS_SHIFT                               24
#define   BPINFO_BPSZ_MASK                       0x00007fff
#define   BPINFO_BPSZ_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 bpinfo_bpsz:15;
        u32 rsvd_15:9;
        u32 bpinfo_brs:2;
        u32 rsvd_26:5;
        u32 bpinfo_abpid:1;
    } b;
} boot_part_info_t;

#define BOOT_PART_READ_SEL                       0x00000044
#define   BPRSEL_BPID_MASK                       0x80000000
#define   BPRSEL_BPID_SHIFT                              31
#define   BPRSEL_BPROF_MASK                      0x3ffffc00
#define   BPRSEL_BPROF_SHIFT                             10
#define   BPRSEL_BPRSZ_MASK                      0x000003ff
#define   BPRSEL_BPRSZ_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 bprsel_bprsz:10;
        u32 bprsel_bprof:20;
        u32 rsvd_30:1;
        u32 bprsel_bpid:1;
    } b;
} boot_part_read_sel_t;

#define BOOT_PART_MEM_BUF_LOC_L                  0x00000048
#define   BPMBL_BMBBA_L_MASK                     0xfffff000
#define   BPMBL_BMBBA_L_SHIFT                            12

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:12;
        u32 bpmbl_bmbba_l:20;
    } b;
} boot_part_mem_buf_loc_l_t;

#define BOOT_PART_MEM_BUF_LOC_H                  0x0000004c
#define   BPMBL_BMBBA_H_MASK                     0xffffffff
#define   BPMBL_BMBBA_H_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 bpmbl_bmbba_h:32;
    } b;
} boot_part_mem_buf_loc_h_t;

#define VS_IDIR_ADDR                             0x00000080
#define   VS_IDIR_ADDR_DW_MASK                   0xfffffffc
#define   VS_IDIR_ADDR_DW_SHIFT                           2

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:2;
        u32 vs_idir_addr_dw:30;
    } b;
} vs_idir_addr_t;

#define VS_IDIR_DATA                             0x00000084
#define   VS_IDIR_DATA_MASK                      0xffffffff
#define   VS_IDIR_DATA_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 vs_idir_data:32;
    } b;
} vs_idir_data_t;

#define SQ0_DB_REG                               0x00001000
#define   CQ_ID_FOR_SQ0_MASK                     0xf0000000
#define   CQ_ID_FOR_SQ0_SHIFT                            28
#define   SQ0_HEAD_PTR_MASK                      0x0fff0000
#define   SQ0_HEAD_PTR_SHIFT                             16
#define   SQ0_TAIL_PTR_MASK                      0x00000fff
#define   SQ0_TAIL_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 sq0_tail_ptr:12;
        u32 rsvd_12:4;
        u32 sq0_head_ptr:12;
        u32 cq_id_for_sq0:4;
    } b;
} sq0_db_reg_t;

#define CQ0_DB_REG                               0x00001004
#define   CQ0_PHASE_TAG_MASK                     0x80000000
#define   CQ0_PHASE_TAG_SHIFT                            31
#define   UNACK_CQ0_CMD_CMPL_MASK                0x40000000
#define   UNACK_CQ0_CMD_CMPL_SHIFT                       30
#define   CQ0_TAIL_PTR_MASK                      0x0fff0000
#define   CQ0_TAIL_PTR_SHIFT                             16
#define   CQ0_HEAD_PTR_MASK                      0x00000fff
#define   CQ0_HEAD_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cq0_head_ptr:12;
        u32 rsvd_12:4;
        u32 cq0_tail_ptr:12;
        u32 rsvd_28:2;
        u32 unack_cq0_cmd_cmpl:1;
        u32 cq0_phase_tag:1;
    } b;
} cq0_db_reg_t;

#define SQ1_DB_REG                               0x00001008
#define   CQ_ID_FOR_SQ1_MASK                     0xf0000000
#define   CQ_ID_FOR_SQ1_SHIFT                            28
#define   SQ1_HEAD_PTR_MASK                      0x0fff0000
#define   SQ1_HEAD_PTR_SHIFT                             16
#define   SQ1_TAIL_PTR_MASK                      0x00000fff
#define   SQ1_TAIL_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 sq1_tail_ptr:12;
        u32 rsvd_12:4;
        u32 sq1_head_ptr:12;
        u32 cq_id_for_sq1:4;
    } b;
} sq1_db_reg_t;

#define CQ1_DB_REG                               0x0000100c
#define   CQ1_PHASE_TAG_MASK                     0x80000000
#define   CQ1_PHASE_TAG_SHIFT                            31
#define   UNACK_CQ1_CMD_CMPL_MASK                0x40000000
#define   UNACK_CQ1_CMD_CMPL_SHIFT                       30
#define   CQ1_TAIL_PTR_MASK                      0x0fff0000
#define   CQ1_TAIL_PTR_SHIFT                             16
#define   CQ1_HEAD_PTR_MASK                      0x00000fff
#define   CQ1_HEAD_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cq1_head_ptr:12;
        u32 rsvd_12:4;
        u32 cq1_tail_ptr:12;
        u32 rsvd_28:2;
        u32 unack_cq1_cmd_cmpl:1;
        u32 cq1_phase_tag:1;
    } b;
} cq1_db_reg_t;

#define SQ2_DB_REG                               0x00001010
#define   CQ_ID_FOR_SQ2_MASK                     0xf0000000
#define   CQ_ID_FOR_SQ2_SHIFT                            28
#define   SQ2_HEAD_PTR_MASK                      0x0fff0000
#define   SQ2_HEAD_PTR_SHIFT                             16
#define   SQ2_TAIL_PTR_MASK                      0x00000fff
#define   SQ2_TAIL_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 sq2_tail_ptr:12;
        u32 rsvd_12:4;
        u32 sq2_head_ptr:12;
        u32 cq_id_for_sq2:4;
    } b;
} sq2_db_reg_t;

#define CQ2_DB_REG                               0x00001014
#define   CQ2_PHASE_TAG_MASK                     0x80000000
#define   CQ2_PHASE_TAG_SHIFT                            31
#define   UNACK_CQ2_CMD_CMPL_MASK                0x40000000
#define   UNACK_CQ2_CMD_CMPL_SHIFT                       30
#define   CQ2_TAIL_PTR_MASK                      0x0fff0000
#define   CQ2_TAIL_PTR_SHIFT                             16
#define   CQ2_HEAD_PTR_MASK                      0x00000fff
#define   CQ2_HEAD_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cq2_head_ptr:12;
        u32 rsvd_12:4;
        u32 cq2_tail_ptr:12;
        u32 rsvd_28:2;
        u32 unack_cq2_cmd_cmpl:1;
        u32 cq2_phase_tag:1;
    } b;
} cq2_db_reg_t;

#define SQ3_DB_REG                               0x00001018
#define   CQ_ID_FOR_SQ3_MASK                     0xf0000000
#define   CQ_ID_FOR_SQ3_SHIFT                            28
#define   SQ3_HEAD_PTR_MASK                      0x0fff0000
#define   SQ3_HEAD_PTR_SHIFT                             16
#define   SQ3_TAIL_PTR_MASK                      0x00000fff
#define   SQ3_TAIL_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 sq3_tail_ptr:12;
        u32 rsvd_12:4;
        u32 sq3_head_ptr:12;
        u32 cq_id_for_sq3:4;
    } b;
} sq3_db_reg_t;

#define CQ3_DB_REG                               0x0000101c
#define   CQ3_PHASE_TAG_MASK                     0x80000000
#define   CQ3_PHASE_TAG_SHIFT                            31
#define   UNACK_CQ3_CMD_CMPL_MASK                0x40000000
#define   UNACK_CQ3_CMD_CMPL_SHIFT                       30
#define   CQ3_TAIL_PTR_MASK                      0x0fff0000
#define   CQ3_TAIL_PTR_SHIFT                             16
#define   CQ3_HEAD_PTR_MASK                      0x00000fff
#define   CQ3_HEAD_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cq3_head_ptr:12;
        u32 rsvd_12:4;
        u32 cq3_tail_ptr:12;
        u32 rsvd_28:2;
        u32 unack_cq3_cmd_cmpl:1;
        u32 cq3_phase_tag:1;
    } b;
} cq3_db_reg_t;

#define SQ4_DB_REG                               0x00001020
#define   CQ_ID_FOR_SQ4_MASK                     0xf0000000
#define   CQ_ID_FOR_SQ4_SHIFT                            28
#define   SQ4_HEAD_PTR_MASK                      0x0fff0000
#define   SQ4_HEAD_PTR_SHIFT                             16
#define   SQ4_TAIL_PTR_MASK                      0x00000fff
#define   SQ4_TAIL_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 sq4_tail_ptr:12;
        u32 rsvd_12:4;
        u32 sq4_head_ptr:12;
        u32 cq_id_for_sq4:4;
    } b;
} sq4_db_reg_t;

#define CQ4_DB_REG                               0x00001024
#define   CQ4_PHASE_TAG_MASK                     0x80000000
#define   CQ4_PHASE_TAG_SHIFT                            31
#define   UNACK_CQ4_CMD_CMPL_MASK                0x40000000
#define   UNACK_CQ4_CMD_CMPL_SHIFT                       30
#define   CQ4_TAIL_PTR_MASK                      0x0fff0000
#define   CQ4_TAIL_PTR_SHIFT                             16
#define   CQ4_HEAD_PTR_MASK                      0x00000fff
#define   CQ4_HEAD_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cq4_head_ptr:12;
        u32 rsvd_12:4;
        u32 cq4_tail_ptr:12;
        u32 rsvd_28:2;
        u32 unack_cq4_cmd_cmpl:1;
        u32 cq4_phase_tag:1;
    } b;
} cq4_db_reg_t;

#define SQ5_DB_REG                               0x00001028
#define   CQ_ID_FOR_SQ5_MASK                     0xf0000000
#define   CQ_ID_FOR_SQ5_SHIFT                            28
#define   SQ5_HEAD_PTR_MASK                      0x0fff0000
#define   SQ5_HEAD_PTR_SHIFT                             16
#define   SQ5_TAIL_PTR_MASK                      0x00000fff
#define   SQ5_TAIL_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 sq5_tail_ptr:12;
        u32 rsvd_12:4;
        u32 sq5_head_ptr:12;
        u32 cq_id_for_sq5:4;
    } b;
} sq5_db_reg_t;

#define CQ5_DB_REG                               0x0000102c
#define   CQ5_PHASE_TAG_MASK                     0x80000000
#define   CQ5_PHASE_TAG_SHIFT                            31
#define   UNACK_CQ5_CMD_CMPL_MASK                0x40000000
#define   UNACK_CQ5_CMD_CMPL_SHIFT                       30
#define   CQ5_TAIL_PTR_MASK                      0x0fff0000
#define   CQ5_TAIL_PTR_SHIFT                             16
#define   CQ5_HEAD_PTR_MASK                      0x00000fff
#define   CQ5_HEAD_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cq5_head_ptr:12;
        u32 rsvd_12:4;
        u32 cq5_tail_ptr:12;
        u32 rsvd_28:2;
        u32 unack_cq5_cmd_cmpl:1;
        u32 cq5_phase_tag:1;
    } b;
} cq5_db_reg_t;

#define SQ6_DB_REG                               0x00001030
#define   CQ_ID_FOR_SQ6_MASK                     0xf0000000
#define   CQ_ID_FOR_SQ6_SHIFT                            28
#define   SQ6_HEAD_PTR_MASK                      0x0fff0000
#define   SQ6_HEAD_PTR_SHIFT                             16
#define   SQ6_TAIL_PTR_MASK                      0x00000fff
#define   SQ6_TAIL_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 sq6_tail_ptr:12;
        u32 rsvd_12:4;
        u32 sq6_head_ptr:12;
        u32 cq_id_for_sq6:4;
    } b;
} sq6_db_reg_t;

#define CQ6_DB_REG                               0x00001034
#define   CQ6_PHASE_TAG_MASK                     0x80000000
#define   CQ6_PHASE_TAG_SHIFT                            31
#define   UNACK_CQ6_CMD_CMPL_MASK                0x40000000
#define   UNACK_CQ6_CMD_CMPL_SHIFT                       30
#define   CQ6_TAIL_PTR_MASK                      0x0fff0000
#define   CQ6_TAIL_PTR_SHIFT                             16
#define   CQ6_HEAD_PTR_MASK                      0x00000fff
#define   CQ6_HEAD_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cq6_head_ptr:12;
        u32 rsvd_12:4;
        u32 cq6_tail_ptr:12;
        u32 rsvd_28:2;
        u32 unack_cq6_cmd_cmpl:1;
        u32 cq6_phase_tag:1;
    } b;
} cq6_db_reg_t;

#define SQ7_DB_REG                               0x00001038
#define   CQ_ID_FOR_SQ7_MASK                     0xf0000000
#define   CQ_ID_FOR_SQ7_SHIFT                            28
#define   SQ7_HEAD_PTR_MASK                      0x0fff0000
#define   SQ7_HEAD_PTR_SHIFT                             16
#define   SQ7_TAIL_PTR_MASK                      0x00000fff
#define   SQ7_TAIL_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 sq7_tail_ptr:12;
        u32 rsvd_12:4;
        u32 sq7_head_ptr:12;
        u32 cq_id_for_sq7:4;
    } b;
} sq7_db_reg_t;

#define CQ7_DB_REG                               0x0000103c
#define   CQ7_PHASE_TAG_MASK                     0x80000000
#define   CQ7_PHASE_TAG_SHIFT                            31
#define   UNACK_CQ7_CMD_CMPL_MASK                0x40000000
#define   UNACK_CQ7_CMD_CMPL_SHIFT                       30
#define   CQ7_TAIL_PTR_MASK                      0x0fff0000
#define   CQ7_TAIL_PTR_SHIFT                             16
#define   CQ7_HEAD_PTR_MASK                      0x00000fff
#define   CQ7_HEAD_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cq7_head_ptr:12;
        u32 rsvd_12:4;
        u32 cq7_tail_ptr:12;
        u32 rsvd_28:2;
        u32 unack_cq7_cmd_cmpl:1;
        u32 cq7_phase_tag:1;
    } b;
} cq7_db_reg_t;

#define SQ8_DB_REG                               0x00001040
#define   CQ_ID_FOR_SQ8_MASK                     0xf0000000
#define   CQ_ID_FOR_SQ8_SHIFT                            28
#define   SQ8_HEAD_PTR_MASK                      0x0fff0000
#define   SQ8_HEAD_PTR_SHIFT                             16
#define   SQ8_TAIL_PTR_MASK                      0x00000fff
#define   SQ8_TAIL_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 sq8_tail_ptr:12;
        u32 rsvd_12:4;
        u32 sq8_head_ptr:12;
        u32 cq_id_for_sq8:4;
    } b;
} sq8_db_reg_t;

#define CQ8_DB_REG                               0x00001044
#define   CQ8_PHASE_TAG_MASK                     0x80000000
#define   CQ8_PHASE_TAG_SHIFT                            31
#define   UNACK_CQ8_CMD_CMPL_MASK                0x40000000
#define   UNACK_CQ8_CMD_CMPL_SHIFT                       30
#define   CQ8_TAIL_PTR_MASK                      0x0fff0000
#define   CQ8_TAIL_PTR_SHIFT                             16
#define   CQ8_HEAD_PTR_MASK                      0x00000fff
#define   CQ8_HEAD_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cq8_head_ptr:12;
        u32 rsvd_12:4;
        u32 cq8_tail_ptr:12;
        u32 rsvd_28:2;
        u32 unack_cq8_cmd_cmpl:1;
        u32 cq8_phase_tag:1;
    } b;
} cq8_db_reg_t;

#define SQ_SIZE_REG1                             0x00001404
#define   SQ1_SIZE_MASK                          0x00000fff
#define   SQ1_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq1_size:12;
        u32 rsvd_12:20;
    } b;
} sq_size_reg1_t;

#define SQ_SIZE_REG2                             0x00001408
#define   SQ2_SIZE_MASK                          0x00000fff
#define   SQ2_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq2_size:12;
        u32 rsvd_12:20;
    } b;
} sq_size_reg2_t;

#define SQ_SIZE_REG3                             0x0000140c
#define   SQ3_SIZE_MASK                          0x00000fff
#define   SQ3_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq3_size:12;
        u32 rsvd_12:20;
    } b;
} sq_size_reg3_t;

#define SQ_SIZE_REG4                             0x00001410
#define   SQ4_SIZE_MASK                          0x00000fff
#define   SQ4_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq4_size:12;
        u32 rsvd_12:20;
    } b;
} sq_size_reg4_t;

#define SQ_SIZE_REG5                             0x00001414
#define   SQ5_SIZE_MASK                          0x00000fff
#define   SQ5_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq5_size:12;
        u32 rsvd_12:20;
    } b;
} sq_size_reg5_t;

#define SQ_SIZE_REG6                             0x00001418
#define   SQ6_SIZE_MASK                          0x00000fff
#define   SQ6_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq6_size:12;
        u32 rsvd_12:20;
    } b;
} sq_size_reg6_t;

#define SQ_SIZE_REG7                             0x0000141c
#define   SQ7_SIZE_MASK                          0x00000fff
#define   SQ7_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq7_size:12;
        u32 rsvd_12:20;
    } b;
} sq_size_reg7_t;

#define SQ_SIZE_REG8                             0x00001420
#define   SQ8_SIZE_MASK                          0x00000fff
#define   SQ8_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sq8_size:12;
        u32 rsvd_12:20;
    } b;
} sq_size_reg8_t;

#define CQ_SIZE_REG1                             0x00001504
#define   CQ1_SIZE_MASK                          0x00000fff
#define   CQ1_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 cq1_size:12;
        u32 rsvd_12:20;
    } b;
} cq_size_reg1_t;

#define CQ_SIZE_REG2                             0x00001508
#define   CQ2_SIZE_MASK                          0x00000fff
#define   CQ2_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 cq2_size:12;
        u32 rsvd_12:20;
    } b;
} cq_size_reg2_t;

#define CQ_SIZE_REG3                             0x0000150c
#define   CQ3_SIZE_MASK                          0x00000fff
#define   CQ3_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 cq3_size:12;
        u32 rsvd_12:20;
    } b;
} cq_size_reg3_t;

#define CQ_SIZE_REG4                             0x00001510
#define   CQ4_SIZE_MASK                          0x00000fff
#define   CQ4_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 cq4_size:12;
        u32 rsvd_12:20;
    } b;
} cq_size_reg4_t;

#define CQ_SIZE_REG5                             0x00001514
#define   CQ5_SIZE_MASK                          0x00000fff
#define   CQ5_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 cq5_size:12;
        u32 rsvd_12:20;
    } b;
} cq_size_reg5_t;

#define CQ_SIZE_REG6                             0x00001518
#define   CQ6_SIZE_MASK                          0x00000fff
#define   CQ6_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 cq6_size:12;
        u32 rsvd_12:20;
    } b;
} cq_size_reg6_t;

#define CQ_SIZE_REG7                             0x0000151c
#define   CQ7_SIZE_MASK                          0x00000fff
#define   CQ7_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 cq7_size:12;
        u32 rsvd_12:20;
    } b;
} cq_size_reg7_t;

#define CQ_SIZE_REG8                             0x00001520
#define   CQ8_SIZE_MASK                          0x00000fff
#define   CQ8_SIZE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 cq8_size:12;
        u32 rsvd_12:20;
    } b;
} cq_size_reg8_t;

#define MSIX_CQ_MAP0                             0x00001680
#define   MX_VECT_FOR_CQ3_MASK                   0xff000000
#define   MX_VECT_FOR_CQ3_SHIFT                          24
#define   MX_VECT_FOR_CQ2_MASK                   0x00ff0000
#define   MX_VECT_FOR_CQ2_SHIFT                          16
#define   MX_VECT_FOR_CQ1_MASK                   0x0000ff00
#define   MX_VECT_FOR_CQ1_SHIFT                           8
#define   MX_VECT_FOR_CQ0_MASK                   0x000000ff
#define   MX_VECT_FOR_CQ0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 mx_vect_for_cq0:8;
        u32 mx_vect_for_cq1:8;
        u32 mx_vect_for_cq2:8;
        u32 mx_vect_for_cq3:8;
    } b;
} msix_cq_map0_t;

#define MSIX_CQ_MAP1                             0x00001684
#define   MX_VECT_FOR_CQ7_MASK                   0xff000000
#define   MX_VECT_FOR_CQ7_SHIFT                          24
#define   MX_VECT_FOR_CQ6_MASK                   0x00ff0000
#define   MX_VECT_FOR_CQ6_SHIFT                          16
#define   MX_VECT_FOR_CQ5_MASK                   0x0000ff00
#define   MX_VECT_FOR_CQ5_SHIFT                           8
#define   MX_VECT_FOR_CQ4_MASK                   0x000000ff
#define   MX_VECT_FOR_CQ4_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 mx_vect_for_cq4:8;
        u32 mx_vect_for_cq5:8;
        u32 mx_vect_for_cq6:8;
        u32 mx_vect_for_cq7:8;
    } b;
} msix_cq_map1_t;

#define MSIX_CQ_MAP2                             0x00001688
#define   MX_VECT_FOR_CQ8_MASK                   0x000000ff
#define   MX_VECT_FOR_CQ8_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 mx_vect_for_cq8:8;
        u32 rsvd_8:24;
    } b;
} msix_cq_map2_t;

#define MSIX_MASK_BIT                            0x00001700
#define   MX_VECT_8_MASK_BIT_MASK                0x00000100
#define   MX_VECT_8_MASK_BIT_SHIFT                        8
#define   MX_VECT_7_MASK_BIT_MASK                0x00000080
#define   MX_VECT_7_MASK_BIT_SHIFT                        7
#define   MX_VECT_6_MASK_BIT_MASK                0x00000040
#define   MX_VECT_6_MASK_BIT_SHIFT                        6
#define   MX_VECT_5_MASK_BIT_MASK                0x00000020
#define   MX_VECT_5_MASK_BIT_SHIFT                        5
#define   MX_VECT_4_MASK_BIT_MASK                0x00000010
#define   MX_VECT_4_MASK_BIT_SHIFT                        4
#define   MX_VECT_3_MASK_BIT_MASK                0x00000008
#define   MX_VECT_3_MASK_BIT_SHIFT                        3
#define   MX_VECT_2_MASK_BIT_MASK                0x00000004
#define   MX_VECT_2_MASK_BIT_SHIFT                        2
#define   MX_VECT_1_MASK_BIT_MASK                0x00000002
#define   MX_VECT_1_MASK_BIT_SHIFT                        1
#define   MX_VECT_0_MASK_BIT_MASK                0x00000001
#define   MX_VECT_0_MASK_BIT_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 mx_vect_0_mask_bit:1;
        u32 mx_vect_1_mask_bit:1;
        u32 mx_vect_2_mask_bit:1;
        u32 mx_vect_3_mask_bit:1;
        u32 mx_vect_4_mask_bit:1;
        u32 mx_vect_5_mask_bit:1;
        u32 mx_vect_6_mask_bit:1;
        u32 mx_vect_7_mask_bit:1;
        u32 mx_vect_8_mask_bit:1;
        u32 rsvd_9:23;
    } b;
} msix_mask_bit_t;

#define MSIX_PBA_BIT                             0x00001710
#define   MX_VECT_8_PBA_BIT_MASK                 0x01000000
#define   MX_VECT_8_PBA_BIT_SHIFT                        24
#define   MX_VECT_7_PBA_BIT_MASK                 0x00800000
#define   MX_VECT_7_PBA_BIT_SHIFT                        23
#define   MX_VECT_6_PBA_BIT_MASK                 0x00400000
#define   MX_VECT_6_PBA_BIT_SHIFT                        22
#define   MX_VECT_5_PBA_BIT_MASK                 0x00200000
#define   MX_VECT_5_PBA_BIT_SHIFT                        21
#define   MX_VECT_4_PBA_BIT_MASK                 0x00100000
#define   MX_VECT_4_PBA_BIT_SHIFT                        20
#define   MX_VECT_3_PBA_BIT_MASK                 0x00080000
#define   MX_VECT_3_PBA_BIT_SHIFT                        19
#define   MX_VECT_2_PBA_BIT_MASK                 0x00040000
#define   MX_VECT_2_PBA_BIT_SHIFT                        18
#define   MX_VECT_1_PBA_BIT_MASK                 0x00020000
#define   MX_VECT_1_PBA_BIT_SHIFT                        17
#define   MX_VECT_0_PBA_BIT_MASK                 0x00010000
#define   MX_VECT_0_PBA_BIT_SHIFT                        16

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:16;
        u32 mx_vect_0_pba_bit:1;
        u32 mx_vect_1_pba_bit:1;
        u32 mx_vect_2_pba_bit:1;
        u32 mx_vect_3_pba_bit:1;
        u32 mx_vect_4_pba_bit:1;
        u32 mx_vect_5_pba_bit:1;
        u32 mx_vect_6_pba_bit:1;
        u32 mx_vect_7_pba_bit:1;
        u32 mx_vect_8_pba_bit:1;
        u32 rsvd_25:7;
    } b;
} msix_pba_bit_t;

#define CQ_INTERRUPT_EN                          0x00001720
#define   CQ8_INTERRUPT_EN_MASK                  0x00000100
#define   CQ8_INTERRUPT_EN_SHIFT                          8
#define   CQ7_INTERRUPT_EN_MASK                  0x00000080
#define   CQ7_INTERRUPT_EN_SHIFT                          7
#define   CQ6_INTERRUPT_EN_MASK                  0x00000040
#define   CQ6_INTERRUPT_EN_SHIFT                          6
#define   CQ5_INTERRUPT_EN_MASK                  0x00000020
#define   CQ5_INTERRUPT_EN_SHIFT                          5
#define   CQ4_INTERRUPT_EN_MASK                  0x00000010
#define   CQ4_INTERRUPT_EN_SHIFT                          4
#define   CQ3_INTERRUPT_EN_MASK                  0x00000008
#define   CQ3_INTERRUPT_EN_SHIFT                          3
#define   CQ2_INTERRUPT_EN_MASK                  0x00000004
#define   CQ2_INTERRUPT_EN_SHIFT                          2
#define   CQ1_INTERRUPT_EN_MASK                  0x00000002
#define   CQ1_INTERRUPT_EN_SHIFT                          1
#define   CQ0_INTERRUPT_EN_MASK                  0x00000001
#define   CQ0_INTERRUPT_EN_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cq0_interrupt_en:1;
        u32 cq1_interrupt_en:1;
        u32 cq2_interrupt_en:1;
        u32 cq3_interrupt_en:1;
        u32 cq4_interrupt_en:1;
        u32 cq5_interrupt_en:1;
        u32 cq6_interrupt_en:1;
        u32 cq7_interrupt_en:1;
        u32 cq8_interrupt_en:1;
        u32 rsvd_9:23;
    } b;
} cq_interrupt_en_t;

#define INT_COALESCING_CTRL                      0x00001740
#define   INTV8_CALSC_EN_MASK                    0x01000000
#define   INTV8_CALSC_EN_SHIFT                           24
#define   INTV7_CALSC_EN_MASK                    0x00800000
#define   INTV7_CALSC_EN_SHIFT                           23
#define   INTV6_CALSC_EN_MASK                    0x00400000
#define   INTV6_CALSC_EN_SHIFT                           22
#define   INTV5_CALSC_EN_MASK                    0x00200000
#define   INTV5_CALSC_EN_SHIFT                           21
#define   INTV4_CALSC_EN_MASK                    0x00100000
#define   INTV4_CALSC_EN_SHIFT                           20
#define   INTV3_CALSC_EN_MASK                    0x00080000
#define   INTV3_CALSC_EN_SHIFT                           19
#define   INTV2_CALSC_EN_MASK                    0x00040000
#define   INTV2_CALSC_EN_SHIFT                           18
#define   INTV1_CALSC_EN_MASK                    0x00020000
#define   INTV1_CALSC_EN_SHIFT                           17
#define   INTV0_CALSC_EN_MASK                    0x00010000
#define   INTV0_CALSC_EN_SHIFT                           16

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:16;
        u32 intv0_calsc_en:1;
        u32 intv1_calsc_en:1;
        u32 intv2_calsc_en:1;
        u32 intv3_calsc_en:1;
        u32 intv4_calsc_en:1;
        u32 intv5_calsc_en:1;
        u32 intv6_calsc_en:1;
        u32 intv7_calsc_en:1;
        u32 intv8_calsc_en:1;
        u32 rsvd_25:7;
    } b;
} int_coalescing_ctrl_t;

#define INTERNAL_INT_STATUS                      0x00001760
#define   R_CMPL_UNACK_CQ_CMD_MASK               0x01ff0000
#define   R_CMPL_UNACK_CQ_CMD_SHIFT                      16
#define   INTERNAL_INT_STATUS_MASK               0x000001ff
#define   INTERNAL_INT_STATUS_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 internal_int_status:9;
        u32 rsvd_9:7;
        u32 r_cmpl_unack_cq_cmd:9;
        u32 rsvd_25:7;
    } b;
} internal_int_status_t;

#define SQ1_H_BASE_ADDR_L                        0x00001800
#define   SQ1_H_BASE_ADDR_L_MASK                 0xffffffff
#define   SQ1_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq1_h_base_addr_l:32;
    } b;
} sq1_h_base_addr_l_t;

#define SQ1_H_BASE_ADDR_H                        0x00001804
#define   SQ1_H_BASE_ADDR_H_MASK                 0xffffffff
#define   SQ1_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq1_h_base_addr_h:32;
    } b;
} sq1_h_base_addr_h_t;

#define SQ2_H_BASE_ADDR_L                        0x00001808
#define   SQ2_H_BASE_ADDR_L_MASK                 0xffffffff
#define   SQ2_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq2_h_base_addr_l:32;
    } b;
} sq2_h_base_addr_l_t;

#define SQ2_H_BASE_ADDR_H                        0x0000180c
#define   SQ2_H_BASE_ADDR_H_MASK                 0xffffffff
#define   SQ2_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq2_h_base_addr_h:32;
    } b;
} sq2_h_base_addr_h_t;

#define SQ3_H_BASE_ADDR_L                        0x00001810
#define   SQ3_H_BASE_ADDR_L_MASK                 0xffffffff
#define   SQ3_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq3_h_base_addr_l:32;
    } b;
} sq3_h_base_addr_l_t;

#define SQ3_H_BASE_ADDR_H                        0x00001814
#define   SQ3_H_BASE_ADDR_H_MASK                 0xffffffff
#define   SQ3_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq3_h_base_addr_h:32;
    } b;
} sq3_h_base_addr_h_t;

#define SQ4_H_BASE_ADDR_L                        0x00001818
#define   SQ4_H_BASE_ADDR_L_MASK                 0xffffffff
#define   SQ4_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq4_h_base_addr_l:32;
    } b;
} sq4_h_base_addr_l_t;

#define SQ4_H_BASE_ADDR_H                        0x0000181c
#define   SQ4_H_BASE_ADDR_H_MASK                 0xffffffff
#define   SQ4_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq4_h_base_addr_h:32;
    } b;
} sq4_h_base_addr_h_t;

#define SQ5_H_BASE_ADDR_L                        0x00001820
#define   SQ5_H_BASE_ADDR_L_MASK                 0xffffffff
#define   SQ5_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq5_h_base_addr_l:32;
    } b;
} sq5_h_base_addr_l_t;

#define SQ5_H_BASE_ADDR_H                        0x00001824
#define   SQ5_H_BASE_ADDR_H_MASK                 0xffffffff
#define   SQ5_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq5_h_base_addr_h:32;
    } b;
} sq5_h_base_addr_h_t;

#define SQ6_H_BASE_ADDR_L                        0x00001828
#define   SQ6_H_BASE_ADDR_L_MASK                 0xffffffff
#define   SQ6_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq6_h_base_addr_l:32;
    } b;
} sq6_h_base_addr_l_t;

#define SQ6_H_BASE_ADDR_H                        0x0000182c
#define   SQ6_H_BASE_ADDR_H_MASK                 0xffffffff
#define   SQ6_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq6_h_base_addr_h:32;
    } b;
} sq6_h_base_addr_h_t;

#define SQ7_H_BASE_ADDR_L                        0x00001830
#define   SQ7_H_BASE_ADDR_L_MASK                 0xffffffff
#define   SQ7_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq7_h_base_addr_l:32;
    } b;
} sq7_h_base_addr_l_t;

#define SQ7_H_BASE_ADDR_H                        0x00001834
#define   SQ7_H_BASE_ADDR_H_MASK                 0xffffffff
#define   SQ7_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq7_h_base_addr_h:32;
    } b;
} sq7_h_base_addr_h_t;

#define SQ8_H_BASE_ADDR_L                        0x00001838
#define   SQ8_H_BASE_ADDR_L_MASK                 0xffffffff
#define   SQ8_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq8_h_base_addr_l:32;
    } b;
} sq8_h_base_addr_l_t;

#define SQ8_H_BASE_ADDR_H                        0x0000183c
#define   SQ8_H_BASE_ADDR_H_MASK                 0xffffffff
#define   SQ8_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq8_h_base_addr_h:32;
    } b;
} sq8_h_base_addr_h_t;

#define CQ1_H_BASE_ADDR_L                        0x00001840
#define   CQ1_H_BASE_ADDR_L_MASK                 0xffffffff
#define   CQ1_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq1_h_base_addr_l:32;
    } b;
} cq1_h_base_addr_l_t;

#define CQ1_H_BASE_ADDR_H                        0x00001844
#define   CQ1_H_BASE_ADDR_H_MASK                 0xffffffff
#define   CQ1_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq1_h_base_addr_h:32;
    } b;
} cq1_h_base_addr_h_t;

#define CQ2_H_BASE_ADDR_L                        0x00001848
#define   CQ2_H_BASE_ADDR_L_MASK                 0xffffffff
#define   CQ2_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq2_h_base_addr_l:32;
    } b;
} cq2_h_base_addr_l_t;

#define CQ2_H_BASE_ADDR_H                        0x0000184c
#define   CQ2_H_BASE_ADDR_H_MASK                 0xffffffff
#define   CQ2_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq2_h_base_addr_h:32;
    } b;
} cq2_h_base_addr_h_t;

#define CQ3_H_BASE_ADDR_L                        0x00001850
#define   CQ3_H_BASE_ADDR_L_MASK                 0xffffffff
#define   CQ3_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq3_h_base_addr_l:32;
    } b;
} cq3_h_base_addr_l_t;

#define CQ3_H_BASE_ADDR_H                        0x00001854
#define   CQ3_H_BASE_ADDR_H_MASK                 0xffffffff
#define   CQ3_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq3_h_base_addr_h:32;
    } b;
} cq3_h_base_addr_h_t;

#define CQ4_H_BASE_ADDR_L                        0x00001858
#define   CQ4_H_BASE_ADDR_L_MASK                 0xffffffff
#define   CQ4_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq4_h_base_addr_l:32;
    } b;
} cq4_h_base_addr_l_t;

#define CQ4_H_BASE_ADDR_H                        0x0000185c
#define   CQ4_H_BASE_ADDR_H_MASK                 0xffffffff
#define   CQ4_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq4_h_base_addr_h:32;
    } b;
} cq4_h_base_addr_h_t;

#define CQ5_H_BASE_ADDR_L                        0x00001860
#define   CQ5_H_BASE_ADDR_L_MASK                 0xffffffff
#define   CQ5_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq5_h_base_addr_l:32;
    } b;
} cq5_h_base_addr_l_t;

#define CQ5_H_BASE_ADDR_H                        0x00001864
#define   CQ5_H_BASE_ADDR_H_MASK                 0xffffffff
#define   CQ5_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq5_h_base_addr_h:32;
    } b;
} cq5_h_base_addr_h_t;

#define CQ6_H_BASE_ADDR_L                        0x00001868
#define   CQ6_H_BASE_ADDR_L_MASK                 0xffffffff
#define   CQ6_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq6_h_base_addr_l:32;
    } b;
} cq6_h_base_addr_l_t;

#define CQ6_H_BASE_ADDR_H                        0x0000186c
#define   CQ6_H_BASE_ADDR_H_MASK                 0xffffffff
#define   CQ6_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq6_h_base_addr_h:32;
    } b;
} cq6_h_base_addr_h_t;

#define CQ7_H_BASE_ADDR_L                        0x00001870
#define   CQ7_H_BASE_ADDR_L_MASK                 0xffffffff
#define   CQ7_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq7_h_base_addr_l:32;
    } b;
} cq7_h_base_addr_l_t;

#define CQ7_H_BASE_ADDR_H                        0x00001874
#define   CQ7_H_BASE_ADDR_H_MASK                 0xffffffff
#define   CQ7_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq7_h_base_addr_h:32;
    } b;
} cq7_h_base_addr_h_t;

#define CQ8_H_BASE_ADDR_L                        0x00001878
#define   CQ8_H_BASE_ADDR_L_MASK                 0xffffffff
#define   CQ8_H_BASE_ADDR_L_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq8_h_base_addr_l:32;
    } b;
} cq8_h_base_addr_l_t;

#define CQ8_H_BASE_ADDR_H                        0x0000187c
#define   CQ8_H_BASE_ADDR_H_MASK                 0xffffffff
#define   CQ8_H_BASE_ADDR_H_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cq8_h_base_addr_h:32;
    } b;
} cq8_h_base_addr_h_t;

#define MX_V0_H_BASE_ADDR_L                      0x00001880
#define   MX_V0_H_BASE_ADDR_L_MASK               0xffffffff
#define   MX_V0_H_BASE_ADDR_L_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v0_h_base_addr_l:32;
    } b;
} mx_v0_h_base_addr_l_t;

#define MX_V0_H_BASE_ADDR_H                      0x00001884
#define   MX_V0_H_BASE_ADDR_H_MASK               0xffffffff
#define   MX_V0_H_BASE_ADDR_H_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v0_h_base_addr_h:32;
    } b;
} mx_v0_h_base_addr_h_t;

#define MSIX_V0_MESSAGE                          0x00001888
#define   MSIX_V0_MESSAGE_MASK                   0xffffffff
#define   MSIX_V0_MESSAGE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 msix_v0_message:32;
    } b;
} msix_v0_message_t;

#define MX_V1_H_BASE_ADDR_L                      0x00001890
#define   MX_V1_H_BASE_ADDR_L_MASK               0xffffffff
#define   MX_V1_H_BASE_ADDR_L_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v1_h_base_addr_l:32;
    } b;
} mx_v1_h_base_addr_l_t;

#define MX_V1_H_BASE_ADDR_H                      0x00001894
#define   MX_V1_H_BASE_ADDR_H_MASK               0xffffffff
#define   MX_V1_H_BASE_ADDR_H_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v1_h_base_addr_h:32;
    } b;
} mx_v1_h_base_addr_h_t;

#define MSIX_V1_MESSAGE                          0x00001898
#define   MSIX_V1_MESSAGE_MASK                   0xffffffff
#define   MSIX_V1_MESSAGE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 msix_v1_message:32;
    } b;
} msix_v1_message_t;

#define MX_V2_H_BASE_ADDR_L                      0x000018a0
#define   MX_V2_H_BASE_ADDR_L_MASK               0xffffffff
#define   MX_V2_H_BASE_ADDR_L_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v2_h_base_addr_l:32;
    } b;
} mx_v2_h_base_addr_l_t;

#define MX_V2_H_BASE_ADDR_H                      0x000018a4
#define   MX_V2_H_BASE_ADDR_H_MASK               0xffffffff
#define   MX_V2_H_BASE_ADDR_H_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v2_h_base_addr_h:32;
    } b;
} mx_v2_h_base_addr_h_t;

#define MSIX_V2_MESSAGE                          0x000018a8
#define   MSIX_V2_MESSAGE_MASK                   0xffffffff
#define   MSIX_V2_MESSAGE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 msix_v2_message:32;
    } b;
} msix_v2_message_t;

#define MX_V3_H_BASE_ADDR_L                      0x000018b0
#define   MX_V3_H_BASE_ADDR_L_MASK               0xffffffff
#define   MX_V3_H_BASE_ADDR_L_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v3_h_base_addr_l:32;
    } b;
} mx_v3_h_base_addr_l_t;

#define MX_V3_H_BASE_ADDR_H                      0x000018b4
#define   MX_V3_H_BASE_ADDR_H_MASK               0xffffffff
#define   MX_V3_H_BASE_ADDR_H_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v3_h_base_addr_h:32;
    } b;
} mx_v3_h_base_addr_h_t;

#define MSIX_V3_MESSAGE                          0x000018b8
#define   MSIX_V3_MESSAGE_MASK                   0xffffffff
#define   MSIX_V3_MESSAGE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 msix_v3_message:32;
    } b;
} msix_v3_message_t;

#define MX_V4_H_BASE_ADDR_L                      0x000018c0
#define   MX_V4_H_BASE_ADDR_L_MASK               0xffffffff
#define   MX_V4_H_BASE_ADDR_L_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v4_h_base_addr_l:32;
    } b;
} mx_v4_h_base_addr_l_t;

#define MX_V4_H_BASE_ADDR_H                      0x000018c4
#define   MX_V4_H_BASE_ADDR_H_MASK               0xffffffff
#define   MX_V4_H_BASE_ADDR_H_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v4_h_base_addr_h:32;
    } b;
} mx_v4_h_base_addr_h_t;

#define MSIX_V4_MESSAGE                          0x000018c8
#define   MSIX_V4_MESSAGE_MASK                   0xffffffff
#define   MSIX_V4_MESSAGE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 msix_v4_message:32;
    } b;
} msix_v4_message_t;

#define MX_V5_H_BASE_ADDR_L                      0x000018d0
#define   MX_V5_H_BASE_ADDR_L_MASK               0xffffffff
#define   MX_V5_H_BASE_ADDR_L_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v5_h_base_addr_l:32;
    } b;
} mx_v5_h_base_addr_l_t;

#define MX_V5_H_BASE_ADDR_H                      0x000018d4
#define   MX_V5_H_BASE_ADDR_H_MASK               0xffffffff
#define   MX_V5_H_BASE_ADDR_H_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v5_h_base_addr_h:32;
    } b;
} mx_v5_h_base_addr_h_t;

#define MSIX_V5_MESSAGE                          0x000018d8
#define   MSIX_V5_MESSAGE_MASK                   0xffffffff
#define   MSIX_V5_MESSAGE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 msix_v5_message:32;
    } b;
} msix_v5_message_t;

#define MX_V6_H_BASE_ADDR_L                      0x000018e0
#define   MX_V6_H_BASE_ADDR_L_MASK               0xffffffff
#define   MX_V6_H_BASE_ADDR_L_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v6_h_base_addr_l:32;
    } b;
} mx_v6_h_base_addr_l_t;

#define MX_V6_H_BASE_ADDR_H                      0x000018e4
#define   MX_V6_H_BASE_ADDR_H_MASK               0xffffffff
#define   MX_V6_H_BASE_ADDR_H_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v6_h_base_addr_h:32;
    } b;
} mx_v6_h_base_addr_h_t;

#define MSIX_V6_MESSAGE                          0x000018e8
#define   MSIX_V6_MESSAGE_MASK                   0xffffffff
#define   MSIX_V6_MESSAGE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 msix_v6_message:32;
    } b;
} msix_v6_message_t;

#define MX_V7_H_BASE_ADDR_L                      0x000018f0
#define   MX_V7_H_BASE_ADDR_L_MASK               0xffffffff
#define   MX_V7_H_BASE_ADDR_L_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v7_h_base_addr_l:32;
    } b;
} mx_v7_h_base_addr_l_t;

#define MX_V7_H_BASE_ADDR_H                      0x000018f4
#define   MX_V7_H_BASE_ADDR_H_MASK               0xffffffff
#define   MX_V7_H_BASE_ADDR_H_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v7_h_base_addr_h:32;
    } b;
} mx_v7_h_base_addr_h_t;

#define MSIX_V7_MESSAGE                          0x000018f8
#define   MSIX_V7_MESSAGE_MASK                   0xffffffff
#define   MSIX_V7_MESSAGE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 msix_v7_message:32;
    } b;
} msix_v7_message_t;

#define MX_V8_H_BASE_ADDR_L                      0x00001900
#define   MX_V8_H_BASE_ADDR_L_MASK               0xffffffff
#define   MX_V8_H_BASE_ADDR_L_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v8_h_base_addr_l:32;
    } b;
} mx_v8_h_base_addr_l_t;

#define MX_V8_H_BASE_ADDR_H                      0x00001904
#define   MX_V8_H_BASE_ADDR_H_MASK               0xffffffff
#define   MX_V8_H_BASE_ADDR_H_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 mx_v8_h_base_addr_h:32;
    } b;
} mx_v8_h_base_addr_h_t;

#define MSIX_V8_MESSAGE                          0x00001908
#define   MSIX_V8_MESSAGE_MASK                   0xffffffff
#define   MSIX_V8_MESSAGE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 msix_v8_message:32;
    } b;
} msix_v8_message_t;

#define INTV01_COALESCING_CNTS                   0x00001980
#define   VECTOR1_EVENT_CNT_MASK                 0xff000000
#define   VECTOR1_EVENT_CNT_SHIFT                        24
#define   VECTOR1_TIMER_CNT_MASK                 0x00ff0000
#define   VECTOR1_TIMER_CNT_SHIFT                        16
#define   VECTOR0_EVENT_CNT_MASK                 0x0000ff00
#define   VECTOR0_EVENT_CNT_SHIFT                         8
#define   VECTOR0_TIMER_CNT_MASK                 0x000000ff
#define   VECTOR0_TIMER_CNT_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 vector0_timer_cnt:8;
        u32 vector0_event_cnt:8;
        u32 vector1_timer_cnt:8;
        u32 vector1_event_cnt:8;
    } b;
} intv01_coalescing_cnts_t;

#define INTV23_COALESCING_CNTS                   0x00001984
#define   VECTOR3_EVENT_CNT_MASK                 0xff000000
#define   VECTOR3_EVENT_CNT_SHIFT                        24
#define   VECTOR3_TIMER_CNT_MASK                 0x00ff0000
#define   VECTOR3_TIMER_CNT_SHIFT                        16
#define   VECTOR2_EVENT_CNT_MASK                 0x0000ff00
#define   VECTOR2_EVENT_CNT_SHIFT                         8
#define   VECTOR2_TIMER_CNT_MASK                 0x000000ff
#define   VECTOR2_TIMER_CNT_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 vector2_timer_cnt:8;
        u32 vector2_event_cnt:8;
        u32 vector3_timer_cnt:8;
        u32 vector3_event_cnt:8;
    } b;
} intv23_coalescing_cnts_t;

#define INTV45_COALESCING_CNTS                   0x00001988
#define   VECTOR5_EVENT_CNT_MASK                 0xff000000
#define   VECTOR5_EVENT_CNT_SHIFT                        24
#define   VECTOR5_TIMER_CNT_MASK                 0x00ff0000
#define   VECTOR5_TIMER_CNT_SHIFT                        16
#define   VECTOR4_EVENT_CNT_MASK                 0x0000ff00
#define   VECTOR4_EVENT_CNT_SHIFT                         8
#define   VECTOR4_TIMER_CNT_MASK                 0x000000ff
#define   VECTOR4_TIMER_CNT_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 vector4_timer_cnt:8;
        u32 vector4_event_cnt:8;
        u32 vector5_timer_cnt:8;
        u32 vector5_event_cnt:8;
    } b;
} intv45_coalescing_cnts_t;

#define INTV67_COALESCING_CNTS                   0x0000198c
#define   VECTOR7_EVENT_CNT_MASK                 0xff000000
#define   VECTOR7_EVENT_CNT_SHIFT                        24
#define   VECTOR7_TIMER_CNT_MASK                 0x00ff0000
#define   VECTOR7_TIMER_CNT_SHIFT                        16
#define   VECTOR6_EVENT_CNT_MASK                 0x0000ff00
#define   VECTOR6_EVENT_CNT_SHIFT                         8
#define   VECTOR6_TIMER_CNT_MASK                 0x000000ff
#define   VECTOR6_TIMER_CNT_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 vector6_timer_cnt:8;
        u32 vector6_event_cnt:8;
        u32 vector7_timer_cnt:8;
        u32 vector7_event_cnt:8;
    } b;
} intv67_coalescing_cnts_t;

#define INTV8_COALESCING_CNTS                    0x00001990
#define   VECTOR8_EVENT_CNT_MASK                 0xff000000
#define   VECTOR8_EVENT_CNT_SHIFT                        24
#define   VECTOR8_TIMER_CNT_MASK                 0x00ff0000
#define   VECTOR8_TIMER_CNT_SHIFT                        16

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:16;
        u32 vector8_timer_cnt:8;
        u32 vector8_event_cnt:8;
    } b;
} intv8_coalescing_cnts_t;

#define ARBITRATION_CONTROL_STS                  0x00001a00
#define   CUR_ARBITRATION_STS_MASK               0x000f0000
#define   CUR_ARBITRATION_STS_SHIFT                      16
#define   CUR_SELECTED_SQ_ID_MASK                0x0000ff00
#define   CUR_SELECTED_SQ_ID_SHIFT                        8
#define   ARBITRATION_ONE_CMD_MASK               0x00000080
#define   ARBITRATION_ONE_CMD_SHIFT                       7
#define   ARBITRATION_BURST_MASK                 0x00000070
#define   ARBITRATION_BURST_SHIFT                         4
#define   ARBITRATION_MODE_MASK                  0x0000000c
#define   ARBITRATION_MODE_SHIFT                          2
#define   ARBITRATION_ENABLE_MASK                0x00000001
#define   ARBITRATION_ENABLE_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 arbitration_enable:1;
        u32 rsvd_1:1;
        u32 arbitration_mode:2;
        u32 arbitration_burst:3;
        u32 arbitration_one_cmd:1;
        u32 cur_selected_sq_id:8;
        u32 cur_arbitration_sts:4;
        u32 rsvd_20:12;
    } b;
} arbitration_control_sts_t;

#define ARB_PRIORITY_WEIGHT                      0x00001a04
#define   HIGH_PRIORITY_WEIGHT_MASK              0x00ff0000
#define   HIGH_PRIORITY_WEIGHT_SHIFT                     16
#define   MED_PRIORITY_WEIGHT_MASK               0x0000ff00
#define   MED_PRIORITY_WEIGHT_SHIFT                       8
#define   LOW_PRIORITY_WEIGHT_MASK               0x000000ff
#define   LOW_PRIORITY_WEIGHT_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 low_priority_weight:8;
        u32 med_priority_weight:8;
        u32 high_priority_weight:8;
        u32 rsvd_24:8;
    } b;
} arb_priority_weight_t;

#define ARB_PRIORITY_CREDIT                      0x00001a08
#define   CUR_H_PRIORITY_CREDIT_MASK             0x00ff0000
#define   CUR_H_PRIORITY_CREDIT_SHIFT                    16
#define   CUR_M_PRIORITY_CREDIT_MASK             0x0000ff00
#define   CUR_M_PRIORITY_CREDIT_SHIFT                     8
#define   CUR_L_PRIORITY_CREDIT_MASK             0x000000ff
#define   CUR_L_PRIORITY_CREDIT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 cur_l_priority_credit:8;
        u32 cur_m_priority_credit:8;
        u32 cur_h_priority_credit:8;
        u32 rsvd_24:8;
    } b;
} arb_priority_credit_t;

#define SQ_ARBITRATION_EN                        0x00001a10
#define   SQ8_ENABLE_MASK                        0x10000000
#define   SQ8_ENABLE_SHIFT                               28
#define   SQ7_ENABLE_MASK                        0x08000000
#define   SQ7_ENABLE_SHIFT                               27
#define   SQ6_ENABLE_MASK                        0x04000000
#define   SQ6_ENABLE_SHIFT                               26
#define   SQ5_ENABLE_MASK                        0x02000000
#define   SQ5_ENABLE_SHIFT                               25
#define   SQ4_ENABLE_MASK                        0x01000000
#define   SQ4_ENABLE_SHIFT                               24
#define   SQ3_ENABLE_MASK                        0x00800000
#define   SQ3_ENABLE_SHIFT                               23
#define   SQ2_ENABLE_MASK                        0x00400000
#define   SQ2_ENABLE_SHIFT                               22
#define   SQ1_ENABLE_MASK                        0x00200000
#define   SQ1_ENABLE_SHIFT                               21
#define   SQ0_ENABLE_MASK                        0x00100000
#define   SQ0_ENABLE_SHIFT                               20

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:20;
        u32 sq0_enable:1;
        u32 sq1_enable:1;
        u32 sq2_enable:1;
        u32 sq3_enable:1;
        u32 sq4_enable:1;
        u32 sq5_enable:1;
        u32 sq6_enable:1;
        u32 sq7_enable:1;
        u32 sq8_enable:1;
        u32 rsvd_29:3;
    } b;
} sq_arbitration_en_t;

#define ADMIN_QUEUE_BITMAP                       0x00001a30
#define   ADMIN_QUEUE_BITMAP_MASK                0x000001ff
#define   ADMIN_QUEUE_BITMAP_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 admin_queue_bitmap:9;
        u32 rsvd_9:23;
    } b;
} admin_queue_bitmap_t;

#define URGENT_QUEUE_BITMAP                      0x00001a38
#define   URGENT_QUEUE_BITMAP_MASK               0x000001ff
#define   URGENT_QUEUE_BITMAP_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 urgent_queue_bitmap:9;
        u32 rsvd_9:23;
    } b;
} urgent_queue_bitmap_t;

#define H_PRIORITY_QUE_BITMAP                    0x00001a40
#define   H_PRIORITY_QUE_BITMAP_MASK             0x01ff0000
#define   H_PRIORITY_QUE_BITMAP_SHIFT                    16

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:16;
        u32 h_priority_que_bitmap:9;
        u32 rsvd_25:7;
    } b;
} h_priority_que_bitmap_t;

#define M_PRIORITY_QUE_BITMAP                    0x00001a48
#define   M_PRIORITY_QUE_BITMAP_MASK             0x000001ff
#define   M_PRIORITY_QUE_BITMAP_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 m_priority_que_bitmap:9;
        u32 rsvd_9:23;
    } b;
} m_priority_que_bitmap_t;

#define L_PRIORITY_QUE_BITMAP                    0x00001a50
#define   L_PRIORITY_QUE_BITMAP_MASK             0x01ff0000
#define   L_PRIORITY_QUE_BITMAP_SHIFT                    16

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:16;
        u32 l_priority_que_bitmap:9;
        u32 rsvd_25:7;
    } b;
} l_priority_que_bitmap_t;

#define INT_CTRL_REG                             0x00001aa0
#define   INTERNAL_CONTROL_MASK                  0x001fffff
#define   INTERNAL_CONTROL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 internal_control:21;
        u32 rsvd_21:11;
    } b;
} int_ctrl_reg_t;

#define HW_SRAM_INIT                             0x00001ab0
#define   HW_SRAM_INIT_MASK                      0xffffffff
#define   HW_SRAM_INIT_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 hw_sram_init:32;
    } b;
} hw_sram_init_t;

#define IDR_ACCESS_DIS                           0x00001b00
#define   INTERNAL_CONTROL_1b00_MASK             0x00000001
#define   INTERNAL_CONTROL_1b00_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 internal_control_1b00:1;
        u32 rsvd_1:31;
    } b;
} idr_access_dis_t;

#define NVME_UNMASKED_INT_STATUS                 0x00002000
#define   CC_EN_STATUS_MASK                      0x80000000
#define   CC_EN_STATUS_SHIFT                             31
#define   ANY_FLR_ACTIVE_MASK                    0x20000000
#define   ANY_FLR_ACTIVE_SHIFT                           29
#define   ANY_VF_ADM_CMD_FETCHED_MASK            0x08000000
#define   ANY_VF_ADM_CMD_FETCHED_SHIFT                   27
#define   ANY_VF_CC_EN_SET_MASK                  0x04000000
#define   ANY_VF_CC_EN_SET_SHIFT                         26
#define   FW_CQ_ERR_MASK                         0x02000000
#define   FW_CQ_ERR_SHIFT                                25
#define   HW_SRAM_INIT_DONE_MASK                 0x01000000
#define   HW_SRAM_INIT_DONE_SHIFT                        24
#define   HW_CQ_BUF_EMPTY_NOT_MASK               0x00800000
#define   HW_CQ_BUF_EMPTY_NOT_SHIFT                      23
#define   AXI_BUS_PARITY_ERRS_MASK               0x00400000
#define   AXI_BUS_PARITY_ERRS_SHIFT                      22
#define   SRAM_PARITY_ERRS_MASK                  0x00200000
#define   SRAM_PARITY_ERRS_SHIFT                         21
#define   QUE_PTR_UPDATE_ERR_MASK                0x00100000
#define   QUE_PTR_UPDATE_ERR_SHIFT                       20
#define   HMB_RSP_QUEUE_FULL_MASK                0x00080000
#define   HMB_RSP_QUEUE_FULL_SHIFT                       19
#define   DMA_QUEUE_XFER_ERROR_MASK              0x00040000
#define   DMA_QUEUE_XFER_ERROR_SHIFT                     18
#define   NVM_CQ_SEND_ERROR_MASK                 0x00020000
#define   NVM_CQ_SEND_ERROR_SHIFT                        17
#define   NVM_CMD_FETCH_ERROR_MASK               0x00010000
#define   NVM_CMD_FETCH_ERROR_SHIFT                      16
#define   BOOT_PARTITION_READ_OP_MASK            0x00008000
#define   BOOT_PARTITION_READ_OP_SHIFT                   15
#define   FW_CQ_REQ_DONE_MASK                    0x00004000
#define   FW_CQ_REQ_DONE_SHIFT                           14
#define   FW_NTBL_ACCESS_DONE_MASK               0x00002000
#define   FW_NTBL_ACCESS_DONE_SHIFT                      13
#define   NTBL_AUTO_LKUP_DONE_MASK               0x00001000
#define   NTBL_AUTO_LKUP_DONE_SHIFT                      12
#define   DMA_QUEUE1_XFER_DONE_MASK              0x00000800
#define   DMA_QUEUE1_XFER_DONE_SHIFT                     11
#define   DMA_QUEUE0_XFER_DONE_MASK              0x00000400
#define   DMA_QUEUE0_XFER_DONE_SHIFT                     10
#define   NVM_CQ_SEND_DONE_MASK                  0x00000200
#define   NVM_CQ_SEND_DONE_SHIFT                          9
#define   NVM_CMD_FETCH_DONE_MASK                0x00000100
#define   NVM_CMD_FETCH_DONE_SHIFT                        8
#define   IO_CMD_FETCHED_MASK                    0x00000080
#define   IO_CMD_FETCHED_SHIFT                            7
#define   ADM_CMD_FETCHED_MASK                   0x00000040
#define   ADM_CMD_FETCHED_SHIFT                           6
#define   IO_SQ_TAIL_UPDT_MASK                   0x00000020
#define   IO_SQ_TAIL_UPDT_SHIFT                           5
#define   ADM_SQ_TAIL_UPDT_MASK                  0x00000010
#define   ADM_SQ_TAIL_UPDT_SHIFT                          4
#define   NSSR_MASK                              0x00000008
#define   NSSR_SHIFT                                      3
#define   CC_SHN_2000_MASK                       0x00000004
#define   CC_SHN_2000_SHIFT                               2
#define   CC_EN_CLEAR_MASK                       0x00000002
#define   CC_EN_CLEAR_SHIFT                               1
#define   CC_EN_SET_MASK                         0x00000001
#define   CC_EN_SET_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cc_en_set:1;
        u32 cc_en_clear:1;
        u32 cc_shn_2000:1;
        u32 nssr:1;
        u32 adm_sq_tail_updt:1;
        u32 io_sq_tail_updt:1;
        u32 adm_cmd_fetched:1;
        u32 io_cmd_fetched:1;
        u32 nvm_cmd_fetch_done:1;
        u32 nvm_cq_send_done:1;
        u32 dma_queue0_xfer_done:1;
        u32 dma_queue1_xfer_done:1;
        u32 ntbl_auto_lkup_done:1;
        u32 fw_ntbl_access_done:1;
        u32 fw_cq_req_done:1;
        u32 boot_partition_read_op:1;
        u32 nvm_cmd_fetch_error:1;
        u32 nvm_cq_send_error:1;
        u32 dma_queue_xfer_error:1;
        u32 hmb_rsp_queue_full:1;
        u32 que_ptr_update_err:1;
        u32 sram_parity_errs:1;
        u32 axi_bus_parity_errs:1;
        u32 hw_cq_buf_empty_not:1;
        u32 hw_sram_init_done:1;
        u32 fw_cq_err:1;
        u32 any_vf_cc_en_set:1;
        u32 any_vf_adm_cmd_fetched:1;
        u32 rsvd_28:1;
        u32 any_flr_active:1;
        u32 rsvd_30:1;
        u32 cc_en_status:1;
    } b;
} nvme_unmasked_int_status_t;

#define NVME_INT_MASK_CPU1                       0x00002004
#define   CC_EN_STATUS_MASK_CPU1_MASK            0x80000000
#define   CC_EN_STATUS_MASK_CPU1_SHIFT                   31
#define   NVME_INT_MASK_CPU1_MASK                0x7fffffff
#define   NVME_INT_MASK_CPU1_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nvme_int_mask_cpu1:31;
        u32 cc_en_status_mask_cpu1:1;
    } b;
} nvme_int_mask_cpu1_t;

#define NVME_MASKED_INT_STATUS_CPU1              0x00002008
#define   CC_EN_STATUS_CPU1_MASK                 0x80000000
#define   CC_EN_STATUS_CPU1_SHIFT                        31
#define   NVME_MASKED_INT_STATUS_CPU1_MASK       0x7fffffff
#define   NVME_MASKED_INT_STATUS_CPU1_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 nvme_masked_int_status_cpu1:31;
        u32 cc_en_status_cpu1:1;
    } b;
} nvme_masked_int_status_cpu1_t;

#define NVME_INT_MASK_CPU2                       0x0000200c
#define   CC_EN_STATUS_MASK_CPU2_MASK            0x80000000
#define   CC_EN_STATUS_MASK_CPU2_SHIFT                   31
#define   NVME_INT_MASK_CPU2_MASK                0x7fffffff
#define   NVME_INT_MASK_CPU2_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nvme_int_mask_cpu2:31;
        u32 cc_en_status_mask_cpu2:1;
    } b;
} nvme_int_mask_cpu2_t;

#define NVME_MASKED_INT_STATUS_CPU2              0x00002010
#define   CC_EN_STATUS_CPU2_MASK                 0x80000000
#define   CC_EN_STATUS_CPU2_SHIFT                        31
#define   NVME_MASKED_INT_STATUS_CPU2_MASK       0x7fffffff
#define   NVME_MASKED_INT_STATUS_CPU2_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 nvme_masked_int_status_cpu2:31;
        u32 cc_en_status_cpu2:1;
    } b;
} nvme_masked_int_status_cpu2_t;

#define NVME_CTRL_STATUS                         0x00002014
#define   AXI_MAS_XFER_STOP_MASK                 0x80000000
#define   AXI_MAS_XFER_STOP_SHIFT                        31
#define   AXI_MAS_XFER_DONE_MASK                 0x40000000
#define   AXI_MAS_XFER_DONE_SHIFT                        30
#define   NRM_MODE_IO_CMD_PENDING_MASK           0x00008000
#define   NRM_MODE_IO_CMD_PENDING_SHIFT                  15
#define   NRM_MODE_ADM_CMD_PENDING_MASK          0x00004000
#define   NRM_MODE_ADM_CMD_PENDING_SHIFT                 14
#define   IO_CMD_PENDING_MASK                    0x00002000
#define   IO_CMD_PENDING_SHIFT                           13
#define   ADM_CMD_PENDING_MASK                   0x00001000
#define   ADM_CMD_PENDING_SHIFT                          12
#define   DBL_NOT_IDLE_MASK                      0x00000800
#define   DBL_NOT_IDLE_SHIFT                             11
#define   DMA_NOT_IDLE_MASK                      0x00000400
#define   DMA_NOT_IDLE_SHIFT                             10
#define   HMB_NOT_IDLE_MASK                      0x00000200
#define   HMB_NOT_IDLE_SHIFT                              9
#define   CMD_PROC_NOT_IDLE_MASK                 0x00000100
#define   CMD_PROC_NOT_IDLE_SHIFT                         8
#define   NVME_OP_MODE_MASK                      0x00000070
#define   NVME_OP_MODE_SHIFT                              4
#define   IO_CMD_PUSH_EN_MASK                    0x00000008
#define   IO_CMD_PUSH_EN_SHIFT                            3
#define   PCIE_PAR_CHK_EN_MASK                   0x00000004
#define   PCIE_PAR_CHK_EN_SHIFT                           2
#define   IO_CMD_HW_FETCH_EN_MASK                0x00000002
#define   IO_CMD_HW_FETCH_EN_SHIFT                        1
#define   ADM_CMD_HW_FETCH_EN_MASK               0x00000001
#define   ADM_CMD_HW_FETCH_EN_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 adm_cmd_hw_fetch_en:1;
        u32 io_cmd_hw_fetch_en:1;
        u32 pcie_par_chk_en:1;
        u32 io_cmd_push_en:1;
        u32 nvme_op_mode:3;
        u32 rsvd_7:1;
        u32 cmd_proc_not_idle:1;
        u32 hmb_not_idle:1;
        u32 dma_not_idle:1;
        u32 dbl_not_idle:1;
        u32 adm_cmd_pending:1;
        u32 io_cmd_pending:1;
        u32 nrm_mode_adm_cmd_pending:1;
        u32 nrm_mode_io_cmd_pending:1;
        u32 rsvd_16:14;
        u32 axi_mas_xfer_done:1;
        u32 axi_mas_xfer_stop:1;
    } b;
} nvme_ctrl_status_t;

#define OUTSTANDING_SQ_BITMAP                    0x00002018
#define   OUTSTANDING_SQ_BITMAP_MASK             0x000001ff
#define   OUTSTANDING_SQ_BITMAP_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 outstanding_sq_bitmap:9;
        u32 rsvd_9:23;
    } b;
} outstanding_sq_bitmap_t;

#define NVME_AXI_INTERFACE_CTRL                  0x0000201c
#define   NVME_PCIE_MAX_2_RREQ_MASK              0x00000004
#define   NVME_PCIE_MAX_2_RREQ_SHIFT                      2
#define   NVME_PCIE_MAX_WR_128B_MASK             0x00000002
#define   NVME_PCIE_MAX_WR_128B_SHIFT                     1
#define   NVME_PCIE_MAX_RD_128B_MASK             0x00000001
#define   NVME_PCIE_MAX_RD_128B_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 nvme_pcie_max_rd_128b:1;
        u32 nvme_pcie_max_wr_128b:1;
        u32 nvme_pcie_max_2_rreq:1;
        u32 rsvd_3:29;
    } b;
} nvme_axi_interface_ctrl_t;

#define FW_CQ_REQS_CTRL_STS                      0x00002020
#define   FW_CQ_REQS_XFER_ACTIVE_MASK            0x00000002
#define   FW_CQ_REQS_XFER_ACTIVE_SHIFT                    1
#define   FW_CQ_REQS_XFER_EN_MASK                0x00000001
#define   FW_CQ_REQS_XFER_EN_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 fw_cq_reqs_xfer_en:1;
        u32 fw_cq_reqs_xfer_active:1;
        u32 rsvd_2:30;
    } b;
} fw_cq_reqs_ctrl_sts_t;

#define FW_CQ_REQS_SRAM_ADDR                     0x00002024
#define   ADDR_IS_FOR_DTCM_MASK                  0x00800000
#define   ADDR_IS_FOR_DTCM_SHIFT                         23
#define   FW_CQ_SRAM_ADDR_MASK                   0x007fffff
#define   FW_CQ_SRAM_ADDR_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 fw_cq_sram_addr:23;
        u32 addr_is_for_dtcm:1;
        u32 rsvd_24:8;
    } b;
} fw_cq_reqs_sram_addr_t;

#define FW_CQ_REQS_POINTERS                      0x00002028
#define   FW_CQ_REQS_RPTR_MASK                   0x0fff0000
#define   FW_CQ_REQS_RPTR_SHIFT                          16
#define   FW_CQ_REQS_WPTR_MASK                   0x00000fff
#define   FW_CQ_REQS_WPTR_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 fw_cq_reqs_wptr:12;
        u32 rsvd_12:4;
        u32 fw_cq_reqs_rptr:12;
        u32 rsvd_28:4;
    } b;
} fw_cq_reqs_pointers_t;

#define FW_CQ_REQS_SIZE                          0x0000202c
#define   FW_CQ_REQS_MAX_SZ_MASK                 0x00000fff
#define   FW_CQ_REQS_MAX_SZ_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 fw_cq_reqs_max_sz:12;
        u32 rsvd_12:20;
    } b;
} fw_cq_reqs_size_t;

#define SQ_POINTER_UPDT_ERRS                     0x00002030
#define   SQ_HEAD_UPDT_ERR_MASK                  0x01ff0000
#define   SQ_HEAD_UPDT_ERR_SHIFT                         16
#define   SQ_TAIL_UPDT_ERR_MASK                  0x000001ff
#define   SQ_TAIL_UPDT_ERR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 sq_tail_updt_err:9;
        u32 rsvd_9:7;
        u32 sq_head_updt_err:9;
        u32 rsvd_25:7;
    } b;
} sq_pointer_updt_errs_t;

#define CQ_POINTER_UPDT_ERRS                     0x00002034
#define   CQ_HEAD_UPDT_ERR_MASK                  0x01ff0000
#define   CQ_HEAD_UPDT_ERR_SHIFT                         16
#define   CQ_TAIL_UPDT_ERR_MASK                  0x000001ff
#define   CQ_TAIL_UPDT_ERR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cq_tail_updt_err:9;
        u32 rsvd_9:7;
        u32 cq_head_updt_err:9;
        u32 rsvd_25:7;
    } b;
} cq_pointer_updt_errs_t;

#define ERRANT_SQ_POINTERS                       0x00002038
#define   ERRANT_SQ_HEAD_MASK                    0x0fff0000
#define   ERRANT_SQ_HEAD_SHIFT                           16
#define   ERRANT_SQ_TAIL_MASK                    0x00000fff
#define   ERRANT_SQ_TAIL_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 errant_sq_tail:12;
        u32 rsvd_12:4;
        u32 errant_sq_head:12;
        u32 rsvd_28:4;
    } b;
} errant_sq_pointers_t;

#define ERRANT_CQ_POINTERS                       0x0000203c
#define   ERRANT_CQ_HEAD_MASK                    0x0fff0000
#define   ERRANT_CQ_HEAD_SHIFT                           16
#define   ERRANT_CQ_TAIL_MASK                    0x00000fff
#define   ERRANT_CQ_TAIL_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 errant_cq_tail:12;
        u32 rsvd_12:4;
        u32 errant_cq_head:12;
        u32 rsvd_28:4;
    } b;
} errant_cq_pointers_t;

#define NVME_MISC_ERRORS                         0x00002040
#define   QARB_ADM_WGHT_ERR_MASK                 0x00000800
#define   QARB_ADM_WGHT_ERR_SHIFT                        11
#define   QARB_ADM_BMAP_ERR_MASK                 0x00000400
#define   QARB_ADM_BMAP_ERR_SHIFT                        10
#define   RD_DMA_AXI_P_ERR_MASK                  0x00000200
#define   RD_DMA_AXI_P_ERR_SHIFT                          9
#define   DBL_ARADR_P_ERR_MASK                   0x00000100
#define   DBL_ARADR_P_ERR_SHIFT                           8
#define   DBL_WDATA_P_ERR_MASK                   0x00000080
#define   DBL_WDATA_P_ERR_SHIFT                           7
#define   DBL_AWADR_P_ERR_MASK                   0x00000040
#define   DBL_AWADR_P_ERR_SHIFT                           6
#define   DBL_ARLEN_ERROR_MASK                   0x00000020
#define   DBL_ARLEN_ERROR_SHIFT                           5
#define   DBL_AWLEN_ERROR_MASK                   0x00000010
#define   DBL_AWLEN_ERROR_SHIFT                           4
#define   DBL_SRAM_PARITY_ERR_MASK               0x00000008
#define   DBL_SRAM_PARITY_ERR_SHIFT                       3
#define   HMB_SRAM_PARITY_ERR_MASK               0x00000004
#define   HMB_SRAM_PARITY_ERR_SHIFT                       2
#define   RD_DMA_SRAM_P_ERR_MASK                 0x00000002
#define   RD_DMA_SRAM_P_ERR_SHIFT                         1
#define   WR_DMA_SRAM_P_ERR_MASK                 0x00000001
#define   WR_DMA_SRAM_P_ERR_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 wr_dma_sram_p_err:1;
        u32 rd_dma_sram_p_err:1;
        u32 hmb_sram_parity_err:1;
        u32 dbl_sram_parity_err:1;
        u32 dbl_awlen_error:1;
        u32 dbl_arlen_error:1;
        u32 dbl_awadr_p_err:1;
        u32 dbl_wdata_p_err:1;
        u32 dbl_aradr_p_err:1;
        u32 rd_dma_axi_p_err:1;
        u32 qarb_adm_bmap_err:1;
        u32 qarb_adm_wght_err:1;
        u32 rsvd_12:20;
    } b;
} nvme_misc_errors_t;

#define DBL_SRAM_P_ERR_ADDR                      0x00002044
#define   DBL_SRAM_P_ERR_ADDR_MASK               0x0000007f
#define   DBL_SRAM_P_ERR_ADDR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 dbl_sram_p_err_addr:7;
        u32 rsvd_7:25;
    } b;
} dbl_sram_p_err_addr_t;

#define DBL_SRAM_P_ERR_DATA                      0x00002048
#define   DBL_SRAM_P_ERR_DATA_MASK               0xffffffff
#define   DBL_SRAM_P_ERR_DATA_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 dbl_sram_p_err_data:32;
    } b;
} dbl_sram_p_err_data_t;

#define PCIE_ERRANT_AWLEN                        0x00002050
#define   PCIE_ERRANT_AWLEN_MASK                 0x0000000f
#define   PCIE_ERRANT_AWLEN_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 pcie_errant_awlen:4;
        u32 rsvd_4:28;
    } b;
} pcie_errant_awlen_t;

#define PCIE_ERRANT_AWLEN_ADDR                   0x00002054
#define   PCIE_ERRANT_AWLEN_ADDR_MASK            0xffffffff
#define   PCIE_ERRANT_AWLEN_ADDR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 pcie_errant_awlen_addr:32;
    } b;
} pcie_errant_awlen_addr_t;

#define PCIE_ERRANT_ARLEN                        0x00002058
#define   PCIE_ERRANT_ARLEN_MASK                 0x0000000f
#define   PCIE_ERRANT_ARLEN_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 pcie_errant_arlen:4;
        u32 rsvd_4:28;
    } b;
} pcie_errant_arlen_t;

#define PCIE_ERRANT_ARLEN_ADDR                   0x0000205c
#define   PCIE_ERRANT_ARLEN_ADDR_MASK            0xffffffff
#define   PCIE_ERRANT_ARLEN_ADDR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 pcie_errant_arlen_addr:32;
    } b;
} pcie_errant_arlen_addr_t;

#define PCIE_P_ERR_AWADR                         0x00002060
#define   PCIE_P_ERR_AWADR_MASK                  0xffffffff
#define   PCIE_P_ERR_AWADR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_p_err_awadr:32;
    } b;
} pcie_p_err_awadr_t;

#define PCIE_P_ERR_WDATA                         0x00002064
#define   PCIE_P_ERR_WDATA_MASK                  0xffffffff
#define   PCIE_P_ERR_WDATA_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_p_err_wdata:32;
    } b;
} pcie_p_err_wdata_t;

#define PCIE_P_ERR_ARADR                         0x00002068
#define   PCIE_P_ERR_ARADR_MASK                  0xffffffff
#define   PCIE_P_ERR_ARADR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_p_err_aradr:32;
    } b;
} pcie_p_err_aradr_t;

#define CMD_FETCH_ERR_BMAP                       0x0000206c
#define   CMD_FETCH_T_ERR_Q_MASK                 0x01ff0000
#define   CMD_FETCH_T_ERR_Q_SHIFT                        16
#define   CMD_FETCH_P_ERR_Q_MASK                 0x000001ff
#define   CMD_FETCH_P_ERR_Q_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cmd_fetch_p_err_q:9;
        u32 rsvd_9:7;
        u32 cmd_fetch_t_err_q:9;
        u32 rsvd_25:7;
    } b;
} cmd_fetch_err_bmap_t;

#define QUEUE_FULL_BITMAP                        0x00002070
#define   CQ_FULL_BITMAP_MASK                    0x01ff0000
#define   CQ_FULL_BITMAP_SHIFT                           16
#define   SQ_CQ_FULL_BITMAP_MASK                 0x000001ff
#define   SQ_CQ_FULL_BITMAP_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq_cq_full_bitmap:9;
        u32 rsvd_9:7;
        u32 cq_full_bitmap:9;
        u32 rsvd_25:7;
    } b;
} queue_full_bitmap_t;

#define FW_CQ_ERR_LOG                            0x00002074
#define   ERROR_SQ_ID_MASK                       0xffff0000
#define   ERROR_SQ_ID_SHIFT                              16
#define   ERROR_CID_MASK                         0x0000ffff
#define   ERROR_CID_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 error_cid:16;
        u32 error_sq_id:16;
    } b;
} fw_cq_err_log_t;

#define HW_CQ_BUF_CTRL_STS                       0x00002080
#define   HW_CQ_BUF_FULL_MASK                    0x80000000
#define   HW_CQ_BUF_FULL_SHIFT                           31
#define   FW_CQ_BUF_EN_MASK                      0x00000002
#define   FW_CQ_BUF_EN_SHIFT                              1
#define   HW_CQ_BUF_EN_MASK                      0x00000001
#define   HW_CQ_BUF_EN_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 hw_cq_buf_en:1;
        u32 fw_cq_buf_en:1;
        u32 rsvd_2:29;
        u32 hw_cq_buf_full:1;
    } b;
} hw_cq_buf_ctrl_sts_t;

#define HW_CQ_BUF_POINTERS                       0x00002084
#define   HW_CQ_BUF_RPTR_MASK                    0x000000f0
#define   HW_CQ_BUF_RPTR_SHIFT                            4
#define   HW_CQ_BUF_WPTR_MASK                    0x0000000f
#define   HW_CQ_BUF_WPTR_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 hw_cq_buf_wptr:4;
        u32 hw_cq_buf_rptr:4;
        u32 rsvd_8:24;
    } b;
} hw_cq_buf_pointers_t;

#define HW_CQ_BUF_CONTENT                        0x00002088
#define   HW_CQ_SQ_ID_MASK                       0x000f0000
#define   HW_CQ_SQ_ID_SHIFT                              16
#define   HW_CQ_CMD_ID_MASK                      0x0000ffff
#define   HW_CQ_CMD_ID_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 hw_cq_cmd_id:16;
        u32 hw_cq_sq_id:4;
        u32 rsvd_20:12;
    } b;
} hw_cq_buf_content_t;

#define HW_CQ_WAIT_TIME                          0x0000208c
#define   HW_CQ_WAIT_TIME_MASK                   0xffffffff
#define   HW_CQ_WAIT_TIME_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 hw_cq_wait_time:32;
    } b;
} hw_cq_wait_time_t;

#define CMPL_GEN_DBG_INFO                        0x00002090
#define   CMPL_GEN_DBG_INFO_MASK                 0xffffffff
#define   CMPL_GEN_DBG_INFO_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cmpl_gen_dbg_info:32;
    } b;
} cmpl_gen_dbg_info_t;

#define CMPL_GEN_DBG_CTRL                        0x00002094
#define   FW_CQ_SENT_RPTR_MASK                   0x00ff0000
#define   FW_CQ_SENT_RPTR_SHIFT                          16
#define   CMPL_GEN_FSM_LOG_EN_MASK               0x00000004
#define   CMPL_GEN_FSM_LOG_EN_SHIFT                       2
#define   CMPL_GEN_DBG_SEL_MASK                  0x00000003
#define   CMPL_GEN_DBG_SEL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cmpl_gen_dbg_sel:2;
        u32 cmpl_gen_fsm_log_en:1;
        u32 rsvd_3:13;
        u32 fw_cq_sent_rptr:8;
        u32 rsvd_24:8;
    } b;
} cmpl_gen_dbg_ctrl_t;

#define DBL_BLK_DBG_INFO                         0x00002098
#define   DBL_BLK_DBG_INFO_MASK                  0xffffffff
#define   DBL_BLK_DBG_INFO_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 dbl_blk_dbg_info:32;
    } b;
} dbl_blk_dbg_info_t;

#define CALSC_BASE_TIMER_THRH                    0x000020a0
#define   CALSC_BASE_TIMER_THRH_MASK             0x0000ffff
#define   CALSC_BASE_TIMER_THRH_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 calsc_base_timer_thrh:16;
        u32 rsvd_16:16;
    } b;
} calsc_base_timer_thrh_t;

#define MSIX_DISABLE_STS                         0x000020a8
#define   PF_MSIX_DISABLE_STS_MASK               0x00010000
#define   PF_MSIX_DISABLE_STS_SHIFT                      16
#define   VF_MSIX_DISABLE_STS_MASK               0x0000ffff
#define   VF_MSIX_DISABLE_STS_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 vf_msix_disable_sts:16;
        u32 pf_msix_disable_sts:1;
        u32 rsvd_17:15;
    } b;
} msix_disable_sts_t;

#define MSIX_ENABLE_STS                          0x000020ac
#define   PF_MSIX_ENABLE_STS_MASK                0x00010000
#define   PF_MSIX_ENABLE_STS_SHIFT                       16
#define   VF_MSIX_ENABLE_STS_MASK                0x0000ffff
#define   VF_MSIX_ENABLE_STS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 vf_msix_enable_sts:16;
        u32 pf_msix_enable_sts:1;
        u32 rsvd_17:15;
    } b;
} msix_enable_sts_t;

#define PCIE_LPBK_ENABLE                         0x000020b0
#define   PCIE_LPBK_BLOCK_EN_MASK                0x80000000
#define   PCIE_LPBK_BLOCK_EN_SHIFT                       31
#define   PCIE_LPBK_ENABLE_MASK                  0x00000001
#define   PCIE_LPBK_ENABLE_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_lpbk_enable:1;
        u32 rsvd_1:30;
        u32 pcie_lpbk_block_en:1;
    } b;
} pcie_lpbk_enable_t;

#define PCIE_LPBK_DATA_PATTERN                   0x000020b4
#define   PCIE_LPBK_DATA_PATTERN_MASK            0xffffffff
#define   PCIE_LPBK_DATA_PATTERN_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 pcie_lpbk_data_pattern:32;
    } b;
} pcie_lpbk_data_pattern_t;

#define PCIE_LPBK_ADDR_LOW                       0x000020b8
#define   PCIE_LPBK_ADDR_LOW_MASK                0xffffffff
#define   PCIE_LPBK_ADDR_LOW_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 pcie_lpbk_addr_low:32;
    } b;
} pcie_lpbk_addr_low_t;

#define PCIE_LPBK_ADDR_HIGH                      0x000020bc
#define   PCIE_LPBK_ADDR_HIGH_MASK               0xffffffff
#define   PCIE_LPBK_ADDR_HIGH_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 pcie_lpbk_addr_high:32;
    } b;
} pcie_lpbk_addr_high_t;

#define PCIE_LPBK_STATUS                         0x000020c0
#define   PCIE_LPBK_FAIL_MASK                    0x80000000
#define   PCIE_LPBK_FAIL_SHIFT                           31
#define   PCIE_LPBK_ON_MASK                      0x00010000
#define   PCIE_LPBK_ON_SHIFT                             16
#define   PCIE_LPBK_COUNT_MASK                   0x0000ffff
#define   PCIE_LPBK_COUNT_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 pcie_lpbk_count:16;
        u32 pcie_lpbk_on:1;
        u32 rsvd_17:14;
        u32 pcie_lpbk_fail:1;
    } b;
} pcie_lpbk_status_t;

#define EXP_ROM_SRAM_BASE                        0x000020c4
#define   EXP_ROM_ACCESS_EN_MASK                 0x80000000
#define   EXP_ROM_ACCESS_EN_SHIFT                        31
#define   EXP_ROM_SRAM_BASE_MASK                 0x007fffe0
#define   EXP_ROM_SRAM_BASE_SHIFT                         5

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:5;
        u32 exp_rom_sram_base:18;
        u32 rsvd_23:8;
        u32 exp_rom_access_en:1;
    } b;
} exp_rom_sram_base_t;

#define CLOCK_GATING_CONTROL                     0x000020c8
#define   CLK_GATE_MIN_IDLE_CNT_MASK             0x000f0000
#define   CLK_GATE_MIN_IDLE_CNT_SHIFT                    16
#define   MEM_TFPM_CYCLE_MASK                    0x0000fe00
#define   MEM_TFPM_CYCLE_SHIFT                            9
#define   MEM_LOWPOW_MODE_MASK                   0x00000100
#define   MEM_LOWPOW_MODE_SHIFT                           8
#define   MEM_LOWPOW_EN_MASK                     0x00000080
#define   MEM_LOWPOW_EN_SHIFT                             7
#define   DMA_CLK_GATE_EN_MASK                   0x00000004
#define   DMA_CLK_GATE_EN_SHIFT                           2
#define   DOORBELL_CLK_GATE_EN_MASK              0x00000002
#define   DOORBELL_CLK_GATE_EN_SHIFT                      1
#define   HMB_CLK_GATE_EN_MASK                   0x00000001
#define   HMB_CLK_GATE_EN_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 hmb_clk_gate_en:1;
        u32 doorbell_clk_gate_en:1;
        u32 dma_clk_gate_en:1;
        u32 rsvd_3:4;
        u32 mem_lowpow_en:1;
        u32 mem_lowpow_mode:1;
        u32 mem_tfpm_cycle:7;
        u32 clk_gate_min_idle_cnt:4;
        u32 rsvd_20:12;
    } b;
} clock_gating_control_t;

#define NVME_INT_MASK_CPU3                       0x000020d0
#define   CC_EN_STATUS_MASK_CPU3_MASK            0x80000000
#define   CC_EN_STATUS_MASK_CPU3_SHIFT                   31
#define   NVME_INT_MASK_CPU3_MASK                0x7fffffff
#define   NVME_INT_MASK_CPU3_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nvme_int_mask_cpu3:31;
        u32 cc_en_status_mask_cpu3:1;
    } b;
} nvme_int_mask_cpu3_t;

#define NVME_MASKED_INT_STATUS_CPU3              0x000020d4
#define   CC_EN_STATUS_CPU3_MASK                 0x80000000
#define   CC_EN_STATUS_CPU3_SHIFT                        31
#define   NVME_MASKED_INT_STATUS_CPU3_MASK       0x7fffffff
#define   NVME_MASKED_INT_STATUS_CPU3_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 nvme_masked_int_status_cpu3:31;
        u32 cc_en_status_cpu3:1;
    } b;
} nvme_masked_int_status_cpu3_t;

#define NVME_INT_MASK_CPU4                       0x000020d8
#define   CC_EN_STATUS_MASK_CPU4_MASK            0x80000000
#define   CC_EN_STATUS_MASK_CPU4_SHIFT                   31
#define   NVME_INT_MASK_CPU4_MASK                0x7fffffff
#define   NVME_INT_MASK_CPU4_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nvme_int_mask_cpu4:31;
        u32 cc_en_status_mask_cpu4:1;
    } b;
} nvme_int_mask_cpu4_t;

#define NVME_MASKED_INT_STATUS_CPU4              0x000020dc
#define   CC_EN_STATUS_CPU4_MASK                 0x80000000
#define   CC_EN_STATUS_CPU4_SHIFT                        31
#define   NVME_MASKED_INT_STATUS_CPU4_MASK       0x7fffffff
#define   NVME_MASKED_INT_STATUS_CPU4_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 nvme_masked_int_status_cpu4:31;
        u32 cc_en_status_cpu4:1;
    } b;
} nvme_masked_int_status_cpu4_t;

#define DBL_BUSY_TIME                            0x000020e8
#define   DBL_TIMER_EN_MASK                      0x80000000
#define   DBL_TIMER_EN_SHIFT                             31
#define   DBL_TIMER_CLK_RATE_MASK                0x70000000
#define   DBL_TIMER_CLK_RATE_SHIFT                       28
#define   INCLUDE_ADMIN_MASK                     0x01000000
#define   INCLUDE_ADMIN_SHIFT                            24
#define   DBL_TIMER_OVERFLOW_MASK                0x00800000
#define   DBL_TIMER_OVERFLOW_SHIFT                       23
#define   DBL_BUSY_TIME_MASK                     0x007fffff
#define   DBL_BUSY_TIME_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 dbl_busy_time:23;
        u32 dbl_timer_overflow:1;
        u32 include_admin:1;
        u32 rsvd_25:3;
        u32 dbl_timer_clk_rate:3;
        u32 dbl_timer_en:1;
    } b;
} dbl_busy_time_t;

#define OUTSTANDING_CMD_CNT                      0x000020ec
#define   OUTSTANDING_CMD_CNT_MASK               0xffffffff
#define   OUTSTANDING_CMD_CNT_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 outstanding_cmd_cnt:32;
    } b;
} outstanding_cmd_cnt_t;

#define SQ0_CMD_SRAM_BASE                        0x00002100
#define   ADM_CMD_FETCH_MAX_SZ_MASK              0xff000000
#define   ADM_CMD_FETCH_MAX_SZ_SHIFT                     24
#define   ADDR_IS_FOR_DTCM_2100_MASK             0x00800000
#define   ADDR_IS_FOR_DTCM_2100_SHIFT                    23
#define   ADM_CMD_SRAM_BASE_MASK                 0x007fffff
#define   ADM_CMD_SRAM_BASE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 adm_cmd_sram_base:23;
        u32 addr_is_for_dtcm_2100:1;
        u32 adm_cmd_fetch_max_sz:8;
    } b;
} sq0_cmd_sram_base_t;

#define SQ0_CMD_FETCH_PTRS                       0x00002104
#define   ADM_CMD_FETCH_RPTR_MASK                0x0000ff00
#define   ADM_CMD_FETCH_RPTR_SHIFT                        8
#define   ADM_CMD_FETCH_WPTR_MASK                0x000000ff
#define   ADM_CMD_FETCH_WPTR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 adm_cmd_fetch_wptr:8;
        u32 adm_cmd_fetch_rptr:8;
        u32 rsvd_16:16;
    } b;
} sq0_cmd_fetch_ptrs_t;

#define SQ1_CMD_SRAM_BASE                        0x00002108
#define   SQ1_CMD_FETCH_MAX_SZ_MASK              0xff000000
#define   SQ1_CMD_FETCH_MAX_SZ_SHIFT                     24
#define   ADDR_IS_FOR_DTCM_2108_MASK             0x00800000
#define   ADDR_IS_FOR_DTCM_2108_SHIFT                    23
#define   SQ1_CMD_SRAM_BASE_MASK                 0x007fffff
#define   SQ1_CMD_SRAM_BASE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq1_cmd_sram_base:23;
        u32 addr_is_for_dtcm_2108:1;
        u32 sq1_cmd_fetch_max_sz:8;
    } b;
} sq1_cmd_sram_base_t;

#define SQ1_CMD_FETCH_PTRS                       0x0000210c
#define   SQ1_CMD_FETCH_RPTR_MASK                0x0000ff00
#define   SQ1_CMD_FETCH_RPTR_SHIFT                        8
#define   SQ1_CMD_FETCH_WPTR_MASK                0x000000ff
#define   SQ1_CMD_FETCH_WPTR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 sq1_cmd_fetch_wptr:8;
        u32 sq1_cmd_fetch_rptr:8;
        u32 rsvd_16:16;
    } b;
} sq1_cmd_fetch_ptrs_t;

#define SQ2_CMD_SRAM_BASE                        0x00002110
#define   SQ2_CMD_FETCH_MAX_SZ_MASK              0xff000000
#define   SQ2_CMD_FETCH_MAX_SZ_SHIFT                     24
#define   ADDR_IS_FOR_DTCM_2110_MASK             0x00800000
#define   ADDR_IS_FOR_DTCM_2110_SHIFT                    23
#define   SQ2_CMD_SRAM_BASE_MASK                 0x007fffff
#define   SQ2_CMD_SRAM_BASE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq2_cmd_sram_base:23;
        u32 addr_is_for_dtcm_2110:1;
        u32 sq2_cmd_fetch_max_sz:8;
    } b;
} sq2_cmd_sram_base_t;

#define SQ2_CMD_FETCH_PTRS                       0x00002114
#define   SQ2_CMD_FETCH_RPTR_MASK                0x0000ff00
#define   SQ2_CMD_FETCH_RPTR_SHIFT                        8
#define   SQ2_CMD_FETCH_WPTR_MASK                0x000000ff
#define   SQ2_CMD_FETCH_WPTR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 sq2_cmd_fetch_wptr:8;
        u32 sq2_cmd_fetch_rptr:8;
        u32 rsvd_16:16;
    } b;
} sq2_cmd_fetch_ptrs_t;

#define SQ3_CMD_SRAM_BASE                        0x00002118
#define   SQ3_CMD_FETCH_MAX_SZ_MASK              0xff000000
#define   SQ3_CMD_FETCH_MAX_SZ_SHIFT                     24
#define   ADDR_IS_FOR_DTCM_2118_MASK             0x00800000
#define   ADDR_IS_FOR_DTCM_2118_SHIFT                    23
#define   SQ3_CMD_SRAM_BASE_MASK                 0x007fffff
#define   SQ3_CMD_SRAM_BASE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq3_cmd_sram_base:23;
        u32 addr_is_for_dtcm_2118:1;
        u32 sq3_cmd_fetch_max_sz:8;
    } b;
} sq3_cmd_sram_base_t;

#define SQ3_CMD_FETCH_PTRS                       0x0000211c
#define   SQ3_CMD_FETCH_RPTR_MASK                0x0000ff00
#define   SQ3_CMD_FETCH_RPTR_SHIFT                        8
#define   SQ3_CMD_FETCH_WPTR_MASK                0x000000ff
#define   SQ3_CMD_FETCH_WPTR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 sq3_cmd_fetch_wptr:8;
        u32 sq3_cmd_fetch_rptr:8;
        u32 rsvd_16:16;
    } b;
} sq3_cmd_fetch_ptrs_t;

#define SQ4_CMD_SRAM_BASE                        0x00002120
#define   SQ4_CMD_FETCH_MAX_SZ_MASK              0xff000000
#define   SQ4_CMD_FETCH_MAX_SZ_SHIFT                     24
#define   ADDR_IS_FOR_DTCM_2120_MASK             0x00800000
#define   ADDR_IS_FOR_DTCM_2120_SHIFT                    23
#define   SQ4_CMD_SRAM_BASE_MASK                 0x007fffff
#define   SQ4_CMD_SRAM_BASE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq4_cmd_sram_base:23;
        u32 addr_is_for_dtcm_2120:1;
        u32 sq4_cmd_fetch_max_sz:8;
    } b;
} sq4_cmd_sram_base_t;

#define SQ4_CMD_FETCH_PTRS                       0x00002124
#define   SQ4_CMD_FETCH_RPTR_MASK                0x0000ff00
#define   SQ4_CMD_FETCH_RPTR_SHIFT                        8
#define   SQ4_CMD_FETCH_WPTR_MASK                0x000000ff
#define   SQ4_CMD_FETCH_WPTR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 sq4_cmd_fetch_wptr:8;
        u32 sq4_cmd_fetch_rptr:8;
        u32 rsvd_16:16;
    } b;
} sq4_cmd_fetch_ptrs_t;

#define SQ5_CMD_SRAM_BASE                        0x00002128
#define   SQ5_CMD_FETCH_MAX_SZ_MASK              0xff000000
#define   SQ5_CMD_FETCH_MAX_SZ_SHIFT                     24
#define   ADDR_IS_FOR_DTCM_2128_MASK             0x00800000
#define   ADDR_IS_FOR_DTCM_2128_SHIFT                    23
#define   SQ5_CMD_SRAM_BASE_MASK                 0x007fffff
#define   SQ5_CMD_SRAM_BASE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq5_cmd_sram_base:23;
        u32 addr_is_for_dtcm_2128:1;
        u32 sq5_cmd_fetch_max_sz:8;
    } b;
} sq5_cmd_sram_base_t;

#define SQ5_CMD_FETCH_PTRS                       0x0000212c
#define   SQ5_CMD_FETCH_RPTR_MASK                0x0000ff00
#define   SQ5_CMD_FETCH_RPTR_SHIFT                        8
#define   SQ5_CMD_FETCH_WPTR_MASK                0x000000ff
#define   SQ5_CMD_FETCH_WPTR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 sq5_cmd_fetch_wptr:8;
        u32 sq5_cmd_fetch_rptr:8;
        u32 rsvd_16:16;
    } b;
} sq5_cmd_fetch_ptrs_t;

#define SQ6_CMD_SRAM_BASE                        0x00002130
#define   SQ6_CMD_FETCH_MAX_SZ_MASK              0xff000000
#define   SQ6_CMD_FETCH_MAX_SZ_SHIFT                     24
#define   ADDR_IS_FOR_DTCM_2130_MASK             0x00800000
#define   ADDR_IS_FOR_DTCM_2130_SHIFT                    23
#define   SQ6_CMD_SRAM_BASE_MASK                 0x007fffff
#define   SQ6_CMD_SRAM_BASE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq6_cmd_sram_base:23;
        u32 addr_is_for_dtcm_2130:1;
        u32 sq6_cmd_fetch_max_sz:8;
    } b;
} sq6_cmd_sram_base_t;

#define SQ6_CMD_FETCH_PTRS                       0x00002134
#define   SQ6_CMD_FETCH_RPTR_MASK                0x0000ff00
#define   SQ6_CMD_FETCH_RPTR_SHIFT                        8
#define   SQ6_CMD_FETCH_WPTR_MASK                0x000000ff
#define   SQ6_CMD_FETCH_WPTR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 sq6_cmd_fetch_wptr:8;
        u32 sq6_cmd_fetch_rptr:8;
        u32 rsvd_16:16;
    } b;
} sq6_cmd_fetch_ptrs_t;

#define SQ7_CMD_SRAM_BASE                        0x00002138
#define   SQ7_CMD_FETCH_MAX_SZ_MASK              0xff000000
#define   SQ7_CMD_FETCH_MAX_SZ_SHIFT                     24
#define   ADDR_IS_FOR_DTCM_2138_MASK             0x00800000
#define   ADDR_IS_FOR_DTCM_2138_SHIFT                    23
#define   SQ7_CMD_SRAM_BASE_MASK                 0x007fffff
#define   SQ7_CMD_SRAM_BASE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq7_cmd_sram_base:23;
        u32 addr_is_for_dtcm_2138:1;
        u32 sq7_cmd_fetch_max_sz:8;
    } b;
} sq7_cmd_sram_base_t;

#define SQ7_CMD_FETCH_PTRS                       0x0000213c
#define   SQ7_CMD_FETCH_RPTR_MASK                0x0000ff00
#define   SQ7_CMD_FETCH_RPTR_SHIFT                        8
#define   SQ7_CMD_FETCH_WPTR_MASK                0x000000ff
#define   SQ7_CMD_FETCH_WPTR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 sq7_cmd_fetch_wptr:8;
        u32 sq7_cmd_fetch_rptr:8;
        u32 rsvd_16:16;
    } b;
} sq7_cmd_fetch_ptrs_t;

#define SQ8_CMD_SRAM_BASE                        0x00002140
#define   SQ8_CMD_FETCH_MAX_SZ_MASK              0xff000000
#define   SQ8_CMD_FETCH_MAX_SZ_SHIFT                     24
#define   ADDR_IS_FOR_DTCM_2140_MASK             0x00800000
#define   ADDR_IS_FOR_DTCM_2140_SHIFT                    23
#define   SQ8_CMD_SRAM_BASE_MASK                 0x007fffff
#define   SQ8_CMD_SRAM_BASE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 sq8_cmd_sram_base:23;
        u32 addr_is_for_dtcm_2140:1;
        u32 sq8_cmd_fetch_max_sz:8;
    } b;
} sq8_cmd_sram_base_t;

#define SQ8_CMD_FETCH_PTRS                       0x00002144
#define   SQ8_CMD_FETCH_RPTR_MASK                0x0000ff00
#define   SQ8_CMD_FETCH_RPTR_SHIFT                        8
#define   SQ8_CMD_FETCH_WPTR_MASK                0x000000ff
#define   SQ8_CMD_FETCH_WPTR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 sq8_cmd_fetch_wptr:8;
        u32 sq8_cmd_fetch_rptr:8;
        u32 rsvd_16:16;
    } b;
} sq8_cmd_fetch_ptrs_t;

#define FETCHED_CMD_BITMAP                       0x00002148
#define   FETCHED_CMD_BITMAP_MASK                0x000001ff
#define   FETCHED_CMD_BITMAP_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 fetched_cmd_bitmap:9;
        u32 rsvd_9:23;
    } b;
} fetched_cmd_bitmap_t;

#define SQ_CMD_FETCH_ENABLE                      0x0000214c
#define   SQ_CMD_FETCH_ENABLE_MASK               0x000001ff
#define   SQ_CMD_FETCH_ENABLE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 sq_cmd_fetch_enable:9;
        u32 rsvd_9:23;
    } b;
} sq_cmd_fetch_enable_t;

#define DMA_QUEUE0_CTRL_STS                      0x000021a0
#define   DMA_QUEUE0_STS_MASK                    0x0000f000
#define   DMA_QUEUE0_STS_SHIFT                           12
#define   DMA_QUEUE0_ERROR_CODE_MASK             0x00000fc0
#define   DMA_QUEUE0_ERROR_CODE_SHIFT                     6
#define   DMA_QUEUE0_XFER_ERR_MASK               0x00000020
#define   DMA_QUEUE0_XFER_ERR_SHIFT                       5
#define   DMA_QUEUE0_ACTIVE_MASK                 0x00000010
#define   DMA_QUEUE0_ACTIVE_SHIFT                         4
#define   DR_DONE_WAIT_RAM_WDONE_MASK            0x00000004
#define   DR_DONE_WAIT_RAM_WDONE_SHIFT                    2
#define   DMA0_ACCESS_DTCM_EN_MASK               0x00000002
#define   DMA0_ACCESS_DTCM_EN_SHIFT                       1
#define   DMA_QUEUE0_ENABLE_MASK                 0x00000001
#define   DMA_QUEUE0_ENABLE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 dma_queue0_enable:1;
        u32 dma0_access_dtcm_en:1;
        u32 dr_done_wait_ram_wdone:1;
        u32 rsvd_3:1;
        u32 dma_queue0_active:1;
        u32 dma_queue0_xfer_err:1;
        u32 dma_queue0_error_code:6;
        u32 dma_queue0_sts:4;
        u32 rsvd_16:16;
    } b;
} dma_queue0_ctrl_sts_t;

#define DMA_QUEUE0_SRAM_BASE                     0x000021a4
#define   DMA_QUEUE0_MAX_SZ_MASK                 0xff000000
#define   DMA_QUEUE0_MAX_SZ_SHIFT                        24
#define   DMA_QUE0_IN_BTCM_MASK                  0x00800000
#define   DMA_QUE0_IN_BTCM_SHIFT                         23
#define   DMA_QUEUE0_SRAM_BASE_MASK              0x007fffff
#define   DMA_QUEUE0_SRAM_BASE_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 dma_queue0_sram_base:23;
        u32 dma_que0_in_btcm:1;
        u32 dma_queue0_max_sz:8;
    } b;
} dma_queue0_sram_base_t;

#define DMA_QUEUE0_POINTERS                      0x000021a8
#define   DMA_QUEUE0_RPTR_MASK                   0x0000ff00
#define   DMA_QUEUE0_RPTR_SHIFT                           8
#define   DMA_QUEUE0_WPTR_MASK                   0x000000ff
#define   DMA_QUEUE0_WPTR_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 dma_queue0_wptr:8;
        u32 dma_queue0_rptr:8;
        u32 rsvd_16:16;
    } b;
} dma_queue0_pointers_t;

#define DMA_QUEUE1_CTRL_STS                      0x000021b0
#define   DMA_QUEUE1_STS_MASK                    0x0000f000
#define   DMA_QUEUE1_STS_SHIFT                           12
#define   DMA_QUEUE1_ERROR_CODE_MASK             0x00000fc0
#define   DMA_QUEUE1_ERROR_CODE_SHIFT                     6
#define   DMA_QUEUE1_XFER_ERR_MASK               0x00000020
#define   DMA_QUEUE1_XFER_ERR_SHIFT                       5
#define   DMA_QUEUE1_ACTIVE_MASK                 0x00000010
#define   DMA_QUEUE1_ACTIVE_SHIFT                         4
#define   DR_DONE_WAIT_RAM_WDONE_21b0_MASK       0x00000004
#define   DR_DONE_WAIT_RAM_WDONE_21b0_SHIFT               2
#define   DMA1_ACCESS_DTCM_EN_MASK               0x00000002
#define   DMA1_ACCESS_DTCM_EN_SHIFT                       1
#define   DMA_QUEUE1_ENABLE_MASK                 0x00000001
#define   DMA_QUEUE1_ENABLE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 dma_queue1_enable:1;
        u32 dma1_access_dtcm_en:1;
        u32 dr_done_wait_ram_wdone_21b0:1;
        u32 rsvd_3:1;
        u32 dma_queue1_active:1;
        u32 dma_queue1_xfer_err:1;
        u32 dma_queue1_error_code:6;
        u32 dma_queue1_sts:4;
        u32 rsvd_16:16;
    } b;
} dma_queue1_ctrl_sts_t;

#define DMA_QUEUE1_SRAM_BASE                     0x000021b4
#define   DMA_QUEUE1_MAX_SZ_MASK                 0xff000000
#define   DMA_QUEUE1_MAX_SZ_SHIFT                        24
#define   DMA_QUE1_IN_BTCM_MASK                  0x00800000
#define   DMA_QUE1_IN_BTCM_SHIFT                         23
#define   DMA_QUEUE1_SRAM_BASE_MASK              0x007fffff
#define   DMA_QUEUE1_SRAM_BASE_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 dma_queue1_sram_base:23;
        u32 dma_que1_in_btcm:1;
        u32 dma_queue1_max_sz:8;
    } b;
} dma_queue1_sram_base_t;

#define DMA_QUEUE1_POINTERS                      0x000021b8
#define   DMA_QUEUE1_RPTR_MASK                   0x0000ff00
#define   DMA_QUEUE1_RPTR_SHIFT                           8
#define   DMA_QUEUE1_WPTR_MASK                   0x000000ff
#define   DMA_QUEUE1_WPTR_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 dma_queue1_wptr:8;
        u32 dma_queue1_rptr:8;
        u32 rsvd_16:16;
    } b;
} dma_queue1_pointers_t;

#define DMA_WRITE_ENGINE_STATES                  0x000021c0
#define   DMA_WRITE_ENGINE_STATES_MASK           0xffffffff
#define   DMA_WRITE_ENGINE_STATES_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 dma_write_engine_states:32;
    } b;
} dma_write_engine_states_t;

#define DMA_READ_ENGINE_STATES                   0x000021c4
#define   DMA_READ_ENGINE_STATES_MASK            0xffffffff
#define   DMA_READ_ENGINE_STATES_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 dma_read_engine_states:32;
    } b;
} dma_read_engine_states_t;

#define DMA_QUEUE_DETAIL_STATES                  0x000021c8
#define   DMA_QUEUE_STATES_MASK                  0xffffffff
#define   DMA_QUEUE_STATES_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 dma_queue_states:32;
    } b;
} dma_queue_detail_states_t;

#define DMA_MCTP_DW1                             0x000021d0
#define   MCTP_EP_MASK                           0x00400000
#define   MCTP_EP_SHIFT                                  22
#define   MCTP_TC_MASK                           0x00007000
#define   MCTP_TC_SHIFT                                  12
#define   MCTP_MSG_TYPE_MASK                     0x0000001f
#define   MCTP_MSG_TYPE_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 mctp_msg_type:5;
        u32 rsvd_5:7;
        u32 mctp_tc:3;
        u32 rsvd_15:7;
        u32 mctp_ep:1;
        u32 rsvd_23:9;
    } b;
} dma_mctp_dw1_t;

#define DMA_MCTP_DW2                             0x000021d4
#define   MCTP_MSG_CODE_MASK                     0xff000000
#define   MCTP_MSG_CODE_SHIFT                            24
#define   MCTP_TAG_FIELD_MASK                    0x003f0000
#define   MCTP_TAG_FIELD_SHIFT                           16

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:16;
        u32 mctp_tag_field:6;
        u32 rsvd_22:2;
        u32 mctp_msg_code:8;
    } b;
} dma_mctp_dw2_t;

#define DMA_MCTP_DW3                             0x000021d8
#define   MCTP_DW3_MASK                          0xffffffff
#define   MCTP_DW3_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 mctp_dw3:32;
    } b;
} dma_mctp_dw3_t;

#define DMA_MCTP_DW4                             0x000021dc
#define   MCTP_DW4_MASK                          0xffffffff
#define   MCTP_DW4_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 mctp_dw4:32;
    } b;
} dma_mctp_dw4_t;

#define HMB_NAND_TBL_CTRL                        0x00002200
#define   HMB_XID_UPDT_EN_MASK                   0x40000000
#define   HMB_XID_UPDT_EN_SHIFT                          30
#define   HMB_ENCRYPT_EN_MASK                    0x20000000
#define   HMB_ENCRYPT_EN_SHIFT                           29
#define   HMB_NTBL_CRC_EN_MASK                   0x10000000
#define   HMB_NTBL_CRC_EN_SHIFT                          28
#define   HMB_NTBL_TOTAL_SIZE_MASK               0x0fff0000
#define   HMB_NTBL_TOTAL_SIZE_SHIFT                      16
#define   HMB_NTBL_SEG_NUM_MASK                  0x00003ff0
#define   HMB_NTBL_SEG_NUM_SHIFT                          4
#define   NTBL_DATA_UNIT_SIZE_MASK               0x00000008
#define   NTBL_DATA_UNIT_SIZE_SHIFT                       3
#define   HOST_SECTOR_SIZE_MASK                  0x00000004
#define   HOST_SECTOR_SIZE_SHIFT                          2
#define   HMB_NTBL_SIZE_FETCH_DONE_MASK          0x00000002
#define   HMB_NTBL_SIZE_FETCH_DONE_SHIFT                  1
#define   HMB_NAND_TBL_ENABLE_MASK               0x00000001
#define   HMB_NAND_TBL_ENABLE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 hmb_nand_tbl_enable:1;
        u32 hmb_ntbl_size_fetch_done:1;
        u32 host_sector_size:1;
        u32 ntbl_data_unit_size:1;
        u32 hmb_ntbl_seg_num:10;
        u32 rsvd_14:2;
        u32 hmb_ntbl_total_size:12;
        u32 hmb_ntbl_crc_en:1;
        u32 hmb_encrypt_en:1;
        u32 hmb_xid_updt_en:1;
        u32 rsvd_31:1;
    } b;
} hmb_nand_tbl_ctrl_t;

#define HMB_NTBL_SADDR_SRAM_BASE                 0x00002204
#define   HMB_NTBL_SADDR_SRAM_BASE_MASK          0x007fffff
#define   HMB_NTBL_SADDR_SRAM_BASE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 hmb_ntbl_saddr_sram_base:23;
        u32 rsvd_23:9;
    } b;
} hmb_ntbl_saddr_sram_base_t;

#define HMB_NTBL_SSIZE_SRAM_BASE                 0x00002208
#define   HMB_NTBL_SSIZE_SRAM_BASE_MASK          0x007fffff
#define   HMB_NTBL_SSIZE_SRAM_BASE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 hmb_ntbl_ssize_sram_base:23;
        u32 rsvd_23:9;
    } b;
} hmb_ntbl_ssize_sram_base_t;

#define HMB_NTBL_META_CTRL                       0x0000220c
#define   HMB_NTBL_META_INI_CRC_MASK             0xffff0000
#define   HMB_NTBL_META_INI_CRC_SHIFT                    16
#define   HMB_META_CRC_EN_MASK                   0x00000001
#define   HMB_META_CRC_EN_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 hmb_meta_crc_en:1;
        u32 rsvd_1:15;
        u32 hmb_ntbl_meta_ini_crc:16;
    } b;
} hmb_ntbl_meta_ctrl_t;

#define HMB_NTBL_META_HADDR_LOW                  0x00002210
#define   HMB_NTBL_META_HADDR_LOW_MASK           0xffffffff
#define   HMB_NTBL_META_HADDR_LOW_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 hmb_ntbl_meta_haddr_low:32;
    } b;
} hmb_ntbl_meta_haddr_low_t;

#define HMB_NTBL_META_HADDR_HIGH                 0x00002214
#define   HMB_NTBL_META_HADDR_HIGH_MASK          0xffffffff
#define   HMB_NTBL_META_HADDR_HIGH_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 hmb_ntbl_meta_haddr_high:32;
    } b;
} hmb_ntbl_meta_haddr_high_t;

#define HMB_NTBL_CRC_HADDR_LOW                   0x00002218
#define   HMB_NTBL_CRC_HADDR_LOW_MASK            0xffffffff
#define   HMB_NTBL_CRC_HADDR_LOW_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 hmb_ntbl_crc_haddr_low:32;
    } b;
} hmb_ntbl_crc_haddr_low_t;

#define HMB_NTBL_CRC_HADDR_HIGH                  0x0000221c
#define   HMB_NTBL_CRC_HADDR_HIGH_MASK           0xffffffff
#define   HMB_NTBL_CRC_HADDR_HIGH_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 hmb_ntbl_crc_haddr_high:32;
    } b;
} hmb_ntbl_crc_haddr_high_t;

#define HMB_NTBL_AUTO_LKUP_CTRL_STS              0x00002220
#define   READ_CMD_NTBL_LKUP_EN_MASK             0x80000000
#define   READ_CMD_NTBL_LKUP_EN_SHIFT                    31
#define   PAR_WR_CMD_NTBL_LKUP_EN_MASK           0x40000000
#define   PAR_WR_CMD_NTBL_LKUP_EN_SHIFT                  30
#define   AUTO_LKUP_RSP0_DTCM_EN_MASK            0x20000000
#define   AUTO_LKUP_RSP0_DTCM_EN_SHIFT                   29
#define   AUTO_LKUP_PREFETCH_ENABLE_MASK         0x10000000
#define   AUTO_LKUP_PREFETCH_ENABLE_SHIFT                28
#define   MAX_PREFECTH_NPA_NUM_MASK              0x0f000000
#define   MAX_PREFECTH_NPA_NUM_SHIFT                     24
#define   AUTO_LKUP_MASK_EN_MASK                 0x00002000
#define   AUTO_LKUP_MASK_EN_SHIFT                        13
#define   AUTO_LKUP_RSP1_DTCM_EN_MASK            0x00001000
#define   AUTO_LKUP_RSP1_DTCM_EN_SHIFT                   12
#define   AUTO_LKUP_RSP1_FULL_MASK               0x00000800
#define   AUTO_LKUP_RSP1_FULL_SHIFT                      11
#define   AUTO_LKUP_CID_FULL_MASK                0x00000400
#define   AUTO_LKUP_CID_FULL_SHIFT                       10
#define   ALKUP_CMD_TAG_SEL_MASK                 0x00000300
#define   ALKUP_CMD_TAG_SEL_SHIFT                         8
#define   AUTO_LKUP_ERROR_CODE_MASK              0x000000f0
#define   AUTO_LKUP_ERROR_CODE_SHIFT                      4
#define   AUTO_LKUP_RSP0_FULL_MASK               0x00000008
#define   AUTO_LKUP_RSP0_FULL_SHIFT                       3
#define   AUTO_LKUP_ERROR_MASK                   0x00000004
#define   AUTO_LKUP_ERROR_SHIFT                           2
#define   CUR_LOOKUP_PROC_ACTIVE_MASK            0x00000002
#define   CUR_LOOKUP_PROC_ACTIVE_SHIFT                    1
#define   HMB_NTBL_AUTOLKUP_ENABLE_MASK          0x00000001
#define   HMB_NTBL_AUTOLKUP_ENABLE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 hmb_ntbl_autolkup_enable:1;
        u32 cur_lookup_proc_active:1;
        u32 auto_lkup_error:1;
        u32 auto_lkup_rsp0_full:1;
        u32 auto_lkup_error_code:4;
        u32 alkup_cmd_tag_sel:2;
        u32 auto_lkup_cid_full:1;
        u32 auto_lkup_rsp1_full:1;
        u32 auto_lkup_rsp1_dtcm_en:1;
        u32 auto_lkup_mask_en:1;
        u32 rsvd_14:10;
        u32 max_prefecth_npa_num:4;
        u32 auto_lkup_prefetch_enable:1;
        u32 auto_lkup_rsp0_dtcm_en:1;
        u32 par_wr_cmd_ntbl_lkup_en:1;
        u32 read_cmd_ntbl_lkup_en:1;
    } b;
} hmb_ntbl_auto_lkup_ctrl_sts_t;

#define HMB_NTBL_AUTO_LKUP_INFO                  0x00002224
#define   CUR_LOOKUP_CMD_ID_MASK                 0xffff0000
#define   CUR_LOOKUP_CMD_ID_SHIFT                        16
#define   CUR_LOOKUP_SQ_ID_MASK                  0x00000f00
#define   CUR_LOOKUP_SQ_ID_SHIFT                          8
#define   OUTSTANDING_LKUP_CMD_NO_MASK           0x000000ff
#define   OUTSTANDING_LKUP_CMD_NO_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 outstanding_lkup_cmd_no:8;
        u32 cur_lookup_sq_id:4;
        u32 rsvd_12:4;
        u32 cur_lookup_cmd_id:16;
    } b;
} hmb_ntbl_auto_lkup_info_t;

#define AUTO_LKUP_RES0_SRAM_BASE                 0x00002228
#define   AUTO_LKUP_RSP0_X_DTCM_MASK             0x00800000
#define   AUTO_LKUP_RSP0_X_DTCM_SHIFT                    23
#define   AUTO_LKUP_RSP0_SRAM_BASE_MASK          0x007fffff
#define   AUTO_LKUP_RSP0_SRAM_BASE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 auto_lkup_rsp0_sram_base:23;
        u32 auto_lkup_rsp0_x_dtcm:1;
        u32 rsvd_24:8;
    } b;
} auto_lkup_res0_sram_base_t;

#define AUTO_LKUP_RES0_MAX_SZ                    0x0000222c
#define   AUTO_LKUP_RSP0_MAX_SZ_MASK             0x00000fff
#define   AUTO_LKUP_RSP0_MAX_SZ_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 auto_lkup_rsp0_max_sz:12;
        u32 rsvd_12:20;
    } b;
} auto_lkup_res0_max_sz_t;

#define AUTO_LOOKUP_RES0_PTRS                    0x00002230
#define   ALKUP_RSP0_RPTR_MASK                   0x0fff0000
#define   ALKUP_RSP0_RPTR_SHIFT                          16
#define   ALKUP_RSP0_WPTR_MASK                   0x00000fff
#define   ALKUP_RSP0_WPTR_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 alkup_rsp0_wptr:12;
        u32 rsvd_12:4;
        u32 alkup_rsp0_rptr:12;
        u32 rsvd_28:4;
    } b;
} auto_lookup_res0_ptrs_t;

#define FW_NTBL_ACCESS_CTRL_STS                  0x00002234
#define   CUR_FW_NTBL_ACCESS_TAG_MASK            0xfffff000
#define   CUR_FW_NTBL_ACCESS_TAG_SHIFT                   12
#define   FW_NTBL_ACCESS_ERROR_CODE_MASK         0x00000f00
#define   FW_NTBL_ACCESS_ERROR_CODE_SHIFT                 8
#define   FW_NTBL_CMD_ERROR_MASK                 0x00000080
#define   FW_NTBL_CMD_ERROR_SHIFT                         7
#define   FW_NTBL_RSP1_FULL_MASK                 0x00000040
#define   FW_NTBL_RSP1_FULL_SHIFT                         6
#define   FW_NTBL_RSP0_FULL_MASK                 0x00000020
#define   FW_NTBL_RSP0_FULL_SHIFT                         5
#define   FW_NTBL_ACCESS_ACTIVE_MASK             0x00000010
#define   FW_NTBL_ACCESS_ACTIVE_SHIFT                     4
#define   FWHMB_RSP_MASK_EN_MASK                 0x00000008
#define   FWHMB_RSP_MASK_EN_SHIFT                         3
#define   FWHMB_RSP1_DTCM_EN_MASK                0x00000004
#define   FWHMB_RSP1_DTCM_EN_SHIFT                        2
#define   FWHMB_RSP0_DTCM_EN_MASK                0x00000002
#define   FWHMB_RSP0_DTCM_EN_SHIFT                        1
#define   FW_NTBL_ACCESS_EN_MASK                 0x00000001
#define   FW_NTBL_ACCESS_EN_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 fw_ntbl_access_en:1;
        u32 fwhmb_rsp0_dtcm_en:1;
        u32 fwhmb_rsp1_dtcm_en:1;
        u32 fwhmb_rsp_mask_en:1;
        u32 fw_ntbl_access_active:1;
        u32 fw_ntbl_rsp0_full:1;
        u32 fw_ntbl_rsp1_full:1;
        u32 fw_ntbl_cmd_error:1;
        u32 fw_ntbl_access_error_code:4;
        u32 cur_fw_ntbl_access_tag:20;
    } b;
} fw_ntbl_access_ctrl_sts_t;

#define FW_NTBL_ACCESS_REQ_SRAM_BASE             0x00002238
#define   FW_NTBL_ACCESS_REQ_IN_BTCM_MASK        0x00800000
#define   FW_NTBL_ACCESS_REQ_IN_BTCM_SHIFT               23
#define   FW_NTBL_ACCESS_REQ_SRAM_BASE_MASK      0x007fffff
#define   FW_NTBL_ACCESS_REQ_SRAM_BASE_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 fw_ntbl_access_req_sram_base:23;
        u32 fw_ntbl_access_req_in_btcm:1;
        u32 rsvd_24:8;
    } b;
} fw_ntbl_access_req_sram_base_t;

#define FW_NTBL_ACCESS_REQ_MAX_SZ                0x0000223c
#define   FW_NTBL_ACCESS_REQ_MAX_SZ_MASK         0x00000fff
#define   FW_NTBL_ACCESS_REQ_MAX_SZ_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 fw_ntbl_access_req_max_sz:12;
        u32 rsvd_12:20;
    } b;
} fw_ntbl_access_req_max_sz_t;

#define FW_NTBL_ACCESS_REQ_POINTERS              0x00002240
#define   FW_NTBL_ACCESS_REQ_RPTR_MASK           0x0fff0000
#define   FW_NTBL_ACCESS_REQ_RPTR_SHIFT                  16
#define   FW_NTBL_ACCESS_REQ_WPTR_MASK           0x00000fff
#define   FW_NTBL_ACCESS_REQ_WPTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 fw_ntbl_access_req_wptr:12;
        u32 rsvd_12:4;
        u32 fw_ntbl_access_req_rptr:12;
        u32 rsvd_28:4;
    } b;
} fw_ntbl_access_req_pointers_t;

#define FW_NTBL_ACCESS_RES0_SRAM_BASE            0x00002244
#define   FW_NTBL_ACCESS_RSP0_X_DTCM_MASK        0x00800000
#define   FW_NTBL_ACCESS_RSP0_X_DTCM_SHIFT               23
#define   FW_NTBL_ACCESS_RSP0_SRAM_BASE_MASK     0x007fffff
#define   FW_NTBL_ACCESS_RSP0_SRAM_BASE_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 fw_ntbl_access_rsp0_sram_base:23;
        u32 fw_ntbl_access_rsp0_x_dtcm:1;
        u32 rsvd_24:8;
    } b;
} fw_ntbl_access_res0_sram_base_t;

#define FW_NTBL_ACCESS_RES0_MAX_SZ               0x00002248
#define   FW_NTBL_ACCESS_RSP0_MAX_SZ_MASK        0x00000fff
#define   FW_NTBL_ACCESS_RSP0_MAX_SZ_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 fw_ntbl_access_rsp0_max_sz:12;
        u32 rsvd_12:20;
    } b;
} fw_ntbl_access_res0_max_sz_t;

#define FW_NTBL_ACCESS_RES0_POINTERS             0x0000224c
#define   FW_ACCESS_RSP0_RPTR_MASK               0x0fff0000
#define   FW_ACCESS_RSP0_RPTR_SHIFT                      16
#define   FW_ACCESS_RSP0_WPTR_MASK               0x00000fff
#define   FW_ACCESS_RSP0_WPTR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 fw_access_rsp0_wptr:12;
        u32 rsvd_12:4;
        u32 fw_access_rsp0_rptr:12;
        u32 rsvd_28:4;
    } b;
} fw_ntbl_access_res0_pointers_t;

#define HMB_NTBL_UPDT_TRANSACTION_ID             0x00002250
#define   HMB_NTBL_UPDT_TRANSACTION_ID_MASK      0xffffffff
#define   HMB_NTBL_UPDT_TRANSACTION_ID_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 hmb_ntbl_updt_transaction_id:32;
    } b;
} hmb_ntbl_updt_transaction_id_t;

#define HMB_DATA_ENCRYPTION_KEY0                 0x00002260
#define   HMB_DATA_ENCRYPTION_KEY0_MASK          0xffffffff
#define   HMB_DATA_ENCRYPTION_KEY0_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 hmb_data_encryption_key0:32;
    } b;
} hmb_data_encryption_key0_t;

#define HMB_DATA_ENCRYPTION_KEY1                 0x00002264
#define   HMB_DATA_ENCRYPTION_KEY1_MASK          0xffffffff
#define   HMB_DATA_ENCRYPTION_KEY1_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 hmb_data_encryption_key1:32;
    } b;
} hmb_data_encryption_key1_t;

#define HMB_DATA_ENCRYPTION_KEY2                 0x00002268
#define   HMB_DATA_ENCRYPTION_KEY2_MASK          0xffffffff
#define   HMB_DATA_ENCRYPTION_KEY2_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 hmb_data_encryption_key2:32;
    } b;
} hmb_data_encryption_key2_t;

#define HMB_DATA_ENCRYPTION_KEY3                 0x0000226c
#define   HMB_DATA_ENCRYPTION_KEY3_MASK          0xffffffff
#define   HMB_DATA_ENCRYPTION_KEY3_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 hmb_data_encryption_key3:32;
    } b;
} hmb_data_encryption_key3_t;

#define HMB_DATA_ENCRYPTION_KEY4                 0x00002270
#define   HMB_DATA_ENCRYPTION_KEY4_MASK          0xffffffff
#define   HMB_DATA_ENCRYPTION_KEY4_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 hmb_data_encryption_key4:32;
    } b;
} hmb_data_encryption_key4_t;

#define HMB_DATA_ENCRYPTION_KEY5                 0x00002274
#define   HMB_DATA_ENCRYPTION_KEY5_MASK          0xffffffff
#define   HMB_DATA_ENCRYPTION_KEY5_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 hmb_data_encryption_key5:32;
    } b;
} hmb_data_encryption_key5_t;

#define HMB_DATA_ENCRYPTION_KEY6                 0x00002278
#define   HMB_DATA_ENCRYPTION_KEY6_MASK          0xffffffff
#define   HMB_DATA_ENCRYPTION_KEY6_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 hmb_data_encryption_key6:32;
    } b;
} hmb_data_encryption_key6_t;

#define HMB_DATA_ENCRYPTION_KEY7                 0x0000227c
#define   HMB_DATA_ENCRYPTION_KEY7_MASK          0xffffffff
#define   HMB_DATA_ENCRYPTION_KEY7_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 hmb_data_encryption_key7:32;
    } b;
} hmb_data_encryption_key7_t;

#define HMB_INTER_STATUS_0                       0x00002280
#define   HMB_INTER_STATUS_0_MASK                0xffffffff
#define   HMB_INTER_STATUS_0_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 hmb_inter_status_0:32;
    } b;
} hmb_inter_status_0_t;

#define HMB_INTER_STATUS_1                       0x00002284
#define   HMB_INTER_STATUS_1_MASK                0xffffffff
#define   HMB_INTER_STATUS_1_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 hmb_inter_status_1:32;
    } b;
} hmb_inter_status_1_t;

#define HMB_INTER_STATUS_2                       0x00002288
#define   HMB_INTER_STATUS_2_MASK                0xffffffff
#define   HMB_INTER_STATUS_2_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 hmb_inter_status_2:32;
    } b;
} hmb_inter_status_2_t;

#define HMB_NTBL_NS_CTRL_STS                     0x00002290
#define   NS0_UNEXP_WAY_UPDT_MASK                0x80000000
#define   NS0_UNEXP_WAY_UPDT_SHIFT                       31
#define   NS0_UNEXP_LDA_SIZE_MASK                0x40000000
#define   NS0_UNEXP_LDA_SIZE_SHIFT                       30
#define   NS1_UNEXP_WAY_UPDT_MASK                0x20000000
#define   NS1_UNEXP_WAY_UPDT_SHIFT                       29
#define   NS1_UNEXP_LDA_SIZE_MASK                0x10000000
#define   NS1_UNEXP_LDA_SIZE_SHIFT                       28
#define   HMB_NS_OFFSET_MASK                     0x01ff0000
#define   HMB_NS_OFFSET_SHIFT                            16
#define   NS0_NONCACHE_MODE_MASK                 0x00000010
#define   NS0_NONCACHE_MODE_SHIFT                         4
#define   NS1_NTBL_DATA_UNIT_SIZE_MASK           0x00000008
#define   NS1_NTBL_DATA_UNIT_SIZE_SHIFT                   3
#define   NS1_HOST_SECTOR_SIZE_MASK              0x00000004
#define   NS1_HOST_SECTOR_SIZE_SHIFT                      2
#define   NS1_NONCACHE_MODE_MASK                 0x00000002
#define   NS1_NONCACHE_MODE_SHIFT                         1
#define   HMB_MULTI_NS_EN_MASK                   0x00000001
#define   HMB_MULTI_NS_EN_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 hmb_multi_ns_en:1;
        u32 ns1_noncache_mode:1;
        u32 ns1_host_sector_size:1;
        u32 ns1_ntbl_data_unit_size:1;
        u32 ns0_noncache_mode:1;
        u32 rsvd_5:11;
        u32 hmb_ns_offset:9;
        u32 rsvd_25:3;
        u32 ns1_unexp_lda_size:1;
        u32 ns1_unexp_way_updt:1;
        u32 ns0_unexp_lda_size:1;
        u32 ns0_unexp_way_updt:1;
    } b;
} hmb_ntbl_ns_ctrl_sts_t;

#define AUTO_LKUP_RES1_SRAM_BASE                 0x000022a0
#define   AUTO_LKUP_RSP1_X_DTCM_MASK             0x00800000
#define   AUTO_LKUP_RSP1_X_DTCM_SHIFT                    23
#define   AUTO_LKUP_RSP1_SRAM_BASE_MASK          0x007fffff
#define   AUTO_LKUP_RSP1_SRAM_BASE_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 auto_lkup_rsp1_sram_base:23;
        u32 auto_lkup_rsp1_x_dtcm:1;
        u32 rsvd_24:8;
    } b;
} auto_lkup_res1_sram_base_t;

#define AUTO_LKUP_RES1_MAX_SZ                    0x000022a4
#define   AUTO_LKUP_RSP1_MAX_SZ_MASK             0x00000fff
#define   AUTO_LKUP_RSP1_MAX_SZ_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 auto_lkup_rsp1_max_sz:12;
        u32 rsvd_12:20;
    } b;
} auto_lkup_res1_max_sz_t;

#define AUTO_LOOKUP_RES1_PTRS                    0x000022a8
#define   AUTO_LOOKUP_RSP1_RPTR_MASK             0x0fff0000
#define   AUTO_LOOKUP_RSP1_RPTR_SHIFT                    16
#define   AUTO_LOOKUP_RSP1_WPTR_MASK             0x00000fff
#define   AUTO_LOOKUP_RSP1_WPTR_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 auto_lookup_rsp1_wptr:12;
        u32 rsvd_12:4;
        u32 auto_lookup_rsp1_rptr:12;
        u32 rsvd_28:4;
    } b;
} auto_lookup_res1_ptrs_t;

#define FW_NTBL_ACCESS_RES1_SRAM_BASE            0x000022b0
#define   FW_NTBL_ACCESS_RSP1_X_DTCM_MASK        0x00800000
#define   FW_NTBL_ACCESS_RSP1_X_DTCM_SHIFT               23
#define   FW_NTBL_ACCESS_RSP1_SRAM_BASE_MASK     0x007fffff
#define   FW_NTBL_ACCESS_RSP1_SRAM_BASE_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 fw_ntbl_access_rsp1_sram_base:23;
        u32 fw_ntbl_access_rsp1_x_dtcm:1;
        u32 rsvd_24:8;
    } b;
} fw_ntbl_access_res1_sram_base_t;

#define FW_NTBL_ACCESS_RES1_MAX_SZ               0x000022b4
#define   FW_NTBL_ACCESS_RSP1_MAX_SZ_MASK        0x00000fff
#define   FW_NTBL_ACCESS_RSP1_MAX_SZ_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 fw_ntbl_access_rsp1_max_sz:12;
        u32 rsvd_12:20;
    } b;
} fw_ntbl_access_res1_max_sz_t;

#define FW_NTBL_ACCESS_RES1_POINTERS             0x000022b8
#define   FW_ACCESS_RSP1_RPTR_MASK               0x0fff0000
#define   FW_ACCESS_RSP1_RPTR_SHIFT                      16
#define   FW_ACCESS_RSP1_WPTR_MASK               0x00000fff
#define   FW_ACCESS_RSP1_WPTR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 fw_access_rsp1_wptr:12;
        u32 rsvd_12:4;
        u32 fw_access_rsp1_rptr:12;
        u32 rsvd_28:4;
    } b;
} fw_ntbl_access_res1_pointers_t;

#define CTRLR_DIS_CONTROL                        0x00002300
#define   NVME_CTRLR_DIS_BY_NSSR_EN_MASK         0x00000080
#define   NVME_CTRLR_DIS_BY_NSSR_EN_SHIFT                 7
#define   NVME_CTRLR_DIS_BY_SHN_EN_MASK          0x00000040
#define   NVME_CTRLR_DIS_BY_SHN_EN_SHIFT                  6
#define   NVME_CTRLR_DIS_BY_CCEN_CLR_EN_MASK     0x00000020
#define   NVME_CTRLR_DIS_BY_CCEN_CLR_EN_SHIFT             5
#define   NVME_CTRLR_DIS_BY_FLR_EN_MASK          0x00000010
#define   NVME_CTRLR_DIS_BY_FLR_EN_SHIFT                  4
#define   CTRLR_DIS_BY_NSSR_DIS_MASK             0x00000008
#define   CTRLR_DIS_BY_NSSR_DIS_SHIFT                     3
#define   CTRLR_DIS_BY_SHN_DIS_MASK              0x00000004
#define   CTRLR_DIS_BY_SHN_DIS_SHIFT                      2
#define   CTRLR_DIS_BY_CCEN_CLR_DIS_MASK         0x00000002
#define   CTRLR_DIS_BY_CCEN_CLR_DIS_SHIFT                 1
#define   CTRLR_DIS_BY_FLR_DIS_MASK              0x00000001
#define   CTRLR_DIS_BY_FLR_DIS_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 ctrlr_dis_by_flr_dis:1;
        u32 ctrlr_dis_by_ccen_clr_dis:1;
        u32 ctrlr_dis_by_shn_dis:1;
        u32 ctrlr_dis_by_nssr_dis:1;
        u32 nvme_ctrlr_dis_by_flr_en:1;
        u32 nvme_ctrlr_dis_by_ccen_clr_en:1;
        u32 nvme_ctrlr_dis_by_shn_en:1;
        u32 nvme_ctrlr_dis_by_nssr_en:1;
        u32 rsvd_8:24;
    } b;
} ctrlr_dis_control_t;

#define PF_CTRLR_DIS_ACT_DONE                    0x00002304
#define   PF_CONTROLLER_DISABLE_DONE_MASK        0x00010000
#define   PF_CONTROLLER_DISABLE_DONE_SHIFT               16
#define   PF_CONTROLLER_DISABLE_ACTIVE_MASK      0x00000001
#define   PF_CONTROLLER_DISABLE_ACTIVE_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 pf_controller_disable_active:1;
        u32 rsvd_1:15;
        u32 pf_controller_disable_done:1;
        u32 rsvd_17:15;
    } b;
} pf_ctrlr_dis_act_done_t;

#define VF_CTRLR_DIS_ACT                         0x00002308
#define   VF_CONTROLLER_DISABLE_ACTIVE_MASK      0xffffffff
#define   VF_CONTROLLER_DISABLE_ACTIVE_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 vf_controller_disable_active:32;
    } b;
} vf_ctrlr_dis_act_t;

#define VF_CTRLR_DIS_DONE                        0x0000230c
#define   VF_CONTROLLER_DISABLE_DONE_MASK        0xffffffff
#define   VF_CONTROLLER_DISABLE_DONE_SHIFT                0
typedef union {
    u32 all;
    struct {
        u32 vf_controller_disable_done:32;
    } b;
} vf_ctrlr_dis_done_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ controller_cap_low_t controller_cap_low;
    /* 0x0004 */ controller_cap_high_t controller_cap_high;
    /* 0x0008 */ nvme_version_t nvme_version;
    /* 0x000c */ int_mask_set_t int_mask_set;
    /* 0x0010 */ int_mask_clear_t int_mask_clear;
    /* 0x0014 */ controller_confg_t controller_confg;
    /* 0x0018 */ u32 rsvd_18;
    /* 0x001c */ controller_status_t controller_status;
    /* 0x0020 */ nvm_subsys_reset_t nvm_subsys_reset;
    /* 0x0024 */ adm_queue_attri_t adm_queue_attri;
    /* 0x0028 */ admin_sq_base_addr_l_t admin_sq_base_addr_l;
    /* 0x002c */ admin_sq_base_addr_h_t admin_sq_base_addr_h;
    /* 0x0030 */ admin_cq_base_addr_l_t admin_cq_base_addr_l;
    /* 0x0034 */ admin_cq_base_addr_h_t admin_cq_base_addr_h;
    /* 0x0038 */ u32 rsvd_38 [2];
    /* 0x0040 */ boot_part_info_t boot_part_info;
    /* 0x0044 */ boot_part_read_sel_t boot_part_read_sel;
    /* 0x0048 */ boot_part_mem_buf_loc_l_t boot_part_mem_buf_loc_l;
    /* 0x004c */ boot_part_mem_buf_loc_h_t boot_part_mem_buf_loc_h;
    /* 0x0050 */ u32 rsvd_50 [12];
    /* 0x0080 */ vs_idir_addr_t vs_idir_addr;
    /* 0x0084 */ vs_idir_data_t vs_idir_data;
    /* 0x0088 */ u32 rsvd_88 [990];
    /* 0x1000 */ sq0_db_reg_t sq0_db_reg;
    /* 0x1004 */ cq0_db_reg_t cq0_db_reg;
    /* 0x1008 */ sq1_db_reg_t sq1_db_reg;
    /* 0x100c */ cq1_db_reg_t cq1_db_reg;
    /* 0x1010 */ sq2_db_reg_t sq2_db_reg;
    /* 0x1014 */ cq2_db_reg_t cq2_db_reg;
    /* 0x1018 */ sq3_db_reg_t sq3_db_reg;
    /* 0x101c */ cq3_db_reg_t cq3_db_reg;
    /* 0x1020 */ sq4_db_reg_t sq4_db_reg;
    /* 0x1024 */ cq4_db_reg_t cq4_db_reg;
    /* 0x1028 */ sq5_db_reg_t sq5_db_reg;
    /* 0x102c */ cq5_db_reg_t cq5_db_reg;
    /* 0x1030 */ sq6_db_reg_t sq6_db_reg;
    /* 0x1034 */ cq6_db_reg_t cq6_db_reg;
    /* 0x1038 */ sq7_db_reg_t sq7_db_reg;
    /* 0x103c */ cq7_db_reg_t cq7_db_reg;
    /* 0x1040 */ sq8_db_reg_t sq8_db_reg;
    /* 0x1044 */ cq8_db_reg_t cq8_db_reg;
    /* 0x1048 */ u32 rsvd_1048 [239];
    /* 0x1404 */ sq_size_reg1_t sq_size_reg1;
    /* 0x1408 */ sq_size_reg2_t sq_size_reg2;
    /* 0x140c */ sq_size_reg3_t sq_size_reg3;
    /* 0x1410 */ sq_size_reg4_t sq_size_reg4;
    /* 0x1414 */ sq_size_reg5_t sq_size_reg5;
    /* 0x1418 */ sq_size_reg6_t sq_size_reg6;
    /* 0x141c */ sq_size_reg7_t sq_size_reg7;
    /* 0x1420 */ sq_size_reg8_t sq_size_reg8;
    /* 0x1424 */ u32 rsvd_1424 [56];
    /* 0x1504 */ cq_size_reg1_t cq_size_reg1;
    /* 0x1508 */ cq_size_reg2_t cq_size_reg2;
    /* 0x150c */ cq_size_reg3_t cq_size_reg3;
    /* 0x1510 */ cq_size_reg4_t cq_size_reg4;
    /* 0x1514 */ cq_size_reg5_t cq_size_reg5;
    /* 0x1518 */ cq_size_reg6_t cq_size_reg6;
    /* 0x151c */ cq_size_reg7_t cq_size_reg7;
    /* 0x1520 */ cq_size_reg8_t cq_size_reg8;
    /* 0x1524 */ u32 rsvd_1524 [87];
    /* 0x1680 */ msix_cq_map0_t msix_cq_map0;
    /* 0x1684 */ msix_cq_map1_t msix_cq_map1;
    /* 0x1688 */ msix_cq_map2_t msix_cq_map2;
    /* 0x168c */ u32 rsvd_168c [29];
    /* 0x1700 */ msix_mask_bit_t msix_mask_bit;
    /* 0x1704 */ u32 rsvd_1704 [3];
    /* 0x1710 */ msix_pba_bit_t msix_pba_bit;
    /* 0x1714 */ u32 rsvd_1714 [3];
    /* 0x1720 */ cq_interrupt_en_t cq_interrupt_en;
    /* 0x1724 */ u32 rsvd_1724 [7];
    /* 0x1740 */ int_coalescing_ctrl_t int_coalescing_ctrl;
    /* 0x1744 */ u32 rsvd_1744 [7];
    /* 0x1760 */ internal_int_status_t internal_int_status;
    /* 0x1764 */ u32 rsvd_1764 [39];
    /* 0x1800 */ sq1_h_base_addr_l_t sq1_h_base_addr_l;
    /* 0x1804 */ sq1_h_base_addr_h_t sq1_h_base_addr_h;
    /* 0x1808 */ sq2_h_base_addr_l_t sq2_h_base_addr_l;
    /* 0x180c */ sq2_h_base_addr_h_t sq2_h_base_addr_h;
    /* 0x1810 */ sq3_h_base_addr_l_t sq3_h_base_addr_l;
    /* 0x1814 */ sq3_h_base_addr_h_t sq3_h_base_addr_h;
    /* 0x1818 */ sq4_h_base_addr_l_t sq4_h_base_addr_l;
    /* 0x181c */ sq4_h_base_addr_h_t sq4_h_base_addr_h;
    /* 0x1820 */ sq5_h_base_addr_l_t sq5_h_base_addr_l;
    /* 0x1824 */ sq5_h_base_addr_h_t sq5_h_base_addr_h;
    /* 0x1828 */ sq6_h_base_addr_l_t sq6_h_base_addr_l;
    /* 0x182c */ sq6_h_base_addr_h_t sq6_h_base_addr_h;
    /* 0x1830 */ sq7_h_base_addr_l_t sq7_h_base_addr_l;
    /* 0x1834 */ sq7_h_base_addr_h_t sq7_h_base_addr_h;
    /* 0x1838 */ sq8_h_base_addr_l_t sq8_h_base_addr_l;
    /* 0x183c */ sq8_h_base_addr_h_t sq8_h_base_addr_h;
    /* 0x1840 */ cq1_h_base_addr_l_t cq1_h_base_addr_l;
    /* 0x1844 */ cq1_h_base_addr_h_t cq1_h_base_addr_h;
    /* 0x1848 */ cq2_h_base_addr_l_t cq2_h_base_addr_l;
    /* 0x184c */ cq2_h_base_addr_h_t cq2_h_base_addr_h;
    /* 0x1850 */ cq3_h_base_addr_l_t cq3_h_base_addr_l;
    /* 0x1854 */ cq3_h_base_addr_h_t cq3_h_base_addr_h;
    /* 0x1858 */ cq4_h_base_addr_l_t cq4_h_base_addr_l;
    /* 0x185c */ cq4_h_base_addr_h_t cq4_h_base_addr_h;
    /* 0x1860 */ cq5_h_base_addr_l_t cq5_h_base_addr_l;
    /* 0x1864 */ cq5_h_base_addr_h_t cq5_h_base_addr_h;
    /* 0x1868 */ cq6_h_base_addr_l_t cq6_h_base_addr_l;
    /* 0x186c */ cq6_h_base_addr_h_t cq6_h_base_addr_h;
    /* 0x1870 */ cq7_h_base_addr_l_t cq7_h_base_addr_l;
    /* 0x1874 */ cq7_h_base_addr_h_t cq7_h_base_addr_h;
    /* 0x1878 */ cq8_h_base_addr_l_t cq8_h_base_addr_l;
    /* 0x187c */ cq8_h_base_addr_h_t cq8_h_base_addr_h;
    /* 0x1880 */ mx_v0_h_base_addr_l_t mx_v0_h_base_addr_l;
    /* 0x1884 */ mx_v0_h_base_addr_h_t mx_v0_h_base_addr_h;
    /* 0x1888 */ msix_v0_message_t msix_v0_message;
    /* 0x188c */ u32 rsvd_188c;
    /* 0x1890 */ mx_v1_h_base_addr_l_t mx_v1_h_base_addr_l;
    /* 0x1894 */ mx_v1_h_base_addr_h_t mx_v1_h_base_addr_h;
    /* 0x1898 */ msix_v1_message_t msix_v1_message;
    /* 0x189c */ u32 rsvd_189c;
    /* 0x18a0 */ mx_v2_h_base_addr_l_t mx_v2_h_base_addr_l;
    /* 0x18a4 */ mx_v2_h_base_addr_h_t mx_v2_h_base_addr_h;
    /* 0x18a8 */ msix_v2_message_t msix_v2_message;
    /* 0x18ac */ u32 rsvd_18ac;
    /* 0x18b0 */ mx_v3_h_base_addr_l_t mx_v3_h_base_addr_l;
    /* 0x18b4 */ mx_v3_h_base_addr_h_t mx_v3_h_base_addr_h;
    /* 0x18b8 */ msix_v3_message_t msix_v3_message;
    /* 0x18bc */ u32 rsvd_18bc;
    /* 0x18c0 */ mx_v4_h_base_addr_l_t mx_v4_h_base_addr_l;
    /* 0x18c4 */ mx_v4_h_base_addr_h_t mx_v4_h_base_addr_h;
    /* 0x18c8 */ msix_v4_message_t msix_v4_message;
    /* 0x18cc */ u32 rsvd_18cc;
    /* 0x18d0 */ mx_v5_h_base_addr_l_t mx_v5_h_base_addr_l;
    /* 0x18d4 */ mx_v5_h_base_addr_h_t mx_v5_h_base_addr_h;
    /* 0x18d8 */ msix_v5_message_t msix_v5_message;
    /* 0x18dc */ u32 rsvd_18dc;
    /* 0x18e0 */ mx_v6_h_base_addr_l_t mx_v6_h_base_addr_l;
    /* 0x18e4 */ mx_v6_h_base_addr_h_t mx_v6_h_base_addr_h;
    /* 0x18e8 */ msix_v6_message_t msix_v6_message;
    /* 0x18ec */ u32 rsvd_18ec;
    /* 0x18f0 */ mx_v7_h_base_addr_l_t mx_v7_h_base_addr_l;
    /* 0x18f4 */ mx_v7_h_base_addr_h_t mx_v7_h_base_addr_h;
    /* 0x18f8 */ msix_v7_message_t msix_v7_message;
    /* 0x18fc */ u32 rsvd_18fc;
    /* 0x1900 */ mx_v8_h_base_addr_l_t mx_v8_h_base_addr_l;
    /* 0x1904 */ mx_v8_h_base_addr_h_t mx_v8_h_base_addr_h;
    /* 0x1908 */ msix_v8_message_t msix_v8_message;
    /* 0x190c */ u32 rsvd_190c [29];
    /* 0x1980 */ intv01_coalescing_cnts_t intv01_coalescing_cnts;
    /* 0x1984 */ intv23_coalescing_cnts_t intv23_coalescing_cnts;
    /* 0x1988 */ intv45_coalescing_cnts_t intv45_coalescing_cnts;
    /* 0x198c */ intv67_coalescing_cnts_t intv67_coalescing_cnts;
    /* 0x1990 */ intv8_coalescing_cnts_t intv8_coalescing_cnts;
    /* 0x1994 */ u32 rsvd_1994 [27];
    /* 0x1a00 */ arbitration_control_sts_t arbitration_control_sts;
    /* 0x1a04 */ arb_priority_weight_t arb_priority_weight;
    /* 0x1a08 */ arb_priority_credit_t arb_priority_credit;
    /* 0x1a0c */ u32 rsvd_1a0c;
    /* 0x1a10 */ sq_arbitration_en_t sq_arbitration_en;
    /* 0x1a14 */ u32 rsvd_1a14 [7];
    /* 0x1a30 */ admin_queue_bitmap_t admin_queue_bitmap;
    /* 0x1a34 */ u32 rsvd_1a34;
    /* 0x1a38 */ urgent_queue_bitmap_t urgent_queue_bitmap;
    /* 0x1a3c */ u32 rsvd_1a3c;
    /* 0x1a40 */ h_priority_que_bitmap_t h_priority_que_bitmap;
    /* 0x1a44 */ u32 rsvd_1a44;
    /* 0x1a48 */ m_priority_que_bitmap_t m_priority_que_bitmap;
    /* 0x1a4c */ u32 rsvd_1a4c;
    /* 0x1a50 */ l_priority_que_bitmap_t l_priority_que_bitmap;
    /* 0x1a54 */ u32 rsvd_1a54 [19];
    /* 0x1aa0 */ int_ctrl_reg_t int_ctrl_reg;
    /* 0x1aa4 */ u32 rsvd_1aa4 [3];
    /* 0x1ab0 */ hw_sram_init_t hw_sram_init;
    /* 0x1ab4 */ u32 rsvd_1ab4 [19];
    /* 0x1b00 */ idr_access_dis_t idr_access_dis;
    /* 0x1b04 */ u32 rsvd_1b04 [319];
    /* 0x2000 */ nvme_unmasked_int_status_t nvme_unmasked_int_status;
    /* 0x2004 */ nvme_int_mask_cpu1_t nvme_int_mask_cpu1;
    /* 0x2008 */ nvme_masked_int_status_cpu1_t nvme_masked_int_status_cpu1;
    /* 0x200c */ nvme_int_mask_cpu2_t nvme_int_mask_cpu2;
    /* 0x2010 */ nvme_masked_int_status_cpu2_t nvme_masked_int_status_cpu2;
    /* 0x2014 */ nvme_ctrl_status_t nvme_ctrl_status;
    /* 0x2018 */ outstanding_sq_bitmap_t outstanding_sq_bitmap;
    /* 0x201c */ nvme_axi_interface_ctrl_t nvme_axi_interface_ctrl;
    /* 0x2020 */ fw_cq_reqs_ctrl_sts_t fw_cq_reqs_ctrl_sts;
    /* 0x2024 */ fw_cq_reqs_sram_addr_t fw_cq_reqs_sram_addr;
    /* 0x2028 */ fw_cq_reqs_pointers_t fw_cq_reqs_pointers;
    /* 0x202c */ fw_cq_reqs_size_t fw_cq_reqs_size;
    /* 0x2030 */ sq_pointer_updt_errs_t sq_pointer_updt_errs;
    /* 0x2034 */ cq_pointer_updt_errs_t cq_pointer_updt_errs;
    /* 0x2038 */ errant_sq_pointers_t errant_sq_pointers;
    /* 0x203c */ errant_cq_pointers_t errant_cq_pointers;
    /* 0x2040 */ nvme_misc_errors_t nvme_misc_errors;
    /* 0x2044 */ dbl_sram_p_err_addr_t dbl_sram_p_err_addr;
    /* 0x2048 */ dbl_sram_p_err_data_t dbl_sram_p_err_data;
    /* 0x204c */ u32 rsvd_204c;
    /* 0x2050 */ pcie_errant_awlen_t pcie_errant_awlen;
    /* 0x2054 */ pcie_errant_awlen_addr_t pcie_errant_awlen_addr;
    /* 0x2058 */ pcie_errant_arlen_t pcie_errant_arlen;
    /* 0x205c */ pcie_errant_arlen_addr_t pcie_errant_arlen_addr;
    /* 0x2060 */ pcie_p_err_awadr_t pcie_p_err_awadr;
    /* 0x2064 */ pcie_p_err_wdata_t pcie_p_err_wdata;
    /* 0x2068 */ pcie_p_err_aradr_t pcie_p_err_aradr;
    /* 0x206c */ cmd_fetch_err_bmap_t cmd_fetch_err_bmap;
    /* 0x2070 */ queue_full_bitmap_t queue_full_bitmap;
    /* 0x2074 */ fw_cq_err_log_t fw_cq_err_log;
    /* 0x2078 */ u32 rsvd_2078 [2];
    /* 0x2080 */ hw_cq_buf_ctrl_sts_t hw_cq_buf_ctrl_sts;
    /* 0x2084 */ hw_cq_buf_pointers_t hw_cq_buf_pointers;
    /* 0x2088 */ hw_cq_buf_content_t hw_cq_buf_content;
    /* 0x208c */ hw_cq_wait_time_t hw_cq_wait_time;
    /* 0x2090 */ cmpl_gen_dbg_info_t cmpl_gen_dbg_info;
    /* 0x2094 */ cmpl_gen_dbg_ctrl_t cmpl_gen_dbg_ctrl;
    /* 0x2098 */ dbl_blk_dbg_info_t dbl_blk_dbg_info;
    /* 0x209c */ u32 rsvd_209c;
    /* 0x20a0 */ calsc_base_timer_thrh_t calsc_base_timer_thrh;
    /* 0x20a4 */ u32 rsvd_20a4;
    /* 0x20a8 */ msix_disable_sts_t msix_disable_sts;
    /* 0x20ac */ msix_enable_sts_t msix_enable_sts;
    /* 0x20b0 */ pcie_lpbk_enable_t pcie_lpbk_enable;
    /* 0x20b4 */ pcie_lpbk_data_pattern_t pcie_lpbk_data_pattern;
    /* 0x20b8 */ pcie_lpbk_addr_low_t pcie_lpbk_addr_low;
    /* 0x20bc */ pcie_lpbk_addr_high_t pcie_lpbk_addr_high;
    /* 0x20c0 */ pcie_lpbk_status_t pcie_lpbk_status;
    /* 0x20c4 */ exp_rom_sram_base_t exp_rom_sram_base;
    /* 0x20c8 */ clock_gating_control_t clock_gating_control;
    /* 0x20cc */ u32 rsvd_20cc;
    /* 0x20d0 */ nvme_int_mask_cpu3_t nvme_int_mask_cpu3;
    /* 0x20d4 */ nvme_masked_int_status_cpu3_t nvme_masked_int_status_cpu3;
    /* 0x20d8 */ nvme_int_mask_cpu4_t nvme_int_mask_cpu4;
    /* 0x20dc */ nvme_masked_int_status_cpu4_t nvme_masked_int_status_cpu4;
    /* 0x20e0 */ u32 rsvd_20e0 [2];
    /* 0x20e8 */ dbl_busy_time_t dbl_busy_time;
    /* 0x20ec */ outstanding_cmd_cnt_t outstanding_cmd_cnt;
    /* 0x20f0 */ u32 rsvd_20f0 [4];
    /* 0x2100 */ sq0_cmd_sram_base_t sq0_cmd_sram_base;
    /* 0x2104 */ sq0_cmd_fetch_ptrs_t sq0_cmd_fetch_ptrs;
    /* 0x2108 */ sq1_cmd_sram_base_t sq1_cmd_sram_base;
    /* 0x210c */ sq1_cmd_fetch_ptrs_t sq1_cmd_fetch_ptrs;
    /* 0x2110 */ sq2_cmd_sram_base_t sq2_cmd_sram_base;
    /* 0x2114 */ sq2_cmd_fetch_ptrs_t sq2_cmd_fetch_ptrs;
    /* 0x2118 */ sq3_cmd_sram_base_t sq3_cmd_sram_base;
    /* 0x211c */ sq3_cmd_fetch_ptrs_t sq3_cmd_fetch_ptrs;
    /* 0x2120 */ sq4_cmd_sram_base_t sq4_cmd_sram_base;
    /* 0x2124 */ sq4_cmd_fetch_ptrs_t sq4_cmd_fetch_ptrs;
    /* 0x2128 */ sq5_cmd_sram_base_t sq5_cmd_sram_base;
    /* 0x212c */ sq5_cmd_fetch_ptrs_t sq5_cmd_fetch_ptrs;
    /* 0x2130 */ sq6_cmd_sram_base_t sq6_cmd_sram_base;
    /* 0x2134 */ sq6_cmd_fetch_ptrs_t sq6_cmd_fetch_ptrs;
    /* 0x2138 */ sq7_cmd_sram_base_t sq7_cmd_sram_base;
    /* 0x213c */ sq7_cmd_fetch_ptrs_t sq7_cmd_fetch_ptrs;
    /* 0x2140 */ sq8_cmd_sram_base_t sq8_cmd_sram_base;
    /* 0x2144 */ sq8_cmd_fetch_ptrs_t sq8_cmd_fetch_ptrs;
    /* 0x2148 */ fetched_cmd_bitmap_t fetched_cmd_bitmap;
    /* 0x214c */ sq_cmd_fetch_enable_t sq_cmd_fetch_enable;
    /* 0x2150 */ u32 rsvd_2150 [20];
    /* 0x21a0 */ dma_queue0_ctrl_sts_t dma_queue0_ctrl_sts;
    /* 0x21a4 */ dma_queue0_sram_base_t dma_queue0_sram_base;
    /* 0x21a8 */ dma_queue0_pointers_t dma_queue0_pointers;
    /* 0x21ac */ u32 rsvd_21ac;
    /* 0x21b0 */ dma_queue1_ctrl_sts_t dma_queue1_ctrl_sts;
    /* 0x21b4 */ dma_queue1_sram_base_t dma_queue1_sram_base;
    /* 0x21b8 */ dma_queue1_pointers_t dma_queue1_pointers;
    /* 0x21bc */ u32 rsvd_21bc;
    /* 0x21c0 */ dma_write_engine_states_t dma_write_engine_states;
    /* 0x21c4 */ dma_read_engine_states_t dma_read_engine_states;
    /* 0x21c8 */ dma_queue_detail_states_t dma_queue_detail_states;
    /* 0x21cc */ u32 rsvd_21cc;
    /* 0x21d0 */ dma_mctp_dw1_t dma_mctp_dw1;
    /* 0x21d4 */ dma_mctp_dw2_t dma_mctp_dw2;
    /* 0x21d8 */ dma_mctp_dw3_t dma_mctp_dw3;
    /* 0x21dc */ dma_mctp_dw4_t dma_mctp_dw4;
    /* 0x21e0 */ u32 rsvd_21e0 [8];
    /* 0x2200 */ hmb_nand_tbl_ctrl_t hmb_nand_tbl_ctrl;
    /* 0x2204 */ hmb_ntbl_saddr_sram_base_t hmb_ntbl_saddr_sram_base;
    /* 0x2208 */ hmb_ntbl_ssize_sram_base_t hmb_ntbl_ssize_sram_base;
    /* 0x220c */ hmb_ntbl_meta_ctrl_t hmb_ntbl_meta_ctrl;
    /* 0x2210 */ hmb_ntbl_meta_haddr_low_t hmb_ntbl_meta_haddr_low;
    /* 0x2214 */ hmb_ntbl_meta_haddr_high_t hmb_ntbl_meta_haddr_high;
    /* 0x2218 */ hmb_ntbl_crc_haddr_low_t hmb_ntbl_crc_haddr_low;
    /* 0x221c */ hmb_ntbl_crc_haddr_high_t hmb_ntbl_crc_haddr_high;
    /* 0x2220 */ hmb_ntbl_auto_lkup_ctrl_sts_t hmb_ntbl_auto_lkup_ctrl_sts;
    /* 0x2224 */ hmb_ntbl_auto_lkup_info_t hmb_ntbl_auto_lkup_info;
    /* 0x2228 */ auto_lkup_res0_sram_base_t auto_lkup_res0_sram_base;
    /* 0x222c */ auto_lkup_res0_max_sz_t auto_lkup_res0_max_sz;
    /* 0x2230 */ auto_lookup_res0_ptrs_t auto_lookup_res0_ptrs;
    /* 0x2234 */ fw_ntbl_access_ctrl_sts_t fw_ntbl_access_ctrl_sts;
    /* 0x2238 */ fw_ntbl_access_req_sram_base_t fw_ntbl_access_req_sram_base;
    /* 0x223c */ fw_ntbl_access_req_max_sz_t fw_ntbl_access_req_max_sz;
    /* 0x2240 */ fw_ntbl_access_req_pointers_t fw_ntbl_access_req_pointers;
    /* 0x2244 */ fw_ntbl_access_res0_sram_base_t fw_ntbl_access_res0_sram_base;
    /* 0x2248 */ fw_ntbl_access_res0_max_sz_t fw_ntbl_access_res0_max_sz;
    /* 0x224c */ fw_ntbl_access_res0_pointers_t fw_ntbl_access_res0_pointers;
    /* 0x2250 */ hmb_ntbl_updt_transaction_id_t hmb_ntbl_updt_transaction_id;
    /* 0x2254 */ u32 rsvd_2254 [3];
    /* 0x2260 */ hmb_data_encryption_key0_t hmb_data_encryption_key0;
    /* 0x2264 */ hmb_data_encryption_key1_t hmb_data_encryption_key1;
    /* 0x2268 */ hmb_data_encryption_key2_t hmb_data_encryption_key2;
    /* 0x226c */ hmb_data_encryption_key3_t hmb_data_encryption_key3;
    /* 0x2270 */ hmb_data_encryption_key4_t hmb_data_encryption_key4;
    /* 0x2274 */ hmb_data_encryption_key5_t hmb_data_encryption_key5;
    /* 0x2278 */ hmb_data_encryption_key6_t hmb_data_encryption_key6;
    /* 0x227c */ hmb_data_encryption_key7_t hmb_data_encryption_key7;
    /* 0x2280 */ hmb_inter_status_0_t hmb_inter_status_0;
    /* 0x2284 */ hmb_inter_status_1_t hmb_inter_status_1;
    /* 0x2288 */ hmb_inter_status_2_t hmb_inter_status_2;
    /* 0x228c */ u32 rsvd_228c;
    /* 0x2290 */ hmb_ntbl_ns_ctrl_sts_t hmb_ntbl_ns_ctrl_sts;
    /* 0x2294 */ u32 rsvd_2294 [3];
    /* 0x22a0 */ auto_lkup_res1_sram_base_t auto_lkup_res1_sram_base;
    /* 0x22a4 */ auto_lkup_res1_max_sz_t auto_lkup_res1_max_sz;
    /* 0x22a8 */ auto_lookup_res1_ptrs_t auto_lookup_res1_ptrs;
    /* 0x22ac */ u32 rsvd_22ac;
    /* 0x22b0 */ fw_ntbl_access_res1_sram_base_t fw_ntbl_access_res1_sram_base;
    /* 0x22b4 */ fw_ntbl_access_res1_max_sz_t fw_ntbl_access_res1_max_sz;
    /* 0x22b8 */ fw_ntbl_access_res1_pointers_t fw_ntbl_access_res1_pointers;
    /* 0x22bc */ u32 rsvd_22bc [17];
    /* 0x2300 */ ctrlr_dis_control_t ctrlr_dis_control;
    /* 0x2304 */ pf_ctrlr_dis_act_done_t pf_ctrlr_dis_act_done;
    /* 0x2308 */ vf_ctrlr_dis_act_t vf_ctrlr_dis_act;
    /* 0x230c */ vf_ctrlr_dis_done_t vf_ctrlr_dis_done;
} pf_reg_regs_t;


#endif /* rev 0 */