//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _PORT_CTRL_H_
#define _PORT_CTRL_H_

#define UNMASK_ERR                               0x0000c200
#define   HMB_ERR_MASK                           0x00002000
#define   HMB_ERR_SHIFT                                  13
#define   DATA_CRC_ERROR_MASK                    0x00001000
#define   DATA_CRC_ERROR_SHIFT                           12
#define   DATA_ECC_ERR_MASK                      0x00000800
#define   DATA_ECC_ERR_SHIFT                             11
#define   PAR_ERR_MASK                           0x00000400
#define   PAR_ERR_SHIFT                                  10
#define   GUARD_ERR_MASK                         0x00000200
#define   GUARD_ERR_SHIFT                                 9
#define   LBAT_ERR_MASK                          0x00000100
#define   LBAT_ERR_SHIFT                                  8
#define   LBRT_ERR_MASK                          0x00000080
#define   LBRT_ERR_SHIFT                                  7
#define   SGL_SEG_INVALID_MASK                   0x00000040
#define   SGL_SEG_INVALID_SHIFT                           6
#define   SGL_NUM_INVALID_MASK                   0x00000020
#define   SGL_NUM_INVALID_SHIFT                           5
#define   PCIE_READ_TMOUT_MASK                   0x00000010
#define   PCIE_READ_TMOUT_SHIFT                           4
#define   DATA_SGL_LEN_INVALID_MASK              0x00000008
#define   DATA_SGL_LEN_INVALID_SHIFT                      3
#define   SGL_SUB_TYPE_INVALID_MASK              0x00000004
#define   SGL_SUB_TYPE_INVALID_SHIFT                      2
#define   SGL_DESC_TYPE_INVALID_MASK             0x00000002
#define   SGL_DESC_TYPE_INVALID_SHIFT                     1
#define   PRP_OFFSET_INVALID_MASK                0x00000001
#define   PRP_OFFSET_INVALID_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 prp_offset_invalid:1;
        u32 sgl_desc_type_invalid:1;
        u32 sgl_sub_type_invalid:1;
        u32 data_sgl_len_invalid:1;
        u32 pcie_read_tmout:1;
        u32 sgl_num_invalid:1;
        u32 sgl_seg_invalid:1;
        u32 lbrt_err:1;
        u32 lbat_err:1;
        u32 guard_err:1;
        u32 par_err:1;
        u32 data_ecc_err:1;
        u32 data_crc_error:1;
        u32 hmb_err:1;
        u32 rsvd_14:18;
    } b;
} unmask_err_t;

#define ERR_MASK                                 0x0000c204
#define   ERR_INT_MASK_MASK                      0x00003fff
#define   ERR_INT_MASK_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 err_int_mask:14;
        u32 rsvd_14:18;
    } b;
} err_mask_t;

#define MASK_ERR                                 0x0000c208
#define   MASKED_ERR_INT_MASK                    0x00003fff
#define   MASKED_ERR_INT_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 masked_err_int:14;
        u32 rsvd_14:18;
    } b;
} mask_err_t;

#define PORT_RESET_CTRL                          0x0000c214
#define   RESET_CMD_RCV_Q_MASK                   0x00000100
#define   RESET_CMD_RCV_Q_SHIFT                           8
#define   RESET_CMD_CMPL_Q_MASK                  0x00000080
#define   RESET_CMD_CMPL_Q_SHIFT                          7
#define   RESET_CMD_Q_MASK                       0x00000040
#define   RESET_CMD_Q_SHIFT                               6
#define   RESET_PPA_Q_MASK                       0x00000020
#define   RESET_PPA_Q_SHIFT                               5
#define   RESET_READ_DMA_MASK                    0x00000010
#define   RESET_READ_DMA_SHIFT                            4
#define   RESET_WRITE_DMA_MASK                   0x00000008
#define   RESET_WRITE_DMA_SHIFT                           3
#define   RESET_RD_PRP_MASK                      0x00000004
#define   RESET_RD_PRP_SHIFT                              2
#define   RESET_WR_PRP_MASK                      0x00000002
#define   RESET_WR_PRP_SHIFT                              1
#define   RESET_DATA_XFER_MASK                   0x00000001
#define   RESET_DATA_XFER_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 reset_data_xfer:1;
        u32 reset_wr_prp:1;
        u32 reset_rd_prp:1;
        u32 reset_write_dma:1;
        u32 reset_read_dma:1;
        u32 reset_ppa_q:1;
        u32 reset_cmd_q:1;
        u32 reset_cmd_cmpl_q:1;
        u32 reset_cmd_rcv_q:1;
        u32 rsvd_9:23;
    } b;
} port_reset_ctrl_t;

#define CMD_Q_BASE                               0x0000c218
#define   CMD_QUEUE_MAX_SZ_MASK                  0xff000000
#define   CMD_QUEUE_MAX_SZ_SHIFT                         24
#define   CMD_QUEUE_LOC_MASK                     0x00800000
#define   CMD_QUEUE_LOC_SHIFT                            23
#define   CMD_SRAM_BASE_ADDR_MASK                0x007fffff
#define   CMD_SRAM_BASE_ADDR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 cmd_sram_base_addr:23;
        u32 cmd_queue_loc:1;
        u32 cmd_queue_max_sz:8;
    } b;
} cmd_q_base_t;

#define CMD_Q_PTR                                0x0000c21c
#define   CMD_Q_RD_PTR_MASK                      0x00ff0000
#define   CMD_Q_RD_PTR_SHIFT                             16
#define   CMD_Q_WR_PTR_MASK                      0x000000ff
#define   CMD_Q_WR_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cmd_q_wr_ptr:8;
        u32 rsvd_8:8;
        u32 cmd_q_rd_ptr:8;
        u32 rsvd_24:8;
    } b;
} cmd_q_ptr_t;

#define CMD_RX_Q_BASE                            0x0000c220
#define   CMD_RX_Q_MAX_SZ_MASK                   0xff000000
#define   CMD_RX_Q_MAX_SZ_SHIFT                          24
#define   CMD_RX_Q_LOC_MASK                      0x00800000
#define   CMD_RX_Q_LOC_SHIFT                             23
#define   CMD_RX_Q_BASE_MASK                     0x007fffff
#define   CMD_RX_Q_BASE_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 cmd_rx_q_base:23;
        u32 cmd_rx_q_loc:1;
        u32 cmd_rx_q_max_sz:8;
    } b;
} cmd_rx_q_base_t;

#define CMD_RX_Q_BASE1                           0x0000c224
#define   CMD_RX_Q_LOC1_MASK                     0x00800000
#define   CMD_RX_Q_LOC1_SHIFT                            23
#define   CMD_RX_Q_BASE1_MASK                    0x007fffff
#define   CMD_RX_Q_BASE1_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 cmd_rx_q_base1:23;
        u32 cmd_rx_q_loc1:1;
        u32 rsvd_24:8;
    } b;
} cmd_rx_q_base1_t;

#define CMD_RX_Q_PTR                             0x0000c228
#define   CMD_RX_RD_PTR_MASK                     0x00ff0000
#define   CMD_RX_RD_PTR_SHIFT                            16
#define   CMD_RX_WR_PTR_MASK                     0x000000ff
#define   CMD_RX_WR_PTR_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 cmd_rx_wr_ptr:8;
        u32 rsvd_8:8;
        u32 cmd_rx_rd_ptr:8;
        u32 rsvd_24:8;
    } b;
} cmd_rx_q_ptr_t;

#define CMD_CMPL_Q_BASE                          0x0000c22c
#define   CMD_CMPL_MAX_SZ_MASK                   0xff000000
#define   CMD_CMPL_MAX_SZ_SHIFT                          24
#define   CMD_CMPL_Q_LOC_MASK                    0x00800000
#define   CMD_CMPL_Q_LOC_SHIFT                           23
#define   CMD_CMPL_Q_BASE_MASK                   0x007fffff
#define   CMD_CMPL_Q_BASE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cmd_cmpl_q_base:23;
        u32 cmd_cmpl_q_loc:1;
        u32 cmd_cmpl_max_sz:8;
    } b;
} cmd_cmpl_q_base_t;

#define CMD_CMPL_Q_PTR                           0x0000c230
#define   CMD_CMPL_RD_PTR_MASK                   0x00ff0000
#define   CMD_CMPL_RD_PTR_SHIFT                          16
#define   CMD_CMPL_WR_PTR_MASK                   0x000000ff
#define   CMD_CMPL_WR_PTR_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cmd_cmpl_wr_ptr:8;
        u32 rsvd_8:8;
        u32 cmd_cmpl_rd_ptr:8;
        u32 rsvd_24:8;
    } b;
} cmd_cmpl_q_ptr_t;

#define HOST_CTRL                                0x0000c234
#define   DU_SIZE_MASK                           0x00000020
#define   DU_SIZE_SHIFT                                   5
#define   MPS_MASK                               0x00000010
#define   MPS_SHIFT                                       4
#define   MAX_PAYLOAD_SZ_MASK                    0x0000000c
#define   MAX_PAYLOAD_SZ_SHIFT                            2
#define   PCIE_MAX_READ_SZ_MASK                  0x00000003
#define   PCIE_MAX_READ_SZ_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_max_read_sz:2;
        u32 max_payload_sz:2;
        u32 mps:1;
        u32 du_size:1;
        u32 rsvd_6:26;
    } b;
} host_ctrl_t;

#define ABORT_XFER                               0x0000c238
#define   WRITE_HMB_PCIE_IDLE_MASK               0x00004000
#define   WRITE_HMB_PCIE_IDLE_SHIFT                      14
#define   READ_HMB_PCIE_IDLE_MASK                0x00002000
#define   READ_HMB_PCIE_IDLE_SHIFT                       13
#define   WRITE_HMB_IDLE_MASK                    0x00001000
#define   WRITE_HMB_IDLE_SHIFT                           12
#define   READ_HMB_IDLE_MASK                     0x00000800
#define   READ_HMB_IDLE_SHIFT                            11
#define   WRITE_DMA_PCIE_IDLE_MASK               0x00000400
#define   WRITE_DMA_PCIE_IDLE_SHIFT                      10
#define   READ_DMA_PCIE_IDLE_MASK                0x00000200
#define   READ_DMA_PCIE_IDLE_SHIFT                        9
#define   WRITE_DMA_IDLE_MASK                    0x00000100
#define   WRITE_DMA_IDLE_SHIFT                            8
#define   READ_DMA_IDLE_MASK                     0x00000080
#define   READ_DMA_IDLE_SHIFT                             7
#define   WRITE_PRP_IDLE_MASK                    0x00000040
#define   WRITE_PRP_IDLE_SHIFT                            6
#define   DATA_XFER_PCIE_IDLE_MASK               0x00000020
#define   DATA_XFER_PCIE_IDLE_SHIFT                       5
#define   DATA_XFER_IDLE_MASK                    0x00000010
#define   DATA_XFER_IDLE_SHIFT                            4
#define   ABORT_PCIE_WR_MASK                     0x00000004
#define   ABORT_PCIE_WR_SHIFT                             2
#define   ABORT_READ_DMA_MASK                    0x00000002
#define   ABORT_READ_DMA_SHIFT                            1
#define   ABORT_WRITE_DMA_MASK                   0x00000001
#define   ABORT_WRITE_DMA_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 abort_write_dma:1;
        u32 abort_read_dma:1;
        u32 abort_pcie_wr:1;
        u32 rsvd_3:1;
        u32 data_xfer_idle:1;
        u32 data_xfer_pcie_idle:1;
        u32 write_prp_idle:1;
        u32 read_dma_idle:1;
        u32 write_dma_idle:1;
        u32 read_dma_pcie_idle:1;
        u32 write_dma_pcie_idle:1;
        u32 read_hmb_idle:1;
        u32 write_hmb_idle:1;
        u32 read_hmb_pcie_idle:1;
        u32 write_hmb_pcie_idle:1;
        u32 rsvd_15:17;
    } b;
} abort_xfer_t;

#define PPA_Q_BASE                               0x0000c240
#define   PPA_Q_LOC_MASK                         0x00800000
#define   PPA_Q_LOC_SHIFT                                23
#define   PPA_Q_BASE_MASK                        0x007fffff
#define   PPA_Q_BASE_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 ppa_q_base:23;
        u32 ppa_q_loc:1;
        u32 rsvd_24:8;
    } b;
} ppa_q_base_t;

#define PPA_Q_SIZE                               0x0000c244
#define   PPA_Q_MAX_SZ_MASK                      0x00000fff
#define   PPA_Q_MAX_SZ_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 ppa_q_max_sz:12;
        u32 rsvd_12:20;
    } b;
} ppa_q_size_t;

#define PPA_Q_PTR                                0x0000c248
#define   PPA_Q_RD_PTR_MASK                      0x0fff0000
#define   PPA_Q_RD_PTR_SHIFT                             16
#define   PPA_Q_WR_PTR_MASK                      0x00000fff
#define   PPA_Q_WR_PTR_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 ppa_q_wr_ptr:12;
        u32 rsvd_12:4;
        u32 ppa_q_rd_ptr:12;
        u32 rsvd_28:4;
    } b;
} ppa_q_ptr_t;

#define HMB_TBL_CTRL                             0x0000c250
#define   HMB_SCRAMBLE_EN_MASK                   0x00002000
#define   HMB_SCRAMBLE_EN_SHIFT                          13
#define   HMB_HCRC_EN_MASK                       0x00001000
#define   HMB_HCRC_EN_SHIFT                              12
#define   HMB_DU_CRC_EN_MASK                     0x00000800
#define   HMB_DU_CRC_EN_SHIFT                            11
#define   HMB_ECC_EN_MASK                        0x00000400
#define   HMB_ECC_EN_SHIFT                               10
#define   HMB_SEG_NUM_MASK                       0x000003f8
#define   HMB_SEG_NUM_SHIFT                               3
#define   HMB_TBL_FETCH_DONE_MASK                0x00000002
#define   HMB_TBL_FETCH_DONE_SHIFT                        1
#define   HMB_TBL_FETCH_EN_MASK                  0x00000001
#define   HMB_TBL_FETCH_EN_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 hmb_tbl_fetch_en:1;
        u32 hmb_tbl_fetch_done:1;
        u32 rsvd_2:1;
        u32 hmb_seg_num:7;
        u32 hmb_ecc_en:1;
        u32 hmb_du_crc_en:1;
        u32 hmb_hcrc_en:1;
        u32 hmb_scramble_en:1;
        u32 rsvd_14:18;
    } b;
} hmb_tbl_ctrl_t;

#define HMB_SEG_ADDR_BASE                        0x0000c254
#define   HMB_SEG_ADDR_LOC_MASK                  0x00800000
#define   HMB_SEG_ADDR_LOC_SHIFT                         23
#define   HMB_SEG_ADDR_BASE_MASK                 0x007fffff
#define   HMB_SEG_ADDR_BASE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 hmb_seg_addr_base:23;
        u32 hmb_seg_addr_loc:1;
        u32 rsvd_24:8;
    } b;
} hmb_seg_addr_base_t;

#define HMB_SEG_SIZE_BASE                        0x0000c258
#define   HMB_SEG_SIZE_LOC_MASK                  0x00800000
#define   HMB_SEG_SIZE_LOC_SHIFT                         23
#define   HMB_SEG_SIZE_BASE_MASK                 0x007fffff
#define   HMB_SEG_SIZE_BASE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 hmb_seg_size_base:23;
        u32 hmb_seg_size_loc:1;
        u32 rsvd_24:8;
    } b;
} hmb_seg_size_base_t;

#define HMB_META_BASE_L                          0x0000c25c
#define   HMB_META_BASE_L_MASK                   0xffffffff
#define   HMB_META_BASE_L_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 hmb_meta_base_l:32;
    } b;
} hmb_meta_base_l_t;

#define HMB_META_BASE_H                          0x0000c260
#define   HMB_META_BASE_H_MASK                   0xffffffff
#define   HMB_META_BASE_H_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 hmb_meta_base_h:32;
    } b;
} hmb_meta_base_h_t;

#define HMB_ECC_BASE_L                           0x0000c264
#define   HMB_ECC_BASE_L_MASK                    0xffffffff
#define   HMB_ECC_BASE_L_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 hmb_ecc_base_l:32;
    } b;
} hmb_ecc_base_l_t;

#define HMB_ECC_BASE_H                           0x0000c268
#define   HMB_ECC_BASE_H_MASK                    0xffffffff
#define   HMB_ECC_BASE_H_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 hmb_ecc_base_h:32;
    } b;
} hmb_ecc_base_h_t;

#define HMB_ERR_STTS                             0x0000c26c
#define   HMB_DATA_BUF_ERR_MASK                  0x00000400
#define   HMB_DATA_BUF_ERR_SHIFT                         10
#define   HMB_PCIE_PAR_ERR_MASK                  0x00000200
#define   HMB_PCIE_PAR_ERR_SHIFT                          9
#define   HMB_PCIE_TMOUT_MASK                    0x00000100
#define   HMB_PCIE_TMOUT_SHIFT                            8
#define   HMB_PI_DATA_POISON_MASK                0x00000080
#define   HMB_PI_DATA_POISON_SHIFT                        7
#define   HMB_HCRC_DATA_POISON_MASK              0x00000040
#define   HMB_HCRC_DATA_POISON_SHIFT                      6
#define   HMB_ECC_DATA_POISON_MASK               0x00000020
#define   HMB_ECC_DATA_POISON_SHIFT                       5
#define   HMB_DUCRC_POISON_MASK                  0x00000010
#define   HMB_DUCRC_POISON_SHIFT                          4
#define   HMB_DUCRC_ERR_MASK                     0x00000008
#define   HMB_DUCRC_ERR_SHIFT                             3
#define   HMB_ECC_1BIT_ERR_FIX_MASK              0x00000004
#define   HMB_ECC_1BIT_ERR_FIX_SHIFT                      2
#define   HMB_ECC_1BIT_ERR_MASK                  0x00000002
#define   HMB_ECC_1BIT_ERR_SHIFT                          1
#define   HMB_ECC_2BIT_ERR_MASK                  0x00000001
#define   HMB_ECC_2BIT_ERR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 hmb_ecc_2bit_err:1;
        u32 hmb_ecc_1bit_err:1;
        u32 hmb_ecc_1bit_err_fix:1;
        u32 hmb_ducrc_err:1;
        u32 hmb_ducrc_poison:1;
        u32 hmb_ecc_data_poison:1;
        u32 hmb_hcrc_data_poison:1;
        u32 hmb_pi_data_poison:1;
        u32 hmb_pcie_tmout:1;
        u32 hmb_pcie_par_err:1;
        u32 hmb_data_buf_err:1;
        u32 rsvd_11:21;
    } b;
} hmb_err_stts_t;

#define HMB_ERROR_MASK                           0x0000c270
#define   HMB_ERROR_MASK_MASK                    0x000007ff
#define   HMB_ERROR_MASK_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 hmb_error_mask:11;
        u32 rsvd_11:21;
    } b;
} hmb_error_mask_t;

#define HMB_ERR_INJ                              0x0000c274
#define   INJECT_2BIT_ERR_MASK                   0x00000004
#define   INJECT_2BIT_ERR_SHIFT                           2
#define   INJECT_1BIT_ERR_MASK                   0x00000002
#define   INJECT_1BIT_ERR_SHIFT                           1
#define   ERR_INJECT_EN_MASK                     0x00000001
#define   ERR_INJECT_EN_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 err_inject_en:1;
        u32 inject_1bit_err:1;
        u32 inject_2bit_err:1;
        u32 rsvd_3:29;
    } b;
} hmb_err_inj_t;

#define NVM_GRP_SEL0                             0x0000c280
#define   SQ_GRP_SEL0_MASK                       0xffffffff
#define   SQ_GRP_SEL0_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_grp_sel0:32;
    } b;
} nvm_grp_sel0_t;

#define NVM_GRP_SEL1                             0x0000c284
#define   SQ_GRP_SEL1_MASK                       0xffffffff
#define   SQ_GRP_SEL1_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_grp_sel1:32;
    } b;
} nvm_grp_sel1_t;

#define NVM_GRP_SEL2                             0x0000c288
#define   SQ_GRP_SEL2_MASK                       0x00000003
#define   SQ_GRP_SEL2_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sq_grp_sel2:2;
        u32 rsvd_2:30;
    } b;
} nvm_grp_sel2_t;

#define RD_PPA_Q_BASE                            0x0000c290
#define   RD_PPA_Q_LOC_MASK                      0x00800000
#define   RD_PPA_Q_LOC_SHIFT                             23
#define   RD_PPA_Q_BASE_MASK                     0x007fffff
#define   RD_PPA_Q_BASE_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 rd_ppa_q_base:23;
        u32 rd_ppa_q_loc:1;
        u32 rsvd_24:8;
    } b;
} rd_ppa_q_base_t;

#define RD_PPA_Q_SIZE                            0x0000c294
#define   RD_PPA_Q_MAX_SZ_MASK                   0x00000fff
#define   RD_PPA_Q_MAX_SZ_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 rd_ppa_q_max_sz:12;
        u32 rsvd_12:20;
    } b;
} rd_ppa_q_size_t;

#define RD_PPA_Q_PTR                             0x0000c298
#define   RD_PPA_Q_RD_PTR_MASK                   0x0fff0000
#define   RD_PPA_Q_RD_PTR_SHIFT                          16
#define   RD_PPA_Q_WR_PTR_MASK                   0x00000fff
#define   RD_PPA_Q_WR_PTR_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 rd_ppa_q_wr_ptr:12;
        u32 rsvd_12:4;
        u32 rd_ppa_q_rd_ptr:12;
        u32 rsvd_28:4;
    } b;
} rd_ppa_q_ptr_t;

#define SRMB_KEY_0                               0x0000c2a0
#define   SCMB_KEY_DW0_MASK                      0xffffffff
#define   SCMB_KEY_DW0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 scmb_key_dw0:32;
    } b;
} srmb_key_0_t;

#define SRMB_KEY_1                               0x0000c2a4
#define   SCMB_KEY_DW1_MASK                      0xffffffff
#define   SCMB_KEY_DW1_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 scmb_key_dw1:32;
    } b;
} srmb_key_1_t;

#define SRMB_KEY_2                               0x0000c2a8
#define   SCMB_KEY_DW2_MASK                      0xffffffff
#define   SCMB_KEY_DW2_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 scmb_key_dw2:32;
    } b;
} srmb_key_2_t;

#define SRMB_KEY_3                               0x0000c2ac
#define   SCMB_KEY_DW3_MASK                      0xffffffff
#define   SCMB_KEY_DW3_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 scmb_key_dw3:32;
    } b;
} srmb_key_3_t;

#define DCRC_KEY_0                               0x0000c2b0
#define   DCRC_KEY_DW0_MASK                      0xffffffff
#define   DCRC_KEY_DW0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 dcrc_key_dw0:32;
    } b;
} dcrc_key_0_t;

#define DCRC_KEY_1                               0x0000c2b4
#define   DCRC_KEY_DW1_MASK                      0xffffffff
#define   DCRC_KEY_DW1_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 dcrc_key_dw1:32;
    } b;
} dcrc_key_1_t;

#define DCRC_KEY_2                               0x0000c2b8
#define   DCRC_KEY_DW2_MASK                      0xffffffff
#define   DCRC_KEY_DW2_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 dcrc_key_dw2:32;
    } b;
} dcrc_key_2_t;

#define DCRC_KEY_3                               0x0000c2bc
#define   DCRC_KEY_DW3_MASK                      0xffffffff
#define   DCRC_KEY_DW3_SHIFT                              0
typedef union {
    u32 all;
    struct {
        u32 dcrc_key_dw3:32;
    } b;
} dcrc_key_3_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ u32 rsvd_0 [12416];
    /* 0xc200 */ unmask_err_t unmask_err;
    /* 0xc204 */ err_mask_t err_mask;
    /* 0xc208 */ mask_err_t mask_err;
    /* 0xc20c */ u32 rsvd_c20c [2];
    /* 0xc214 */ port_reset_ctrl_t port_reset_ctrl;
    /* 0xc218 */ cmd_q_base_t cmd_q_base;
    /* 0xc21c */ cmd_q_ptr_t cmd_q_ptr;
    /* 0xc220 */ cmd_rx_q_base_t cmd_rx_q_base;
    /* 0xc224 */ cmd_rx_q_base1_t cmd_rx_q_base1;
    /* 0xc228 */ cmd_rx_q_ptr_t cmd_rx_q_ptr;
    /* 0xc22c */ cmd_cmpl_q_base_t cmd_cmpl_q_base;
    /* 0xc230 */ cmd_cmpl_q_ptr_t cmd_cmpl_q_ptr;
    /* 0xc234 */ host_ctrl_t host_ctrl;
    /* 0xc238 */ abort_xfer_t abort_xfer;
    /* 0xc23c */ u32 rsvd_c23c;
    /* 0xc240 */ ppa_q_base_t ppa_q_base;
    /* 0xc244 */ ppa_q_size_t ppa_q_size;
    /* 0xc248 */ ppa_q_ptr_t ppa_q_ptr;
    /* 0xc24c */ u32 rsvd_c24c;
    /* 0xc250 */ hmb_tbl_ctrl_t hmb_tbl_ctrl;
    /* 0xc254 */ hmb_seg_addr_base_t hmb_seg_addr_base;
    /* 0xc258 */ hmb_seg_size_base_t hmb_seg_size_base;
    /* 0xc25c */ hmb_meta_base_l_t hmb_meta_base_l;
    /* 0xc260 */ hmb_meta_base_h_t hmb_meta_base_h;
    /* 0xc264 */ hmb_ecc_base_l_t hmb_ecc_base_l;
    /* 0xc268 */ hmb_ecc_base_h_t hmb_ecc_base_h;
    /* 0xc26c */ hmb_err_stts_t hmb_err_stts;
    /* 0xc270 */ hmb_error_mask_t hmb_error_mask;
    /* 0xc274 */ hmb_err_inj_t hmb_err_inj;
    /* 0xc278 */ u32 rsvd_c278 [2];
    /* 0xc280 */ nvm_grp_sel0_t nvm_grp_sel0;
    /* 0xc284 */ nvm_grp_sel1_t nvm_grp_sel1;
    /* 0xc288 */ nvm_grp_sel2_t nvm_grp_sel2;
    /* 0xc28c */ u32 rsvd_c28c;
    /* 0xc290 */ rd_ppa_q_base_t rd_ppa_q_base;
    /* 0xc294 */ rd_ppa_q_size_t rd_ppa_q_size;
    /* 0xc298 */ rd_ppa_q_ptr_t rd_ppa_q_ptr;
    /* 0xc29c */ u32 rsvd_c29c;
    /* 0xc2a0 */ srmb_key_0_t srmb_key_0;
    /* 0xc2a4 */ srmb_key_1_t srmb_key_1;
    /* 0xc2a8 */ srmb_key_2_t srmb_key_2;
    /* 0xc2ac */ srmb_key_3_t srmb_key_3;
    /* 0xc2b0 */ dcrc_key_0_t dcrc_key_0;
    /* 0xc2b4 */ dcrc_key_1_t dcrc_key_1;
    /* 0xc2b8 */ dcrc_key_2_t dcrc_key_2;
    /* 0xc2bc */ dcrc_key_3_t dcrc_key_3;
} port_ctrl_regs_t;


#endif /* rev 0 */