//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _DFI_REG_H_
#define _DFI_REG_H_

#define REVID_0                                  0x00000000
#define   REVID_ARCH_MASK                        0xff000000
#define   REVID_ARCH_SHIFT                               24
#define   REVID_MAJOR_MASK                       0x00fff000
#define   REVID_MAJOR_SHIFT                              12
#define   REVID_MINOR_MASK                       0x00000fff
#define   REVID_MINOR_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 revid_minor:12;
        u32 revid_major:12;
        u32 revid_arch:8;
    } b;
} revid_0_t;

#define REVID_1                                  0x00000004
#define   REVID_MISC_MASK                        0xffffffff
#define   REVID_MISC_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 revid_misc:32;
    } b;
} revid_1_t;

#define SYSTEM                                   0x00000008
#define   RESET_RDPTR_MASK                       0x00000001
#define   RESET_RDPTR_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 reset_rdptr:1;
        u32 rsvd_1:31;
    } b;
} system_t;

#define IO_DATA_0                                0x00000010
#define   DATA_DE_MASK                           0xc0000000
#define   DATA_DE_SHIFT                                  30
#define   DATA_PSTR_MASK                         0x1f000000
#define   DATA_PSTR_SHIFT                                24
#define   DATA_NSTR_MASK                         0x001f0000
#define   DATA_NSTR_SHIFT                                16
#define   DATA_PODT_SEL_MASK                     0x0000f000
#define   DATA_PODT_SEL_SHIFT                            12
#define   DATA_NODT_SEL_MASK                     0x00000f00
#define   DATA_NODT_SEL_SHIFT                             8
#define   DATA_PDRV_SEL_MASK                     0x000000f0
#define   DATA_PDRV_SEL_SHIFT                             4
#define   DATA_NDRV_SEL_MASK                     0x0000000f
#define   DATA_NDRV_SEL_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 data_ndrv_sel:4;
        u32 data_pdrv_sel:4;
        u32 data_nodt_sel:4;
        u32 data_podt_sel:4;
        u32 data_nstr:5;
        u32 rsvd_21:3;
        u32 data_pstr:5;
        u32 rsvd_29:1;
        u32 data_de:2;
    } b;
} io_data_0_t;

#define IO_DATA_1                                0x00000014
#define   DATA_DIFF_EN_MASK                      0x02000000
#define   DATA_DIFF_EN_SHIFT                             25
#define   DATA_AUX_EN_MASK                       0x01000000
#define   DATA_AUX_EN_SHIFT                              24
#define   DATA_MODE_MASK                         0x00800000
#define   DATA_MODE_SHIFT                                23
#define   DQS_EDGE_SEL_MASK                      0x00200000
#define   DQS_EDGE_SEL_SHIFT                             21
#define   DQ_EDGE_SEL_MASK                       0x00100000
#define   DQ_EDGE_SEL_SHIFT                              20
#define   DQS_RCV_SEL_MASK                       0x00040000
#define   DQS_RCV_SEL_SHIFT                              18
#define   DQ_RCV_SEL_MASK                        0x00010000
#define   DQ_RCV_SEL_SHIFT                               16
#define   DQS_RCV_MODE_MASK                      0x00000c00
#define   DQS_RCV_MODE_SHIFT                             10
#define   DQ_RCV_MODE_MASK                       0x00000300
#define   DQ_RCV_MODE_SHIFT                               8
#define   DQSN_PD_MASK                           0x00000040
#define   DQSN_PD_SHIFT                                   6
#define   DQS_PD_MASK                            0x00000020
#define   DQS_PD_SHIFT                                    5
#define   DQ_PD_MASK                             0x00000010
#define   DQ_PD_SHIFT                                     4
#define   DQSN_PU_MASK                           0x00000004
#define   DQSN_PU_SHIFT                                   2
#define   DQS_PU_MASK                            0x00000002
#define   DQS_PU_SHIFT                                    1
#define   DQ_PU_MASK                             0x00000001
#define   DQ_PU_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 dq_pu:1;
        u32 dqs_pu:1;
        u32 dqsn_pu:1;
        u32 rsvd_3:1;
        u32 dq_pd:1;
        u32 dqs_pd:1;
        u32 dqsn_pd:1;
        u32 rsvd_7:1;
        u32 dq_rcv_mode:2;
        u32 dqs_rcv_mode:2;
        u32 rsvd_12:4;
        u32 dq_rcv_sel:1;
        u32 rsvd_17:1;
        u32 dqs_rcv_sel:1;
        u32 rsvd_19:1;
        u32 dq_edge_sel:1;
        u32 dqs_edge_sel:1;
        u32 rsvd_22:1;
        u32 data_mode:1;
        u32 data_aux_en:1;
        u32 data_diff_en:1;
        u32 rsvd_26:6;
    } b;
} io_data_1_t;

#define IO_DATA_2                                0x00000018
#define   DATA_RESERVE_MASK                      0x000000ff
#define   DATA_RESERVE_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 data_reserve:8;
        u32 rsvd_8:24;
    } b;
} io_data_2_t;

#define IO_ADCM_0                                0x00000020
#define   ADCM_DE_MASK                           0xc0000000
#define   ADCM_DE_SHIFT                                  30
#define   ADCM_PSTR_MASK                         0x1f000000
#define   ADCM_PSTR_SHIFT                                24
#define   ADCM_NSTR_MASK                         0x001f0000
#define   ADCM_NSTR_SHIFT                                16
#define   ADCM_PODT_SEL_MASK                     0x0000f000
#define   ADCM_PODT_SEL_SHIFT                            12
#define   ADCM_NODT_SEL_MASK                     0x00000f00
#define   ADCM_NODT_SEL_SHIFT                             8
#define   ADCM_PDRV_SEL_MASK                     0x000000f0
#define   ADCM_PDRV_SEL_SHIFT                             4
#define   ADCM_NDRV_SEL_MASK                     0x0000000f
#define   ADCM_NDRV_SEL_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 adcm_ndrv_sel:4;
        u32 adcm_pdrv_sel:4;
        u32 adcm_nodt_sel:4;
        u32 adcm_podt_sel:4;
        u32 adcm_nstr:5;
        u32 rsvd_21:3;
        u32 adcm_pstr:5;
        u32 rsvd_29:1;
        u32 adcm_de:2;
    } b;
} io_adcm_0_t;

#define IO_ADCM_1                                0x00000024
#define   ADCM_DIFF_EN_MASK                      0x02000000
#define   ADCM_DIFF_EN_SHIFT                             25
#define   ADCM_AUX_EN_MASK                       0x01000000
#define   ADCM_AUX_EN_SHIFT                              24
#define   ADCM_MODE_MASK                         0x00800000
#define   ADCM_MODE_SHIFT                                23
#define   ADDR_EDGE_SEL_MASK                     0x00100000
#define   ADDR_EDGE_SEL_SHIFT                            20
#define   ADDR_RCV_SEL_MASK                      0x00010000
#define   ADDR_RCV_SEL_SHIFT                             16
#define   ADDR_RCV_MODE_MASK                     0x00000300
#define   ADDR_RCV_MODE_SHIFT                             8
#define   ADDR_PD_MASK                           0x00000010
#define   ADDR_PD_SHIFT                                   4
#define   ADDR_PU_MASK                           0x00000001
#define   ADDR_PU_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 addr_pu:1;
        u32 rsvd_1:3;
        u32 addr_pd:1;
        u32 rsvd_5:3;
        u32 addr_rcv_mode:2;
        u32 rsvd_10:6;
        u32 addr_rcv_sel:1;
        u32 rsvd_17:3;
        u32 addr_edge_sel:1;
        u32 rsvd_21:2;
        u32 adcm_mode:1;
        u32 adcm_aux_en:1;
        u32 adcm_diff_en:1;
        u32 rsvd_26:6;
    } b;
} io_adcm_1_t;

#define IO_ADCM_2                                0x00000028
#define   ADCM_RESERVE_MASK                      0x000000ff
#define   ADCM_RESERVE_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 adcm_reserve:8;
        u32 rsvd_8:24;
    } b;
} io_adcm_2_t;

#define IO_ADCM_3                                0x0000002c
#define   CK_PDRV_SEL_MASK                       0x000000f0
#define   CK_PDRV_SEL_SHIFT                               4
#define   CK_NDRV_SEL_MASK                       0x0000000f
#define   CK_NDRV_SEL_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 ck_ndrv_sel:4;
        u32 ck_pdrv_sel:4;
        u32 rsvd_8:24;
    } b;
} io_adcm_3_t;

#define IO_CK_0                                  0x00000030

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} io_ck_0_t;

#define IO_ALERTN                                0x00000038
#define   ALERT_DIFF_EN_MASK                     0x04000000
#define   ALERT_DIFF_EN_SHIFT                            26
#define   ALERT_AUX_EN_MASK                      0x02000000
#define   ALERT_AUX_EN_SHIFT                             25
#define   ALERT_MODE_MASK                        0x01000000
#define   ALERT_MODE_SHIFT                               24
#define   ALERT_RCV_SEL_MASK                     0x00400000
#define   ALERT_RCV_SEL_SHIFT                            22
#define   ALERT_RCV_MODE_MASK                    0x00300000
#define   ALERT_RCV_MODE_SHIFT                           20
#define   ALERT_RCV_EN_MASK                      0x00040000
#define   ALERT_RCV_EN_SHIFT                             18
#define   ALERT_PD_MASK                          0x00020000
#define   ALERT_PD_SHIFT                                 17
#define   ALERT_PU_MASK                          0x00010000
#define   ALERT_PU_SHIFT                                 16
#define   ALERT_PODT_SEL_MASK                    0x0000f000
#define   ALERT_PODT_SEL_SHIFT                           12
#define   ALERT_NODT_SEL_MASK                    0x00000f00
#define   ALERT_NODT_SEL_SHIFT                            8

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:8;
        u32 alert_nodt_sel:4;
        u32 alert_podt_sel:4;
        u32 alert_pu:1;
        u32 alert_pd:1;
        u32 alert_rcv_en:1;
        u32 rsvd_19:1;
        u32 alert_rcv_mode:2;
        u32 alert_rcv_sel:1;
        u32 rsvd_23:1;
        u32 alert_mode:1;
        u32 alert_aux_en:1;
        u32 alert_diff_en:1;
        u32 rsvd_27:5;
    } b;
} io_alertn_t;

#define IO_RESETN                                0x0000003c
#define   RESET_PD_MASK                          0x00020000
#define   RESET_PD_SHIFT                                 17
#define   RESET_PU_MASK                          0x00010000
#define   RESET_PU_SHIFT                                 16

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:16;
        u32 reset_pu:1;
        u32 reset_pd:1;
        u32 rsvd_18:14;
    } b;
} io_resetn_t;

#define IO_CAL_0                                 0x00000040
#define   CAL_PSTR_MASK                          0x1f000000
#define   CAL_PSTR_SHIFT                                 24
#define   CAL_NSTR_MASK                          0x001f0000
#define   CAL_NSTR_SHIFT                                 16
#define   CAL_DIFF_EN_MASK                       0x00000040
#define   CAL_DIFF_EN_SHIFT                               6
#define   CAL_AUX_EN_MASK                        0x00000020
#define   CAL_AUX_EN_SHIFT                                5
#define   CAL_MODE_MASK                          0x00000010
#define   CAL_MODE_SHIFT                                  4
#define   CAL_EN_N_MASK                          0x00000002
#define   CAL_EN_N_SHIFT                                  1
#define   CAL_EN_P_MASK                          0x00000001
#define   CAL_EN_P_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 cal_en_p:1;
        u32 cal_en_n:1;
        u32 rsvd_2:2;
        u32 cal_mode:1;
        u32 cal_aux_en:1;
        u32 cal_diff_en:1;
        u32 rsvd_7:9;
        u32 cal_nstr:5;
        u32 rsvd_21:3;
        u32 cal_pstr:5;
        u32 rsvd_29:3;
    } b;
} io_cal_0_t;

#define IO_CAL_1                                 0x00000044
#define   CAL_OUT_MASK                           0x00000001
#define   CAL_OUT_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 cal_out:1;
        u32 rsvd_1:31;
    } b;
} io_cal_1_t;

#define VREF_CTRL_0                              0x00000050
#define   VREF_SEL_MASK                          0x00000007
#define   VREF_SEL_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 vref_sel:3;
        u32 rsvd_3:29;
    } b;
} vref_ctrl_0_t;

#define VGEN_CTRL_0                              0x00000054
#define   VGEN_VSEL_MASK                         0x00003f00
#define   VGEN_VSEL_SHIFT                                 8
#define   VGEN_RANGE_MASK                        0x00000030
#define   VGEN_RANGE_SHIFT                                4
#define   VGEN_BYPASS_MASK                       0x00000008
#define   VGEN_BYPASS_SHIFT                               3
#define   VGEN_BUF_EN_MASK                       0x00000004
#define   VGEN_BUF_EN_SHIFT                               2
#define   VGEN_PU_MASK                           0x00000001
#define   VGEN_PU_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 vgen_pu:1;
        u32 rsvd_1:1;
        u32 vgen_buf_en:1;
        u32 vgen_bypass:1;
        u32 vgen_range:2;
        u32 rsvd_6:2;
        u32 vgen_vsel:6;
        u32 rsvd_14:18;
    } b;
} vgen_ctrl_0_t;

#define IO_MISC_0                                0x00000060

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} io_misc_0_t;

#define SYNC_CTRL_0                              0x00000080
#define   PHY_SYNC_MASK                          0x80000000
#define   PHY_SYNC_SHIFT                                 31
#define   WR_RSTB_DIS_MASK                       0x00010000
#define   WR_RSTB_DIS_SHIFT                              16
#define   CGS_SEL_MASK                           0x0000f000
#define   CGS_SEL_SHIFT                                  12
#define   WR_RSTB_SEL_MASK                       0x00000f00
#define   WR_RSTB_SEL_SHIFT                               8
#define   WR_PT_INIT_MASK                        0x000000f0
#define   WR_PT_INIT_SHIFT                                4
#define   SYNC_CGS_EN_MASK                       0x00000004
#define   SYNC_CGS_EN_SHIFT                               2
#define   SYNC_EN_MASK                           0x00000002
#define   SYNC_EN_SHIFT                                   1
#define   SYNC_RSTN_MASK                         0x00000001
#define   SYNC_RSTN_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 sync_rstn:1;
        u32 sync_en:1;
        u32 sync_cgs_en:1;
        u32 rsvd_3:1;
        u32 wr_pt_init:4;
        u32 wr_rstb_sel:4;
        u32 cgs_sel:4;
        u32 wr_rstb_dis:1;
        u32 rsvd_17:14;
        u32 phy_sync:1;
    } b;
} sync_ctrl_0_t;

#define DFI_CTRL_0                               0x00000088
#define   BYP_FIFO_MASK_EN_MASK                  0x08000000
#define   BYP_FIFO_MASK_EN_SHIFT                         27
#define   BYP_FIFO_RST_MASK                      0x04000000
#define   BYP_FIFO_RST_SHIFT                             26
#define   BYP_FIFO_R_EN_MASK                     0x02000000
#define   BYP_FIFO_R_EN_SHIFT                            25
#define   BYP_FIFO_W_EN_MASK                     0x01000000
#define   BYP_FIFO_W_EN_SHIFT                            24
#define   PIPE_I_SEL_MASK                        0x00100000
#define   PIPE_I_SEL_SHIFT                               20
#define   PIPE_O_SEL_MASK                        0x00010000
#define   PIPE_O_SEL_SHIFT                               16
#define   RDDATA_BYPASS_MASK                     0x00004000
#define   RDDATA_BYPASS_SHIFT                            14
#define   ECC_BYTE_REMAP_MASK                    0x00002000
#define   ECC_BYTE_REMAP_SHIFT                           13
#define   DLPBK_MASK                             0x00001000
#define   DLPBK_SHIFT                                    12
#define   DDR_TYPE_MASK                          0x00000f00
#define   DDR_TYPE_SHIFT                                  8
#define   PINMUX_SEL_MASK                        0x0000000f
#define   PINMUX_SEL_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 pinmux_sel:4;
        u32 rsvd_4:4;
        u32 dram_type:4;
        u32 dlpbk:1;
        u32 ecc_byte_remap:1;
        u32 rddata_bypass:1;
        u32 rsvd_15:1;
        u32 pipe_o_sel:1;
        u32 rsvd_17:3;
        u32 pipe_i_sel:1;
        u32 rsvd_21:3;
        u32 byp_fifo_w_en:1;
        u32 byp_fifo_r_en:1;
        u32 byp_fifo_rst:1;
        u32 byp_fifo_mask_en:1;
        u32 rsvd_28:4;
    } b;
} dfi_ctrl_0_t;

#define OUT_CTRL_0                               0x00000090
#define   ADDR_MIRROR_EN_MASK                    0xf0000000
#define   ADDR_MIRROR_EN_SHIFT                           28
#define   WDQS_ON_MASK                           0x01f00000
#define   WDQS_ON_SHIFT                                  20
#define   WDQS_CONTROL_MODE2_ON_MASK             0x00020000
#define   WDQS_CONTROL_MODE2_ON_SHIFT                    17
#define   WDQS_CONTROL_MODE1_MASK                0x00010000
#define   WDQS_CONTROL_MODE1_SHIFT                       16
#define   WDQS_INVERT_MASK                       0x00002000
#define   WDQS_INVERT_SHIFT                              13
#define   OE_UNMAPPED_MASK                       0x00001000
#define   OE_UNMAPPED_SHIFT                              12
#define   OED_PH_DLY_MASK                        0x00000f00
#define   OED_PH_DLY_SHIFT                                8
#define   OEP_E_PH_DLY_MASK                      0x000000f0
#define   OEP_E_PH_DLY_SHIFT                              4
#define   OEP_S_PH_DLY_MASK                      0x0000000f
#define   OEP_S_PH_DLY_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 oep_s_ph_dly:4;
        u32 oep_e_ph_dly:4;
        u32 oed_ph_dly:4;
        u32 oe_unmapped:1;
        u32 wdqs_invert:1;
        u32 rsvd_14:2;
        u32 wdqs_control_mode1:1;
        u32 wdqs_control_mode2_on:1;
        u32 rsvd_18:2;
        u32 wdqs_on:5;
        u32 rsvd_25:3;
        u32 addr_mirror_en:4;
    } b;
} out_ctrl_0_t;

#define OUT_CTRL_1                               0x00000094
#define   WDQS_ON_PEND_TH_EN_MASK                0x80000000
#define   WDQS_ON_PEND_TH_EN_SHIFT                       31
#define   WDQS_ON_PEND_TH_MASK                   0x1f000000
#define   WDQS_ON_PEND_TH_SHIFT                          24
#define   WDQS_OFF_MASK                          0x003f0000
#define   WDQS_OFF_SHIFT                                 16
#define   CA_5_0_ON_CH_B_MASK                    0x00000200
#define   CA_5_0_ON_CH_B_SHIFT                            9
#define   CALVL_CH_B_MASK                        0x00000100
#define   CALVL_CH_B_SHIFT                                8
#define   CK_INVERT_MASK                         0x00000080
#define   CK_INVERT_SHIFT                                 7
#define   OEA_AUTO_ADDR_MASK                     0x00000030
#define   OEA_AUTO_ADDR_SHIFT                             4
#define   ADDR_PH_DLY_MASK                       0x00000003
#define   ADDR_PH_DLY_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 addr_ph_dly:2;
        u32 rsvd_2:2;
        u32 oea_auto_addr:2;
        u32 rsvd_6:1;
        u32 ck_invert:1;
        u32 calvl_ch_b:1;
        u32 ca_5_0_on_ch_b:1;
        u32 rsvd_10:6;
        u32 wdqs_off:6;
        u32 rsvd_22:2;
        u32 wdqs_on_pend_th:5;
        u32 rsvd_29:2;
        u32 wdqs_on_pend_th_en:1;
    } b;
} out_ctrl_1_t;

#define IN_CTRL_0                                0x000000a0
#define   FORCE_DQS_RCV_EN_MASK                  0x80000000
#define   FORCE_DQS_RCV_EN_SHIFT                         31
#define   FORCE_DQ_RCV_EN_MASK                   0x40000000
#define   FORCE_DQ_RCV_EN_SHIFT                          30
#define   DM_ODT_OFF_MASK                        0x20000000
#define   DM_ODT_OFF_SHIFT                               29
#define   FORCE_ODT_EN_MASK                      0x10000000
#define   FORCE_ODT_EN_SHIFT                             28
#define   RCVLAT_MASK                            0x03f00000
#define   RCVLAT_SHIFT                                   20
#define   RDPTR_PRE_ADJ_MASK                     0x00040000
#define   RDPTR_PRE_ADJ_SHIFT                            18
#define   RDPTR_POST_ADJ_MASK                    0x00020000
#define   RDPTR_POST_ADJ_SHIFT                           17
#define   RDPTR_MODE_MASK                        0x00010000
#define   RDPTR_MODE_SHIFT                               16
#define   RD_RSTB_FORCE_MASK                     0x00008000
#define   RD_RSTB_FORCE_SHIFT                            15
#define   RD_RSTB_DIS_RCV_MASK                   0x00004000
#define   RD_RSTB_DIS_RCV_SHIFT                          14
#define   RD_RSTB_DIS_OEP_MASK                   0x00002000
#define   RD_RSTB_DIS_OEP_SHIFT                          13
#define   RD_RSTB_OEPFE_DLY_MASK                 0x00001c00
#define   RD_RSTB_OEPFE_DLY_SHIFT                        10
#define   RD_RSTB_DLY_MASK                       0x00000300
#define   RD_RSTB_DLY_SHIFT                               8
#define   RDLAT_MASK                             0x0000003f
#define   RDLAT_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 rdlat:6;
        u32 rsvd_6:2;
        u32 rd_rstb_dly:2;
        u32 rd_rstb_oepfe_dly:3;
        u32 rd_rstb_dis_oep:1;
        u32 rd_rstb_dis_rcv:1;
        u32 rd_rstb_force:1;
        u32 rdptr_mode:1;
        u32 rdptr_post_adj:1;
        u32 rdptr_pre_adj:1;
        u32 rsvd_19:1;
        u32 rcvlat:6;
        u32 rsvd_26:2;
        u32 force_odt_en:1;
        u32 dm_odt_off:1;
        u32 force_dq_rcv_en:1;
        u32 force_dqs_rcv_en:1;
    } b;
} in_ctrl_0_t;

#define CK_GATE_0                                0x000000b0
#define   CK_GATE_DBD_AUTO_OFF_MASK              0x80000000
#define   CK_GATE_DBD_AUTO_OFF_SHIFT                     31
#define   CK_GATE_DATA_MASK                      0x00010000
#define   CK_GATE_DATA_SHIFT                             16
#define   CK_GATE_UNUSED_MASK                    0x00000200
#define   CK_GATE_UNUSED_SHIFT                            9
#define   CK_GATE_ADCM_MASK                      0x00000100
#define   CK_GATE_ADCM_SHIFT                              8
#define   CK_GATE_RANK_MASK                      0x000000f0
#define   CK_GATE_RANK_SHIFT                              4
#define   CK_GATE_CK_MASK                        0x0000000f
#define   CK_GATE_CK_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 ck_gate_ck:4;
        u32 ck_gate_rank:4;
        u32 ck_gate_adcm:1;
        u32 ck_gate_unused:1;
        u32 rsvd_10:6;
        u32 ck_gate_data:1;
        u32 rsvd_17:14;
        u32 ck_gate_dbd_auto_off:1;
    } b;
} ck_gate_0_t;

#define CK_CTRL_0                                0x000000b4
#define   CK_STOP_MASK                           0x0000000f
#define   CK_STOP_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 ck_stop:4;
        u32 rsvd_4:28;
    } b;
} ck_ctrl_0_t;

#define LVL_ALL_CTRL_0                           0x000000c0
#define   LVL_BYTE_MASK_MASK                     0x000001ff
#define   LVL_BYTE_MASK_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 lvl_byte_mask:9;
        u32 rsvd_9:23;
    } b;
} lvl_all_ctrl_0_t;

#define LVL_ALL_WO_0                             0x000000c4
#define   RDLAT_UPDATE_MASK                      0x00010000
#define   RDLAT_UPDATE_SHIFT                             16
#define   CALVL_SEND_PAT_MASK                    0x00000200
#define   CALVL_SEND_PAT_SHIFT                            9
#define   CALVL_SEND_DQS_MASK                    0x00000100
#define   CALVL_SEND_DQS_SHIFT                            8
#define   RDLVL_RDLAT_START_MASK                 0x00000020
#define   RDLVL_RDLAT_START_SHIFT                         5
#define   RDLVL_COMP_START_MASK                  0x00000010
#define   RDLVL_COMP_START_SHIFT                          4
#define   RDFIFO_CLEAR_MASK                      0x00000008
#define   RDFIFO_CLEAR_SHIFT                              3
#define   WRLVL_SEND_PULSE_MASK                  0x00000001
#define   WRLVL_SEND_PULSE_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 wrlvl_send_pulse:1;
        u32 rsvd_1:2;
        u32 rdfifo_clear:1;
        u32 rdlvl_comp_start:1;
        u32 rdlvl_rdlat_start:1;
        u32 rsvd_6:2;
        u32 calvl_send_dqs:1;
        u32 calvl_send_pat:1;
        u32 rsvd_10:6;
        u32 rdlat_update:1;
        u32 rsvd_17:15;
    } b;
} lvl_all_wo_0_t;

#define LVL_ALL_RO_0                             0x000000c8
#define   CALVL_SEND_PAT_DONE_MASK               0x00000200
#define   CALVL_SEND_PAT_DONE_SHIFT                       9
#define   CALVL_SEND_DQS_DONE_MASK               0x00000100
#define   CALVL_SEND_DQS_DONE_SHIFT                       8
#define   RDLVL_ERROR_MASK                       0x00000040
#define   RDLVL_ERROR_SHIFT                               6
#define   RDLVL_RDLAT_DONE_MASK                  0x00000020
#define   RDLVL_RDLAT_DONE_SHIFT                          5
#define   RDLVL_COMP_DONE_MASK                   0x00000010
#define   RDLVL_COMP_DONE_SHIFT                           4
#define   RDFIFO_CLEAR_DONE_MASK                 0x00000008
#define   RDFIFO_CLEAR_DONE_SHIFT                         3
#define   WRLVL_SEND_PULSE_DONE_MASK             0x00000001
#define   WRLVL_SEND_PULSE_DONE_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 wrlvl_send_pulse_done:1;
        u32 rsvd_1:2;
        u32 rdfifo_clear_done:1;
        u32 rdlvl_comp_done:1;
        u32 rdlvl_rdlat_done:1;
        u32 rdlvl_error:1;
        u32 rsvd_7:1;
        u32 calvl_send_dqs_done:1;
        u32 calvl_send_pat_done:1;
        u32 rsvd_10:22;
    } b;
} lvl_all_ro_0_t;

#define LVL_WRLVL_0                              0x000000d0
#define   WRLVL_PULSE_WIDTH_MASK                 0x00000002
#define   WRLVL_PULSE_WIDTH_SHIFT                         1
#define   WRLVL_MODE_MASK                        0x00000001
#define   WRLVL_MODE_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 wrlvl_mode:1;
        u32 wrlvl_pulse_width:1;
        u32 rsvd_2:30;
    } b;
} lvl_wrlvl_0_t;

#define LVL_RDLVL_0                              0x000000d4
#define   RD_DQ_CAL_CUSTOM_EN_MASK               0x00010000
#define   RD_DQ_CAL_CUSTOM_EN_SHIFT                      16
#define   RDLVL_BL_MASK                          0x00000300
#define   RDLVL_BL_SHIFT                                  8
#define   RDLAT_ACTUAL_MASK                      0x0000003f
#define   RDLAT_ACTUAL_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 rdlat_actual:6;
        u32 rsvd_6:2;
        u32 rdlvl_bl:2;
        u32 rsvd_10:6;
        u32 rd_dq_cal_custom_en:1;
        u32 rsvd_17:15;
    } b;
} lvl_rdlvl_0_t;

#define LVL_RDLVL_1                              0x000000d8
#define   RD_DQ_CAL_INVERT_MASK                  0xffff0000
#define   RD_DQ_CAL_INVERT_SHIFT                         16
#define   RD_DQ_CAL_PATTERN_MASK                 0x0000ffff
#define   RD_DQ_CAL_PATTERN_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 rd_dq_cal_pattern:16;
        u32 rd_dq_cal_invert:16;
    } b;
} lvl_rdlvl_1_t;

#define LVL_CALVL_0                              0x000000e0
#define   CALVL_TADR_MASK                        0x3f000000
#define   CALVL_TADR_SHIFT                               24
#define   CALVL_CS_MASK                          0x00f00000
#define   CALVL_CS_SHIFT                                 20
#define   CALVL_SEND_PAT_SEL_MASK                0x00030000
#define   CALVL_SEND_PAT_SEL_SHIFT                       16
#define   CALVL_VREF_LEVEL_MASK                  0x00003f00
#define   CALVL_VREF_LEVEL_SHIFT                          8
#define   CALVL_VREF_RANGE_MASK                  0x00000010
#define   CALVL_VREF_RANGE_SHIFT                          4
#define   CALVL_MODE_MASK                        0x00000001
#define   CALVL_MODE_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 calvl_mode:1;
        u32 rsvd_1:3;
        u32 calvl_vref_range:1;
        u32 rsvd_5:3;
        u32 calvl_vref_level:6;
        u32 rsvd_14:2;
        u32 calvl_send_pat_sel:2;
        u32 rsvd_18:2;
        u32 calvl_cs:4;
        u32 calvl_tadr:6;
        u32 rsvd_30:2;
    } b;
} lvl_calvl_0_t;

#define DLL_CTRL_0                               0x00000110
#define   DLL_AUTO_UPDATE_ZQC_MASK               0x10000000
#define   DLL_AUTO_UPDATE_ZQC_SHIFT                      28
#define   DLL_AUTO_UPDATE_REF_MASK               0x08000000
#define   DLL_AUTO_UPDATE_REF_SHIFT                      27
#define   DLL_BYPASS_DLY_MASK                    0x07ff0000
#define   DLL_BYPASS_DLY_SHIFT                           16
#define   DLL_TEST_EN_MASK                       0x00000200
#define   DLL_TEST_EN_SHIFT                               9
#define   DLL_BYPASS_EN_MASK                     0x00000100
#define   DLL_BYPASS_EN_SHIFT                             8
#define   DLL_UPDATE_EN_MASK                     0x00000010
#define   DLL_UPDATE_EN_SHIFT                             4
#define   DLL_RSTB_MASK                          0x00000001
#define   DLL_RSTB_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 dll_rstb:1;
        u32 rsvd_1:3;
        u32 dll_update_en:1;
        u32 rsvd_5:3;
        u32 dll_bypass_en:1;
        u32 dll_test_en:1;
        u32 rsvd_10:6;
        u32 dll_bypass_dly:11;
        u32 dll_auto_update_ref:1;
        u32 dll_auto_update_zqc:1;
        u32 rsvd_29:3;
    } b;
} dll_ctrl_0_t;

#define DLL_CTRL_1                               0x00000114
#define   DLL_UPDATE_EN_LEN_MASK                 0x00007c00
#define   DLL_UPDATE_EN_LEN_SHIFT                        10
#define   DLL_LOCK_MASK                          0x000001ff
#define   DLL_LOCK_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 dll_lock:9;
        u32 rsvd_9:1;
        u32 dll_update_en_len:5;
        u32 rsvd_15:17;
    } b;
} dll_ctrl_1_t;

#define STRGT_CTRL_0                             0x00000120
#define   STRGT_WIN_SIZE_MASK                    0x00000030
#define   STRGT_WIN_SIZE_SHIFT                            4
#define   STRGT_MODE_MASK                        0x00000006
#define   STRGT_MODE_SHIFT                                1
#define   STRGT_EN_MASK                          0x00000001
#define   STRGT_EN_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 strgt_en:1;
        u32 strgt_mode:2;
        u32 rsvd_3:1;
        u32 strgt_win_size:2;
        u32 rsvd_6:26;
    } b;
} strgt_ctrl_0_t;

#define RDDATA_0                                 0x00000128
#define   RDDATA_PENDING_NONE_MASK               0x00000100
#define   RDDATA_PENDING_NONE_SHIFT                       8
#define   RDDATA_PENDING_MASK                    0x0000003f
#define   RDDATA_PENDING_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 rddata_pending:6;
        u32 rsvd_6:2;
        u32 rddata_pending_none:1;
        u32 rsvd_9:23;
    } b;
} rddata_0_t;

#define OADLY_0                                  0x00000140
#define   CM_WR_RSV_MASK                         0x0000ff00
#define   CM_WR_RSV_SHIFT                                 8
#define   CM_WR_DLY_MASK                         0x000000ff
#define   CM_WR_DLY_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cm_wr_dly:8;
        u32 cm_wr_rsv:8;
        u32 rsvd_16:16;
    } b;
} oadly_0_t;

#define LP_CTRL_0                                0x00000150
#define   LP_PD_CFG_MASK                         0x00003f00
#define   LP_PD_CFG_SHIFT                                 8
#define   LP_SR_CFG_MASK                         0x0000003f
#define   LP_SR_CFG_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 lp_sr_cfg:6;
        u32 rsvd_6:2;
        u32 lp_pd_cfg:6;
        u32 rsvd_14:18;
    } b;
} lp_ctrl_0_t;

#define CA_COMP_STATUS_0                         0x000001b0
#define   CALVL_COMP_STATUS_MASK                 0x0000003f
#define   CALVL_COMP_STATUS_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 calvl_comp_status:6;
        u32 rsvd_6:26;
    } b;
} ca_comp_status_0_t;

#define DQ_STATUS_ALL_0                          0x000001c0
#define   PHY_DQ_STATE_31_0_MASK                 0xffffffff
#define   PHY_DQ_STATE_31_0_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 phy_dq_state_31_0:32;
    } b;
} dq_status_all_0_t;

#define DQ_STATUS_ALL_1                          0x000001c4
#define   PHY_DQ_STATE_63_32_MASK                0xffffffff
#define   PHY_DQ_STATE_63_32_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 phy_dq_state_63_32:32;
    } b;
} dq_status_all_1_t;

#define DQ_STATUS_ALL_2                          0x000001c8
#define   PHY_DQ_STATE_BYTEWISE_OR_MASK          0x01ff0000
#define   PHY_DQ_STATE_BYTEWISE_OR_SHIFT                 16
#define   PHY_DQ_STATE_71_64_MASK                0x000000ff
#define   PHY_DQ_STATE_71_64_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 phy_dq_state_71_64:8;
        u32 rsvd_8:8;
        u32 phy_dq_state_bytewise_or:9;
        u32 rsvd_25:7;
    } b;
} dq_status_all_2_t;

#define RD_COMP_STATUS_ALL_0                     0x000001d0
#define   RD_COMP_RISE_DQ_31_0_MASK              0xffffffff
#define   RD_COMP_RISE_DQ_31_0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 rd_comp_rise_dq_31_0:32;
    } b;
} rd_comp_status_all_0_t;

#define RD_COMP_STATUS_ALL_1                     0x000001d4
#define   RD_COMP_RISE_DQ_63_32_MASK             0xffffffff
#define   RD_COMP_RISE_DQ_63_32_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 rd_comp_rise_dq_63_32:32;
    } b;
} rd_comp_status_all_1_t;

#define RD_COMP_STATUS_ALL_2                     0x000001d8
#define   RD_COMP_RISE_DM_MASK                   0x01ff0000
#define   RD_COMP_RISE_DM_SHIFT                          16
#define   RD_COMP_RISE_DQ_71_64_MASK             0x000000ff
#define   RD_COMP_RISE_DQ_71_64_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 rd_comp_rise_dq_71_64:8;
        u32 rsvd_8:8;
        u32 rd_comp_rise_dm:9;
        u32 rsvd_25:7;
    } b;
} rd_comp_status_all_2_t;

#define RD_COMP_STATUS_ALL_3                     0x000001dc
#define   RD_COMP_FALL_BYTEWISE_MASK             0x01ff0000
#define   RD_COMP_FALL_BYTEWISE_SHIFT                    16
#define   RD_COMP_RISE_BYTEWISE_MASK             0x000001ff
#define   RD_COMP_RISE_BYTEWISE_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 rd_comp_rise_bytewise:9;
        u32 rsvd_9:7;
        u32 rd_comp_fall_bytewise:9;
        u32 rsvd_25:7;
    } b;
} rd_comp_status_all_3_t;

#define RD_COMP_STATUS_ALL_4                     0x000001e0
#define   RD_COMP_FALL_DQ_31_0_MASK              0xffffffff
#define   RD_COMP_FALL_DQ_31_0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 rd_comp_fall_dq_31_0:32;
    } b;
} rd_comp_status_all_4_t;

#define RD_COMP_STATUS_ALL_5                     0x000001e4
#define   RD_COMP_FALL_DQ_63_32_MASK             0xffffffff
#define   RD_COMP_FALL_DQ_63_32_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 rd_comp_fall_dq_63_32:32;
    } b;
} rd_comp_status_all_5_t;

#define RD_COMP_STATUS_ALL_6                     0x000001e8
#define   RD_COMP_FALL_DM_MASK                   0x01ff0000
#define   RD_COMP_FALL_DM_SHIFT                          16
#define   RD_COMP_FALL_DQ_71_64_MASK             0x000000ff
#define   RD_COMP_FALL_DQ_71_64_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 rd_comp_fall_dq_71_64:8;
        u32 rsvd_8:8;
        u32 rd_comp_fall_dm:9;
        u32 rsvd_25:7;
    } b;
} rd_comp_status_all_6_t;

#define STR_GATE_STATUS_0                        0x000001f0
#define   STR_GATE_OUTP_BY3_MASK                 0xf0000000
#define   STR_GATE_OUTP_BY3_SHIFT                        28
#define   STR_GATE_OUTN_BY3_MASK                 0x0f000000
#define   STR_GATE_OUTN_BY3_SHIFT                        24
#define   STR_GATE_OUTP_BY2_MASK                 0x00f00000
#define   STR_GATE_OUTP_BY2_SHIFT                        20
#define   STR_GATE_OUTN_BY2_MASK                 0x000f0000
#define   STR_GATE_OUTN_BY2_SHIFT                        16
#define   STR_GATE_OUTP_BY1_MASK                 0x0000f000
#define   STR_GATE_OUTP_BY1_SHIFT                        12
#define   STR_GATE_OUTN_BY1_MASK                 0x00000f00
#define   STR_GATE_OUTN_BY1_SHIFT                         8
#define   STR_GATE_OUTP_BY0_MASK                 0x000000f0
#define   STR_GATE_OUTP_BY0_SHIFT                         4
#define   STR_GATE_OUTN_BY0_MASK                 0x0000000f
#define   STR_GATE_OUTN_BY0_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 str_gate_outn_by0:4;
        u32 str_gate_outp_by0:4;
        u32 str_gate_outn_by1:4;
        u32 str_gate_outp_by1:4;
        u32 str_gate_outn_by2:4;
        u32 str_gate_outp_by2:4;
        u32 str_gate_outn_by3:4;
        u32 str_gate_outp_by3:4;
    } b;
} str_gate_status_0_t;

#define STR_GATE_STATUS_1                        0x000001f4
#define   STR_GATE_OUTP_BY7_MASK                 0xf0000000
#define   STR_GATE_OUTP_BY7_SHIFT                        28
#define   STR_GATE_OUTN_BY7_MASK                 0x0f000000
#define   STR_GATE_OUTN_BY7_SHIFT                        24
#define   STR_GATE_OUTP_BY6_MASK                 0x00f00000
#define   STR_GATE_OUTP_BY6_SHIFT                        20
#define   STR_GATE_OUTN_BY6_MASK                 0x000f0000
#define   STR_GATE_OUTN_BY6_SHIFT                        16
#define   STR_GATE_OUTP_BY5_MASK                 0x0000f000
#define   STR_GATE_OUTP_BY5_SHIFT                        12
#define   STR_GATE_OUTN_BY5_MASK                 0x00000f00
#define   STR_GATE_OUTN_BY5_SHIFT                         8
#define   STR_GATE_OUTP_BY4_MASK                 0x000000f0
#define   STR_GATE_OUTP_BY4_SHIFT                         4
#define   STR_GATE_OUTN_BY4_MASK                 0x0000000f
#define   STR_GATE_OUTN_BY4_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 str_gate_outn_by4:4;
        u32 str_gate_outp_by4:4;
        u32 str_gate_outn_by5:4;
        u32 str_gate_outp_by5:4;
        u32 str_gate_outn_by6:4;
        u32 str_gate_outp_by6:4;
        u32 str_gate_outn_by7:4;
        u32 str_gate_outp_by7:4;
    } b;
} str_gate_status_1_t;

#define STR_GATE_STATUS_2                        0x000001f8
#define   STR_GATE_OUTP_BY8_MASK                 0x000000f0
#define   STR_GATE_OUTP_BY8_SHIFT                         4
#define   STR_GATE_OUTN_BY8_MASK                 0x0000000f
#define   STR_GATE_OUTN_BY8_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 str_gate_outn_by8:4;
        u32 str_gate_outp_by8:4;
        u32 rsvd_8:24;
    } b;
} str_gate_status_2_t;

#define SEL_CTRL_0                               0x00000200
#define   SEL_DQLVL_PAT_BL_MASK                  0x0c000000
#define   SEL_DQLVL_PAT_BL_SHIFT                         26
#define   SEL_DQLVL_PAT_MASK                     0x03000000
#define   SEL_DQLVL_PAT_SHIFT                            24
#define   SEL_RANK_MASK                          0x00c00000
#define   SEL_RANK_SHIFT                                 22
#define   SEL_CK_MASK                            0x00300000
#define   SEL_CK_SHIFT                                   20
#define   SEL_CALVL_PAT_MASK                     0x00040000
#define   SEL_CALVL_PAT_SHIFT                            18
#define   SEL_CA_MASK                            0x0001f000
#define   SEL_CA_SHIFT                                   12
#define   SEL_DBYTE_MASK                         0x00000f00
#define   SEL_DBYTE_SHIFT                                 8
#define   SEL_DBIT_MASK                          0x0000007f
#define   SEL_DBIT_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sel_dbit:7;
        u32 rsvd_7:1;
        u32 sel_dbyte:4;
        u32 sel_ca:5;
        u32 rsvd_17:1;
        u32 sel_calvl_pat:1;
        u32 rsvd_19:1;
        u32 sel_ck:2;
        u32 sel_rank:2;
        u32 sel_dqlvl_pat:2;
        u32 sel_dqlvl_pat_bl:2;
        u32 rsvd_28:4;
    } b;
} sel_ctrl_0_t;

#define SEL_CTRL_1                               0x00000204
#define   SIMUL_DQLVL_PAT_MASK                   0x00000400
#define   SIMUL_DQLVL_PAT_SHIFT                          10
#define   SIMUL_OADLY_RANK_MASK                  0x00000200
#define   SIMUL_OADLY_RANK_SHIFT                          9
#define   SIMUL_OADLY_CK_MASK                    0x00000100
#define   SIMUL_OADLY_CK_SHIFT                            8
#define   SIMUL_OADLY_CA_MASK                    0x00000080
#define   SIMUL_OADLY_CA_SHIFT                            7
#define   SIMUL_ODDLY_DATA_MASK                  0x00000040
#define   SIMUL_ODDLY_DATA_SHIFT                          6
#define   SIMUL_ODDLY_DQDM_MASK                  0x00000020
#define   SIMUL_ODDLY_DQDM_SHIFT                          5
#define   SIMUL_ODDLY_DQS_MASK                   0x00000010
#define   SIMUL_ODDLY_DQS_SHIFT                           4
#define   SIMUL_STRGT_0_MASK                     0x00000008
#define   SIMUL_STRGT_0_SHIFT                             3
#define   SIMUL_RD_DLY_MASK                      0x00000004
#define   SIMUL_RD_DLY_SHIFT                              2
#define   SIMUL_LVL_PAT_MASK                     0x00000002
#define   SIMUL_LVL_PAT_SHIFT                             1
#define   SIMUL_DLL_PHASE_MASK                   0x00000001
#define   SIMUL_DLL_PHASE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 simul_dll_phase:1;
        u32 simul_lvl_pat:1;
        u32 simul_rd_dly:1;
        u32 simul_strgt_0:1;
        u32 simul_oddly_dqs:1;
        u32 simul_oddly_dqdm:1;
        u32 simul_oddly_data:1;
        u32 simul_oadly_ca:1;
        u32 simul_oadly_ck:1;
        u32 simul_oadly_rank:1;
        u32 simul_dqlvl_pat:1;
        u32 rsvd_11:21;
    } b;
} sel_ctrl_1_t;

#define SEL_CTRL_2                               0x00000208

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} sel_ctrl_2_t;

#define SEL_CTRL_3                               0x0000020c

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} sel_ctrl_3_t;

#define SEL_DLL_0                                0x00000210
#define   DLL_DLY_OUT_M_MASK                     0x07ff0000
#define   DLL_DLY_OUT_M_SHIFT                            16
#define   DLL_PHASE1_MASK                        0x00003f00
#define   DLL_PHASE1_SHIFT                                8
#define   DLL_PHASE0_MASK                        0x0000003f
#define   DLL_PHASE0_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 dll_phase0:6;
        u32 rsvd_6:2;
        u32 dll_phase1:6;
        u32 rsvd_14:2;
        u32 dll_dly_out_m:11;
        u32 rsvd_27:5;
    } b;
} sel_dll_0_t;

#define SEL_RD_DLY_0                             0x00000218
#define   DM_RD_DLY_MASK                         0x00000007
#define   DM_RD_DLY_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 dm_rd_dly:3;
        u32 rsvd_3:29;
    } b;
} sel_rd_dly_0_t;

#define SEL_RD_DLY_1                             0x0000021c
#define   DQ_RD_DLY_MASK                         0x00000007
#define   DQ_RD_DLY_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 dq_rd_dly:3;
        u32 rsvd_3:29;
    } b;
} sel_rd_dly_1_t;

#define SEL_STRGT_0                              0x00000220
#define   STRGT_PHASE_DLY_MASK                   0x00001f00
#define   STRGT_PHASE_DLY_SHIFT                           8
#define   STRGT_TAP_DLY_MASK                     0x000000ff
#define   STRGT_TAP_DLY_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 strgt_tap_dly:8;
        u32 strgt_phase_dly:5;
        u32 rsvd_13:19;
    } b;
} sel_strgt_0_t;

#define SEL_ODDLY_0                              0x00000230
#define   DQS_WR_RSV_MASK                        0x0000ff00
#define   DQS_WR_RSV_SHIFT                                8
#define   DQS_WR_DLY_MASK                        0x000000ff
#define   DQS_WR_DLY_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 dqs_wr_dly:8;
        u32 dqs_wr_rsv:8;
        u32 rsvd_16:16;
    } b;
} sel_oddly_0_t;

#define SEL_ODDLY_1                              0x00000234
#define   DM_WR_RSV_MASK                         0x0000ff00
#define   DM_WR_RSV_SHIFT                                 8
#define   DM_WR_DLY_MASK                         0x000000ff
#define   DM_WR_DLY_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 dm_wr_dly:8;
        u32 dm_wr_rsv:8;
        u32 rsvd_16:16;
    } b;
} sel_oddly_1_t;

#define SEL_ODDLY_2                              0x00000238
#define   DQ_WR_RSV_MASK                         0x0000ff00
#define   DQ_WR_RSV_SHIFT                                 8
#define   DQ_WR_DLY_MASK                         0x000000ff
#define   DQ_WR_DLY_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 dq_wr_dly:8;
        u32 dq_wr_rsv:8;
        u32 rsvd_16:16;
    } b;
} sel_oddly_2_t;

#define SEL_OADLY_0                              0x00000240
#define   CA_WR_RSV_MASK                         0x0000ff00
#define   CA_WR_RSV_SHIFT                                 8
#define   CA_WR_DLY_MASK                         0x000000ff
#define   CA_WR_DLY_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 ca_wr_dly:8;
        u32 ca_wr_rsv:8;
        u32 rsvd_16:16;
    } b;
} sel_oadly_0_t;

#define SEL_OADLY_1                              0x00000244
#define   CK_WR_RSV_MASK                         0x0000ff00
#define   CK_WR_RSV_SHIFT                                 8
#define   CK_WR_DLY_MASK                         0x000000ff
#define   CK_WR_DLY_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 ck_wr_dly:8;
        u32 ck_wr_rsv:8;
        u32 rsvd_16:16;
    } b;
} sel_oadly_1_t;

#define SEL_OADLY_2                              0x00000248
#define   RANK_WR_RSV_MASK                       0x0000ff00
#define   RANK_WR_RSV_SHIFT                               8
#define   RANK_WR_DLY_MASK                       0x000000ff
#define   RANK_WR_DLY_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 rank_wr_dly:8;
        u32 rank_wr_rsv:8;
        u32 rsvd_16:16;
    } b;
} sel_oadly_2_t;

#define SEL_CALVL_PAT_0                          0x00000260
#define   CALVL_PAT_BG_MASK                      0x003f0000
#define   CALVL_PAT_BG_SHIFT                             16
#define   CALVL_PAT_FG_MASK                      0x0000003f
#define   CALVL_PAT_FG_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 calvl_pat_fg:6;
        u32 rsvd_6:10;
        u32 calvl_pat_bg:6;
        u32 rsvd_22:10;
    } b;
} sel_calvl_pat_0_t;

#define LB_CTRL_0                                0x000003c0
#define   SEL_LBTEST_MASK                        0x0f000000
#define   SEL_LBTEST_SHIFT                               24
#define   LB_INFINITE_MODE_MASK                  0x00080000
#define   LB_INFINITE_MODE_SHIFT                         19
#define   LB_RDAT_DLY_MASK                       0x00000f00
#define   LB_RDAT_DLY_SHIFT                               8
#define   LB_RPTR_DLY_MASK                       0x000000f0
#define   LB_RPTR_DLY_SHIFT                               4
#define   LB_START_MASK                          0x00000001
#define   LB_START_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 lb_start:1;
        u32 rsvd_1:3;
        u32 lb_rptr_dly:4;
        u32 lb_rdat_dly:4;
        u32 rsvd_12:7;
        u32 lb_infinite_mode:1;
        u32 rsvd_20:4;
        u32 sel_lbtest:4;
        u32 rsvd_28:4;
    } b;
} lb_ctrl_0_t;

#define LB_CTRL_1                                0x000003c4
#define   LB_TEST_SEL_MASK                       0xffff0000
#define   LB_TEST_SEL_SHIFT                              16
#define   LB_STATUS_SEL_MASK                     0x0000ff00
#define   LB_STATUS_SEL_SHIFT                             8

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:8;
        u32 lb_status_sel:8;
        u32 lb_test_sel:16;
    } b;
} lb_ctrl_1_t;

#define LB_CTRL_3                                0x000003cc
#define   LB_SEED_MASK                           0xffffffff
#define   LB_SEED_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 lb_seed:32;
    } b;
} lb_ctrl_3_t;

#define LB_SCTRL_0                               0x000003d0
#define   LB_PAT_SEL_MASK                        0x00700000
#define   LB_PAT_SEL_SHIFT                               20
#define   LB_LENGTH_MASK                         0x0000ffff
#define   LB_LENGTH_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 lb_length:16;
        u32 rsvd_16:4;
        u32 lb_pat_sel:3;
        u32 rsvd_23:9;
    } b;
} lb_sctrl_0_t;

#define LB_SCTRL_1                               0x000003d4
#define   LB_DQS_WR_DLY_COARSE_MASK              0x00700000
#define   LB_DQS_WR_DLY_COARSE_SHIFT                     20
#define   LB_DQ_WR_DLY_COARSE_MASK               0x00070000
#define   LB_DQ_WR_DLY_COARSE_SHIFT                      16
#define   LB_DLL_PHASE1_SEL_MASK                 0x00000040
#define   LB_DLL_PHASE1_SEL_SHIFT                         6
#define   LB_DLL_PHASE0_SEL_MASK                 0x00000020
#define   LB_DLL_PHASE0_SEL_SHIFT                         5
#define   LB_DLL_BYPASS_EN_MASK                  0x00000010
#define   LB_DLL_BYPASS_EN_SHIFT                          4
#define   LB_DQS_POLARITY_MASK                   0x00000008
#define   LB_DQS_POLARITY_SHIFT                           3
#define   LB_DQS_EDGE_SEL_MASK                   0x00000004
#define   LB_DQS_EDGE_SEL_SHIFT                           2
#define   LB_DQ_EDGE_SEL_MASK                    0x00000002
#define   LB_DQ_EDGE_SEL_SHIFT                            1
#define   LB_DATA_DDRMODE_MASK                   0x00000001
#define   LB_DATA_DDRMODE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 lb_data_ddrmode:1;
        u32 lb_dq_edge_sel:1;
        u32 lb_dqs_edge_sel:1;
        u32 lb_dqs_polarity:1;
        u32 lb_dll_bypass_en:1;
        u32 lb_dll_phase0_sel:1;
        u32 lb_dll_phase1_sel:1;
        u32 rsvd_7:9;
        u32 lb_dq_wr_dly_coarse:3;
        u32 rsvd_19:1;
        u32 lb_dqs_wr_dly_coarse:3;
        u32 rsvd_23:9;
    } b;
} lb_sctrl_1_t;

#define LB_STATUS_0                              0x000003d8
#define   LB_STATUS_MASK                         0xffffffff
#define   LB_STATUS_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 lb_status:32;
    } b;
} lb_status_0_t;

#define LB_STATUS_1                              0x000003dc
#define   LB_STATUS_TEST_FAIL_MASK               0xffff0000
#define   LB_STATUS_TEST_FAIL_SHIFT                      16
#define   LB_STATUS_TEST_FINISH_MASK             0x0000ffff
#define   LB_STATUS_TEST_FINISH_SHIFT                     0
typedef union {
    u32 all;
    struct {
        u32 lb_status_test_finish:16;
        u32 lb_status_test_fail:16;
    } b;
} lb_status_1_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ revid_0_t revid_0;
    /* 0x0004 */ revid_1_t revid_1;
    /* 0x0008 */ system_t system;
    /* 0x000c */ u32 rsvd_c;
    /* 0x0010 */ io_data_0_t io_data_0;
    /* 0x0014 */ io_data_1_t io_data_1;
    /* 0x0018 */ io_data_2_t io_data_2;
    /* 0x001c */ u32 rsvd_1c;
    /* 0x0020 */ io_adcm_0_t io_adcm_0;
    /* 0x0024 */ io_adcm_1_t io_adcm_1;
    /* 0x0028 */ io_adcm_2_t io_adcm_2;
    /* 0x002c */ io_adcm_3_t io_adcm_3;
    /* 0x0030 */ io_ck_0_t io_ck_0;
    /* 0x0034 */ u32 rsvd_34;
    /* 0x0038 */ io_alertn_t io_alertn;
    /* 0x003c */ io_resetn_t io_resetn;
    /* 0x0040 */ io_cal_0_t io_cal_0;
    /* 0x0044 */ io_cal_1_t io_cal_1;
    /* 0x0048 */ u32 rsvd_48 [2];
    /* 0x0050 */ vref_ctrl_0_t vref_ctrl_0;
    /* 0x0054 */ vgen_ctrl_0_t vgen_ctrl_0;
    /* 0x0058 */ u32 rsvd_58 [2];
    /* 0x0060 */ io_misc_0_t io_misc_0;
    /* 0x0064 */ u32 rsvd_64 [7];
    /* 0x0080 */ sync_ctrl_0_t sync_ctrl_0;
    /* 0x0084 */ u32 rsvd_84;
    /* 0x0088 */ dfi_ctrl_0_t dfi_ctrl_0;
    /* 0x008c */ u32 rsvd_8c;
    /* 0x0090 */ out_ctrl_0_t out_ctrl_0;
    /* 0x0094 */ out_ctrl_1_t out_ctrl_1;
    /* 0x0098 */ u32 rsvd_98 [2];
    /* 0x00a0 */ in_ctrl_0_t in_ctrl_0;
    /* 0x00a4 */ u32 rsvd_a4 [3];
    /* 0x00b0 */ ck_gate_0_t ck_gate_0;
    /* 0x00b4 */ ck_ctrl_0_t ck_ctrl_0;
    /* 0x00b8 */ u32 rsvd_b8 [2];
    /* 0x00c0 */ lvl_all_ctrl_0_t lvl_all_ctrl_0;
    /* 0x00c4 */ lvl_all_wo_0_t lvl_all_wo_0;
    /* 0x00c8 */ lvl_all_ro_0_t lvl_all_ro_0;
    /* 0x00cc */ u32 rsvd_cc;
    /* 0x00d0 */ lvl_wrlvl_0_t lvl_wrlvl_0;
    /* 0x00d4 */ lvl_rdlvl_0_t lvl_rdlvl_0;
    /* 0x00d8 */ lvl_rdlvl_1_t lvl_rdlvl_1;
    /* 0x00dc */ u32 rsvd_dc;
    /* 0x00e0 */ lvl_calvl_0_t lvl_calvl_0;
    /* 0x00e4 */ u32 rsvd_e4 [11];
    /* 0x0110 */ dll_ctrl_0_t dll_ctrl_0;
    /* 0x0114 */ dll_ctrl_1_t dll_ctrl_1;
    /* 0x0118 */ u32 rsvd_118 [2];
    /* 0x0120 */ strgt_ctrl_0_t strgt_ctrl_0;
    /* 0x0124 */ u32 rsvd_124;
    /* 0x0128 */ rddata_0_t rddata_0;
    /* 0x012c */ u32 rsvd_12c [5];
    /* 0x0140 */ oadly_0_t oadly_0;
    /* 0x0144 */ u32 rsvd_144 [3];
    /* 0x0150 */ lp_ctrl_0_t lp_ctrl_0;
    /* 0x0154 */ u32 rsvd_154 [23];
    /* 0x01b0 */ ca_comp_status_0_t ca_comp_status_0;
    /* 0x01b4 */ u32 rsvd_1b4 [3];
    /* 0x01c0 */ dq_status_all_0_t dq_status_all_0;
    /* 0x01c4 */ dq_status_all_1_t dq_status_all_1;
    /* 0x01c8 */ dq_status_all_2_t dq_status_all_2;
    /* 0x01cc */ u32 rsvd_1cc;
    /* 0x01d0 */ rd_comp_status_all_0_t rd_comp_status_all_0;
    /* 0x01d4 */ rd_comp_status_all_1_t rd_comp_status_all_1;
    /* 0x01d8 */ rd_comp_status_all_2_t rd_comp_status_all_2;
    /* 0x01dc */ rd_comp_status_all_3_t rd_comp_status_all_3;
    /* 0x01e0 */ rd_comp_status_all_4_t rd_comp_status_all_4;
    /* 0x01e4 */ rd_comp_status_all_5_t rd_comp_status_all_5;
    /* 0x01e8 */ rd_comp_status_all_6_t rd_comp_status_all_6;
    /* 0x01ec */ u32 rsvd_1ec;
    /* 0x01f0 */ str_gate_status_0_t str_gate_status_0;
    /* 0x01f4 */ str_gate_status_1_t str_gate_status_1;
    /* 0x01f8 */ str_gate_status_2_t str_gate_status_2;
    /* 0x01fc */ u32 rsvd_1fc;
    /* 0x0200 */ sel_ctrl_0_t sel_ctrl_0;
    /* 0x0204 */ sel_ctrl_1_t sel_ctrl_1;
    /* 0x0208 */ sel_ctrl_2_t sel_ctrl_2;
    /* 0x020c */ sel_ctrl_3_t sel_ctrl_3;
    /* 0x0210 */ sel_dll_0_t sel_dll_0;
    /* 0x0214 */ u32 rsvd_214;
    /* 0x0218 */ sel_rd_dly_0_t sel_rd_dly_0;
    /* 0x021c */ sel_rd_dly_1_t sel_rd_dly_1;
    /* 0x0220 */ sel_strgt_0_t sel_strgt_0;
    /* 0x0224 */ u32 rsvd_224 [3];
    /* 0x0230 */ sel_oddly_0_t sel_oddly_0;
    /* 0x0234 */ sel_oddly_1_t sel_oddly_1;
    /* 0x0238 */ sel_oddly_2_t sel_oddly_2;
    /* 0x023c */ u32 rsvd_23c;
    /* 0x0240 */ sel_oadly_0_t sel_oadly_0;
    /* 0x0244 */ sel_oadly_1_t sel_oadly_1;
    /* 0x0248 */ sel_oadly_2_t sel_oadly_2;
    /* 0x024c */ u32 rsvd_24c [5];
    /* 0x0260 */ sel_calvl_pat_0_t sel_calvl_pat_0;
    /* 0x0264 */ u32 rsvd_264 [87];
    /* 0x03c0 */ lb_ctrl_0_t lb_ctrl_0;
    /* 0x03c4 */ lb_ctrl_1_t lb_ctrl_1;
    /* 0x03c8 */ u32 rsvd_3c8;
    /* 0x03cc */ lb_ctrl_3_t lb_ctrl_3;
    /* 0x03d0 */ lb_sctrl_0_t lb_sctrl_0;
    /* 0x03d4 */ lb_sctrl_1_t lb_sctrl_1;
    /* 0x03d8 */ lb_status_0_t lb_status_0;
    /* 0x03dc */ lb_status_1_t lb_status_1;
} dfi_reg_regs_t;


#endif /* rev 0 */