//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _DEC_TOP_CTRL_REGISTER_H_
#define _DEC_TOP_CTRL_REGISTER_H_

#define DEC_TOP_CTRS_REG0                        0x00000000
#define   ECCU_CUR_PDEC_CW_ID_MASK               0x0c000000
#define   ECCU_CUR_PDEC_CW_ID_SHIFT                      26
#define   ECCU_CUR_PDEC_BUSY_MASK                0x02000000
#define   ECCU_CUR_PDEC_BUSY_SHIFT                       25
#define   ECCU_CUR_PDEC_DU_XFER_DONE_MASK        0x01000000
#define   ECCU_CUR_PDEC_DU_XFER_DONE_SHIFT               24
#define   ECCU_CUR_PDEC_CW_XFER_DONE_MASK        0x00800000
#define   ECCU_CUR_PDEC_CW_XFER_DONE_SHIFT               23
#define   ECCU_CUR_PDEC_STATUS_MASK              0x007e0000
#define   ECCU_CUR_PDEC_STATUS_SHIFT                     17
#define   ECCU_CUR_PDEC_DONE_MASK                0x00010000
#define   ECCU_CUR_PDEC_DONE_SHIFT                       16
#define   ECCU_MDEC_DIS_MASK                     0x0000c000
#define   ECCU_MDEC_DIS_SHIFT                            14
#define   ECCU_CUR_MDEC_CW_ID_MASK               0x00003000
#define   ECCU_CUR_MDEC_CW_ID_SHIFT                      12
#define   ECCU_CUR_MDEC_BUSY_MASK                0x00000800
#define   ECCU_CUR_MDEC_BUSY_SHIFT                       11
#define   ECCU_CUR_MDEC_DU_XFER_DONE_MASK        0x00000400
#define   ECCU_CUR_MDEC_DU_XFER_DONE_SHIFT               10
#define   ECCU_CUR_MDEC_CW_XFER_DONE_MASK        0x00000200
#define   ECCU_CUR_MDEC_CW_XFER_DONE_SHIFT                9
#define   ECCU_CUR_MDEC_STATUS_MASK              0x000001f8
#define   ECCU_CUR_MDEC_STATUS_SHIFT                      3
#define   ECCU_CUR_MDEC_DONE_MASK                0x00000004
#define   ECCU_CUR_MDEC_DONE_SHIFT                        2
#define   ECCU_OTF_DEC_MODE_MASK                 0x00000003
#define   ECCU_OTF_DEC_MODE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 eccu_otf_dec_mode:2;
        u32 eccu_cur_mdec_done:1;
        u32 eccu_cur_mdec_status:6;
        u32 eccu_cur_mdec_cw_xfer_done:1;
        u32 eccu_cur_mdec_du_xfer_done:1;
        u32 eccu_cur_mdec_busy:1;
        u32 eccu_cur_mdec_cw_id:2;
        u32 eccu_mdec_dis:2;
        u32 eccu_cur_pdec_done:1;
        u32 eccu_cur_pdec_status:6;
        u32 eccu_cur_pdec_cw_xfer_done:1;
        u32 eccu_cur_pdec_du_xfer_done:1;
        u32 eccu_cur_pdec_busy:1;
        u32 eccu_cur_pdec_cw_id:2;
        u32 rsvd_28:4;
    } b;
} dec_top_ctrs_reg0_t;

#define DEC_TOP_CTRS_REG1                        0x00000004
#define   ECCU_ARD_LOOP_CNT_MASK                 0x0f000000
#define   ECCU_ARD_LOOP_CNT_SHIFT                        24
#define   ECCU_ARD_CH_ID_MASK                    0x00600000
#define   ECCU_ARD_CH_ID_SHIFT                           21
#define   ECCU_ARD_NUM_OVRFLW_MASK               0x00100000
#define   ECCU_ARD_NUM_OVRFLW_SHIFT                      20
#define   ECCU_ARD_DU_XFER_DONE_MASK             0x00080000
#define   ECCU_ARD_DU_XFER_DONE_SHIFT                    19
#define   ECCU_ARD_CW_XFER_DONE_MASK             0x00040000
#define   ECCU_ARD_CW_XFER_DONE_SHIFT                    18
#define   ECCU_ARD_CW_FOUND_MASK                 0x00020000
#define   ECCU_ARD_CW_FOUND_SHIFT                        17
#define   ECCU_ARD_DEC_DONE_MASK                 0x00010000
#define   ECCU_ARD_DEC_DONE_SHIFT                        16
#define   ECCU_ARD_BYPASS_ERASE_MASK             0x00008000
#define   ECCU_ARD_BYPASS_ERASE_SHIFT                    15
#define   ECCU_ARD_CW_AUTO_DROP_DIS_MASK         0x00002000
#define   ECCU_ARD_CW_AUTO_DROP_DIS_SHIFT                13
#define   ECCU_ARD_FORCE_AUTO_RESUME_MASK        0x00001000
#define   ECCU_ARD_FORCE_AUTO_RESUME_SHIFT               12
#define   ECCU_ARD_MAX_NUM_CH_MASK               0x00000f00
#define   ECCU_ARD_MAX_NUM_CH_SHIFT                       8
#define   ECCU_ARD_MAX_ACT_NUM_MASK              0x000000f0
#define   ECCU_ARD_MAX_ACT_NUM_SHIFT                      4
#define   ECCU_ARD_DATA_FMT_MASK                 0x0000000c
#define   ECCU_ARD_DATA_FMT_SHIFT                         2
#define   ECCU_ARD_DEC_MODE_MASK                 0x00000003
#define   ECCU_ARD_DEC_MODE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 eccu_ard_dec_mode:2;
        u32 eccu_ard_data_fmt:2;
        u32 eccu_ard_max_act_num:4;
        u32 eccu_ard_max_num_ch:4;
        u32 eccu_ard_force_auto_resume:1;
        u32 eccu_ard_cw_auto_drop_dis:1;
        u32 rsvd_14:1;
        u32 eccu_ard_bypass_erase:1;
        u32 eccu_ard_dec_done:1;
        u32 eccu_ard_cw_found:1;
        u32 eccu_ard_cw_xfer_done:1;
        u32 eccu_ard_du_xfer_done:1;
        u32 eccu_ard_num_ovrflw:1;
        u32 eccu_ard_ch_id:2;
        u32 rsvd_23:1;
        u32 eccu_ard_loop_cnt:4;
        u32 rsvd_28:4;
    } b;
} dec_top_ctrs_reg1_t;

#define DEC_TOP_CTRS_REG2                        0x00000008
#define   ECCU_ERD_DU_XFER_DONE_MASK             0x00080000
#define   ECCU_ERD_DU_XFER_DONE_SHIFT                    19
#define   ECCU_ERD_CW_XFER_DONE_MASK             0x00040000
#define   ECCU_ERD_CW_XFER_DONE_SHIFT                    18
#define   ECCU_ERD_CW_FOUND_MASK                 0x00020000
#define   ECCU_ERD_CW_FOUND_SHIFT                        17
#define   ECCU_ERD_DEC_DONE_MASK                 0x00010000
#define   ECCU_ERD_DEC_DONE_SHIFT                        16
#define   ECCU_ERD_MODE_MASK                     0x00000200
#define   ECCU_ERD_MODE_SHIFT                             9
#define   ECCU_ERD_HD_ONLY_MASK                  0x00000100
#define   ECCU_ERD_HD_ONLY_SHIFT                          8
#define   ECCU_ERD_IPI_EN_MASK                   0x00000080
#define   ECCU_ERD_IPI_EN_SHIFT                           7
#define   ECCU_ERD_DIRECT_MODE_MASK              0x00000040
#define   ECCU_ERD_DIRECT_MODE_SHIFT                      6
#define   ECCU_ERD_DEC_SEL_MASK                  0x00000020
#define   ECCU_ERD_DEC_SEL_SHIFT                          5
#define   ECCU_ERD_DEC_START_MASK                0x00000010
#define   ECCU_ERD_DEC_START_SHIFT                        4
#define   ECCU_ERD_CW_SEL_MASK                   0x0000000c
#define   ECCU_ERD_CW_SEL_SHIFT                           2
#define   ECCU_START_CW_IDX_MASK                 0x00000003
#define   ECCU_START_CW_IDX_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 eccu_start_cw_idx:2;
        u32 eccu_erd_cw_sel:2;
        u32 eccu_erd_dec_start:1;
        u32 eccu_erd_dec_sel:1;
        u32 eccu_erd_direct_mode:1;
        u32 eccu_erd_ipi_en:1;
        u32 eccu_erd_hd_only:1;
        u32 eccu_erd_mode:1;
        u32 rsvd_10:6;
        u32 eccu_erd_dec_done:1;
        u32 eccu_erd_cw_found:1;
        u32 eccu_erd_cw_xfer_done:1;
        u32 eccu_erd_du_xfer_done:1;
        u32 rsvd_20:12;
    } b;
} dec_top_ctrs_reg2_t;

#define DEC_TOP_CTRS_REG3                        0x0000000c
#define   ECCU_ERD_WR_RESP_BYPASS_MASK           0x10000000
#define   ECCU_ERD_WR_RESP_BYPASS_SHIFT                  28
#define   ECCU_ERD_RR_DEF_VAL_MASK               0x08000000
#define   ECCU_ERD_RR_DEF_VAL_SHIFT                      27
#define   ECCU_ERD_MAX_NUM_CH_MASK               0x07000000
#define   ECCU_ERD_MAX_NUM_CH_SHIFT                      24
#define   ECCU_ERD_MAX_RR_NUM_MASK               0x001f0000
#define   ECCU_ERD_MAX_RR_NUM_SHIFT                      16
#define   ECCU_ERD_MAX_DU_SZ_MASK                0x0000ffff
#define   ECCU_ERD_MAX_DU_SZ_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 eccu_erd_max_du_sz:16;
        u32 eccu_erd_max_rr_num:5;
        u32 rsvd_21:3;
        u32 eccu_erd_max_num_ch:3;
        u32 eccu_erd_rr_def_val:1;
        u32 eccu_erd_wr_resp_bypass:1;
        u32 rsvd_29:3;
    } b;
} dec_top_ctrs_reg3_t;

#define DEC_DSM_REG0                             0x00000010
#define   DEC_DSM_SELECT_MASK                    0x00000010
#define   DEC_DSM_SELECT_SHIFT                            4
#define   DEC_DSM_RESET_MASK                     0x00000002
#define   DEC_DSM_RESET_SHIFT                             1
#define   DEC_DSM_EN_MASK                        0x00000001
#define   DEC_DSM_EN_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 dec_dsm_en:1;
        u32 dec_dsm_reset:1;
        u32 rsvd_2:2;
        u32 dec_dsm_select:1;
        u32 rsvd_5:27;
    } b;
} dec_dsm_reg0_t;

#define DEC_DSM_REG1                             0x00000014
#define   DEC_DSM_THD_MASK                       0xffff0000
#define   DEC_DSM_THD_SHIFT                              16
#define   DEC_DSM_SRC_MASK                       0x00000f00
#define   DEC_DSM_SRC_SHIFT                               8
#define   DEC_DSM_ACC_CW_COND_EN_MASK            0x00000004
#define   DEC_DSM_ACC_CW_COND_EN_SHIFT                    2
#define   DEC_DSM_ACC_CW_COND_MASK               0x00000002
#define   DEC_DSM_ACC_CW_COND_SHIFT                       1
#define   DEC_DSM_DEC_SELECT_MASK                0x00000001
#define   DEC_DSM_DEC_SELECT_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 dec_dsm_dec_select:1;
        u32 dec_dsm_acc_cw_cond:1;
        u32 dec_dsm_acc_cw_cond_en:1;
        u32 rsvd_3:5;
        u32 dec_dsm_src:4;
        u32 rsvd_12:4;
        u32 dec_dsm_thd:16;
    } b;
} dec_dsm_reg1_t;

#define DEC_DSM_REG2                             0x00000018
#define   DSM_ACC_L_MASK                         0xffffffff
#define   DSM_ACC_L_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 dsm_acc_l:32;
    } b;
} dec_dsm_reg2_t;

#define DEC_DSM_REG3                             0x0000001c
#define   DSM_ACC_H_MASK                         0xffffffff
#define   DSM_ACC_H_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 dsm_acc_h:32;
    } b;
} dec_dsm_reg3_t;

#define DEC_DSM_REG4                             0x00000020
#define   DSM_CW_COUNT_MASK                      0xffffffff
#define   DSM_CW_COUNT_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 dsm_cw_count:32;
    } b;
} dec_dsm_reg4_t;

#define DEC_ARD_LLRM_REG0                        0x00000024
#define   ECCU_ARD_HD_111_MAP_MASK               0x0c000000
#define   ECCU_ARD_HD_111_MAP_SHIFT                      26
#define   ECCU_ARD_HD_110_MAP_MASK               0x03000000
#define   ECCU_ARD_HD_110_MAP_SHIFT                      24
#define   ECCU_ARD_HD_101_MAP_MASK               0x00c00000
#define   ECCU_ARD_HD_101_MAP_SHIFT                      22
#define   ECCU_ARD_HD_100_MAP_MASK               0x00300000
#define   ECCU_ARD_HD_100_MAP_SHIFT                      20
#define   ECCU_ARD_HD_011_MAP_MASK               0x000c0000
#define   ECCU_ARD_HD_011_MAP_SHIFT                      18
#define   ECCU_ARD_HD_010_MAP_MASK               0x00030000
#define   ECCU_ARD_HD_010_MAP_SHIFT                      16
#define   ECCU_ARD_HD_001_MAP_MASK               0x0000c000
#define   ECCU_ARD_HD_001_MAP_SHIFT                      14
#define   ECCU_ARD_HD_000_MAP_MASK               0x00003000
#define   ECCU_ARD_HD_000_MAP_SHIFT                      12
#define   ECCU_ARD_HD_11_MAP_MASK                0x00000c00
#define   ECCU_ARD_HD_11_MAP_SHIFT                       10
#define   ECCU_ARD_HD_10_MAP_MASK                0x00000300
#define   ECCU_ARD_HD_10_MAP_SHIFT                        8
#define   ECCU_ARD_HD_01_MAP_MASK                0x000000c0
#define   ECCU_ARD_HD_01_MAP_SHIFT                        6
#define   ECCU_ARD_HD_00_MAP_MASK                0x00000030
#define   ECCU_ARD_HD_00_MAP_SHIFT                        4
#define   ECCU_ARD_HD_1_MAP_MASK                 0x0000000c
#define   ECCU_ARD_HD_1_MAP_SHIFT                         2
#define   ECCU_ARD_HD_0_MAP_MASK                 0x00000003
#define   ECCU_ARD_HD_0_MAP_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 eccu_ard_hd_0_map:2;
        u32 eccu_ard_hd_1_map:2;
        u32 eccu_ard_hd_00_map:2;
        u32 eccu_ard_hd_01_map:2;
        u32 eccu_ard_hd_10_map:2;
        u32 eccu_ard_hd_11_map:2;
        u32 eccu_ard_hd_000_map:2;
        u32 eccu_ard_hd_001_map:2;
        u32 eccu_ard_hd_010_map:2;
        u32 eccu_ard_hd_011_map:2;
        u32 eccu_ard_hd_100_map:2;
        u32 eccu_ard_hd_101_map:2;
        u32 eccu_ard_hd_110_map:2;
        u32 eccu_ard_hd_111_map:2;
        u32 rsvd_28:4;
    } b;
} dec_ard_llrm_reg0_t;

#define DEC_CLK_GATE_CTRL_REG                    0x0000002c
#define   PDEC_CLK_GATE_DIS_MASK                 0x00000001
#define   PDEC_CLK_GATE_DIS_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 pdec_clk_gate_dis:1;
        u32 rsvd_1:31;
    } b;
} dec_clk_gate_ctrl_reg_t;

#define DEC_01_ACCU_REG0                         0x00000030
#define   DEC_DU_01_ACCUM_EN_MASK                0x00000100
#define   DEC_DU_01_ACCUM_EN_SHIFT                        8
#define   DEC_01_ACCU_CH_SEL_MASK                0x00000070
#define   DEC_01_ACCU_CH_SEL_SHIFT                        4
#define   DEC_01_ACCU_SEL_MASK                   0x00000004
#define   DEC_01_ACCU_SEL_SHIFT                           2
#define   DEC_01_ACCU_RESET_MASK                 0x00000002
#define   DEC_01_ACCU_RESET_SHIFT                         1
#define   DEC_01_ACCU_EN_MASK                    0x00000001
#define   DEC_01_ACCU_EN_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 dec_01_accu_en:1;
        u32 dec_01_accu_reset:1;
        u32 dec_01_accu_sel:1;
        u32 rsvd_3:1;
        u32 dec_01_accu_ch_sel:3;
        u32 rsvd_7:1;
        u32 dec_du_01_accum_en:1;
        u32 rsvd_9:23;
    } b;
} dec_01_accu_reg0_t;

#define DEC_01_ACCU_REG1                         0x00000034
#define   DEC_01_ACCU_COUNT_MASK                 0xffffffff
#define   DEC_01_ACCU_COUNT_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 dec_01_accu_count:32;
    } b;
} dec_01_accu_reg1_t;

#define DEC_BED_REG0                             0x00000038
#define   ECCU_BED_PAGE_SEL_MASK                 0x00000038
#define   ECCU_BED_PAGE_SEL_SHIFT                         3
#define   ECCU_BED_SIGN_FLIP_MASK                0x00000004
#define   ECCU_BED_SIGN_FLIP_SHIFT                        2
#define   ECCU_BED_MAG_ERASE_MASK                0x00000002
#define   ECCU_BED_MAG_ERASE_SHIFT                        1
#define   ECCU_BED_EN_MASK                       0x00000001
#define   ECCU_BED_EN_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 eccu_bed_en:1;
        u32 eccu_bed_mag_erase:1;
        u32 eccu_bed_sign_flip:1;
        u32 eccu_bed_page_sel:3;
        u32 rsvd_6:26;
    } b;
} dec_bed_reg0_t;

#define DEC_BED_REG1                             0x0000003c
#define   ECCU_BED_ERASE_LOC_1_MASK              0xffff0000
#define   ECCU_BED_ERASE_LOC_1_SHIFT                     16
#define   ECCU_BED_ERASE_LOC_0_MASK              0x0000ffff
#define   ECCU_BED_ERASE_LOC_0_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 eccu_bed_erase_loc_0:16;
        u32 eccu_bed_erase_loc_1:16;
    } b;
} dec_bed_reg1_t;

#define DEC_ERD_DDR_ST_ADDR_REG                  0x00000040
#define   ECCU_ERD_DDR_ST_ADR_MASK               0xffffffff
#define   ECCU_ERD_DDR_ST_ADR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 eccu_erd_ddr_st_adr:32;
    } b;
} dec_erd_ddr_st_addr_reg_t;

#define DEC_ERD_DDR_END_ADDR_REG                 0x00000044
#define   ECCU_ERD_DDR_END_ADR_MASK              0xffffffff
#define   ECCU_ERD_DDR_END_ADR_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 eccu_erd_ddr_end_adr:32;
    } b;
} dec_erd_ddr_end_addr_reg_t;

#define DEC_ERD_DDR_ST                           0x00000048
#define   ECCU_ERD_DDR_WR_ERR_MASK               0x00000030
#define   ECCU_ERD_DDR_WR_ERR_SHIFT                       4
#define   ECCU_ERD_DDR_RD_ERR_MASK               0x00000007
#define   ECCU_ERD_DDR_RD_ERR_SHIFT                       0
typedef union {
    u32 all;
    struct {
        u32 eccu_erd_ddr_rd_err:3;
        u32 rsvd_3:1;
        u32 eccu_erd_ddr_wr_err:2;
        u32 rsvd_6:26;
    } b;
} dec_erd_ddr_st_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ dec_top_ctrs_reg0_t dec_top_ctrs_reg0;
    /* 0x0004 */ dec_top_ctrs_reg1_t dec_top_ctrs_reg1;
    /* 0x0008 */ dec_top_ctrs_reg2_t dec_top_ctrs_reg2;
    /* 0x000c */ dec_top_ctrs_reg3_t dec_top_ctrs_reg3;
    /* 0x0010 */ dec_dsm_reg0_t dec_dsm_reg0;
    /* 0x0014 */ dec_dsm_reg1_t dec_dsm_reg1;
    /* 0x0018 */ dec_dsm_reg2_t dec_dsm_reg2;
    /* 0x001c */ dec_dsm_reg3_t dec_dsm_reg3;
    /* 0x0020 */ dec_dsm_reg4_t dec_dsm_reg4;
    /* 0x0024 */ dec_ard_llrm_reg0_t dec_ard_llrm_reg0;
    /* 0x0028 */ u32 rsvd_28;
    /* 0x002c */ dec_clk_gate_ctrl_reg_t dec_clk_gate_ctrl_reg;
    /* 0x0030 */ dec_01_accu_reg0_t dec_01_accu_reg0;
    /* 0x0034 */ dec_01_accu_reg1_t dec_01_accu_reg1;
    /* 0x0038 */ dec_bed_reg0_t dec_bed_reg0;
    /* 0x003c */ dec_bed_reg1_t dec_bed_reg1;
    /* 0x0040 */ dec_erd_ddr_st_addr_reg_t dec_erd_ddr_st_addr_reg;
    /* 0x0044 */ dec_erd_ddr_end_addr_reg_t dec_erd_ddr_end_addr_reg;
    /* 0x0048 */ dec_erd_ddr_st_t dec_erd_ddr_st;
} dec_top_ctrl_regs_t;


#endif /* rev 1002 */