//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _ECCU_PDEC_REGISTER_H_
#define _ECCU_PDEC_REGISTER_H_

#define PDEC_CTRS_REG0                           0x00000000
#define   ECCU_PDEC_CW_FND_MASK                  0xf0000000
#define   ECCU_PDEC_CW_FND_SHIFT                         28
#define   ECCU_PDEC_SYND_WT_MASK                 0x0fff0000
#define   ECCU_PDEC_SYND_WT_SHIFT                        16
#define   ECCU_PDEC_FINAL_ITER_CNT_MASK          0x0000ff00
#define   ECCU_PDEC_FINAL_ITER_CNT_SHIFT                  8
#define   ECCU_PDEC_CW_FND_INT_MASK              0x000000f0
#define   ECCU_PDEC_CW_FND_INT_SHIFT                      4
#define   ECCU_PDEC_ERR_OVRTHD_CW_CNT_CLR_MASK   0x00000008
#define   ECCU_PDEC_ERR_OVRTHD_CW_CNT_CLR_SHIFT           3
#define   ECCU_PDEC_ABORT_DIS_MASK               0x00000004
#define   ECCU_PDEC_ABORT_DIS_SHIFT                       2
#define   ECCU_PDEC_BYPASS_MASK                  0x00000002
#define   ECCU_PDEC_BYPASS_SHIFT                          1
#define   ECCU_PDEC_RESET_MASK                   0x00000001
#define   ECCU_PDEC_RESET_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_reset:1;
        u32 eccu_pdec_bypass:1;
        u32 eccu_pdec_abort_dis:1;
        u32 eccu_pdec_err_ovrthd_cw_cnt_clr:1;
        u32 eccu_pdec_cw_fnd_int:4;
        u32 eccu_pdec_final_iter_cnt:8;
        u32 eccu_pdec_synd_wt:12;
        u32 eccu_pdec_cw_fnd:4;
    } b;
} pdec_ctrs_reg0_t;

#define PDEC_CTRS_REG1                           0x00000004
#define   ECCU_PDEC_ERR_CNT1TO0_MASK             0xffff0000
#define   ECCU_PDEC_ERR_CNT1TO0_SHIFT                    16
#define   ECCU_PDEC_ERR_CNT0TO1_MASK             0x0000ffff
#define   ECCU_PDEC_ERR_CNT0TO1_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_err_cnt0to1:16;
        u32 eccu_pdec_err_cnt1to0:16;
    } b;
} pdec_ctrs_reg1_t;

#define PDEC_CTRS_REG2                           0x00000008
#define   ECCU_PDEC_ERR_OVRTHD_CW_CNT_MASK       0xffffffff
#define   ECCU_PDEC_ERR_OVRTHD_CW_CNT_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_err_ovrthd_cw_cnt:32;
    } b;
} pdec_ctrs_reg2_t;

#define PDEC_CTRS_REG3                           0x0000000c
#define   ECCU_PDEC_EARLY_TERM_DIS_MASK          0x80000000
#define   ECCU_PDEC_EARLY_TERM_DIS_SHIFT                 31
#define   ECCU_PDEC_FORCE_CW_FAIL_MASK           0x78000000
#define   ECCU_PDEC_FORCE_CW_FAIL_SHIFT                  27
#define   ECCU_PDEC_Q_SCALE_2_MASK               0x07000000
#define   ECCU_PDEC_Q_SCALE_2_SHIFT                      24
#define   ECCU_PDEC_ERR_THD_MASK                 0x00ff0000
#define   ECCU_PDEC_ERR_THD_SHIFT                        16
#define   ECCU_PDEC_MAX_ITER_CNT_MASK            0x0000ff00
#define   ECCU_PDEC_MAX_ITER_CNT_SHIFT                    8
#define   ECCU_PDEC_ERR_CNT_EN_MASK              0x00000080
#define   ECCU_PDEC_ERR_CNT_EN_SHIFT                      7
#define   ECCU_PDEC_Q_SCALE_1_MASK               0x00000070
#define   ECCU_PDEC_Q_SCALE_1_SHIFT                       4
#define   ECCU_PDEC_ABORT_DET_MASK               0x0000000f
#define   ECCU_PDEC_ABORT_DET_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_abort_det:4;
        u32 eccu_pdec_q_scale_1:3;
        u32 eccu_pdec_err_cnt_en:1;
        u32 eccu_pdec_max_iter_cnt:8;
        u32 eccu_pdec_err_thd:8;
        u32 eccu_pdec_q_scale_2:3;
        u32 eccu_pdec_force_cw_fail:4;
        u32 eccu_pdec_early_term_dis:1;
    } b;
} pdec_ctrs_reg3_t;

#define PDEC_CTRS_REG4                           0x00000010
#define   ECCU_PDEC_ABORT_ITER_THD_MASK          0x000000ff
#define   ECCU_PDEC_ABORT_ITER_THD_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_abort_iter_thd:8;
        u32 rsvd_8:24;
    } b;
} pdec_ctrs_reg4_t;

#define PDEC_CTRS_REG5                           0x00000014
#define   ECCU_PDEC_HD_1_LLR_MAP_MASK            0x1f000000
#define   ECCU_PDEC_HD_1_LLR_MAP_SHIFT                   24
#define   ECCU_PDEC_HD_0_LLR_MAP_MASK            0x001f0000
#define   ECCU_PDEC_HD_0_LLR_MAP_SHIFT                   16
#define   ECCU_PDEC_FINAL_LAYER_CNT_MASK         0x0000ffff
#define   ECCU_PDEC_FINAL_LAYER_CNT_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_final_layer_cnt:16;
        u32 eccu_pdec_hd_0_llr_map:5;
        u32 rsvd_21:3;
        u32 eccu_pdec_hd_1_llr_map:5;
        u32 rsvd_29:3;
    } b;
} pdec_ctrs_reg5_t;

#define PDEC_CTRS_REG6                           0x00000018
#define   ECCU_PDEC_HD_11_LLR_MAP_MASK           0x1f000000
#define   ECCU_PDEC_HD_11_LLR_MAP_SHIFT                  24
#define   ECCU_PDEC_HD_10_LLR_MAP_MASK           0x001f0000
#define   ECCU_PDEC_HD_10_LLR_MAP_SHIFT                  16
#define   ECCU_PDEC_HD_01_LLR_MAP_MASK           0x00001f00
#define   ECCU_PDEC_HD_01_LLR_MAP_SHIFT                   8
#define   ECCU_PDEC_HD_00_LLR_MAP_MASK           0x0000001f
#define   ECCU_PDEC_HD_00_LLR_MAP_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_hd_00_llr_map:5;
        u32 rsvd_5:3;
        u32 eccu_pdec_hd_01_llr_map:5;
        u32 rsvd_13:3;
        u32 eccu_pdec_hd_10_llr_map:5;
        u32 rsvd_21:3;
        u32 eccu_pdec_hd_11_llr_map:5;
        u32 rsvd_29:3;
    } b;
} pdec_ctrs_reg6_t;

#define PDEC_CTRS_REG7                           0x0000001c
#define   ECCU_PDEC_HD_111_LLR_MAP_MASK          0x1f000000
#define   ECCU_PDEC_HD_111_LLR_MAP_SHIFT                 24
#define   ECCU_PDEC_HD_110_LLR_MAP_MASK          0x001f0000
#define   ECCU_PDEC_HD_110_LLR_MAP_SHIFT                 16
#define   ECCU_PDEC_HD_101_LLR_MAP_MASK          0x00001f00
#define   ECCU_PDEC_HD_101_LLR_MAP_SHIFT                  8
#define   ECCU_PDEC_HD_100_LLR_MAP_MASK          0x0000001f
#define   ECCU_PDEC_HD_100_LLR_MAP_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_hd_100_llr_map:5;
        u32 rsvd_5:3;
        u32 eccu_pdec_hd_101_llr_map:5;
        u32 rsvd_13:3;
        u32 eccu_pdec_hd_110_llr_map:5;
        u32 rsvd_21:3;
        u32 eccu_pdec_hd_111_llr_map:5;
        u32 rsvd_29:3;
    } b;
} pdec_ctrs_reg7_t;

#define PDEC_CTRS_REG8                           0x00000020
#define   ECCU_PDEC_HD_011_LLR_MAP_MASK          0x1f000000
#define   ECCU_PDEC_HD_011_LLR_MAP_SHIFT                 24
#define   ECCU_PDEC_HD_010_LLR_MAP_MASK          0x001f0000
#define   ECCU_PDEC_HD_010_LLR_MAP_SHIFT                 16
#define   ECCU_PDEC_HD_001_LLR_MAP_MASK          0x00001f00
#define   ECCU_PDEC_HD_001_LLR_MAP_SHIFT                  8
#define   ECCU_PDEC_HD_000_LLR_MAP_MASK          0x0000001f
#define   ECCU_PDEC_HD_000_LLR_MAP_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_hd_000_llr_map:5;
        u32 rsvd_5:3;
        u32 eccu_pdec_hd_001_llr_map:5;
        u32 rsvd_13:3;
        u32 eccu_pdec_hd_010_llr_map:5;
        u32 rsvd_21:3;
        u32 eccu_pdec_hd_011_llr_map:5;
        u32 rsvd_29:3;
    } b;
} pdec_ctrs_reg8_t;

#define PDEC_MEM_REG0                            0x00000024
#define   ECCU_PDEC_HDMEM_RTSEL_MASK             0xc0000000
#define   ECCU_PDEC_HDMEM_RTSEL_SHIFT                    30
#define   ECCU_PDEC_HDMEM_WTSEL_MASK             0x30000000
#define   ECCU_PDEC_HDMEM_WTSEL_SHIFT                    28
#define   ECCU_PDEC_HDMEM_MTSEL_MASK             0x0c000000
#define   ECCU_PDEC_HDMEM_MTSEL_SHIFT                    26
#define   ECCU_PDEC_ORIGHDMEM_RTSEL_MASK         0x03000000
#define   ECCU_PDEC_ORIGHDMEM_RTSEL_SHIFT                24
#define   ECCU_PDEC_ORIGHDMEM_WTSEL_MASK         0x00c00000
#define   ECCU_PDEC_ORIGHDMEM_WTSEL_SHIFT                22
#define   ECCU_PDEC_PMEM_RTSEL_MASK              0x00300000
#define   ECCU_PDEC_PMEM_RTSEL_SHIFT                     20
#define   ECCU_PDEC_PMEM_WTSEL_MASK              0x000c0000
#define   ECCU_PDEC_PMEM_WTSEL_SHIFT                     18
#define   ECCU_PDEC_PMEM_MTSEL_MASK              0x00030000
#define   ECCU_PDEC_PMEM_MTSEL_SHIFT                     16
#define   ECCU_PDEC_RMEM_RTSEL_MASK              0x0000c000
#define   ECCU_PDEC_RMEM_RTSEL_SHIFT                     14
#define   ECCU_PDEC_RMEM_WTSEL_MASK              0x00003000
#define   ECCU_PDEC_RMEM_WTSEL_SHIFT                     12
#define   ECCU_PDEC_QSMEM_RTSEL_MASK             0x00000c00
#define   ECCU_PDEC_QSMEM_RTSEL_SHIFT                    10
#define   ECCU_PDEC_QSMEM_WTSEL_MASK             0x00000300
#define   ECCU_PDEC_QSMEM_WTSEL_SHIFT                     8
#define   ECCU_PDEC_QSMEM_MTSEL_MASK             0x000000c0
#define   ECCU_PDEC_QSMEM_MTSEL_SHIFT                     6
#define   ECCU_PDEC_MEM_PWDN_MASK                0x00000001
#define   ECCU_PDEC_MEM_PWDN_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_mem_pwdn:1;
        u32 rsvd_1:5;
        u32 eccu_pdec_qsmem_mtsel:2;
        u32 eccu_pdec_qsmem_wtsel:2;
        u32 eccu_pdec_qsmem_rtsel:2;
        u32 eccu_pdec_rmem_wtsel:2;
        u32 eccu_pdec_rmem_rtsel:2;
        u32 eccu_pdec_pmem_mtsel:2;
        u32 eccu_pdec_pmem_wtsel:2;
        u32 eccu_pdec_pmem_rtsel:2;
        u32 eccu_pdec_orighdmem_wtsel:2;
        u32 eccu_pdec_orighdmem_rtsel:2;
        u32 eccu_pdec_hdmem_mtsel:2;
        u32 eccu_pdec_hdmem_wtsel:2;
        u32 eccu_pdec_hdmem_rtsel:2;
    } b;
} pdec_mem_reg0_t;

#define PDEC_MEM_REG1                            0x00000028
#define   ECCU_PDEC_QMEM_RTSEL_MASK              0xc0000000
#define   ECCU_PDEC_QMEM_RTSEL_SHIFT                     30
#define   ECCU_PDEC_QMEM_WTSEL_MASK              0x30000000
#define   ECCU_PDEC_QMEM_WTSEL_SHIFT                     28
#define   ECCU_PDEC_QMEM_MTSEL_MASK              0x0c000000
#define   ECCU_PDEC_QMEM_MTSEL_SHIFT                     26
#define   ECCU_PDEC_PSMEM_RTSEL_MASK             0x03000000
#define   ECCU_PDEC_PSMEM_RTSEL_SHIFT                    24
#define   ECCU_PDEC_PSMEM_WTSEL_MASK             0x00c00000
#define   ECCU_PDEC_PSMEM_WTSEL_SHIFT                    22
#define   ECCU_PDEC_PSMEM_MTSEL_MASK             0x00300000
#define   ECCU_PDEC_PSMEM_MTSEL_SHIFT                    20
#define   ECCU_PDEC_PCMFMEM_RTSEL_MASK           0x000c0000
#define   ECCU_PDEC_PCMFMEM_RTSEL_SHIFT                  18
#define   ECCU_PDEC_PCMFMEM_WTSEL_MASK           0x00030000
#define   ECCU_PDEC_PCMFMEM_WTSEL_SHIFT                  16
#define   ECCU_PDEC_PCMFMEM_MTSEL_MASK           0x0000c000
#define   ECCU_PDEC_PCMFMEM_MTSEL_SHIFT                  14

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:14;
        u32 eccu_pdec_pcmfmem_mtsel:2;
        u32 eccu_pdec_pcmfmem_wtsel:2;
        u32 eccu_pdec_pcmfmem_rtsel:2;
        u32 eccu_pdec_psmem_mtsel:2;
        u32 eccu_pdec_psmem_wtsel:2;
        u32 eccu_pdec_psmem_rtsel:2;
        u32 eccu_pdec_qmem_mtsel:2;
        u32 eccu_pdec_qmem_wtsel:2;
        u32 eccu_pdec_qmem_rtsel:2;
    } b;
} pdec_mem_reg1_t;

#define PDEC_DBG_REG                             0x0000002c
#define   ECCU_PDEC_DBG_STATUS_MASK              0xffff0000
#define   ECCU_PDEC_DBG_STATUS_SHIFT                     16
#define   ECCU_PDEC_DBG_SEL_MASK                 0x0000ff00
#define   ECCU_PDEC_DBG_SEL_SHIFT                         8

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:8;
        u32 eccu_pdec_dbg_sel:8;
        u32 eccu_pdec_dbg_status:16;
    } b;
} pdec_dbg_reg_t;

#define PDEC_ERD_LLR_LUT_REG0                    0x00000030
#define   ECCU_PDEC_ERD_LLR_LUT_ADDR_MASK        0x000003fc
#define   ECCU_PDEC_ERD_LLR_LUT_ADDR_SHIFT                2
#define   ECCU_PDEC_ERD_LLR_LUT_WR_EN_MASK       0x00000002
#define   ECCU_PDEC_ERD_LLR_LUT_WR_EN_SHIFT               1
#define   ECCU_PDEC_ERD_LLR_LUT_ACC_EN_MASK      0x00000001
#define   ECCU_PDEC_ERD_LLR_LUT_ACC_EN_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_erd_llr_lut_acc_en:1;
        u32 eccu_pdec_erd_llr_lut_wr_en:1;
        u32 eccu_pdec_erd_llr_lut_addr:8;
        u32 rsvd_10:22;
    } b;
} pdec_erd_llr_lut_reg0_t;

#define PDEC_ERD_LLR_LUT_REG1                    0x00000034
#define   ECCU_PDEC_ERD_LLR_LUT_DIN_MASK         0xffffffff
#define   ECCU_PDEC_ERD_LLR_LUT_DIN_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_erd_llr_lut_din:32;
    } b;
} pdec_erd_llr_lut_reg1_t;

#define PDEC_ERD_LLR_LUT_REG2                    0x00000038
#define   ECCU_PDEC_ERD_LLR_LUT_DOUT_MASK        0xffffffff
#define   ECCU_PDEC_ERD_LLR_LUT_DOUT_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_erd_llr_lut_dout:32;
    } b;
} pdec_erd_llr_lut_reg2_t;

#define PDEC_FAULT_REG0                          0x0000003c
#define   ECCU_PDEC_PMEM_EVEN_PARITY_FAULT_MASK_MASK 0x00000002
#define   ECCU_PDEC_PMEM_EVEN_PARITY_FAULT_MASK_SHIFT          1
#define   ECCU_PDEC_PMEM_EVEN_PARITY_FAULT_MASK  0x00000001
#define   ECCU_PDEC_PMEM_EVEN_PARITY_FAULT_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_pmem_even_parity_fault:1;
        u32 eccu_pdec_pmem_even_parity_fault_mask:1;
        u32 rsvd_2:30;
    } b;
} pdec_fault_reg0_t;

#define PDEC_LLRMAP_REG0                         0x00000040
#define   ECCU_PDEC_HD_1_LPREC_LLR_MAP_0_MASK    0x1f000000
#define   ECCU_PDEC_HD_1_LPREC_LLR_MAP_0_SHIFT           24
#define   ECCU_PDEC_HD_0_LPREC_LLR_MAP_0_MASK    0x001f0000
#define   ECCU_PDEC_HD_0_LPREC_LLR_MAP_0_SHIFT           16
#define   ECCU_PDEC_LPREC_EN_MASK                0x0000000f
#define   ECCU_PDEC_LPREC_EN_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_lprec_en:4;
        u32 rsvd_4:12;
        u32 eccu_pdec_hd_0_lprec_llr_map_0:5;
        u32 rsvd_21:3;
        u32 eccu_pdec_hd_1_lprec_llr_map_0:5;
        u32 rsvd_29:3;
    } b;
} pdec_llrmap_reg0_t;

#define PDEC_LLRMAP_REG1                         0x00000044
#define   ECCU_PDEC_HD_11_LPREC_LLR_MAP_0_MASK   0x1f000000
#define   ECCU_PDEC_HD_11_LPREC_LLR_MAP_0_SHIFT          24
#define   ECCU_PDEC_HD_10_LPREC_LLR_MAP_0_MASK   0x001f0000
#define   ECCU_PDEC_HD_10_LPREC_LLR_MAP_0_SHIFT          16
#define   ECCU_PDEC_HD_01_LPREC_LLR_MAP_0_MASK   0x00001f00
#define   ECCU_PDEC_HD_01_LPREC_LLR_MAP_0_SHIFT           8
#define   ECCU_PDEC_HD_00_LPREC_LLR_MAP_0_MASK   0x0000001f
#define   ECCU_PDEC_HD_00_LPREC_LLR_MAP_0_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_hd_00_lprec_llr_map_0:5;
        u32 rsvd_5:3;
        u32 eccu_pdec_hd_01_lprec_llr_map_0:5;
        u32 rsvd_13:3;
        u32 eccu_pdec_hd_10_lprec_llr_map_0:5;
        u32 rsvd_21:3;
        u32 eccu_pdec_hd_11_lprec_llr_map_0:5;
        u32 rsvd_29:3;
    } b;
} pdec_llrmap_reg1_t;

#define PDEC_LLRMAP_REG2                         0x00000048
#define   ECCU_PDEC_HD_111_LPREC_LLR_MAP_0_MASK  0x1f000000
#define   ECCU_PDEC_HD_111_LPREC_LLR_MAP_0_SHIFT         24
#define   ECCU_PDEC_HD_110_LPREC_LLR_MAP_0_MASK  0x001f0000
#define   ECCU_PDEC_HD_110_LPREC_LLR_MAP_0_SHIFT         16
#define   ECCU_PDEC_HD_101_LPREC_LLR_MAP_0_MASK  0x00001f00
#define   ECCU_PDEC_HD_101_LPREC_LLR_MAP_0_SHIFT          8
#define   ECCU_PDEC_HD_100_LPREC_LLR_MAP_0_MASK  0x0000001f
#define   ECCU_PDEC_HD_100_LPREC_LLR_MAP_0_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_hd_100_lprec_llr_map_0:5;
        u32 rsvd_5:3;
        u32 eccu_pdec_hd_101_lprec_llr_map_0:5;
        u32 rsvd_13:3;
        u32 eccu_pdec_hd_110_lprec_llr_map_0:5;
        u32 rsvd_21:3;
        u32 eccu_pdec_hd_111_lprec_llr_map_0:5;
        u32 rsvd_29:3;
    } b;
} pdec_llrmap_reg2_t;

#define PDEC_LLRMAP_REG3                         0x0000004c
#define   ECCU_PDEC_HD_011_LPREC_LLR_MAP_0_MASK  0x1f000000
#define   ECCU_PDEC_HD_011_LPREC_LLR_MAP_0_SHIFT         24
#define   ECCU_PDEC_HD_010_LPREC_LLR_MAP_0_MASK  0x001f0000
#define   ECCU_PDEC_HD_010_LPREC_LLR_MAP_0_SHIFT         16
#define   ECCU_PDEC_HD_001_LPREC_LLR_MAP_0_MASK  0x00001f00
#define   ECCU_PDEC_HD_001_LPREC_LLR_MAP_0_SHIFT          8
#define   ECCU_PDEC_HD_000_LPREC_LLR_MAP_0_MASK  0x0000001f
#define   ECCU_PDEC_HD_000_LPREC_LLR_MAP_0_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_hd_000_lprec_llr_map_0:5;
        u32 rsvd_5:3;
        u32 eccu_pdec_hd_001_lprec_llr_map_0:5;
        u32 rsvd_13:3;
        u32 eccu_pdec_hd_010_lprec_llr_map_0:5;
        u32 rsvd_21:3;
        u32 eccu_pdec_hd_011_lprec_llr_map_0:5;
        u32 rsvd_29:3;
    } b;
} pdec_llrmap_reg3_t;

#define PDEC_LLRMAP_REG4                         0x00000050
#define   ECCU_PDEC_HD_1_LPREC_LLR_MAP_1_MASK    0x1f000000
#define   ECCU_PDEC_HD_1_LPREC_LLR_MAP_1_SHIFT           24
#define   ECCU_PDEC_HD_0_LPREC_LLR_MAP_1_MASK    0x001f0000
#define   ECCU_PDEC_HD_0_LPREC_LLR_MAP_1_SHIFT           16

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:16;
        u32 eccu_pdec_hd_0_lprec_llr_map_1:5;
        u32 rsvd_21:3;
        u32 eccu_pdec_hd_1_lprec_llr_map_1:5;
        u32 rsvd_29:3;
    } b;
} pdec_llrmap_reg4_t;

#define PDEC_LLRMAP_REG5                         0x00000054
#define   ECCU_PDEC_HD_11_LPREC_LLR_MAP_1_MASK   0x1f000000
#define   ECCU_PDEC_HD_11_LPREC_LLR_MAP_1_SHIFT          24
#define   ECCU_PDEC_HD_10_LPREC_LLR_MAP_1_MASK   0x001f0000
#define   ECCU_PDEC_HD_10_LPREC_LLR_MAP_1_SHIFT          16
#define   ECCU_PDEC_HD_01_LPREC_LLR_MAP_1_MASK   0x00001f00
#define   ECCU_PDEC_HD_01_LPREC_LLR_MAP_1_SHIFT           8
#define   ECCU_PDEC_HD_00_LPREC_LLR_MAP_1_MASK   0x0000001f
#define   ECCU_PDEC_HD_00_LPREC_LLR_MAP_1_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_hd_00_lprec_llr_map_1:5;
        u32 rsvd_5:3;
        u32 eccu_pdec_hd_01_lprec_llr_map_1:5;
        u32 rsvd_13:3;
        u32 eccu_pdec_hd_10_lprec_llr_map_1:5;
        u32 rsvd_21:3;
        u32 eccu_pdec_hd_11_lprec_llr_map_1:5;
        u32 rsvd_29:3;
    } b;
} pdec_llrmap_reg5_t;

#define PDEC_LLRMAP_REG6                         0x00000058
#define   ECCU_PDEC_HD_111_LPREC_LLR_MAP_1_MASK  0x1f000000
#define   ECCU_PDEC_HD_111_LPREC_LLR_MAP_1_SHIFT         24
#define   ECCU_PDEC_HD_110_LPREC_LLR_MAP_1_MASK  0x001f0000
#define   ECCU_PDEC_HD_110_LPREC_LLR_MAP_1_SHIFT         16
#define   ECCU_PDEC_HD_101_LPREC_LLR_MAP_1_MASK  0x00001f00
#define   ECCU_PDEC_HD_101_LPREC_LLR_MAP_1_SHIFT          8
#define   ECCU_PDEC_HD_100_LPREC_LLR_MAP_1_MASK  0x0000001f
#define   ECCU_PDEC_HD_100_LPREC_LLR_MAP_1_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_hd_100_lprec_llr_map_1:5;
        u32 rsvd_5:3;
        u32 eccu_pdec_hd_101_lprec_llr_map_1:5;
        u32 rsvd_13:3;
        u32 eccu_pdec_hd_110_lprec_llr_map_1:5;
        u32 rsvd_21:3;
        u32 eccu_pdec_hd_111_lprec_llr_map_1:5;
        u32 rsvd_29:3;
    } b;
} pdec_llrmap_reg6_t;

#define PDEC_LLRMAP_REG7                         0x0000005c
#define   ECCU_PDEC_HD_011_LPREC_LLR_MAP_1_MASK  0x1f000000
#define   ECCU_PDEC_HD_011_LPREC_LLR_MAP_1_SHIFT         24
#define   ECCU_PDEC_HD_010_LPREC_LLR_MAP_1_MASK  0x001f0000
#define   ECCU_PDEC_HD_010_LPREC_LLR_MAP_1_SHIFT         16
#define   ECCU_PDEC_HD_001_LPREC_LLR_MAP_1_MASK  0x00001f00
#define   ECCU_PDEC_HD_001_LPREC_LLR_MAP_1_SHIFT          8
#define   ECCU_PDEC_HD_000_LPREC_LLR_MAP_1_MASK  0x0000001f
#define   ECCU_PDEC_HD_000_LPREC_LLR_MAP_1_SHIFT          0
typedef union {
    u32 all;
    struct {
        u32 eccu_pdec_hd_000_lprec_llr_map_1:5;
        u32 rsvd_5:3;
        u32 eccu_pdec_hd_001_lprec_llr_map_1:5;
        u32 rsvd_13:3;
        u32 eccu_pdec_hd_010_lprec_llr_map_1:5;
        u32 rsvd_21:3;
        u32 eccu_pdec_hd_011_lprec_llr_map_1:5;
        u32 rsvd_29:3;
    } b;
} pdec_llrmap_reg7_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ pdec_ctrs_reg0_t pdec_ctrs_reg0;
    /* 0x0004 */ pdec_ctrs_reg1_t pdec_ctrs_reg1;
    /* 0x0008 */ pdec_ctrs_reg2_t pdec_ctrs_reg2;
    /* 0x000c */ pdec_ctrs_reg3_t pdec_ctrs_reg3;
    /* 0x0010 */ pdec_ctrs_reg4_t pdec_ctrs_reg4;
    /* 0x0014 */ pdec_ctrs_reg5_t pdec_ctrs_reg5;
    /* 0x0018 */ pdec_ctrs_reg6_t pdec_ctrs_reg6;
    /* 0x001c */ pdec_ctrs_reg7_t pdec_ctrs_reg7;
    /* 0x0020 */ pdec_ctrs_reg8_t pdec_ctrs_reg8;
    /* 0x0024 */ pdec_mem_reg0_t pdec_mem_reg0;
    /* 0x0028 */ pdec_mem_reg1_t pdec_mem_reg1;
    /* 0x002c */ pdec_dbg_reg_t pdec_dbg_reg;
    /* 0x0030 */ pdec_erd_llr_lut_reg0_t pdec_erd_llr_lut_reg0;
    /* 0x0034 */ pdec_erd_llr_lut_reg1_t pdec_erd_llr_lut_reg1;
    /* 0x0038 */ pdec_erd_llr_lut_reg2_t pdec_erd_llr_lut_reg2;
    /* 0x003c */ pdec_fault_reg0_t pdec_fault_reg0;
    /* 0x0040 */ pdec_llrmap_reg0_t pdec_llrmap_reg0;
    /* 0x0044 */ pdec_llrmap_reg1_t pdec_llrmap_reg1;
    /* 0x0048 */ pdec_llrmap_reg2_t pdec_llrmap_reg2;
    /* 0x004c */ pdec_llrmap_reg3_t pdec_llrmap_reg3;
    /* 0x0050 */ pdec_llrmap_reg4_t pdec_llrmap_reg4;
    /* 0x0054 */ pdec_llrmap_reg5_t pdec_llrmap_reg5;
    /* 0x0058 */ pdec_llrmap_reg6_t pdec_llrmap_reg6;
    /* 0x005c */ pdec_llrmap_reg7_t pdec_llrmap_reg7;
} eccu_pdec_regs_t;


#endif /* rev 1003 */