//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _ECCU_MISR_REGISTER_H_
#define _ECCU_MISR_REGISTER_H_

#define MISR_CTRS_REG0                           0x00000000
#define   ECCU_MISR_STATUS_MASK                  0xc0000000
#define   ECCU_MISR_STATUS_SHIFT                         30
#define   ECCU_MISR_FAIL_CW_RD_IDX_MASK          0x00c00000
#define   ECCU_MISR_FAIL_CW_RD_IDX_SHIFT                 22
#define   ECCU_MISR_CW_NUM_MASK                  0x003f0000
#define   ECCU_MISR_CW_NUM_SHIFT                         16
#define   ECCU_MISR_HOST_TYPE_MASK               0x00003c00
#define   ECCU_MISR_HOST_TYPE_SHIFT                      10
#define   ECCU_MISR_MISCORR_DET_EN_MASK          0x00000200
#define   ECCU_MISR_MISCORR_DET_EN_SHIFT                  9
#define   ECCU_MISR_CH_NUM_MASK                  0x000000c0
#define   ECCU_MISR_CH_NUM_SHIFT                          6
#define   ECCU_MISR_DEC_MODE_MASK                0x00000010
#define   ECCU_MISR_DEC_MODE_SHIFT                        4
#define   ECCU_MISR_OP_MODE_MASK                 0x00000008
#define   ECCU_MISR_OP_MODE_SHIFT                         3
#define   ECCU_MISR_START_PULSE_MASK             0x00000004
#define   ECCU_MISR_START_PULSE_SHIFT                     2
#define   ECCU_MISR_RESET_MASK                   0x00000002
#define   ECCU_MISR_RESET_SHIFT                           1
#define   ECCU_MISR_EN_MASK                      0x00000001
#define   ECCU_MISR_EN_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_en:1;
        u32 eccu_misr_reset:1;
        u32 eccu_misr_start_pulse:1;
        u32 eccu_misr_op_mode:1;
        u32 eccu_misr_dec_mode:1;
        u32 rsvd_5:1;
        u32 eccu_misr_ch_num:2;
        u32 rsvd_8:1;
        u32 eccu_misr_miscorr_det_en:1;
        u32 eccu_misr_host_type:4;
        u32 rsvd_14:2;
        u32 eccu_misr_cw_num:6;
        u32 eccu_misr_fail_cw_rd_idx:2;
        u32 rsvd_24:6;
        u32 eccu_misr_status:2;
    } b;
} misr_ctrs_reg0_t;

#define MISR_CTRS_REG1                           0x00000004
#define   ECCU_MISR_RNG_SEED_MASK                0xffffffff
#define   ECCU_MISR_RNG_SEED_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_rng_seed:32;
    } b;
} misr_ctrs_reg1_t;

#define MISR_CTRS_REG2                           0x00000008
#define   ECCU_MISR_BIN_NOISE_LEVEL_MASK         0xffff0000
#define   ECCU_MISR_BIN_NOISE_LEVEL_SHIFT                16
#define   ECCU_MISR_RNG_SEED_OFFSET_MASK         0x0000ffff
#define   ECCU_MISR_RNG_SEED_OFFSET_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_rng_seed_offset:16;
        u32 eccu_misr_bin_noise_level:16;
    } b;
} misr_ctrs_reg2_t;

#define MISR_STAT_REG0                           0x0000000c
#define   ECCU_MISR_MISCORR_CW_IDX_L_MASK        0xffffffff
#define   ECCU_MISR_MISCORR_CW_IDX_L_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_miscorr_cw_idx_l:32;
    } b;
} misr_stat_reg0_t;

#define MISR_STAT_REG1                           0x00000010
#define   ECCU_MISR_FINAL_CW_CNT_L_MASK          0xffffffff
#define   ECCU_MISR_FINAL_CW_CNT_L_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_final_cw_cnt_l:32;
    } b;
} misr_stat_reg1_t;

#define MISR_STAT_REG2                           0x00000014
#define   ECCU_MISR_MISCORR_CW_IDX_H_MASK        0xffff0000
#define   ECCU_MISR_MISCORR_CW_IDX_H_SHIFT               16
#define   ECCU_MISR_FINAL_CW_CNT_H_MASK          0x0000ffff
#define   ECCU_MISR_FINAL_CW_CNT_H_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_final_cw_cnt_h:16;
        u32 eccu_misr_miscorr_cw_idx_h:16;
    } b;
} misr_stat_reg2_t;

#define GAU_CTRS_REG0                            0x00000018
#define   ECCU_MISR_GAU_NOISE_LEVEL_0_0_MASK     0xffffffff
#define   ECCU_MISR_GAU_NOISE_LEVEL_0_0_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_gau_noise_level_0_0:32;
    } b;
} gau_ctrs_reg0_t;

#define GAU_CTRS_REG1                            0x0000001c
#define   ECCU_MISR_GAU_NOISE_LEVEL_0_1_MASK     0xffffffff
#define   ECCU_MISR_GAU_NOISE_LEVEL_0_1_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_gau_noise_level_0_1:32;
    } b;
} gau_ctrs_reg1_t;

#define GAU_CTRS_REG2                            0x00000020
#define   ECCU_MISR_GAU_NOISE_LEVEL_0_2_MASK     0xffffffff
#define   ECCU_MISR_GAU_NOISE_LEVEL_0_2_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_gau_noise_level_0_2:32;
    } b;
} gau_ctrs_reg2_t;

#define GAU_CTRS_REG3                            0x00000024
#define   ECCU_MISR_GAU_NOISE_LEVEL_0_3_MASK     0xffffffff
#define   ECCU_MISR_GAU_NOISE_LEVEL_0_3_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_gau_noise_level_0_3:32;
    } b;
} gau_ctrs_reg3_t;

#define GAU_CTRS_REG4                            0x00000028
#define   ECCU_MISR_GAU_NOISE_LEVEL_0_4_MASK     0xffffffff
#define   ECCU_MISR_GAU_NOISE_LEVEL_0_4_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_gau_noise_level_0_4:32;
    } b;
} gau_ctrs_reg4_t;

#define GAU_CTRS_REG5                            0x0000002c
#define   ECCU_MISR_GAU_NOISE_LEVEL_0_5_MASK     0xffffffff
#define   ECCU_MISR_GAU_NOISE_LEVEL_0_5_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_gau_noise_level_0_5:32;
    } b;
} gau_ctrs_reg5_t;

#define GAU_CTRS_REG6                            0x00000030
#define   ECCU_MISR_GAU_NOISE_LEVEL_1_0_MASK     0xffffffff
#define   ECCU_MISR_GAU_NOISE_LEVEL_1_0_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_gau_noise_level_1_0:32;
    } b;
} gau_ctrs_reg6_t;

#define GAU_CTRS_REG7                            0x00000034
#define   ECCU_MISR_GAU_NOISE_LEVEL_1_1_MASK     0xffffffff
#define   ECCU_MISR_GAU_NOISE_LEVEL_1_1_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_gau_noise_level_1_1:32;
    } b;
} gau_ctrs_reg7_t;

#define GAU_CTRS_REG8                            0x00000038
#define   ECCU_MISR_GAU_NOISE_LEVEL_1_2_MASK     0xffffffff
#define   ECCU_MISR_GAU_NOISE_LEVEL_1_2_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_gau_noise_level_1_2:32;
    } b;
} gau_ctrs_reg8_t;

#define GAU_CTRS_REG9                            0x0000003c
#define   ECCU_MISR_GAU_NOISE_LEVEL_1_3_MASK     0xffffffff
#define   ECCU_MISR_GAU_NOISE_LEVEL_1_3_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_gau_noise_level_1_3:32;
    } b;
} gau_ctrs_reg9_t;

#define GAU_CTRS_REG10                           0x00000040
#define   ECCU_MISR_GAU_NOISE_LEVEL_1_4_MASK     0xffffffff
#define   ECCU_MISR_GAU_NOISE_LEVEL_1_4_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_gau_noise_level_1_4:32;
    } b;
} gau_ctrs_reg10_t;

#define GAU_CTRS_REG11                           0x00000044
#define   ECCU_MISR_GAU_NOISE_LEVEL_1_5_MASK     0xffffffff
#define   ECCU_MISR_GAU_NOISE_LEVEL_1_5_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_gau_noise_level_1_5:32;
    } b;
} gau_ctrs_reg11_t;

#define MISR_VER_REG0                            0x00000048
#define   ECCU_MISR_DBG_STATUS_MASK              0xff000000
#define   ECCU_MISR_DBG_STATUS_SHIFT                     24
#define   ECCU_MISR_DBG_SEL_MASK                 0x00ff0000
#define   ECCU_MISR_DBG_SEL_SHIFT                        16
#define   ECCU_MISR_VERSION_MASK                 0x0000ffff
#define   ECCU_MISR_VERSION_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_version:16;
        u32 eccu_misr_dbg_sel:8;
        u32 eccu_misr_dbg_status:8;
    } b;
} misr_ver_reg0_t;

#define MISR_CYC_REG0                            0x0000004c
#define   ECCU_MISR_CYC_EXEC_L_MASK              0xffffffff
#define   ECCU_MISR_CYC_EXEC_L_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_cyc_exec_l:32;
    } b;
} misr_cyc_reg0_t;

#define MISR_CYC_REG1                            0x00000050
#define   ECCU_MISR_CYC_EXEC_H_MASK              0xffffffff
#define   ECCU_MISR_CYC_EXEC_H_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_cyc_exec_h:32;
    } b;
} misr_cyc_reg1_t;

#define MISR_CYC_REG2                            0x00000054
#define   ECCU_MISR_DOUT_LAT_MASK                0xffffffff
#define   ECCU_MISR_DOUT_LAT_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_dout_lat:32;
    } b;
} misr_cyc_reg2_t;

#define MISR_RES_REG0                            0x00000058
#define   ECCU_MISR_ERR_CNT_VS_0S_MASK           0xffffffff
#define   ECCU_MISR_ERR_CNT_VS_0S_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_err_cnt_vs_0s:32;
    } b;
} misr_res_reg0_t;

#define MISR_RES_REG1                            0x0000005c
#define   ECCU_MISR_NUM_CW_FAIL_L_MASK           0xffffffff
#define   ECCU_MISR_NUM_CW_FAIL_L_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_num_cw_fail_l:32;
    } b;
} misr_res_reg1_t;

#define MISR_RES_REG2                            0x00000060
#define   ECCU_MISR_FAIL_CW_IDX_H_MASK           0xffff0000
#define   ECCU_MISR_FAIL_CW_IDX_H_SHIFT                  16
#define   ECCU_MISR_NUM_CW_FAIL_H_MASK           0x0000ffff
#define   ECCU_MISR_NUM_CW_FAIL_H_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_num_cw_fail_h:16;
        u32 eccu_misr_fail_cw_idx_h:16;
    } b;
} misr_res_reg2_t;

#define MISR_RES_REG3                            0x00000064
#define   ECCU_MISR_FAIL_CW_IDX_L_MASK           0xffffffff
#define   ECCU_MISR_FAIL_CW_IDX_L_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 eccu_misr_fail_cw_idx_l:32;
    } b;
} misr_res_reg3_t;

#define MISR_RES_REG4                            0x00000068
#define   ECCU_MISR_BURST_ERR_PATTERN_MASK       0xffff0000
#define   ECCU_MISR_BURST_ERR_PATTERN_SHIFT              16
#define   ECCU_MISR_BURST_ERR_EN_MASK            0x00000100
#define   ECCU_MISR_BURST_ERR_EN_SHIFT                    8
#define   ECCU_MISR_FAIL_CW_NUM_MASK             0x0000000f
#define   ECCU_MISR_FAIL_CW_NUM_SHIFT                     0
typedef union {
    u32 all;
    struct {
        u32 eccu_misr_fail_cw_num:4;
        u32 rsvd_4:4;
        u32 eccu_misr_burst_err_en:1;
        u32 rsvd_9:7;
        u32 eccu_misr_burst_err_pattern:16;
    } b;
} misr_res_reg4_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ misr_ctrs_reg0_t misr_ctrs_reg0;
    /* 0x0004 */ misr_ctrs_reg1_t misr_ctrs_reg1;
    /* 0x0008 */ misr_ctrs_reg2_t misr_ctrs_reg2;
    /* 0x000c */ misr_stat_reg0_t misr_stat_reg0;
    /* 0x0010 */ misr_stat_reg1_t misr_stat_reg1;
    /* 0x0014 */ misr_stat_reg2_t misr_stat_reg2;
    /* 0x0018 */ gau_ctrs_reg0_t gau_ctrs_reg0;
    /* 0x001c */ gau_ctrs_reg1_t gau_ctrs_reg1;
    /* 0x0020 */ gau_ctrs_reg2_t gau_ctrs_reg2;
    /* 0x0024 */ gau_ctrs_reg3_t gau_ctrs_reg3;
    /* 0x0028 */ gau_ctrs_reg4_t gau_ctrs_reg4;
    /* 0x002c */ gau_ctrs_reg5_t gau_ctrs_reg5;
    /* 0x0030 */ gau_ctrs_reg6_t gau_ctrs_reg6;
    /* 0x0034 */ gau_ctrs_reg7_t gau_ctrs_reg7;
    /* 0x0038 */ gau_ctrs_reg8_t gau_ctrs_reg8;
    /* 0x003c */ gau_ctrs_reg9_t gau_ctrs_reg9;
    /* 0x0040 */ gau_ctrs_reg10_t gau_ctrs_reg10;
    /* 0x0044 */ gau_ctrs_reg11_t gau_ctrs_reg11;
    /* 0x0048 */ misr_ver_reg0_t misr_ver_reg0;
    /* 0x004c */ misr_cyc_reg0_t misr_cyc_reg0;
    /* 0x0050 */ misr_cyc_reg1_t misr_cyc_reg1;
    /* 0x0054 */ misr_cyc_reg2_t misr_cyc_reg2;
    /* 0x0058 */ misr_res_reg0_t misr_res_reg0;
    /* 0x005c */ misr_res_reg1_t misr_res_reg1;
    /* 0x0060 */ misr_res_reg2_t misr_res_reg2;
    /* 0x0064 */ misr_res_reg3_t misr_res_reg3;
    /* 0x0068 */ misr_res_reg4_t misr_res_reg4;
} eccu_misr_regs_t;


#endif /* rev 1001 */