//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _NCB_ECCU_REGISTER_H_
#define _NCB_ECCU_REGISTER_H_

#define ECCU_VER_REG                             0x00000000
#define   ECC_ARCH_ID_MASK                       0xff000000
#define   ECC_ARCH_ID_SHIFT                              24
#define   ECC_VER_MASK                           0x00ff0000
#define   ECC_VER_SHIFT                                  16
#define   ECCU_VER1_MASK                         0x0000ff00
#define   ECCU_VER1_SHIFT                                 8
#define   ECCU_VER0_MASK                         0x000000ff
#define   ECCU_VER0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 eccu_ver0:8;
        u32 eccu_ver1:8;
        u32 ecc_ver:8;
        u32 ecc_arch_id:8;
    } b;
} eccu_ver_reg_t;

#define ECCU_CTRL_REG0                           0x00000004
#define   ENC_RPT_ON_RAID_ERR_MASK               0x80000000
#define   ENC_RPT_ON_RAID_ERR_SHIFT                      31
#define   DEC_RPT_ON_RAID_ERR_MASK               0x40000000
#define   DEC_RPT_ON_RAID_ERR_SHIFT                      30
#define   ENC_HALT_ON_ERR_MASK                   0x20000000
#define   ENC_HALT_ON_ERR_SHIFT                          29
#define   DEC_ARD_HALT_ON_ERR_MASK               0x10000000
#define   DEC_ARD_HALT_ON_ERR_SHIFT                      28
#define   ENC_RPT_ON_FDMA_ERR_MASK               0x08000000
#define   ENC_RPT_ON_FDMA_ERR_SHIFT                      27
#define   ENC_RPT_ON_PPU_ERR_MASK                0x04000000
#define   ENC_RPT_ON_PPU_ERR_SHIFT                       26
#define   ENC_RPT_ON_AES_ERR_MASK                0x02000000
#define   ENC_RPT_ON_AES_ERR_SHIFT                       25
#define   ENC_RPT_ON_DFU_ERR_MASK                0x01000000
#define   ENC_RPT_ON_DFU_ERR_SHIFT                       24
#define   ENC_RPT_ON_ENC_ERR_MASK                0x00800000
#define   ENC_RPT_ON_ENC_ERR_SHIFT                       23
#define   DEC_HALT_ON_ERR_MASK                   0x00400000
#define   DEC_HALT_ON_ERR_SHIFT                          22
#define   DEC_RPT_ON_FDMA_ERR_MASK               0x00200000
#define   DEC_RPT_ON_FDMA_ERR_SHIFT                      21
#define   DEC_RPT_ON_PPU_ERR_MASK                0x00100000
#define   DEC_RPT_ON_PPU_ERR_SHIFT                       20
#define   DEC_RPT_ON_AES_ERR_MASK                0x00080000
#define   DEC_RPT_ON_AES_ERR_SHIFT                       19
#define   DEC_RPT_ON_DFU_ERR_MASK                0x00040000
#define   DEC_RPT_ON_DFU_ERR_SHIFT                       18
#define   DEC_RPT_ON_DEC_ERR_MASK                0x00020000
#define   DEC_RPT_ON_DEC_ERR_SHIFT                       17
#define   DEC_RPT_ON_ERASE_ERR_MASK              0x00010000
#define   DEC_RPT_ON_ERASE_ERR_SHIFT                     16
#define   DEC_RPT_ON_OVRLMT_ERR_MASK             0x00008000
#define   DEC_RPT_ON_OVRLMT_ERR_SHIFT                    15
#define   ENC_HALT_ON_SEND_STATUS_MASK           0x00004000
#define   ENC_HALT_ON_SEND_STATUS_SHIFT                  14
#define   DEC_HALT_ON_SEND_STATUS_MASK           0x00002000
#define   DEC_HALT_ON_SEND_STATUS_SHIFT                  13
#define   ENC_ERR_RPT_MODE_MASK                  0x00001000
#define   ENC_ERR_RPT_MODE_SHIFT                         12
#define   DEC_ERR_RPT_MODE_MASK                  0x00000800
#define   DEC_ERR_RPT_MODE_SHIFT                         11
#define   ECCU_SEND_DATA_DIS_MASK                0x00000400
#define   ECCU_SEND_DATA_DIS_SHIFT                       10
#define   ENC_RPT_ON_HMB_ERR_MASK                0x00000200
#define   ENC_RPT_ON_HMB_ERR_SHIFT                        9
#define   DEC_RPT_ON_FW_ARD_SET_ERR_MASK         0x00000008
#define   DEC_RPT_ON_FW_ARD_SET_ERR_SHIFT                 3
#define   ECCU_FORCE_ROM_DS_MASK                 0x00000004
#define   ECCU_FORCE_ROM_DS_SHIFT                         2
#define   ECCU_FORCE_CLK_ON_MASK                 0x00000002
#define   ECCU_FORCE_CLK_ON_SHIFT                         1
#define   ECCU_SOFT_RESET_MASK                   0x00000001
#define   ECCU_SOFT_RESET_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 eccu_soft_reset:1;
        u32 eccu_force_clk_on:1;
        u32 eccu_force_rom_ds:1;
        u32 dec_rpt_on_fw_ard_set_err:1;
        u32 rsvd_4:5;
        u32 enc_rpt_on_hmb_err:1;
        u32 eccu_send_data_dis:1;
        u32 dec_err_rpt_mode:1;
        u32 enc_err_rpt_mode:1;
        u32 dec_halt_on_send_status:1;
        u32 enc_halt_on_send_status:1;
        u32 dec_rpt_on_ovrlmt_err:1;
        u32 dec_rpt_on_erase_err:1;
        u32 dec_rpt_on_dec_err:1;
        u32 dec_rpt_on_dfu_err:1;
        u32 dec_rpt_on_aes_err:1;
        u32 dec_rpt_on_ppu_err:1;
        u32 dec_rpt_on_fdma_err:1;
        u32 dec_halt_on_err:1;
        u32 enc_rpt_on_enc_err:1;
        u32 enc_rpt_on_dfu_err:1;
        u32 enc_rpt_on_aes_err:1;
        u32 enc_rpt_on_ppu_err:1;
        u32 enc_rpt_on_fdma_err:1;
        u32 dec_ard_halt_on_err:1;
        u32 enc_halt_on_err:1;
        u32 dec_rpt_on_raid_err:1;
        u32 enc_rpt_on_raid_err:1;
    } b;
} eccu_ctrl_reg0_t;

#define ECCU_CTRL_REG1                           0x00000008
#define   DEC_DTAG_AUTO_RELS_EN_MASK             0x02000000
#define   DEC_DTAG_AUTO_RELS_EN_SHIFT                    25
#define   ENC_DUMMY_DTAG_DIS_MASK                0x01000000
#define   ENC_DUMMY_DTAG_DIS_SHIFT                       24
#define   DEC_FW_ARD_EN_MASK                     0x00800000
#define   DEC_FW_ARD_EN_SHIFT                            23
#define   ENC_RAID_BYPASS_ERR_MASK               0x00400000
#define   ENC_RAID_BYPASS_ERR_SHIFT                      22
#define   DEC_RAID_BYPASS_ERR_MASK               0x00200000
#define   DEC_RAID_BYPASS_ERR_SHIFT                      21
#define   ECCU_RAID_EN_MASK                      0x00100000
#define   ECCU_RAID_EN_SHIFT                             20
#define   ECCU_HMB_RD_NUM_MASK                   0x000e0000
#define   ECCU_HMB_RD_NUM_SHIFT                          17
#define   ECCU_HMB_EN_MASK                       0x00010000
#define   ECCU_HMB_EN_SHIFT                              16
#define   ECCU_HMB_DTAG_CHK_MASK                 0x0000c000
#define   ECCU_HMB_DTAG_CHK_SHIFT                        14
#define   ECCU_FAST_ACCESS_MODE_MASK             0x000000f0
#define   ECCU_FAST_ACCESS_MODE_SHIFT                     4
#define   FAST_ENC_XFER_SYNC_EN_MASK             0x00000004
#define   FAST_ENC_XFER_SYNC_EN_SHIFT                     2
#define   FAST_DEC_XFER_SYNC_EN_MASK             0x00000002
#define   FAST_DEC_XFER_SYNC_EN_SHIFT                     1
#define   ECCU_FAST_ACCESS_EN_MASK               0x00000001
#define   ECCU_FAST_ACCESS_EN_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 eccu_fast_access_en:1;
        u32 fast_dec_xfer_sync_en:1;
        u32 fast_enc_xfer_sync_en:1;
        u32 rsvd_3:1;
        u32 eccu_fast_access_mode:4;
        u32 rsvd_8:6;
        u32 eccu_hmb_dtag_chk:2;
        u32 eccu_hmb_en:1;
        u32 eccu_hmb_rd_num:3;
        u32 eccu_raid_en:1;
        u32 dec_raid_bypass_err:1;
        u32 enc_raid_bypass_err:1;
        u32 dec_fw_ard_en:1;
        u32 enc_dummy_dtag_dis:1;
        u32 dec_dtag_auto_rels_en:1;
        u32 rsvd_26:6;
    } b;
} eccu_ctrl_reg1_t;

#define ECCU_CTRL_REG2                           0x0000000c
#define   SCR_LUT_IDX_SHFT_MASK                  0x0000001f
#define   SCR_LUT_IDX_SHFT_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 scr_lut_idx_shft:5;
        u32 rsvd_5:27;
    } b;
} eccu_ctrl_reg2_t;

#define ECCU_CTRL_REG3                           0x00000010
#define   SCR_INIT_SEED_MASK                     0xffffffff
#define   SCR_INIT_SEED_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 scr_init_seed:32;
    } b;
} eccu_ctrl_reg3_t;

#define ECCU_CTRL_REG4                           0x00000014
#define   SCR_SEED_MASK_MASK                     0xffffffff
#define   SCR_SEED_MASK_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 scr_seed_mask:32;
    } b;
} eccu_ctrl_reg4_t;

#define ECCU_CTRL_REG5                           0x00000018
#define   FORCE_RAID_MIN_CW_GAP_MASK             0x80000000
#define   FORCE_RAID_MIN_CW_GAP_SHIFT                    31
#define   FORCE_RAID_DU_SZ_MASK                  0x40000000
#define   FORCE_RAID_DU_SZ_SHIFT                         30
#define   FORCE_META_SCR_OFF_MASK                0x20000000
#define   FORCE_META_SCR_OFF_SHIFT                       29
#define   FORCE_USER_SCR_OFF_MASK                0x10000000
#define   FORCE_USER_SCR_OFF_SHIFT                       28
#define   DEC_RAID_PAR_NUM_MAX_MASK              0x0f000000
#define   DEC_RAID_PAR_NUM_MAX_SHIFT                     24
#define   ENC_TAG_NUM_MAX_MASK                   0x00f00000
#define   ENC_TAG_NUM_MAX_SHIFT                          20
#define   DEC_TAG_NUM_MAX_MASK                   0x000f0000
#define   DEC_TAG_NUM_MAX_SHIFT                          16
#define   ENC_FORCE_PHY_PAD_EN_MASK              0x00008000
#define   ENC_FORCE_PHY_PAD_EN_SHIFT                     15
#define   DEC_FORCE_PHY_PAD_EN_MASK              0x00004000
#define   DEC_FORCE_PHY_PAD_EN_SHIFT                     14
#define   HLBA_LOC_START_MASK                    0x00003f00
#define   HLBA_LOC_START_SHIFT                            8
#define   DEC_FORCE_CRC_ERR_MASK                 0x00000080
#define   DEC_FORCE_CRC_ERR_SHIFT                         7
#define   HLBA_SZ_MASK                           0x00000006
#define   HLBA_SZ_SHIFT                                   1
#define   HLBA_SRC_MASK                          0x00000001
#define   HLBA_SRC_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 hlba_src:1;
        u32 hlba_sz:2;
        u32 rsvd_3:4;
        u32 dec_force_crc_err:1;
        u32 hlba_loc_start:6;
        u32 dec_force_phy_pad_en:1;
        u32 enc_force_phy_pad_en:1;
        u32 dec_tag_num_max:4;
        u32 enc_tag_num_max:4;
        u32 dec_raid_par_num_max:4;
        u32 force_user_scr_off:1;
        u32 force_meta_scr_off:1;
        u32 force_raid_du_sz:1;
        u32 force_raid_min_cw_gap:1;
    } b;
} eccu_ctrl_reg5_t;

#define ECCU_DU_FMT_SEL_REG                      0x0000001c
#define   DU_FMT_CFG_IDX_MASK                    0x0000001f
#define   DU_FMT_CFG_IDX_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 du_fmt_cfg_idx:5;
        u32 rsvd_5:27;
    } b;
} eccu_du_fmt_sel_reg_t;

#define ECCU_DU_FMT_REG0                         0x00000020
#define   META_SZ_MASK                           0xff000000
#define   META_SZ_SHIFT                                  24
#define   HLBA_MODE_MASK                         0x00c00000
#define   HLBA_MODE_SHIFT                                22
#define   HLBA_SZ_20_MASK                        0x00300000
#define   HLBA_SZ_20_SHIFT                               20
#define   DU2HOST_RATIO_MASK                     0x000f8000
#define   DU2HOST_RATIO_SHIFT                            15
#define   HOST_SECTOR_SZ_MASK                    0x00003fff
#define   HOST_SECTOR_SZ_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 host_sector_sz:14;
        u32 rsvd_14:1;
        u32 du2host_ratio:5;
        u32 hlba_sz_20:2;
        u32 hlba_mode:2;
        u32 meta_sz:8;
    } b;
} eccu_du_fmt_reg0_t;

#define ECCU_DU_FMT_REG1                         0x00000024
#define   PHY_PAGE_PAD_EN_MASK                   0x40000000
#define   PHY_PAGE_PAD_EN_SHIFT                          30
#define   PI_SZ_MASK                             0x30000000
#define   PI_SZ_SHIFT                                    28
#define   SCR_SEED_SEL_MASK                      0x0c000000
#define   SCR_SEED_SEL_SHIFT                             26
#define   SCR_LUT_EN_MASK                        0x02000000
#define   SCR_LUT_EN_SHIFT                               25
#define   USER_SCR_EN_MASK                       0x01000000
#define   USER_SCR_EN_SHIFT                              24
#define   META_SCR_EN_MASK                       0x00800000
#define   META_SCR_EN_SHIFT                              23
#define   DU_CRC_INV_EN_MASK                     0x00400000
#define   DU_CRC_INV_EN_SHIFT                            22
#define   ECC_INV_EN_MASK                        0x00200000
#define   ECC_INV_EN_SHIFT                               21
#define   DU_CRC_EN_MASK                         0x00100000
#define   DU_CRC_EN_SHIFT                                20
#define   DU_CRC_6B_EN_MASK                      0x00080000
#define   DU_CRC_6B_EN_SHIFT                             19
#define   META_CRC_EN_MASK                       0x00040000
#define   META_CRC_EN_SHIFT                              18
#define   ECC_BYPASS_MASK                        0x00030000
#define   ECC_BYPASS_SHIFT                               16
#define   BCH_T_MASK                             0x00003f80
#define   BCH_T_SHIFT                                     7
#define   ECC_CMF_SEL_MASK                       0x00000040
#define   ECC_CMF_SEL_SHIFT                               6
#define   ECC_CORE_SEL_MASK                      0x00000030
#define   ECC_CORE_SEL_SHIFT                              4
#define   CW_NUM_DU_MASK                         0x0000000f
#define   CW_NUM_DU_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cw_num_du:4;
        u32 ecc_core_sel:2;
        u32 ecc_cmf_sel:1;
        u32 bch_t:7;
        u32 rsvd_14:2;
        u32 ecc_bypass:2;
        u32 meta_crc_en:1;
        u32 du_crc_6b_en:1;
        u32 du_crc_en:1;
        u32 ecc_inv_en:1;
        u32 du_crc_inv_en:1;
        u32 meta_scr_en:1;
        u32 user_scr_en:1;
        u32 scr_lut_en:1;
        u32 scr_seed_sel:2;
        u32 pi_sz:2;
        u32 phy_page_pad_en:1;
        u32 rsvd_31:1;
    } b;
} eccu_du_fmt_reg1_t;

#define ECCU_DU_FMT_REG2                         0x00000028
#define   ERASE_DET_THD_MASK                     0x0fff0000
#define   ERASE_DET_THD_SHIFT                            16
#define   PHY_PAD_SZ_MASK                        0x0000ffff
#define   PHY_PAD_SZ_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 phy_pad_sz:16;
        u32 erase_det_thd:12;
        u32 rsvd_28:4;
    } b;
} eccu_du_fmt_reg2_t;

#define ECCU_DU_FMT_REG3                         0x0000002c
#define   CW_ERR_OVRLMT_THD_MASK                 0x0000ffff
#define   CW_ERR_OVRLMT_THD_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 cw_err_ovrlmt_thd:16;
        u32 rsvd_16:16;
    } b;
} eccu_du_fmt_reg3_t;

#define ECCU_DU_FMT_REG4                         0x00000030

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} eccu_du_fmt_reg4_t;

#define ECCU_DU_FMT_REG5                         0x00000034
#define   ECCU_DU_SZ_MASK                        0xffff0000
#define   ECCU_DU_SZ_SHIFT                               16
#define   ECCU_TOT_XFCNT_MASK                    0x0000ffff
#define   ECCU_TOT_XFCNT_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 eccu_tot_xfcnt:16;
        u32 eccu_du_sz:16;
    } b;
} eccu_du_fmt_reg5_t;

#define ECCU_DU_FMT_REG6                         0x00000038
#define   ECC_MAX_USER_SZ_MASK                   0xffff0000
#define   ECC_MAX_USER_SZ_SHIFT                          16
#define   ECC_MAX_PAR_SZ_MASK                    0x0000ffff
#define   ECC_MAX_PAR_SZ_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 ecc_max_par_sz:16;
        u32 ecc_max_user_sz:16;
    } b;
} eccu_du_fmt_reg6_t;

#define ECCU_ENC_STATUS_REG0                     0x0000003c
#define   CUR_DU_HMB_ERR_MASK                    0x00000100
#define   CUR_DU_HMB_ERR_SHIFT                            8
#define   CUR_DU_ENC_XFER_ERR_MASK               0x00000080
#define   CUR_DU_ENC_XFER_ERR_SHIFT                       7
#define   CUR_DU_RAID_ERR_MASK                   0x00000040
#define   CUR_DU_RAID_ERR_SHIFT                           6
#define   CUR_DU_FDMA_ERR_MASK                   0x00000020
#define   CUR_DU_FDMA_ERR_SHIFT                           5
#define   CUR_DU_PPU_ERR_MASK                    0x00000010
#define   CUR_DU_PPU_ERR_SHIFT                            4
#define   CUR_DU_DFU_ERR_MASK                    0x00000008
#define   CUR_DU_DFU_ERR_SHIFT                            3
#define   CUR_DU_ENC_ERR_MASK                    0x00000006
#define   CUR_DU_ENC_ERR_SHIFT                            1
#define   ECCU_ENC_RESUME_MASK                   0x00000001
#define   ECCU_ENC_RESUME_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 eccu_enc_resume:1;
        u32 cur_du_enc_err:2;
        u32 cur_du_dfu_err:1;
        u32 cur_du_ppu_err:1;
        u32 cur_du_fdma_err:1;
        u32 cur_du_raid_err:1;
        u32 cur_du_enc_xfer_err:1;
        u32 cur_du_hmb_err:1;
        u32 rsvd_9:23;
    } b;
} eccu_enc_status_reg0_t;

#define ECCU_ENC_STATUS_REG1                     0x00000040
#define   ECCU_RSVVD_0_MASK                      0xffffffff
#define   ECCU_RSVVD_0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 eccu_rsvvd_0:32;
    } b;
} eccu_enc_status_reg1_t;

#define ECCU_ENC_STATUS_REG2                     0x00000044
#define   ECCU_RSVVD_1_MASK                      0xffffffff
#define   ECCU_RSVVD_1_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 eccu_rsvvd_1:32;
    } b;
} eccu_enc_status_reg2_t;

#define ECCU_DEC_STATUS_REG0                     0x00000048
#define   CUR_DU_ACCUM_RAW_01_CNT_MASK           0xffff0000
#define   CUR_DU_ACCUM_RAW_01_CNT_SHIFT                  16
#define   CUR_DU_FW_ARD_SET_ERR_MASK             0x00000400
#define   CUR_DU_FW_ARD_SET_ERR_SHIFT                    10
#define   CUR_DU_PARTIAL_DU_DET_ERR_MASK         0x00000200
#define   CUR_DU_PARTIAL_DU_DET_ERR_SHIFT                 9
#define   CUR_DU_OVRLMT_ERR_MASK                 0x00000100
#define   CUR_DU_OVRLMT_ERR_SHIFT                         8
#define   CUR_DU_RAID_ERR_48_MASK                0x00000080
#define   CUR_DU_RAID_ERR_48_SHIFT                        7
#define   CUR_DU_FDMA_ERR_48_MASK                0x00000040
#define   CUR_DU_FDMA_ERR_48_SHIFT                        6
#define   CUR_DU_PPU_ERR_48_MASK                 0x00000020
#define   CUR_DU_PPU_ERR_48_SHIFT                         5
#define   CUR_DU_DFU_ERR_48_MASK                 0x00000010
#define   CUR_DU_DFU_ERR_48_SHIFT                         4
#define   CUR_DU_UCERR_MASK                      0x0000000c
#define   CUR_DU_UCERR_SHIFT                              2
#define   CUR_DU_ERASE_MASK                      0x00000002
#define   CUR_DU_ERASE_SHIFT                              1
#define   ECCU_DEC_RESUME_MASK                   0x00000001
#define   ECCU_DEC_RESUME_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 eccu_dec_resume:1;
        u32 cur_du_erase:1;
        u32 cur_du_ucerr:2;
        u32 cur_du_dfu_err_48:1;
        u32 cur_du_ppu_err_48:1;
        u32 cur_du_fdma_err_48:1;
        u32 cur_du_raid_err_48:1;
        u32 cur_du_ovrlmt_err:1;
        u32 cur_du_partial_du_det_err:1;
        u32 cur_du_fw_ard_set_err:1;
        u32 rsvd_11:5;
        u32 cur_du_accum_raw_01_cnt:16;
    } b;
} eccu_dec_status_reg0_t;

#define ECCU_DEC_STATUS_REG1                     0x0000004c

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} eccu_dec_status_reg1_t;

#define ECCU_DEC_STATUS_REG2                     0x00000050
#define   UNCLEAN_DU_CNT_MASK                    0xffffffff
#define   UNCLEAN_DU_CNT_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 unclean_du_cnt:32;
    } b;
} eccu_dec_status_reg2_t;

#define ECCU_DEC_STATUS_REG3                     0x00000054
#define   UNCORR_DU_CNT_MASK                     0xffffffff
#define   UNCORR_DU_CNT_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 uncorr_du_cnt:32;
    } b;
} eccu_dec_status_reg3_t;

#define ECCU_DEC_STATUS_REG4                     0x00000058
#define   OVRLMT_DU_CNT_MASK                     0xffffffff
#define   OVRLMT_DU_CNT_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 ovrlmt_du_cnt:32;
    } b;
} eccu_dec_status_reg4_t;

#define ECCU_DEC_STATUS_REG5                     0x0000005c

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} eccu_dec_status_reg5_t;

#define ECCU_DEC_STATUS_REG6                     0x00000060

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} eccu_dec_status_reg6_t;

#define ECCU_DBG_REG0                            0x00000064
#define   ECCU_DBG_STATUS_MASK                   0xffff0000
#define   ECCU_DBG_STATUS_SHIFT                          16
#define   ECCU_DBG_SEL_MASK                      0x0000ffff
#define   ECCU_DBG_SEL_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 eccu_dbg_sel:16;
        u32 eccu_dbg_status:16;
    } b;
} eccu_dbg_reg0_t;

#define ECCU_DBG_REG1                            0x00000068
#define   ECCU_PIN_DBG_SEL_MASK                  0x0000000f
#define   ECCU_PIN_DBG_SEL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 eccu_pin_dbg_sel:4;
        u32 rsvd_4:28;
    } b;
} eccu_dbg_reg1_t;

#define ECCU_MEM_CPU_ACC_REG0                    0x0000006c
#define   ECCU_CPU_MEM_ACC_IDX_MASK              0x0000ff00
#define   ECCU_CPU_MEM_ACC_IDX_SHIFT                      8
#define   ECCU_CPU_MEM_ACC_INIT_MASK             0x00000004
#define   ECCU_CPU_MEM_ACC_INIT_SHIFT                     2
#define   ECCU_CPU_MEM_ACC_RWB_MASK              0x00000002
#define   ECCU_CPU_MEM_ACC_RWB_SHIFT                      1
#define   ECCU_CPU_MEM_ACC_EN_MASK               0x00000001
#define   ECCU_CPU_MEM_ACC_EN_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 eccu_cpu_mem_acc_en:1;
        u32 eccu_cpu_mem_acc_rwb:1;
        u32 eccu_cpu_mem_acc_init:1;
        u32 rsvd_3:5;
        u32 eccu_cpu_mem_acc_idx:8;
        u32 rsvd_16:16;
    } b;
} eccu_mem_cpu_acc_reg0_t;

#define ECCU_MEM_CPU_ACC_REG1                    0x00000070
#define   ECCU_CPU_MEM_ACC_DATA_MASK             0xffffffff
#define   ECCU_CPU_MEM_ACC_DATA_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 eccu_cpu_mem_acc_data:32;
    } b;
} eccu_mem_cpu_acc_reg1_t;

#define ECC_CLK_GATE_CTRL_REG                    0x00000074
#define   FORCE_LLRMAP_CLK_ON_MASK               0x80000000
#define   FORCE_LLRMAP_CLK_ON_SHIFT                      31
#define   FORCE_MDEC_CLK_ON_MASK                 0x40000000
#define   FORCE_MDEC_CLK_ON_SHIFT                        30
#define   FORCE_DEC_CLK_ON_MASK                  0x20000000
#define   FORCE_DEC_CLK_ON_SHIFT                         29
#define   FORCE_ENC_CLK_ON_MASK                  0x10000000
#define   FORCE_ENC_CLK_ON_SHIFT                         28
#define   FORCE_ECCU_MEM_CLK_ON_MASK             0x08000000
#define   FORCE_ECCU_MEM_CLK_ON_SHIFT                    27
#define   ECCU_MEM_CLK_GATE_DIS_MASK             0x04000000
#define   ECCU_MEM_CLK_GATE_DIS_SHIFT                    26
#define   ECCU_ENC_XFCNT_THD_MASK                0x00ff0000
#define   ECCU_ENC_XFCNT_THD_SHIFT                       16
#define   ECCU_CLK_GATE_TERM_CNT_MASK            0x0000ff00
#define   ECCU_CLK_GATE_TERM_CNT_SHIFT                    8
#define   APB_WR_WAIT_CNT_MASK                   0x000000f0
#define   APB_WR_WAIT_CNT_SHIFT                           4
#define   APB_RD_WAIT_CNT_MASK                   0x0000000f
#define   APB_RD_WAIT_CNT_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 apb_rd_wait_cnt:4;
        u32 apb_wr_wait_cnt:4;
        u32 eccu_clk_gate_term_cnt:8;
        u32 eccu_enc_xfcnt_thd:8;
        u32 rsvd_24:2;
        u32 eccu_mem_clk_gate_dis:1;
        u32 force_eccu_mem_clk_on:1;
        u32 force_enc_clk_on:1;
        u32 force_dec_clk_on:1;
        u32 force_mdec_clk_on:1;
        u32 force_llrmap_clk_on:1;
    } b;
} ecc_clk_gate_ctrl_reg_t;

#define ECCU_FDMA_CFG_REG                        0x00000080
#define   FDMA_CONF_INTF_RESET_MASK              0x80000000
#define   FDMA_CONF_INTF_RESET_SHIFT                     31
#define   FDMA_CONF_SEED_BYPASS_MASK             0x00020000
#define   FDMA_CONF_SEED_BYPASS_SHIFT                    17
#define   FDMA_CONF_SCR_LUT_RDY_MASK             0x00010000
#define   FDMA_CONF_SCR_LUT_RDY_SHIFT                    16
#define   FDMA_CONF_ENC_RDY_MASK                 0x00008000
#define   FDMA_CONF_ENC_RDY_SHIFT                        15
#define   FDMA_CONF_DEC_RDY_MASK                 0x00004000
#define   FDMA_CONF_DEC_RDY_SHIFT                        14
#define   FDMA_CONF_XFER_RD_FINISH_MASK          0x00000800
#define   FDMA_CONF_XFER_RD_FINISH_SHIFT                 11
#define   FDMA_CONF_SCR_LUT_INIT_MASK            0x00000400
#define   FDMA_CONF_SCR_LUT_INIT_SHIFT                   10
#define   FDMA_CONF_DEC_INIT_MASK                0x00000200
#define   FDMA_CONF_DEC_INIT_SHIFT                        9
#define   FDMA_CONF_ENC_INIT_MASK                0x00000100
#define   FDMA_CONF_ENC_INIT_SHIFT                        8
#define   FDMA_CONF_CMF_SEL_MASK                 0x00000020
#define   FDMA_CONF_CMF_SEL_SHIFT                         5
#define   FDMA_CONF_RD_WRB_MASK                  0x00000010
#define   FDMA_CONF_RD_WRB_SHIFT                          4
#define   FDMA_CONF_ENC_DEC_SEL_MASK             0x00000008
#define   FDMA_CONF_ENC_DEC_SEL_SHIFT                     3
#define   FDMA_CONF_MODE_MASK                    0x00000007
#define   FDMA_CONF_MODE_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 fdma_conf_mode:3;
        u32 fdma_conf_enc_dec_sel:1;
        u32 fdma_conf_rd_wrb:1;
        u32 fdma_conf_cmf_sel:1;
        u32 rsvd_6:2;
        u32 fdma_conf_enc_init:1;
        u32 fdma_conf_dec_init:1;
        u32 fdma_conf_scr_lut_init:1;
        u32 fdma_conf_xfer_rd_finish:1;
        u32 rsvd_12:2;
        u32 fdma_conf_dec_rdy:1;
        u32 fdma_conf_enc_rdy:1;
        u32 fdma_conf_scr_lut_rdy:1;
        u32 fdma_conf_seed_bypass:1;
        u32 rsvd_18:13;
        u32 fdma_conf_intf_reset:1;
    } b;
} eccu_fdma_cfg_reg_t;

#define ECCU_FDMA_CFG_ADDR_REG                   0x00000084
#define   FDMA_CONF_START_ADDR_MASK              0xffffffff
#define   FDMA_CONF_START_ADDR_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 fdma_conf_start_addr:32;
    } b;
} eccu_fdma_cfg_addr_reg_t;

#define ECCU_FDMA_CFG_XFSZ_REG                   0x00000088
#define   FDMA_CONF_RELS_TYPE_MASK               0x000f0000
#define   FDMA_CONF_RELS_TYPE_SHIFT                      16
#define   FDMA_CONF_XFER_SZ_MASK                 0x0000ffff
#define   FDMA_CONF_XFER_SZ_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 fdma_conf_xfer_sz:16;
        u32 fdma_conf_rels_type:4;
        u32 rsvd_20:12;
    } b;
} eccu_fdma_cfg_xfsz_reg_t;

#define ECCU_RGBK_CMF_CFG_REG0                   0x0000008c
#define   ECCU_CMF_RD_DATA_RDY_MASK              0x00000008
#define   ECCU_CMF_RD_DATA_RDY_SHIFT                      3
#define   ECCU_CMF_RD_DATA_VLD_MASK              0x00000004
#define   ECCU_CMF_RD_DATA_VLD_SHIFT                      2
#define   ECCU_CMF_WR_DATA_VLD_MASK              0x00000002
#define   ECCU_CMF_WR_DATA_VLD_SHIFT                      1
#define   ECCU_CMF_INTF_SEL_MASK                 0x00000001
#define   ECCU_CMF_INTF_SEL_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 eccu_cmf_intf_sel:1;
        u32 eccu_cmf_wr_data_vld:1;
        u32 eccu_cmf_rd_data_vld:1;
        u32 eccu_cmf_rd_data_rdy:1;
        u32 rsvd_4:28;
    } b;
} eccu_rgbk_cmf_cfg_reg0_t;

#define ECCU_RGBK_CMF_CFG_REG1                   0x00000090
#define   ECCU_CMF_WR_DATA_MASK                  0xffffffff
#define   ECCU_CMF_WR_DATA_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 eccu_cmf_wr_data:32;
    } b;
} eccu_rgbk_cmf_cfg_reg1_t;

#define ECCU_RGBK_CMF_CFG_REG2                   0x00000094
#define   ECCU_CMF_RD_DATA_MASK                  0xffffffff
#define   ECCU_CMF_RD_DATA_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 eccu_cmf_rd_data:32;
    } b;
} eccu_rgbk_cmf_cfg_reg2_t;

#define ECCU_FAULT_REG0                          0x00000098
#define   SCR_LUT_CRC_FAULT_MASK_MASK            0x00000800
#define   SCR_LUT_CRC_FAULT_MASK_SHIFT                   11
#define   SCR_LUT_CRC_FAULT_MASK                 0x00000400
#define   SCR_LUT_CRC_FAULT_SHIFT                        10
#define   PDEC_CMF_MEM_CRC_FAULT_MASK_MASK       0x00000200
#define   PDEC_CMF_MEM_CRC_FAULT_MASK_SHIFT               9
#define   PDEC_CMF_MEM_CRC_FAULT_MASK            0x00000100
#define   PDEC_CMF_MEM_CRC_FAULT_SHIFT                    8
#define   MDEC_CMF_MEM_CRC_FAULT_MASK_MASK       0x000000c0
#define   MDEC_CMF_MEM_CRC_FAULT_MASK_SHIFT               6
#define   MDEC_CMF_MEM_CRC_FAULT_MASK            0x00000030
#define   MDEC_CMF_MEM_CRC_FAULT_SHIFT                    4
#define   ENC_CMF_H1_MEM_CRC_FAULT_MASK_MASK     0x00000008
#define   ENC_CMF_H1_MEM_CRC_FAULT_MASK_SHIFT             3
#define   ENC_CMF_H1_MEM_CRC_FAULT_MASK          0x00000004
#define   ENC_CMF_H1_MEM_CRC_FAULT_SHIFT                  2
#define   ENC_CMF_G_MEM_CRC_FAULT_MASK_MASK      0x00000002
#define   ENC_CMF_G_MEM_CRC_FAULT_MASK_SHIFT              1
#define   ENC_CMF_G_MEM_CRC_FAULT_MASK           0x00000001
#define   ENC_CMF_G_MEM_CRC_FAULT_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 enc_cmf_g_mem_crc_fault:1;
        u32 enc_cmf_g_mem_crc_fault_mask:1;
        u32 enc_cmf_h1_mem_crc_fault:1;
        u32 enc_cmf_h1_mem_crc_fault_mask:1;
        u32 mdec_cmf_mem_crc_fault:2;
        u32 mdec_cmf_mem_crc_fault_mask:2;
        u32 pdec_cmf_mem_crc_fault:1;
        u32 pdec_cmf_mem_crc_fault_mask:1;
        u32 scr_lut_crc_fault:1;
        u32 scr_lut_crc_fault_mask:1;
        u32 rsvd_12:20;
    } b;
} eccu_fault_reg0_t;

#define FDMA_CTRL_REG0                           0x00000100
#define   FDMA_ABORT_REQ_MASK                    0x00000080
#define   FDMA_ABORT_REQ_SHIFT                            7
#define   FDMA_SECT_SZ_SEL_MASK                  0x00000060
#define   FDMA_SECT_SZ_SEL_SHIFT                          5
#define   FDMA_DU_SZ_SEL_MASK                    0x00000018
#define   FDMA_DU_SZ_SEL_SHIFT                            3
#define   FDMA_PI_EN_MASK                        0x00000004
#define   FDMA_PI_EN_SHIFT                                2
#define   FDMA_SCRC_EN_MASK                      0x00000002
#define   FDMA_SCRC_EN_SHIFT                              1
#define   FDMA_RESET_MASK                        0x00000001
#define   FDMA_RESET_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 fdma_reset:1;
        u32 fdma_scrc_en:1;
        u32 fdma_pi_en:1;
        u32 fdma_du_sz_sel:2;
        u32 fdma_sect_sz_sel:2;
        u32 fdma_abort_req:1;
        u32 rsvd_8:24;
    } b;
} fdma_ctrl_reg0_t;

#define FDMA_LOOPBK_CTRL_REG                     0x00000104
#define   F2B_LOOPBACK_ADDR_HIGH_MASK            0x000f0000
#define   F2B_LOOPBACK_ADDR_HIGH_SHIFT                   16
#define   TEST_ERROR_COUNT_MASK                  0x00007e00
#define   TEST_ERROR_COUNT_SHIFT                          9
#define   TEST_FAIL_MASK                         0x00000100
#define   TEST_FAIL_SHIFT                                 8
#define   F2B_LOOPBACK_RD_DONE_MASK              0x00000008
#define   F2B_LOOPBACK_RD_DONE_SHIFT                      3
#define   F2B_LOOPBACK_RD_TEST_MASK              0x00000004
#define   F2B_LOOPBACK_RD_TEST_SHIFT                      2
#define   F2B_LOOPBACK_WR_DONE_MASK              0x00000002
#define   F2B_LOOPBACK_WR_DONE_SHIFT                      1
#define   F2B_LOOPBACK_WR_TEST_MASK              0x00000001
#define   F2B_LOOPBACK_WR_TEST_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 f2b_loopback_wr_test:1;
        u32 f2b_loopback_wr_done:1;
        u32 f2b_loopback_rd_test:1;
        u32 f2b_loopback_rd_done:1;
        u32 rsvd_4:4;
        u32 test_fail:1;
        u32 test_error_count:6;
        u32 rsvd_15:1;
        u32 f2b_loopback_addr_high:4;
        u32 rsvd_20:12;
    } b;
} fdma_loopbk_ctrl_reg_t;

#define FDMA_LOOPBK_ADDR_LOW_REG                 0x00000108
#define   F2B_LOOPBACK_ADDR_LOW_MASK             0xffffffff
#define   F2B_LOOPBACK_ADDR_LOW_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 f2b_loopback_addr_low:32;
    } b;
} fdma_loopbk_addr_low_reg_t;

#define FDMA_DEBUG_REG                           0x0000010c
#define   FDMA_INT_DBG_STATUS_MASK               0xffffffff
#define   FDMA_INT_DBG_STATUS_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 fdma_int_dbg_status:32;
    } b;
} fdma_debug_reg_t;

#define ECCU_CONF_REG                            0x00000110
#define   NCB_1_MASK                             0x00010000
#define   NCB_1_SHIFT                                    16
#define   NCB_0_MASK                             0x00008000
#define   NCB_0_SHIFT                                    15
#define   CMF_1_MASK                             0x00004000
#define   CMF_1_SHIFT                                    14
#define   CMF_0_MASK                             0x00002000
#define   CMF_0_SHIFT                                    13
#define   BCH_MASK                               0x00001000
#define   BCH_SHIFT                                      12
#define   LDPC_ENC_MASK                          0x00000800
#define   LDPC_ENC_SHIFT                                 11
#define   PDEC_MASK                              0x00000400
#define   PDEC_SHIFT                                     10
#define   MDEC_1_MASK                            0x00000200
#define   MDEC_1_SHIFT                                    9
#define   MDEC_0_MASK                            0x00000100
#define   MDEC_0_SHIFT                                    8
#define   CE_NUM_MASK                            0x000000f0
#define   CE_NUM_SHIFT                                    4
#define   CH_NUM_MASK                            0x0000000f
#define   CH_NUM_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 ch_num:4;
        u32 ce_num:4;
        u32 mdec_0:1;
        u32 mdec_1:1;
        u32 pdec:1;
        u32 ldpc_enc:1;
        u32 bch:1;
        u32 cmf_0:1;
        u32 cmf_1:1;
        u32 ncb_0:1;
        u32 ncb_1:1;
        u32 rsvd_17:15;
    } b;
} eccu_conf_reg_t;

#define ECCU_MEM_TIMING_CTRL_REG0                0x00000120
#define   RGW_ENC_BUF_WTSEL_MASK                 0x00c00000
#define   RGW_ENC_BUF_WTSEL_SHIFT                        22
#define   RGW_ENC_BUF_RTSEL_MASK                 0x00300000
#define   RGW_ENC_BUF_RTSEL_SHIFT                        20
#define   RGW_DFU_SCR_SEED_MEM_WTSEL_MASK        0x000c0000
#define   RGW_DFU_SCR_SEED_MEM_WTSEL_SHIFT               18
#define   RGW_DFU_SCR_SEED_MEM_RTSEL_MASK        0x00030000
#define   RGW_DFU_SCR_SEED_MEM_RTSEL_SHIFT               16
#define   RGW_DEC_DU_BUF_WTSEL_MASK              0x0000c000
#define   RGW_DEC_DU_BUF_WTSEL_SHIFT                     14
#define   RGW_DEC_DU_BUF_RTSEL_MASK              0x00003000
#define   RGW_DEC_DU_BUF_RTSEL_SHIFT                     12
#define   RGW_DEC_INPUT_BUF_WTSEL_MASK           0x00000c00
#define   RGW_DEC_INPUT_BUF_WTSEL_SHIFT                  10
#define   RGW_DEC_INPUT_BUF_RTSEL_MASK           0x00000300
#define   RGW_DEC_INPUT_BUF_RTSEL_SHIFT                   8
#define   RGW_MDEC_CMF_MEM_WTSEL_MASK            0x000000c0
#define   RGW_MDEC_CMF_MEM_WTSEL_SHIFT                    6
#define   RGW_MDEC_CMF_MEM_RTSEL_MASK            0x00000030
#define   RGW_MDEC_CMF_MEM_RTSEL_SHIFT                    4
#define   RGW_PDEC_CMF_MEM_WTSEL_MASK            0x0000000c
#define   RGW_PDEC_CMF_MEM_WTSEL_SHIFT                    2
#define   RGW_PDEC_CMF_MEM_RTSEL_MASK            0x00000003
#define   RGW_PDEC_CMF_MEM_RTSEL_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 rgw_pdec_cmf_mem_rtsel:2;
        u32 rgw_pdec_cmf_mem_wtsel:2;
        u32 rgw_mdec_cmf_mem_rtsel:2;
        u32 rgw_mdec_cmf_mem_wtsel:2;
        u32 rgw_dec_input_buf_rtsel:2;
        u32 rgw_dec_input_buf_wtsel:2;
        u32 rgw_dec_du_buf_rtsel:2;
        u32 rgw_dec_du_buf_wtsel:2;
        u32 rgw_dfu_scr_seed_mem_rtsel:2;
        u32 rgw_dfu_scr_seed_mem_wtsel:2;
        u32 rgw_enc_buf_rtsel:2;
        u32 rgw_enc_buf_wtsel:2;
        u32 rsvd_24:8;
    } b;
} eccu_mem_timing_ctrl_reg0_t;

#define ECCU_MEM_TIMING_CTRL_REG1                0x00000124
#define   RGW_FDMA_SRAM_KPSEL_MASK               0x0001c000
#define   RGW_FDMA_SRAM_KPSEL_SHIFT                      14
#define   RGW_FDMA_SRAM_WTSEL_MASK               0x00003000
#define   RGW_FDMA_SRAM_WTSEL_SHIFT                      12
#define   RGW_FDMA_SRAM_RTSEL_MASK               0x00000c00
#define   RGW_FDMA_SRAM_RTSEL_SHIFT                      10
#define   RGW_FDMA_RMSRAM_MTSEL_MASK             0x00000300
#define   RGW_FDMA_RMSRAM_MTSEL_SHIFT                     8
#define   RGW_FDMA_RMSRAM_WTSEL_MASK             0x000000c0
#define   RGW_FDMA_RMSRAM_WTSEL_SHIFT                     6
#define   RGW_FDMA_RMSRAM_RTSEL_MASK             0x00000030
#define   RGW_FDMA_RMSRAM_RTSEL_SHIFT                     4
#define   RGW_FDMA_PRFSRAM_WTSEL_MASK            0x0000000c
#define   RGW_FDMA_PRFSRAM_WTSEL_SHIFT                    2
#define   RGW_FDMA_PRFSRAM_RTSEL_MASK            0x00000003
#define   RGW_FDMA_PRFSRAM_RTSEL_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 rgw_fdma_prfsram_rtsel:2;
        u32 rgw_fdma_prfsram_wtsel:2;
        u32 rgw_fdma_rmsram_rtsel:2;
        u32 rgw_fdma_rmsram_wtsel:2;
        u32 rgw_fdma_rmsram_mtsel:2;
        u32 rgw_fdma_sram_rtsel:2;
        u32 rgw_fdma_sram_wtsel:2;
        u32 rgw_fdma_sram_kpsel:3;
        u32 rsvd_17:15;
    } b;
} eccu_mem_timing_ctrl_reg1_t;

#define ECCU_MEM_TIMING_CTRL_REG2                0x00000128
#define   ECCU_ROM_TM_MASK                       0x00000040
#define   ECCU_ROM_TM_SHIFT                               6
#define   ECCU_ROM_TRB_MASK                      0x00000030
#define   ECCU_ROM_TRB_SHIFT                              4
#define   ECCU_ROM_RTSEL_MASK                    0x0000000c
#define   ECCU_ROM_RTSEL_SHIFT                            2
#define   ECCU_ROM_PTSEL_MASK                    0x00000003
#define   ECCU_ROM_PTSEL_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 eccu_rom_ptsel:2;
        u32 eccu_rom_rtsel:2;
        u32 eccu_rom_trb:2;
        u32 eccu_rom_tm:1;
        u32 rsvd_7:25;
    } b;
} eccu_mem_timing_ctrl_reg2_t;

#define ECCU_ROM_SZ_REG0                         0x0000012c
#define   RGR_CMF_ROM_LEN_MASK                   0x3fff0000
#define   RGR_CMF_ROM_LEN_SHIFT                          16
#define   RGR_CMF_ROM_END_ADDR_MASK              0x00003fff
#define   RGR_CMF_ROM_END_ADDR_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 rgr_cmf_rom_end_addr:14;
        u32 rsvd_14:2;
        u32 rgr_cmf_rom_len:14;
        u32 rsvd_30:2;
    } b;
} eccu_rom_sz_reg0_t;

#define ECCU_PARTIAL_DU_DETECT_REG0              0x00000130
#define   PARTIAL_DU_DETECT_LOC_START_MASK       0x0000001e
#define   PARTIAL_DU_DETECT_LOC_START_SHIFT               1
#define   PARTIAL_DU_DETECT_EN_MASK              0x00000001
#define   PARTIAL_DU_DETECT_EN_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 partial_du_detect_en:1;
        u32 partial_du_detect_loc_start:4;
        u32 rsvd_5:27;
    } b;
} eccu_partial_du_detect_reg0_t;

#define ECCU_PARTIAL_DU_DETECT_REG1              0x00000134
#define   PARTIAL_DU_DETECT_BIT_MASK_MASK        0xffffffff
#define   PARTIAL_DU_DETECT_BIT_MASK_SHIFT                0
typedef union {
    u32 all;
    struct {
        u32 partial_du_detect_bit_mask:32;
    } b;
} eccu_partial_du_detect_reg1_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ eccu_ver_reg_t eccu_ver_reg;
    /* 0x0004 */ eccu_ctrl_reg0_t eccu_ctrl_reg0;
    /* 0x0008 */ eccu_ctrl_reg1_t eccu_ctrl_reg1;
    /* 0x000c */ eccu_ctrl_reg2_t eccu_ctrl_reg2;
    /* 0x0010 */ eccu_ctrl_reg3_t eccu_ctrl_reg3;
    /* 0x0014 */ eccu_ctrl_reg4_t eccu_ctrl_reg4;
    /* 0x0018 */ eccu_ctrl_reg5_t eccu_ctrl_reg5;
    /* 0x001c */ eccu_du_fmt_sel_reg_t eccu_du_fmt_sel_reg;
    /* 0x0020 */ eccu_du_fmt_reg0_t eccu_du_fmt_reg0;
    /* 0x0024 */ eccu_du_fmt_reg1_t eccu_du_fmt_reg1;
    /* 0x0028 */ eccu_du_fmt_reg2_t eccu_du_fmt_reg2;
    /* 0x002c */ eccu_du_fmt_reg3_t eccu_du_fmt_reg3;
    /* 0x0030 */ eccu_du_fmt_reg4_t eccu_du_fmt_reg4;
    /* 0x0034 */ eccu_du_fmt_reg5_t eccu_du_fmt_reg5;
    /* 0x0038 */ eccu_du_fmt_reg6_t eccu_du_fmt_reg6;
    /* 0x003c */ eccu_enc_status_reg0_t eccu_enc_status_reg0;
    /* 0x0040 */ eccu_enc_status_reg1_t eccu_enc_status_reg1;
    /* 0x0044 */ eccu_enc_status_reg2_t eccu_enc_status_reg2;
    /* 0x0048 */ eccu_dec_status_reg0_t eccu_dec_status_reg0;
    /* 0x004c */ eccu_dec_status_reg1_t eccu_dec_status_reg1;
    /* 0x0050 */ eccu_dec_status_reg2_t eccu_dec_status_reg2;
    /* 0x0054 */ eccu_dec_status_reg3_t eccu_dec_status_reg3;
    /* 0x0058 */ eccu_dec_status_reg4_t eccu_dec_status_reg4;
    /* 0x005c */ eccu_dec_status_reg5_t eccu_dec_status_reg5;
    /* 0x0060 */ eccu_dec_status_reg6_t eccu_dec_status_reg6;
    /* 0x0064 */ eccu_dbg_reg0_t eccu_dbg_reg0;
    /* 0x0068 */ eccu_dbg_reg1_t eccu_dbg_reg1;
    /* 0x006c */ eccu_mem_cpu_acc_reg0_t eccu_mem_cpu_acc_reg0;
    /* 0x0070 */ eccu_mem_cpu_acc_reg1_t eccu_mem_cpu_acc_reg1;
    /* 0x0074 */ ecc_clk_gate_ctrl_reg_t ecc_clk_gate_ctrl_reg;
    /* 0x0078 */ u32 rsvd_78 [2];
    /* 0x0080 */ eccu_fdma_cfg_reg_t eccu_fdma_cfg_reg;
    /* 0x0084 */ eccu_fdma_cfg_addr_reg_t eccu_fdma_cfg_addr_reg;
    /* 0x0088 */ eccu_fdma_cfg_xfsz_reg_t eccu_fdma_cfg_xfsz_reg;
    /* 0x008c */ eccu_rgbk_cmf_cfg_reg0_t eccu_rgbk_cmf_cfg_reg0;
    /* 0x0090 */ eccu_rgbk_cmf_cfg_reg1_t eccu_rgbk_cmf_cfg_reg1;
    /* 0x0094 */ eccu_rgbk_cmf_cfg_reg2_t eccu_rgbk_cmf_cfg_reg2;
    /* 0x0098 */ eccu_fault_reg0_t eccu_fault_reg0;
    /* 0x009c */ u32 rsvd_9c [25];
    /* 0x0100 */ fdma_ctrl_reg0_t fdma_ctrl_reg0;
    /* 0x0104 */ fdma_loopbk_ctrl_reg_t fdma_loopbk_ctrl_reg;
    /* 0x0108 */ fdma_loopbk_addr_low_reg_t fdma_loopbk_addr_low_reg;
    /* 0x010c */ fdma_debug_reg_t fdma_debug_reg;
    /* 0x0110 */ eccu_conf_reg_t eccu_conf_reg;
    /* 0x0114 */ u32 rsvd_114 [3];
    /* 0x0120 */ eccu_mem_timing_ctrl_reg0_t eccu_mem_timing_ctrl_reg0;
    /* 0x0124 */ eccu_mem_timing_ctrl_reg1_t eccu_mem_timing_ctrl_reg1;
    /* 0x0128 */ eccu_mem_timing_ctrl_reg2_t eccu_mem_timing_ctrl_reg2;
    /* 0x012c */ eccu_rom_sz_reg0_t eccu_rom_sz_reg0;
    /* 0x0130 */ eccu_partial_du_detect_reg0_t eccu_partial_du_detect_reg0;
    /* 0x0134 */ eccu_partial_du_detect_reg1_t eccu_partial_du_detect_reg1;
} ncb_eccu_regs_t;


#endif /* rev 1003 */