//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _NCB_NDCU_REGISTER_H_
#define _NCB_NDCU_REGISTER_H_

#define NF_CTRL_REG0                             0x00000000
#define   NF_ONFI_CLK_EN_MASK                    0x40000000
#define   NF_ONFI_CLK_EN_SHIFT                           30
#define   NF_ONFI_CLK_STOP_MODE_MASK             0x20000000
#define   NF_ONFI_CLK_STOP_MODE_SHIFT                    29
#define   NF_DONE_RPT_OOO_EN_MASK                0x10000000
#define   NF_DONE_RPT_OOO_EN_SHIFT                       28
#define   NF_POLL_FUSE_MASK                      0x08000000
#define   NF_POLL_FUSE_SHIFT                             27
#define   NF_MP_POLL_DIS_MASK                    0x04000000
#define   NF_MP_POLL_DIS_SHIFT                           26
#define   NF_MP_WR_DAT_RDY_CHK_MASK              0x02000000
#define   NF_MP_WR_DAT_RDY_CHK_SHIFT                     25
#define   NF_MP_RD_XFER_MODE_MASK                0x01800000
#define   NF_MP_RD_XFER_MODE_SHIFT                       23
#define   NF_TGL_MP_CRC_MASK                     0x00400000
#define   NF_TGL_MP_CRC_SHIFT                            22
#define   NF_FICU_RESET_MASK                     0x00200000
#define   NF_FICU_RESET_SHIFT                            21
#define   NF_FICU_EN_MASK                        0x00100000
#define   NF_FICU_EN_SHIFT                               20
#define   NF_RDBUF_DUMMY_EN_MASK                 0x00080000
#define   NF_RDBUF_DUMMY_EN_SHIFT                        19
#define   NF_MLUN_INTLV_SEQ_SEL_MASK             0x00040000
#define   NF_MLUN_INTLV_SEQ_SEL_SHIFT                    18
#define   NF_EXT_ROW_EN_MASK                     0x00020000
#define   NF_EXT_ROW_EN_SHIFT                            17
#define   NF_MAX_DDR_MASK                        0x00010000
#define   NF_MAX_DDR_SHIFT                               16
#define   NF_TSB_MP_MODE_MASK                    0x00008000
#define   NF_TSB_MP_MODE_SHIFT                           15
#define   NF_DEV_BW_MASK                         0x00004000
#define   NF_DEV_BW_SHIFT                                14
#define   NF_RDCMD_OOO_DIS_MASK                  0x00002000
#define   NF_RDCMD_OOO_DIS_SHIFT                         13
#define   NF_ENCE_EXT_EN_MASK                    0x00001000
#define   NF_ENCE_EXT_EN_SHIFT                           12
#define   NF_ENCE_ON_MASK                        0x00000800
#define   NF_ENCE_ON_SHIFT                               11
#define   NF_RD_OOO_DIS_MASK                     0x00000400
#define   NF_RD_OOO_DIS_SHIFT                            10
#define   NF_NOPT_OOO_DIS_MASK                   0x00000200
#define   NF_NOPT_OOO_DIS_SHIFT                           9
#define   NF_TIM_MODE_MASK                       0x000001c0
#define   NF_TIM_MODE_SHIFT                               6
#define   NF_OP_MODE_MASK                        0x00000030
#define   NF_OP_MODE_SHIFT                                4
#define   NF_PREFIX_MODE_MASK                    0x00000008
#define   NF_PREFIX_MODE_SHIFT                            3
#define   NF_PD_EN_MASK                          0x00000004
#define   NF_PD_EN_SHIFT                                  2
#define   NF_FORCE_CLK_ON_MASK                   0x00000002
#define   NF_FORCE_CLK_ON_SHIFT                           1
#define   NF_RESET_MASK                          0x00000001
#define   NF_RESET_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 nf_reset:1;
        u32 nf_force_clk_on:1;
        u32 nf_pd_en:1;
        u32 nf_prefix_mode:1;
        u32 nf_op_mode:2;
        u32 nf_tim_mode:3;
        u32 nf_nopt_ooo_dis:1;
        u32 nf_rd_ooo_dis:1;
        u32 nf_ence_on:1;
        u32 nf_ence_ext_en:1;
        u32 nf_rdcmd_ooo_dis:1;
        u32 nf_dev_bw:1;
        u32 nf_tsb_mp_mode:1;
        u32 nf_max_ddr:1;
        u32 nf_ext_row_en:1;
        u32 nf_mlun_intlv_seq_sel:1;
        u32 nf_rdbuf_dummy_en:1;
        u32 nf_ficu_en:1;
        u32 nf_ficu_reset:1;
        u32 nf_tgl_mp_crc:1;
        u32 nf_mp_rd_xfer_mode:2;
        u32 nf_mp_wr_dat_rdy_chk:1;
        u32 nf_mp_poll_dis:1;
        u32 nf_poll_fuse:1;
        u32 nf_done_rpt_ooo_en:1;
        u32 nf_onfi_clk_stop_mode:1;
        u32 nf_onfi_clk_en:1;
        u32 rsvd_31:1;
    } b;
} nf_ctrl_reg0_t;

#define NF_IND_REG0                              0x00000004
#define   IND_START_CLR_MODE_MASK                0x20000000
#define   IND_START_CLR_MODE_SHIFT                       29
#define   IND_DQS_EVEN_MASK                      0x10000000
#define   IND_DQS_EVEN_SHIFT                             28
#define   IND_DDR_RESET_MASK                     0x08000000
#define   IND_DDR_RESET_SHIFT                            27
#define   IND_DDR_EN_MASK                        0x04000000
#define   IND_DDR_EN_SHIFT                               26
#define   IND_WP_EN_MASK                         0x02000000
#define   IND_WP_EN_SHIFT                                25
#define   IND_FIFO_RDY_MASK                      0x01000000
#define   IND_FIFO_RDY_SHIFT                             24
#define   IND_FIFO_RESET_MASK                    0x00800000
#define   IND_FIFO_RESET_SHIFT                           23
#define   IND_DQSOE_CTRL_MASK                    0x00400000
#define   IND_DQSOE_CTRL_SHIFT                           22
#define   IND_CE_CTRL_MASK                       0x00200000
#define   IND_CE_CTRL_SHIFT                              21
#define   IND_RDY_CTRL_MASK                      0x00100000
#define   IND_RDY_CTRL_SHIFT                             20
#define   IND_CMD_NUM_MASK                       0x000f0000
#define   IND_CMD_NUM_SHIFT                              16
#define   IND_START_MASK                         0x00008000
#define   IND_START_SHIFT                                15
#define   IND_RWB_MASK                           0x00004000
#define   IND_RWB_SHIFT                                  14
#define   IND_CLE_MODE_MASK                      0x00002000
#define   IND_CLE_MODE_SHIFT                             13
#define   IND_AUTO_WT_EN_MASK                    0x00001000
#define   IND_AUTO_WT_EN_SHIFT                           12
#define   IND_CH_ID_MASK                         0x00000f00
#define   IND_CH_ID_SHIFT                                 8
#define   IND_DEV_ID_MASK                        0x000000ff
#define   IND_DEV_ID_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 ind_dev_id:8;
        u32 ind_ch_id:4;
        u32 ind_auto_wt_en:1;
        u32 ind_cle_mode:1;
        u32 ind_rwb:1;
        u32 ind_start:1;
        u32 ind_cmd_num:4;
        u32 ind_rdy_ctrl:1;
        u32 ind_ce_ctrl:1;
        u32 ind_dqsoe_ctrl:1;
        u32 ind_fifo_reset:1;
        u32 ind_fifo_rdy:1;
        u32 ind_wp_en:1;
        u32 ind_ddr_en:1;
        u32 ind_ddr_reset:1;
        u32 ind_dqs_even:1;
        u32 ind_start_clr_mode:1;
        u32 rsvd_30:2;
    } b;
} nf_ind_reg0_t;

#define NF_IND_REG1                              0x00000008
#define   IND_BYTE3_MASK                         0xff000000
#define   IND_BYTE3_SHIFT                                24
#define   IND_BYTE2_MASK                         0x00ff0000
#define   IND_BYTE2_SHIFT                                16
#define   IND_BYTE1_MASK                         0x0000ff00
#define   IND_BYTE1_SHIFT                                 8
#define   IND_BYTE0_MASK                         0x000000ff
#define   IND_BYTE0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 ind_byte0:8;
        u32 ind_byte1:8;
        u32 ind_byte2:8;
        u32 ind_byte3:8;
    } b;
} nf_ind_reg1_t;

#define NF_IND_REG2                              0x0000000c
#define   IND_BYTE7_MASK                         0xff000000
#define   IND_BYTE7_SHIFT                                24
#define   IND_BYTE6_MASK                         0x00ff0000
#define   IND_BYTE6_SHIFT                                16
#define   IND_BYTE5_MASK                         0x0000ff00
#define   IND_BYTE5_SHIFT                                 8
#define   IND_BYTE4_MASK                         0x000000ff
#define   IND_BYTE4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 ind_byte4:8;
        u32 ind_byte5:8;
        u32 ind_byte6:8;
        u32 ind_byte7:8;
    } b;
} nf_ind_reg2_t;

#define NF_IND_REG3                              0x00000010
#define   IND_XFCNT_MASK                         0x0000ffff
#define   IND_XFCNT_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 ind_xfcnt:16;
        u32 rsvd_16:16;
    } b;
} nf_ind_reg3_t;

#define NF_IND_REG4                              0x00000014
#define   IND_FDATA3_MASK                        0xff000000
#define   IND_FDATA3_SHIFT                               24
#define   IND_FDATA2_MASK                        0x00ff0000
#define   IND_FDATA2_SHIFT                               16
#define   IND_FDATA1_MASK                        0x0000ff00
#define   IND_FDATA1_SHIFT                                8
#define   IND_FDATA0_MASK                        0x000000ff
#define   IND_FDATA0_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 ind_fdata0:8;
        u32 ind_fdata1:8;
        u32 ind_fdata2:8;
        u32 ind_fdata3:8;
    } b;
} nf_ind_reg4_t;

#define NF_IND_REG5                              0x00000018
#define   IND_T8_MASK                            0xf0000000
#define   IND_T8_SHIFT                                   28
#define   IND_T7_MASK                            0x0f000000
#define   IND_T7_SHIFT                                   24
#define   IND_T6_MASK                            0x00f00000
#define   IND_T6_SHIFT                                   20
#define   IND_T5_MASK                            0x000f0000
#define   IND_T5_SHIFT                                   16
#define   IND_T4_MASK                            0x0000f000
#define   IND_T4_SHIFT                                   12
#define   IND_T3_MASK                            0x00000f00
#define   IND_T3_SHIFT                                    8
#define   IND_T2_MASK                            0x000000f0
#define   IND_T2_SHIFT                                    4
#define   IND_T1_MASK                            0x0000000f
#define   IND_T1_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 ind_t1:4;
        u32 ind_t2:4;
        u32 ind_t3:4;
        u32 ind_t4:4;
        u32 ind_t5:4;
        u32 ind_t6:4;
        u32 ind_t7:4;
        u32 ind_t8:4;
    } b;
} nf_ind_reg5_t;

#define NF_IND_REG6                              0x0000001c
#define   IND_RE2DQS_DLY_MASK                    0x00001f00
#define   IND_RE2DQS_DLY_SHIFT                            8
#define   IND_T10_MASK                           0x000000f0
#define   IND_T10_SHIFT                                   4
#define   IND_T9_MASK                            0x0000000f
#define   IND_T9_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 ind_t9:4;
        u32 ind_t10:4;
        u32 ind_re2dqs_dly:5;
        u32 rsvd_13:19;
    } b;
} nf_ind_reg6_t;

#define NF_ASYNC_TIM_REG0                        0x00000020
#define   T4_ASYNC2_MASK                         0xf0000000
#define   T4_ASYNC2_SHIFT                                28
#define   T3_ASYNC2_MASK                         0x0f000000
#define   T3_ASYNC2_SHIFT                                24
#define   T2_ASYNC2_MASK                         0x00f00000
#define   T2_ASYNC2_SHIFT                                20
#define   T1_ASYNC2_MASK                         0x000f0000
#define   T1_ASYNC2_SHIFT                                16
#define   T4_ASYNC1_MASK                         0x0000f000
#define   T4_ASYNC1_SHIFT                                12
#define   T3_ASYNC1_MASK                         0x00000f00
#define   T3_ASYNC1_SHIFT                                 8
#define   T2_ASYNC1_MASK                         0x000000f0
#define   T2_ASYNC1_SHIFT                                 4
#define   T1_ASYNC1_MASK                         0x0000000f
#define   T1_ASYNC1_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 t1_async1:4;
        u32 t2_async1:4;
        u32 t3_async1:4;
        u32 t4_async1:4;
        u32 t1_async2:4;
        u32 t2_async2:4;
        u32 t3_async2:4;
        u32 t4_async2:4;
    } b;
} nf_async_tim_reg0_t;

#define NF_SYNC_TIM_REG0                         0x00000024
#define   T4_SYNC2_MASK                          0xf0000000
#define   T4_SYNC2_SHIFT                                 28
#define   T3_SYNC2_MASK                          0x0f000000
#define   T3_SYNC2_SHIFT                                 24
#define   T2_SYNC2_MASK                          0x00f00000
#define   T2_SYNC2_SHIFT                                 20
#define   T1_SYNC2_MASK                          0x000f0000
#define   T1_SYNC2_SHIFT                                 16
#define   T4_SYNC1_MASK                          0x0000f000
#define   T4_SYNC1_SHIFT                                 12
#define   T3_SYNC1_MASK                          0x00000f00
#define   T3_SYNC1_SHIFT                                  8
#define   T2_SYNC1_MASK                          0x000000f0
#define   T2_SYNC1_SHIFT                                  4
#define   T1_SYNC1_MASK                          0x0000000f
#define   T1_SYNC1_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 t1_sync1:4;
        u32 t2_sync1:4;
        u32 t3_sync1:4;
        u32 t4_sync1:4;
        u32 t1_sync2:4;
        u32 t2_sync2:4;
        u32 t3_sync2:4;
        u32 t4_sync2:4;
    } b;
} nf_sync_tim_reg0_t;

#define NF_SYNC_TIM_REG1                         0x00000028
#define   TADL_SYNC2_MASK                        0xf0000000
#define   TADL_SYNC2_SHIFT                               28
#define   T7_SYNC2_MASK                          0x0f000000
#define   T7_SYNC2_SHIFT                                 24
#define   T6_SYNC2_MASK                          0x00f00000
#define   T6_SYNC2_SHIFT                                 20
#define   T5_SYNC2_MASK                          0x000f0000
#define   T5_SYNC2_SHIFT                                 16
#define   TADL_SYNC1_MASK                        0x0000f000
#define   TADL_SYNC1_SHIFT                               12
#define   T7_SYNC1_MASK                          0x00000f00
#define   T7_SYNC1_SHIFT                                  8
#define   T6_SYNC1_MASK                          0x000000f0
#define   T6_SYNC1_SHIFT                                  4
#define   T5_SYNC1_MASK                          0x0000000f
#define   T5_SYNC1_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 t5_sync1:4;
        u32 t6_sync1:4;
        u32 t7_sync1:4;
        u32 tadl_sync1:4;
        u32 t5_sync2:4;
        u32 t6_sync2:4;
        u32 t7_sync2:4;
        u32 tadl_sync2:4;
    } b;
} nf_sync_tim_reg1_t;

#define NF_SYNC_TIM_REG2                         0x0000002c
#define   TCDQSS_MASK                            0x0f000000
#define   TCDQSS_SHIFT                                   24
#define   TWHR_MASK                              0x000003ff
#define   TWHR_SHIFT                                      0

typedef union {
    u32 all;
    struct {
        u32 twhr:10;
        u32 rsvd_10:14;
        u32 tcdqss:4;
        u32 rsvd_28:4;
    } b;
} nf_sync_tim_reg2_t;

#define NF_TGL_TIM_REG0                          0x00000030
#define   NF_TG_TIM_DUMMY0_MASK                  0xffffff00
#define   NF_TG_TIM_DUMMY0_SHIFT                          8
#define   NF_CLK_TERM_CNTR_MASK                  0x000000ff
#define   NF_CLK_TERM_CNTR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 nf_clk_term_cntr:8;
        u32 nf_tg_tim_dummy0:24;
    } b;
} nf_tgl_tim_reg0_t;

#define NF_TGL_TIM_REG1                          0x00000034
#define   NF_TG_TIM_DUMMY1_MASK                  0xffffffff
#define   NF_TG_TIM_DUMMY1_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 nf_tg_tim_dummy1:32;
    } b;
} nf_tgl_tim_reg1_t;

#define NF_GEN_TIM_REG0                          0x00000038
#define   NF_TWB_MASK                            0xf0000000
#define   NF_TWB_SHIFT                                   28
#define   NF_TRHW_MASK                           0x0f000000
#define   NF_TRHW_SHIFT                                  24
#define   NF_TCS_MASK                            0x00f00000
#define   NF_TCS_SHIFT                                   20
#define   NF_TCEH_MASK                           0x000f0000
#define   NF_TCEH_SHIFT                                  16
#define   NF_TWPSTH_ONFI_MASK                    0x0000f000
#define   NF_TWPSTH_ONFI_SHIFT                           12
#define   NF_TRPST_RCVR_ON_MASK                  0x00000400
#define   NF_TRPST_RCVR_ON_SHIFT                         10
#define   NF_DDR2_WCNT_EXT_MASK                  0x00000200
#define   NF_DDR2_WCNT_EXT_SHIFT                          9
#define   NF_DQS_HIGH_DDR2_TWHR_EN_MASK          0x00000100
#define   NF_DQS_HIGH_DDR2_TWHR_EN_SHIFT                  8
#define   NF_DQS_HIGH_DDR2_TCCS_EN_MASK          0x00000080
#define   NF_DQS_HIGH_DDR2_TCCS_EN_SHIFT                  7
#define   NF_DQSH_TCDQSS_EN_MASK                 0x00000040
#define   NF_DQSH_TCDQSS_EN_SHIFT                         6
#define   DQS_NVDDR2_TDQSRH_HIGH_MASK            0x00000020
#define   DQS_NVDDR2_TDQSRH_HIGH_SHIFT                    5
#define   NF_TCWAW_MASK                          0x0000001f
#define   NF_TCWAW_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 nf_tcwaw:5;
        u32 dqs_nvddr2_tdqsrh_high:1;
        u32 nf_dqsh_tcdqss_en:1;
        u32 nf_dqs_high_ddr2_tccs_en:1;
        u32 nf_dqs_high_ddr2_twhr_en:1;
        u32 nf_ddr2_wcnt_ext:1;
        u32 nf_trpst_rcvr_on:1;
        u32 rsvd_11:1;
        u32 nf_twpsth_onfi:4;
        u32 nf_tceh:4;
        u32 nf_tcs:4;
        u32 nf_trhw:4;
        u32 nf_twb:4;
    } b;
} nf_gen_tim_reg0_t;

#define NF_GEN_TIM_REG1                          0x0000003c
#define   NF_TWPRE_MASK                          0xf0000000
#define   NF_TWPRE_SHIFT                                 28
#define   NF_TWPRE2_MASK                         0x0f000000
#define   NF_TWPRE2_SHIFT                                24
#define   NF_TWPST_MASK                          0x00f00000
#define   NF_TWPST_SHIFT                                 20
#define   NF_TWPSTH_MASK                         0x000f0000
#define   NF_TWPSTH_SHIFT                                16
#define   NF_TRPRE_MASK                          0x0000f000
#define   NF_TRPRE_SHIFT                                 12
#define   NF_TRPRE2_MASK                         0x00000f00
#define   NF_TRPRE2_SHIFT                                 8
#define   NF_TRPST_MASK                          0x000000f0
#define   NF_TRPST_SHIFT                                  4
#define   NF_TRPSTH_MASK                         0x0000000f
#define   NF_TRPSTH_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 nf_trpsth:4;
        u32 nf_trpst:4;
        u32 nf_trpre2:4;
        u32 nf_trpre:4;
        u32 nf_twpsth:4;
        u32 nf_twpst:4;
        u32 nf_twpre2:4;
        u32 nf_twpre:4;
    } b;
} nf_gen_tim_reg1_t;

#define NF_TIM_CTRL_REG0                         0x00000040
#define   NF_TIMING_SEL_CH0_MASK                 0x0000ffff
#define   NF_TIMING_SEL_CH0_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 nf_timing_sel_ch0:16;
        u32 rsvd_16:16;
    } b;
} nf_tim_ctrl_reg0_t;

#define NF_TIM_CTRL_REG1                         0x00000044
#define   NF_TIMING_SEL_CH1_MASK                 0x0000ffff
#define   NF_TIMING_SEL_CH1_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 nf_timing_sel_ch1:16;
        u32 rsvd_16:16;
    } b;
} nf_tim_ctrl_reg1_t;

#define NF_TIM_CTRL_REG2                         0x00000048
#define   NF_TIMING_SEL_CH2_MASK                 0x0000ffff
#define   NF_TIMING_SEL_CH2_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 nf_timing_sel_ch2:16;
        u32 rsvd_16:16;
    } b;
} nf_tim_ctrl_reg2_t;

#define NF_TIM_CTRL_REG3                         0x0000004c
#define   NF_TIMING_SEL_CH3_MASK                 0x0000ffff
#define   NF_TIMING_SEL_CH3_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 nf_timing_sel_ch3:16;
        u32 rsvd_16:16;
    } b;
} nf_tim_ctrl_reg3_t;

#define NF_TIM_CTRL_REG4                         0x00000050
#define   NF_TIMING_SEL_CH4_MASK                 0x0000ffff
#define   NF_TIMING_SEL_CH4_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 nf_timing_sel_ch4:16;
        u32 rsvd_16:16;
    } b;
} nf_tim_ctrl_reg4_t;

#define NF_TIM_CTRL_REG5                         0x00000054
#define   NF_TIMING_SEL_CH5_MASK                 0x0000ffff
#define   NF_TIMING_SEL_CH5_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 nf_timing_sel_ch5:16;
        u32 rsvd_16:16;
    } b;
} nf_tim_ctrl_reg5_t;

#define NF_TIM_CTRL_REG6                         0x00000058
#define   NF_TIMING_SEL_CH6_MASK                 0x0000ffff
#define   NF_TIMING_SEL_CH6_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 nf_timing_sel_ch6:16;
        u32 rsvd_16:16;
    } b;
} nf_tim_ctrl_reg6_t;

#define NF_TIM_CTRL_REG7                         0x0000005c
#define   NF_TIMING_SEL_CH7_MASK                 0x0000ffff
#define   NF_TIMING_SEL_CH7_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 nf_timing_sel_ch7:16;
        u32 rsvd_16:16;
    } b;
} nf_tim_ctrl_reg7_t;

#define NF_RCMD_REG00                            0x00000060
#define   RCMD3_MASK                             0xff000000
#define   RCMD3_SHIFT                                    24
#define   RCMD2_MASK                             0x00ff0000
#define   RCMD2_SHIFT                                    16
#define   RCMD1_MASK                             0x0000ff00
#define   RCMD1_SHIFT                                     8
#define   RCMD0_MASK                             0x000000ff
#define   RCMD0_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 rcmd0:8;
        u32 rcmd1:8;
        u32 rcmd2:8;
        u32 rcmd3:8;
    } b;
} nf_rcmd_reg00_t;

#define NF_RCMD_REG01                            0x00000064
#define   RCMD7_MASK                             0xff000000
#define   RCMD7_SHIFT                                    24
#define   RCMD6_MASK                             0x00ff0000
#define   RCMD6_SHIFT                                    16
#define   RCMD5_MASK                             0x0000ff00
#define   RCMD5_SHIFT                                     8
#define   RCMD4_MASK                             0x000000ff
#define   RCMD4_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 rcmd4:8;
        u32 rcmd5:8;
        u32 rcmd6:8;
        u32 rcmd7:8;
    } b;
} nf_rcmd_reg01_t;

#define NF_RCMD_REG10                            0x00000068
#define   RCMD11_MASK                            0xff000000
#define   RCMD11_SHIFT                                   24
#define   RCMD10_MASK                            0x00ff0000
#define   RCMD10_SHIFT                                   16
#define   RCMD9_MASK                             0x0000ff00
#define   RCMD9_SHIFT                                     8
#define   RCMD8_MASK                             0x000000ff
#define   RCMD8_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 rcmd8:8;
        u32 rcmd9:8;
        u32 rcmd10:8;
        u32 rcmd11:8;
    } b;
} nf_rcmd_reg10_t;

#define NF_RCMD_REG11                            0x0000006c
#define   RCMD15_MASK                            0xff000000
#define   RCMD15_SHIFT                                   24
#define   RCMD14_MASK                            0x00ff0000
#define   RCMD14_SHIFT                                   16
#define   RCMD13_MASK                            0x0000ff00
#define   RCMD13_SHIFT                                    8
#define   RCMD12_MASK                            0x000000ff
#define   RCMD12_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 rcmd12:8;
        u32 rcmd13:8;
        u32 rcmd14:8;
        u32 rcmd15:8;
    } b;
} nf_rcmd_reg11_t;

#define NF_RCMD_MP_REG00                         0x00000070
#define   RCMD3_MP_MASK                          0xff000000
#define   RCMD3_MP_SHIFT                                 24
#define   RCMD2_MP_MASK                          0x00ff0000
#define   RCMD2_MP_SHIFT                                 16
#define   RCMD1_MP_MASK                          0x0000ff00
#define   RCMD1_MP_SHIFT                                  8
#define   RCMD0_MP_MASK                          0x000000ff
#define   RCMD0_MP_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rcmd0_mp:8;
        u32 rcmd1_mp:8;
        u32 rcmd2_mp:8;
        u32 rcmd3_mp:8;
    } b;
} nf_rcmd_mp_reg00_t;

#define NF_RCMD_MP_REG01                         0x00000074
#define   RCMD7_MP_MASK                          0xff000000
#define   RCMD7_MP_SHIFT                                 24
#define   RCMD6_MP_MASK                          0x00ff0000
#define   RCMD6_MP_SHIFT                                 16
#define   RCMD5_MP_MASK                          0x0000ff00
#define   RCMD5_MP_SHIFT                                  8
#define   RCMD4_MP_MASK                          0x000000ff
#define   RCMD4_MP_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rcmd4_mp:8;
        u32 rcmd5_mp:8;
        u32 rcmd6_mp:8;
        u32 rcmd7_mp:8;
    } b;
} nf_rcmd_mp_reg01_t;

#define NF_RCMD_MP_REG10                         0x00000078
#define   RCMD11_MP_MASK                         0xff000000
#define   RCMD11_MP_SHIFT                                24
#define   RCMD10_MP_MASK                         0x00ff0000
#define   RCMD10_MP_SHIFT                                16
#define   RCMD9_MP_MASK                          0x0000ff00
#define   RCMD9_MP_SHIFT                                  8
#define   RCMD8_MP_MASK                          0x000000ff
#define   RCMD8_MP_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rcmd8_mp:8;
        u32 rcmd9_mp:8;
        u32 rcmd10_mp:8;
        u32 rcmd11_mp:8;
    } b;
} nf_rcmd_mp_reg10_t;

#define NF_RCMD_MP_REG11                         0x0000007c
#define   RCMD15_MP_MASK                         0xff000000
#define   RCMD15_MP_SHIFT                                24
#define   RCMD14_MP_MASK                         0x00ff0000
#define   RCMD14_MP_SHIFT                                16
#define   RCMD13_MP_MASK                         0x0000ff00
#define   RCMD13_MP_SHIFT                                 8
#define   RCMD12_MP_MASK                         0x000000ff
#define   RCMD12_MP_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 rcmd12_mp:8;
        u32 rcmd13_mp:8;
        u32 rcmd14_mp:8;
        u32 rcmd15_mp:8;
    } b;
} nf_rcmd_mp_reg11_t;

#define NF_RXCMD_REG0                            0x00000080
#define   CRC_CMD3_MASK                          0xff000000
#define   CRC_CMD3_SHIFT                                 24
#define   CRC_CMD2_MASK                          0x00ff0000
#define   CRC_CMD2_SHIFT                                 16
#define   CRC_CMD1_MASK                          0x0000ff00
#define   CRC_CMD1_SHIFT                                  8
#define   CRC_CMD0_MASK                          0x000000ff
#define   CRC_CMD0_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 crc_cmd0:8;
        u32 crc_cmd1:8;
        u32 crc_cmd2:8;
        u32 crc_cmd3:8;
    } b;
} nf_rxcmd_reg0_t;

#define NF_RXCMD_REG1                            0x00000084
#define   CRC_CMD7_MASK                          0xff000000
#define   CRC_CMD7_SHIFT                                 24
#define   CRC_CMD6_MASK                          0x00ff0000
#define   CRC_CMD6_SHIFT                                 16
#define   CRC_CMD5_MASK                          0x0000ff00
#define   CRC_CMD5_SHIFT                                  8
#define   CRC_CMD4_MASK                          0x000000ff
#define   CRC_CMD4_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 crc_cmd4:8;
        u32 crc_cmd5:8;
        u32 crc_cmd6:8;
        u32 crc_cmd7:8;
    } b;
} nf_rxcmd_reg1_t;

#define NF_RXCMD_MP_REG0                         0x00000088
#define   CRC_CMD3_MP_MASK                       0xff000000
#define   CRC_CMD3_MP_SHIFT                              24
#define   CRC_CMD2_MP_MASK                       0x00ff0000
#define   CRC_CMD2_MP_SHIFT                              16
#define   CRC_CMD1_MP_MASK                       0x0000ff00
#define   CRC_CMD1_MP_SHIFT                               8
#define   CRC_CMD0_MP_MASK                       0x000000ff
#define   CRC_CMD0_MP_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 crc_cmd0_mp:8;
        u32 crc_cmd1_mp:8;
        u32 crc_cmd2_mp:8;
        u32 crc_cmd3_mp:8;
    } b;
} nf_rxcmd_mp_reg0_t;

#define NF_RXCMD_MP_REG1                         0x0000008c
#define   CRC_CMD7_MP_MASK                       0xff000000
#define   CRC_CMD7_MP_SHIFT                              24
#define   CRC_CMD6_MP_MASK                       0x00ff0000
#define   CRC_CMD6_MP_SHIFT                              16
#define   CRC_CMD5_MP_MASK                       0x0000ff00
#define   CRC_CMD5_MP_SHIFT                               8
#define   CRC_CMD4_MP_MASK                       0x000000ff
#define   CRC_CMD4_MP_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 crc_cmd4_mp:8;
        u32 crc_cmd5_mp:8;
        u32 crc_cmd6_mp:8;
        u32 crc_cmd7_mp:8;
    } b;
} nf_rxcmd_mp_reg1_t;

#define NF_RDCMD_DUMMY                           0x00000090
#define   R_DUMY_CMD3_MASK                       0xff000000
#define   R_DUMY_CMD3_SHIFT                              24
#define   R_DUMY_CMD2_MASK                       0x00ff0000
#define   R_DUMY_CMD2_SHIFT                              16
#define   R_DUMY_CMD1_MASK                       0x0000ff00
#define   R_DUMY_CMD1_SHIFT                               8
#define   R_DUMY_CMD0_MASK                       0x000000ff
#define   R_DUMY_CMD0_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 r_dumy_cmd0:8;
        u32 r_dumy_cmd1:8;
        u32 r_dumy_cmd2:8;
        u32 r_dumy_cmd3:8;
    } b;
} nf_rdcmd_dummy_t;

#define NF_PCMD_REG00                            0x00000094
#define   PCMD3_MASK                             0xff000000
#define   PCMD3_SHIFT                                    24
#define   PCMD2_MASK                             0x00ff0000
#define   PCMD2_SHIFT                                    16
#define   PCMD1_MASK                             0x0000ff00
#define   PCMD1_SHIFT                                     8
#define   PCMD0_MASK                             0x000000ff
#define   PCMD0_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 pcmd0:8;
        u32 pcmd1:8;
        u32 pcmd2:8;
        u32 pcmd3:8;
    } b;
} nf_pcmd_reg00_t;

#define NF_PCMD_REG01                            0x00000098
#define   PCMD7_MASK                             0xff000000
#define   PCMD7_SHIFT                                    24
#define   PCMD6_MASK                             0x00ff0000
#define   PCMD6_SHIFT                                    16
#define   PCMD5_MASK                             0x0000ff00
#define   PCMD5_SHIFT                                     8
#define   PCMD4_MASK                             0x000000ff
#define   PCMD4_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 pcmd4:8;
        u32 pcmd5:8;
        u32 pcmd6:8;
        u32 pcmd7:8;
    } b;
} nf_pcmd_reg01_t;

#define NF_PCMD_REG10                            0x0000009c
#define   PCMD11_MASK                            0xff000000
#define   PCMD11_SHIFT                                   24
#define   PCMD10_MASK                            0x00ff0000
#define   PCMD10_SHIFT                                   16
#define   PCMD9_MASK                             0x0000ff00
#define   PCMD9_SHIFT                                     8
#define   PCMD8_MASK                             0x000000ff
#define   PCMD8_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 pcmd8:8;
        u32 pcmd9:8;
        u32 pcmd10:8;
        u32 pcmd11:8;
    } b;
} nf_pcmd_reg10_t;

#define NF_PCMD_REG11                            0x000000a0
#define   PCMD15_MASK                            0xff000000
#define   PCMD15_SHIFT                                   24
#define   PCMD14_MASK                            0x00ff0000
#define   PCMD14_SHIFT                                   16
#define   PCMD13_MASK                            0x0000ff00
#define   PCMD13_SHIFT                                    8
#define   PCMD12_MASK                            0x000000ff
#define   PCMD12_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 pcmd12:8;
        u32 pcmd13:8;
        u32 pcmd14:8;
        u32 pcmd15:8;
    } b;
} nf_pcmd_reg11_t;

#define NF_PCMD_MP_REG00                         0x000000a4
#define   PCMD3_MP_MASK                          0xff000000
#define   PCMD3_MP_SHIFT                                 24
#define   PCMD2_MP_MASK                          0x00ff0000
#define   PCMD2_MP_SHIFT                                 16
#define   PCMD1_MP_MASK                          0x0000ff00
#define   PCMD1_MP_SHIFT                                  8
#define   PCMD0_MP_MASK                          0x000000ff
#define   PCMD0_MP_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 pcmd0_mp:8;
        u32 pcmd1_mp:8;
        u32 pcmd2_mp:8;
        u32 pcmd3_mp:8;
    } b;
} nf_pcmd_mp_reg00_t;

#define NF_PCMD_MP_REG01                         0x000000a8
#define   PCMD7_MP_MASK                          0xff000000
#define   PCMD7_MP_SHIFT                                 24
#define   PCMD6_MP_MASK                          0x00ff0000
#define   PCMD6_MP_SHIFT                                 16
#define   PCMD5_MP_MASK                          0x0000ff00
#define   PCMD5_MP_SHIFT                                  8
#define   PCMD4_MP_MASK                          0x000000ff
#define   PCMD4_MP_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 pcmd4_mp:8;
        u32 pcmd5_mp:8;
        u32 pcmd6_mp:8;
        u32 pcmd7_mp:8;
    } b;
} nf_pcmd_mp_reg01_t;

#define NF_PCMD_MP_REG10                         0x000000ac
#define   PCMD11_MP_MASK                         0xff000000
#define   PCMD11_MP_SHIFT                                24
#define   PCMD10_MP_MASK                         0x00ff0000
#define   PCMD10_MP_SHIFT                                16
#define   PCMD9_MP_MASK                          0x0000ff00
#define   PCMD9_MP_SHIFT                                  8
#define   PCMD8_MP_MASK                          0x000000ff
#define   PCMD8_MP_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 pcmd8_mp:8;
        u32 pcmd9_mp:8;
        u32 pcmd10_mp:8;
        u32 pcmd11_mp:8;
    } b;
} nf_pcmd_mp_reg10_t;

#define NF_PCMD_MP_REG11                         0x000000b0
#define   PCMD15_MP_MASK                         0xff000000
#define   PCMD15_MP_SHIFT                                24
#define   PCMD14_MP_MASK                         0x00ff0000
#define   PCMD14_MP_SHIFT                                16
#define   PCMD13_MP_MASK                         0x0000ff00
#define   PCMD13_MP_SHIFT                                 8
#define   PCMD12_MP_MASK                         0x000000ff
#define   PCMD12_MP_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 pcmd12_mp:8;
        u32 pcmd13_mp:8;
        u32 pcmd14_mp:8;
        u32 pcmd15_mp:8;
    } b;
} nf_pcmd_mp_reg11_t;

#define NF_ECMD_REG0                             0x000000b4
#define   ECMD3_MASK                             0xff000000
#define   ECMD3_SHIFT                                    24
#define   ECMD2_MASK                             0x00ff0000
#define   ECMD2_SHIFT                                    16
#define   ECMD1_MASK                             0x0000ff00
#define   ECMD1_SHIFT                                     8
#define   ECMD0_MASK                             0x000000ff
#define   ECMD0_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 ecmd0:8;
        u32 ecmd1:8;
        u32 ecmd2:8;
        u32 ecmd3:8;
    } b;
} nf_ecmd_reg0_t;

#define NF_ECMD_REG1                             0x000000b8
#define   ECMD7_MASK                             0xff000000
#define   ECMD7_SHIFT                                    24
#define   ECMD6_MASK                             0x00ff0000
#define   ECMD6_SHIFT                                    16
#define   ECMD5_MASK                             0x0000ff00
#define   ECMD5_SHIFT                                     8
#define   ECMD4_MASK                             0x000000ff
#define   ECMD4_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 ecmd4:8;
        u32 ecmd5:8;
        u32 ecmd6:8;
        u32 ecmd7:8;
    } b;
} nf_ecmd_reg1_t;

#define NF_ECMD_MP_REG0                          0x000000bc
#define   ECMD3_MP_MASK                          0xff000000
#define   ECMD3_MP_SHIFT                                 24
#define   ECMD2_MP_MASK                          0x00ff0000
#define   ECMD2_MP_SHIFT                                 16
#define   ECMD1_MP_MASK                          0x0000ff00
#define   ECMD1_MP_SHIFT                                  8
#define   ECMD0_MP_MASK                          0x000000ff
#define   ECMD0_MP_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 ecmd0_mp:8;
        u32 ecmd1_mp:8;
        u32 ecmd2_mp:8;
        u32 ecmd3_mp:8;
    } b;
} nf_ecmd_mp_reg0_t;

#define NF_ECMD_MP_REG1                          0x000000c0
#define   ECMD7_MP_MASK                          0xff000000
#define   ECMD7_MP_SHIFT                                 24
#define   ECMD6_MP_MASK                          0x00ff0000
#define   ECMD6_MP_SHIFT                                 16
#define   ECMD5_MP_MASK                          0x0000ff00
#define   ECMD5_MP_SHIFT                                  8
#define   ECMD4_MP_MASK                          0x000000ff
#define   ECMD4_MP_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 ecmd4_mp:8;
        u32 ecmd5_mp:8;
        u32 ecmd6_mp:8;
        u32 ecmd7_mp:8;
    } b;
} nf_ecmd_mp_reg1_t;

#define NF_ECMD_JDC0                             0x000000c4
#define   ECMD3_JDEC_MASK                        0xff000000
#define   ECMD3_JDEC_SHIFT                               24
#define   ECMD2_JDEC_MASK                        0x00ff0000
#define   ECMD2_JDEC_SHIFT                               16
#define   ECMD1_JDEC_MASK                        0x0000ff00
#define   ECMD1_JDEC_SHIFT                                8
#define   ECMD0_JDEC_MASK                        0x000000ff
#define   ECMD0_JDEC_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 ecmd0_jdec:8;
        u32 ecmd1_jdec:8;
        u32 ecmd2_jdec:8;
        u32 ecmd3_jdec:8;
    } b;
} nf_ecmd_jdc0_t;

#define NF_SCMD_REG0                             0x000000c8
#define   SCMD3_MASK                             0xff000000
#define   SCMD3_SHIFT                                    24
#define   SCMD2_MASK                             0x00ff0000
#define   SCMD2_SHIFT                                    16
#define   SCMD1_MASK                             0x0000ff00
#define   SCMD1_SHIFT                                     8
#define   SCMD0_MASK                             0x000000ff
#define   SCMD0_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 scmd0:8;
        u32 scmd1:8;
        u32 scmd2:8;
        u32 scmd3:8;
    } b;
} nf_scmd_reg0_t;

#define NF_SCMD_REG1                             0x000000cc
#define   SCMD7_MASK                             0xff000000
#define   SCMD7_SHIFT                                    24
#define   SCMD6_MASK                             0x00ff0000
#define   SCMD6_SHIFT                                    16
#define   SCMD5_MASK                             0x0000ff00
#define   SCMD5_SHIFT                                     8
#define   SCMD4_MASK                             0x000000ff
#define   SCMD4_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 scmd4:8;
        u32 scmd5:8;
        u32 scmd6:8;
        u32 scmd7:8;
    } b;
} nf_scmd_reg1_t;

#define NF_RSTCMD_REG0                           0x000000d0
#define   RST_CMD3_MASK                          0xff000000
#define   RST_CMD3_SHIFT                                 24
#define   RST_CMD2_MASK                          0x00ff0000
#define   RST_CMD2_SHIFT                                 16
#define   RST_CMD1_MASK                          0x0000ff00
#define   RST_CMD1_SHIFT                                  8
#define   RST_CMD0_MASK                          0x000000ff
#define   RST_CMD0_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rst_cmd0:8;
        u32 rst_cmd1:8;
        u32 rst_cmd2:8;
        u32 rst_cmd3:8;
    } b;
} nf_rstcmd_reg0_t;

#define NF_RSTCMD_REG1                           0x000000d4
#define   RST_CMD7_MASK                          0xff000000
#define   RST_CMD7_SHIFT                                 24
#define   RST_CMD6_MASK                          0x00ff0000
#define   RST_CMD6_SHIFT                                 16
#define   RST_CMD5_MASK                          0x0000ff00
#define   RST_CMD5_SHIFT                                  8
#define   RST_CMD4_MASK                          0x000000ff
#define   RST_CMD4_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rst_cmd4:8;
        u32 rst_cmd5:8;
        u32 rst_cmd6:8;
        u32 rst_cmd7:8;
    } b;
} nf_rstcmd_reg1_t;

#define NF_PRECMD_REG00                          0x000000d8
#define   PRECMD3_MASK                           0xff000000
#define   PRECMD3_SHIFT                                  24
#define   PRECMD2_MASK                           0x00ff0000
#define   PRECMD2_SHIFT                                  16
#define   PRECMD1_MASK                           0x0000ff00
#define   PRECMD1_SHIFT                                   8
#define   PRECMD0_MASK                           0x000000ff
#define   PRECMD0_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 precmd0:8;
        u32 precmd1:8;
        u32 precmd2:8;
        u32 precmd3:8;
    } b;
} nf_precmd_reg00_t;

#define NF_PRECMD_REG01                          0x000000dc
#define   PRECMD7_MASK                           0xff000000
#define   PRECMD7_SHIFT                                  24
#define   PRECMD6_MASK                           0x00ff0000
#define   PRECMD6_SHIFT                                  16
#define   PRECMD5_MASK                           0x0000ff00
#define   PRECMD5_SHIFT                                   8
#define   PRECMD4_MASK                           0x000000ff
#define   PRECMD4_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 precmd4:8;
        u32 precmd5:8;
        u32 precmd6:8;
        u32 precmd7:8;
    } b;
} nf_precmd_reg01_t;

#define NF_PRECMD_REG10                          0x000000e0
#define   PRECMD11_MASK                          0xff000000
#define   PRECMD11_SHIFT                                 24
#define   PRECMD10_MASK                          0x00ff0000
#define   PRECMD10_SHIFT                                 16
#define   PRECMD9_MASK                           0x0000ff00
#define   PRECMD9_SHIFT                                   8
#define   PRECMD8_MASK                           0x000000ff
#define   PRECMD8_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 precmd8:8;
        u32 precmd9:8;
        u32 precmd10:8;
        u32 precmd11:8;
    } b;
} nf_precmd_reg10_t;

#define NF_PRECMD_REG11                          0x000000e4
#define   PRECMD15_MASK                          0xff000000
#define   PRECMD15_SHIFT                                 24
#define   PRECMD14_MASK                          0x00ff0000
#define   PRECMD14_SHIFT                                 16
#define   PRECMD13_MASK                          0x0000ff00
#define   PRECMD13_SHIFT                                  8
#define   PRECMD12_MASK                          0x000000ff
#define   PRECMD12_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 precmd12:8;
        u32 precmd13:8;
        u32 precmd14:8;
        u32 precmd15:8;
    } b;
} nf_precmd_reg11_t;

#define NF_PRECMD_REG20                          0x000000e8
#define   PRECMD19_MASK                          0xff000000
#define   PRECMD19_SHIFT                                 24
#define   PRECMD18_MASK                          0x00ff0000
#define   PRECMD18_SHIFT                                 16
#define   PRECMD17_MASK                          0x0000ff00
#define   PRECMD17_SHIFT                                  8
#define   PRECMD16_MASK                          0x000000ff
#define   PRECMD16_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 precmd16:8;
        u32 precmd17:8;
        u32 precmd18:8;
        u32 precmd19:8;
    } b;
} nf_precmd_reg20_t;

#define NF_PRECMD_REG21                          0x000000ec
#define   PRECMD23_MASK                          0xff000000
#define   PRECMD23_SHIFT                                 24
#define   PRECMD22_MASK                          0x00ff0000
#define   PRECMD22_SHIFT                                 16
#define   PRECMD21_MASK                          0x0000ff00
#define   PRECMD21_SHIFT                                  8
#define   PRECMD20_MASK                          0x000000ff
#define   PRECMD20_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 precmd20:8;
        u32 precmd21:8;
        u32 precmd22:8;
        u32 precmd23:8;
    } b;
} nf_precmd_reg21_t;

#define NF_WCNT_REG0                             0x000000f0
#define   NF_DIV2_MASK                           0xc0000000
#define   NF_DIV2_SHIFT                                  30
#define   NF_WCNT22_MASK                         0x3f000000
#define   NF_WCNT22_SHIFT                                24
#define   NF_WCNT21_MASK                         0x00ff0000
#define   NF_WCNT21_SHIFT                                16
#define   NF_DIV1_MASK                           0x0000c000
#define   NF_DIV1_SHIFT                                  14
#define   NF_WCNT12_MASK                         0x00003f00
#define   NF_WCNT12_SHIFT                                 8
#define   NF_WCNT11_MASK                         0x000000ff
#define   NF_WCNT11_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 nf_wcnt11:8;
        u32 nf_wcnt12:6;
        u32 nf_div1:2;
        u32 nf_wcnt21:8;
        u32 nf_wcnt22:6;
        u32 nf_div2:2;
    } b;
} nf_wcnt_reg0_t;

#define NF_WCNT_REG1                             0x000000f4
#define   NF_DIV4_MASK                           0xc0000000
#define   NF_DIV4_SHIFT                                  30
#define   NF_WCNT42_MASK                         0x3f000000
#define   NF_WCNT42_SHIFT                                24
#define   NF_WCNT41_MASK                         0x00ff0000
#define   NF_WCNT41_SHIFT                                16
#define   NF_DIV3_MASK                           0x0000c000
#define   NF_DIV3_SHIFT                                  14
#define   NF_WCNT32_MASK                         0x00003f00
#define   NF_WCNT32_SHIFT                                 8
#define   NF_WCNT31_MASK                         0x000000ff
#define   NF_WCNT31_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 nf_wcnt31:8;
        u32 nf_wcnt32:6;
        u32 nf_div3:2;
        u32 nf_wcnt41:8;
        u32 nf_wcnt42:6;
        u32 nf_div4:2;
    } b;
} nf_wcnt_reg1_t;

#define NF_WCNT_REG2                             0x000000f8
#define   NF_DIV6_MASK                           0xc0000000
#define   NF_DIV6_SHIFT                                  30
#define   NF_WCNT62_MASK                         0x3f000000
#define   NF_WCNT62_SHIFT                                24
#define   NF_WCNT61_MASK                         0x00ff0000
#define   NF_WCNT61_SHIFT                                16
#define   NF_DIV5_MASK                           0x0000c000
#define   NF_DIV5_SHIFT                                  14
#define   NF_WCNT52_MASK                         0x00003f00
#define   NF_WCNT52_SHIFT                                 8
#define   NF_WCNT51_MASK                         0x000000ff
#define   NF_WCNT51_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 nf_wcnt51:8;
        u32 nf_wcnt52:6;
        u32 nf_div5:2;
        u32 nf_wcnt61:8;
        u32 nf_wcnt62:6;
        u32 nf_div6:2;
    } b;
} nf_wcnt_reg2_t;

#define NF_WCNT_REG3                             0x000000fc
#define   NF_DIV8_MASK                           0xc0000000
#define   NF_DIV8_SHIFT                                  30
#define   NF_WCNT82_MASK                         0x3f000000
#define   NF_WCNT82_SHIFT                                24
#define   NF_WCNT81_MASK                         0x00ff0000
#define   NF_WCNT81_SHIFT                                16
#define   NF_DIV7_MASK                           0x0000c000
#define   NF_DIV7_SHIFT                                  14
#define   NF_WCNT72_MASK                         0x00003f00
#define   NF_WCNT72_SHIFT                                 8
#define   NF_WCNT71_MASK                         0x000000ff
#define   NF_WCNT71_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 nf_wcnt71:8;
        u32 nf_wcnt72:6;
        u32 nf_div7:2;
        u32 nf_wcnt81:8;
        u32 nf_wcnt82:6;
        u32 nf_div8:2;
    } b;
} nf_wcnt_reg3_t;

#define NF_PCNT_REG0                             0x00000100
#define   NF_PDIV2_MASK                          0xc0000000
#define   NF_PDIV2_SHIFT                                 30
#define   NF_PCNT22_MASK                         0x3f000000
#define   NF_PCNT22_SHIFT                                24
#define   NF_PCNT21_MASK                         0x00ff0000
#define   NF_PCNT21_SHIFT                                16
#define   NF_PDIV1_MASK                          0x0000c000
#define   NF_PDIV1_SHIFT                                 14
#define   NF_PCNT12_MASK                         0x00003f00
#define   NF_PCNT12_SHIFT                                 8
#define   NF_PCNT11_MASK                         0x000000ff
#define   NF_PCNT11_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 nf_pcnt11:8;
        u32 nf_pcnt12:6;
        u32 nf_pdiv1:2;
        u32 nf_pcnt21:8;
        u32 nf_pcnt22:6;
        u32 nf_pdiv2:2;
    } b;
} nf_pcnt_reg0_t;

#define NF_PCNT_REG1                             0x00000104
#define   NF_PDIV4_MASK                          0xc0000000
#define   NF_PDIV4_SHIFT                                 30
#define   NF_PCNT42_MASK                         0x3f000000
#define   NF_PCNT42_SHIFT                                24
#define   NF_PCNT41_MASK                         0x00ff0000
#define   NF_PCNT41_SHIFT                                16
#define   NF_PDIV3_MASK                          0x0000c000
#define   NF_PDIV3_SHIFT                                 14
#define   NF_PCNT32_MASK                         0x00003f00
#define   NF_PCNT32_SHIFT                                 8
#define   NF_PCNT31_MASK                         0x000000ff
#define   NF_PCNT31_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 nf_pcnt31:8;
        u32 nf_pcnt32:6;
        u32 nf_pdiv3:2;
        u32 nf_pcnt41:8;
        u32 nf_pcnt42:6;
        u32 nf_pdiv4:2;
    } b;
} nf_pcnt_reg1_t;

#define NF_FAIL_REG0                             0x00000108
#define   FAIL_BIT_CHK07_MASK                    0xf0000000
#define   FAIL_BIT_CHK07_SHIFT                           28
#define   FAIL_BIT_CHK06_MASK                    0x0f000000
#define   FAIL_BIT_CHK06_SHIFT                           24
#define   FAIL_BIT_CHK05_MASK                    0x00f00000
#define   FAIL_BIT_CHK05_SHIFT                           20
#define   FAIL_BIT_CHK04_MASK                    0x000f0000
#define   FAIL_BIT_CHK04_SHIFT                           16
#define   FAIL_BIT_CHK03_MASK                    0x0000f000
#define   FAIL_BIT_CHK03_SHIFT                           12
#define   FAIL_BIT_CHK02_MASK                    0x00000f00
#define   FAIL_BIT_CHK02_SHIFT                            8
#define   FAIL_BIT_CHK01_MASK                    0x000000f0
#define   FAIL_BIT_CHK01_SHIFT                            4
#define   FAIL_BIT_CHK0_MASK                     0x0000000f
#define   FAIL_BIT_CHK0_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk0:4;
        u32 fail_bit_chk01:4;
        u32 fail_bit_chk02:4;
        u32 fail_bit_chk03:4;
        u32 fail_bit_chk04:4;
        u32 fail_bit_chk05:4;
        u32 fail_bit_chk06:4;
        u32 fail_bit_chk07:4;
    } b;
} nf_fail_reg0_t;

#define NF_FAIL_REG1                             0x0000010c
#define   FAIL_BIT_CHK17_MASK                    0xf0000000
#define   FAIL_BIT_CHK17_SHIFT                           28
#define   FAIL_BIT_CHK16_MASK                    0x0f000000
#define   FAIL_BIT_CHK16_SHIFT                           24
#define   FAIL_BIT_CHK15_MASK                    0x00f00000
#define   FAIL_BIT_CHK15_SHIFT                           20
#define   FAIL_BIT_CHK14_MASK                    0x000f0000
#define   FAIL_BIT_CHK14_SHIFT                           16
#define   FAIL_BIT_CHK13_MASK                    0x0000f000
#define   FAIL_BIT_CHK13_SHIFT                           12
#define   FAIL_BIT_CHK12_MASK                    0x00000f00
#define   FAIL_BIT_CHK12_SHIFT                            8
#define   FAIL_BIT_CHK11_MASK                    0x000000f0
#define   FAIL_BIT_CHK11_SHIFT                            4
#define   FAIL_BIT_CHK1_MASK                     0x0000000f
#define   FAIL_BIT_CHK1_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk1:4;
        u32 fail_bit_chk11:4;
        u32 fail_bit_chk12:4;
        u32 fail_bit_chk13:4;
        u32 fail_bit_chk14:4;
        u32 fail_bit_chk15:4;
        u32 fail_bit_chk16:4;
        u32 fail_bit_chk17:4;
    } b;
} nf_fail_reg1_t;

#define NF_FAIL_REG2                             0x00000110
#define   FAIL_BIT_CHK27_MASK                    0xf0000000
#define   FAIL_BIT_CHK27_SHIFT                           28
#define   FAIL_BIT_CHK26_MASK                    0x0f000000
#define   FAIL_BIT_CHK26_SHIFT                           24
#define   FAIL_BIT_CHK25_MASK                    0x00f00000
#define   FAIL_BIT_CHK25_SHIFT                           20
#define   FAIL_BIT_CHK24_MASK                    0x000f0000
#define   FAIL_BIT_CHK24_SHIFT                           16
#define   FAIL_BIT_CHK23_MASK                    0x0000f000
#define   FAIL_BIT_CHK23_SHIFT                           12
#define   FAIL_BIT_CHK22_MASK                    0x00000f00
#define   FAIL_BIT_CHK22_SHIFT                            8
#define   FAIL_BIT_CHK21_MASK                    0x000000f0
#define   FAIL_BIT_CHK21_SHIFT                            4
#define   FAIL_BIT_CHK2_MASK                     0x0000000f
#define   FAIL_BIT_CHK2_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk2:4;
        u32 fail_bit_chk21:4;
        u32 fail_bit_chk22:4;
        u32 fail_bit_chk23:4;
        u32 fail_bit_chk24:4;
        u32 fail_bit_chk25:4;
        u32 fail_bit_chk26:4;
        u32 fail_bit_chk27:4;
    } b;
} nf_fail_reg2_t;

#define NF_FAIL_REG3                             0x00000114
#define   FAIL_BIT_CHK37_MASK                    0xf0000000
#define   FAIL_BIT_CHK37_SHIFT                           28
#define   FAIL_BIT_CHK36_MASK                    0x0f000000
#define   FAIL_BIT_CHK36_SHIFT                           24
#define   FAIL_BIT_CHK35_MASK                    0x00f00000
#define   FAIL_BIT_CHK35_SHIFT                           20
#define   FAIL_BIT_CHK34_MASK                    0x000f0000
#define   FAIL_BIT_CHK34_SHIFT                           16
#define   FAIL_BIT_CHK33_MASK                    0x0000f000
#define   FAIL_BIT_CHK33_SHIFT                           12
#define   FAIL_BIT_CHK32_MASK                    0x00000f00
#define   FAIL_BIT_CHK32_SHIFT                            8
#define   FAIL_BIT_CHK31_MASK                    0x000000f0
#define   FAIL_BIT_CHK31_SHIFT                            4
#define   FAIL_BIT_CHK3_MASK                     0x0000000f
#define   FAIL_BIT_CHK3_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk3:4;
        u32 fail_bit_chk31:4;
        u32 fail_bit_chk32:4;
        u32 fail_bit_chk33:4;
        u32 fail_bit_chk34:4;
        u32 fail_bit_chk35:4;
        u32 fail_bit_chk36:4;
        u32 fail_bit_chk37:4;
    } b;
} nf_fail_reg3_t;

#define NF_FAIL_REG4                             0x00000118
#define   FAIL_BIT_CHK47_MASK                    0xf0000000
#define   FAIL_BIT_CHK47_SHIFT                           28
#define   FAIL_BIT_CHK46_MASK                    0x0f000000
#define   FAIL_BIT_CHK46_SHIFT                           24
#define   FAIL_BIT_CHK45_MASK                    0x00f00000
#define   FAIL_BIT_CHK45_SHIFT                           20
#define   FAIL_BIT_CHK44_MASK                    0x000f0000
#define   FAIL_BIT_CHK44_SHIFT                           16
#define   FAIL_BIT_CHK43_MASK                    0x0000f000
#define   FAIL_BIT_CHK43_SHIFT                           12
#define   FAIL_BIT_CHK42_MASK                    0x00000f00
#define   FAIL_BIT_CHK42_SHIFT                            8
#define   FAIL_BIT_CHK41_MASK                    0x000000f0
#define   FAIL_BIT_CHK41_SHIFT                            4
#define   FAIL_BIT_CHK4_MASK                     0x0000000f
#define   FAIL_BIT_CHK4_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk4:4;
        u32 fail_bit_chk41:4;
        u32 fail_bit_chk42:4;
        u32 fail_bit_chk43:4;
        u32 fail_bit_chk44:4;
        u32 fail_bit_chk45:4;
        u32 fail_bit_chk46:4;
        u32 fail_bit_chk47:4;
    } b;
} nf_fail_reg4_t;

#define NF_RDY_REG0                              0x0000011c
#define   RDY_BIT_CHK7_MASK                      0xf0000000
#define   RDY_BIT_CHK7_SHIFT                             28
#define   RDY_BIT_CHK6_MASK                      0x0f000000
#define   RDY_BIT_CHK6_SHIFT                             24
#define   RDY_BIT_CHK5_MASK                      0x00f00000
#define   RDY_BIT_CHK5_SHIFT                             20
#define   RDY_BIT_CHK4_MASK                      0x000f0000
#define   RDY_BIT_CHK4_SHIFT                             16
#define   RDY_BIT_CHK3_MASK                      0x0000f000
#define   RDY_BIT_CHK3_SHIFT                             12
#define   RDY_BIT_CHK2_MASK                      0x00000f00
#define   RDY_BIT_CHK2_SHIFT                              8
#define   RDY_BIT_CHK1_MASK                      0x000000f0
#define   RDY_BIT_CHK1_SHIFT                              4
#define   RDY_BIT_CHK0_MASK                      0x0000000f
#define   RDY_BIT_CHK0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 rdy_bit_chk0:4;
        u32 rdy_bit_chk1:4;
        u32 rdy_bit_chk2:4;
        u32 rdy_bit_chk3:4;
        u32 rdy_bit_chk4:4;
        u32 rdy_bit_chk5:4;
        u32 rdy_bit_chk6:4;
        u32 rdy_bit_chk7:4;
    } b;
} nf_rdy_reg0_t;

#define NF_LUN_CTRL_REG0                         0x00000120
#define   LUN_ADDR_SEL_CH7_MASK                  0xf0000000
#define   LUN_ADDR_SEL_CH7_SHIFT                         28
#define   LUN_ADDR_SEL_CH6_MASK                  0x0f000000
#define   LUN_ADDR_SEL_CH6_SHIFT                         24
#define   LUN_ADDR_SEL_CH5_MASK                  0x00f00000
#define   LUN_ADDR_SEL_CH5_SHIFT                         20
#define   LUN_ADDR_SEL_CH4_MASK                  0x000f0000
#define   LUN_ADDR_SEL_CH4_SHIFT                         16
#define   LUN_ADDR_SEL_CH3_MASK                  0x0000f000
#define   LUN_ADDR_SEL_CH3_SHIFT                         12
#define   LUN_ADDR_SEL_CH2_MASK                  0x00000f00
#define   LUN_ADDR_SEL_CH2_SHIFT                          8
#define   LUN_ADDR_SEL_CH1_MASK                  0x000000f0
#define   LUN_ADDR_SEL_CH1_SHIFT                          4
#define   LUN_ADDR_SEL_CH0_MASK                  0x0000000f
#define   LUN_ADDR_SEL_CH0_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 lun_addr_sel_ch0:4;
        u32 lun_addr_sel_ch1:4;
        u32 lun_addr_sel_ch2:4;
        u32 lun_addr_sel_ch3:4;
        u32 lun_addr_sel_ch4:4;
        u32 lun_addr_sel_ch5:4;
        u32 lun_addr_sel_ch6:4;
        u32 lun_addr_sel_ch7:4;
    } b;
} nf_lun_ctrl_reg0_t;

#define NF_PDWN_CTRL_REG0                        0x00000124
#define   NF_TSB_MP_SCMD_MASK                    0x40000000
#define   NF_TSB_MP_SCMD_SHIFT                           30
#define   NF_SCMD_ENH_EN_MASK                    0x20000000
#define   NF_SCMD_ENH_EN_SHIFT                           29
#define   NF_PWCNT_ENH_EN_MASK                   0x10000000
#define   NF_PWCNT_ENH_EN_SHIFT                          28
#define   NF_MLUN_SEL_EN_MASK                    0x04000000
#define   NF_MLUN_SEL_EN_SHIFT                           26
#define   NF_MLUN_MODE_MASK                      0x02000000
#define   NF_MLUN_MODE_SHIFT                             25
#define   NF_Q_RDY_SEL_MASK                      0x01000000
#define   NF_Q_RDY_SEL_SHIFT                             24
#define   NF_ARD_FUSE_MODE_MASK                  0x00800000
#define   NF_ARD_FUSE_MODE_SHIFT                         23
#define   NF_PROGXFER_HPRI_EN_MASK               0x00400000
#define   NF_PROGXFER_HPRI_EN_SHIFT                      22
#define   NF_RDY_BIT_WDOG_EN_MASK                0x00200000
#define   NF_RDY_BIT_WDOG_EN_SHIFT                       21
#define   NF_MP_POLL_ON_FAIL_MASK                0x00100000
#define   NF_MP_POLL_ON_FAIL_SHIFT                       20
#define   NF_FUSE_MODE_MASK                      0x00080000
#define   NF_FUSE_MODE_SHIFT                             19
#define   NF_RDST_MP_POLL_DIS_MASK               0x00040000
#define   NF_RDST_MP_POLL_DIS_SHIFT                      18
#define   NF_PROG_EXT_EN_MASK                    0x00020000
#define   NF_PROG_EXT_EN_SHIFT                           17
#define   NF_VIQ_MODE_MASK                       0x00010000
#define   NF_VIQ_MODE_SHIFT                              16
#define   PD_CH_CTRL_MASK                        0x0000ffff
#define   PD_CH_CTRL_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 pd_ch_ctrl:16;
        u32 nf_viq_mode:1;
        u32 nf_prog_ext_en:1;
        u32 nf_rdst_mp_poll_dis:1;
        u32 nf_fuse_mode:1;
        u32 nf_mp_poll_on_fail:1;
        u32 nf_rdy_bit_wdog_en:1;
        u32 nf_progxfer_hpri_en:1;
        u32 nf_ard_fuse_mode:1;
        u32 nf_q_rdy_sel:1;
        u32 nf_mlun_mode:1;
        u32 nf_mlun_sel_en:1;
        u32 rsvd_27:1;
        u32 nf_pwcnt_enh_en:1;
        u32 nf_scmd_enh_en:1;
        u32 nf_tsb_mp_scmd:1;
        u32 rsvd_31:1;
    } b;
} nf_pdwn_ctrl_reg0_t;

#define NF_DDR_DATA_DLY_CTRL_REG0                0x00000128
#define   NF_SET_FEAT_MODE_FIX_MASK              0x10000000
#define   NF_SET_FEAT_MODE_FIX_SHIFT                     28
#define   NF_VOL_CHK_DIS_MASK                    0x08000000
#define   NF_VOL_CHK_DIS_SHIFT                           27
#define   NF_SET_FEAT_MODE_MASK                  0x04000000
#define   NF_SET_FEAT_MODE_SHIFT                         26
#define   NF_CE_REMAP_EN_MASK                    0x02000000
#define   NF_CE_REMAP_EN_SHIFT                           25
#define   NF_RDBUF_CMD_SEL_MASK                  0x01000000
#define   NF_RDBUF_CMD_SEL_SHIFT                         24
#define   NF_RDBUF_MODE_MASK                     0x00c00000
#define   NF_RDBUF_MODE_SHIFT                            22
#define   NF_PAD_OUT_REG_CTRL_MASK               0x00080000
#define   NF_PAD_OUT_REG_CTRL_SHIFT                      19
#define   NF_PAD_OUT_VAL_MASK                    0x00040000
#define   NF_PAD_OUT_VAL_SHIFT                           18
#define   NF_COL_MSK_SEL_MASK                    0x00020000
#define   NF_COL_MSK_SEL_SHIFT                           17
#define   NF_ERR_MSK_SEL_MASK                    0x00010000
#define   NF_ERR_MSK_SEL_SHIFT                           16
#define   NF_RE_RD_PTR_CTRL_MASK                 0x0000ff00
#define   NF_RE_RD_PTR_CTRL_SHIFT                         8
#define   NF_DDR_DAT_DLY_CTRL_MASK               0x00000007
#define   NF_DDR_DAT_DLY_CTRL_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 nf_ddr_dat_dly_ctrl:3;
        u32 rsvd_3:5;
        u32 nf_re_rd_ptr_ctrl:8;
        u32 nf_err_msk_sel:1;
        u32 nf_col_msk_sel:1;
        u32 nf_pad_out_val:1;
        u32 nf_pad_out_reg_ctrl:1;
        u32 rsvd_20:2;
        u32 nf_rdbuf_mode:2;
        u32 nf_rdbuf_cmd_sel:1;
        u32 nf_ce_remap_en:1;
        u32 nf_set_feat_mode:1;
        u32 nf_vol_chk_dis:1;
        u32 nf_set_feat_mode_fix:1;
        u32 rsvd_29:3;
    } b;
} nf_ddr_data_dly_ctrl_reg0_t;

#define NF_CE_REMAP_REG0                         0x0000012c
#define   NF_CE7_MAP_CH0_MASK                    0xf0000000
#define   NF_CE7_MAP_CH0_SHIFT                           28
#define   NF_CE6_MAP_CH0_MASK                    0x0f000000
#define   NF_CE6_MAP_CH0_SHIFT                           24
#define   NF_CE5_MAP_CH0_MASK                    0x00f00000
#define   NF_CE5_MAP_CH0_SHIFT                           20
#define   NF_CE4_MAP_CH0_MASK                    0x000f0000
#define   NF_CE4_MAP_CH0_SHIFT                           16
#define   NF_CE3_MAP_CH0_MASK                    0x0000f000
#define   NF_CE3_MAP_CH0_SHIFT                           12
#define   NF_CE2_MAP_CH0_MASK                    0x00000f00
#define   NF_CE2_MAP_CH0_SHIFT                            8
#define   NF_CE1_MAP_CH0_MASK                    0x000000f0
#define   NF_CE1_MAP_CH0_SHIFT                            4
#define   NF_CE0_MAP_CH0_MASK                    0x0000000f
#define   NF_CE0_MAP_CH0_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 nf_ce0_map_ch0:4;
        u32 nf_ce1_map_ch0:4;
        u32 nf_ce2_map_ch0:4;
        u32 nf_ce3_map_ch0:4;
        u32 nf_ce4_map_ch0:4;
        u32 nf_ce5_map_ch0:4;
        u32 nf_ce6_map_ch0:4;
        u32 nf_ce7_map_ch0:4;
    } b;
} nf_ce_remap_reg0_t;

#define NF_CE_REMAP_REG1                         0x00000130
#define   NF_CE7_MAP_CH1_MASK                    0xf0000000
#define   NF_CE7_MAP_CH1_SHIFT                           28
#define   NF_CE6_MAP_CH1_MASK                    0x0f000000
#define   NF_CE6_MAP_CH1_SHIFT                           24
#define   NF_CE5_MAP_CH1_MASK                    0x00f00000
#define   NF_CE5_MAP_CH1_SHIFT                           20
#define   NF_CE4_MAP_CH1_MASK                    0x000f0000
#define   NF_CE4_MAP_CH1_SHIFT                           16
#define   NF_CE3_MAP_CH1_MASK                    0x0000f000
#define   NF_CE3_MAP_CH1_SHIFT                           12
#define   NF_CE2_MAP_CH1_MASK                    0x00000f00
#define   NF_CE2_MAP_CH1_SHIFT                            8
#define   NF_CE1_MAP_CH1_MASK                    0x000000f0
#define   NF_CE1_MAP_CH1_SHIFT                            4
#define   NF_CE0_MAP_CH1_MASK                    0x0000000f
#define   NF_CE0_MAP_CH1_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 nf_ce0_map_ch1:4;
        u32 nf_ce1_map_ch1:4;
        u32 nf_ce2_map_ch1:4;
        u32 nf_ce3_map_ch1:4;
        u32 nf_ce4_map_ch1:4;
        u32 nf_ce5_map_ch1:4;
        u32 nf_ce6_map_ch1:4;
        u32 nf_ce7_map_ch1:4;
    } b;
} nf_ce_remap_reg1_t;

#define NF_CE_REMAP_REG2                         0x00000134
#define   NF_CE7_MAP_CH2_MASK                    0xf0000000
#define   NF_CE7_MAP_CH2_SHIFT                           28
#define   NF_CE6_MAP_CH2_MASK                    0x0f000000
#define   NF_CE6_MAP_CH2_SHIFT                           24
#define   NF_CE5_MAP_CH2_MASK                    0x00f00000
#define   NF_CE5_MAP_CH2_SHIFT                           20
#define   NF_CE4_MAP_CH2_MASK                    0x000f0000
#define   NF_CE4_MAP_CH2_SHIFT                           16
#define   NF_CE3_MAP_CH2_MASK                    0x0000f000
#define   NF_CE3_MAP_CH2_SHIFT                           12
#define   NF_CE2_MAP_CH2_MASK                    0x00000f00
#define   NF_CE2_MAP_CH2_SHIFT                            8
#define   NF_CE1_MAP_CH2_MASK                    0x000000f0
#define   NF_CE1_MAP_CH2_SHIFT                            4
#define   NF_CE0_MAP_CH2_MASK                    0x0000000f
#define   NF_CE0_MAP_CH2_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 nf_ce0_map_ch2:4;
        u32 nf_ce1_map_ch2:4;
        u32 nf_ce2_map_ch2:4;
        u32 nf_ce3_map_ch2:4;
        u32 nf_ce4_map_ch2:4;
        u32 nf_ce5_map_ch2:4;
        u32 nf_ce6_map_ch2:4;
        u32 nf_ce7_map_ch2:4;
    } b;
} nf_ce_remap_reg2_t;

#define NF_CE_REMAP_REG3                         0x00000138
#define   NF_CE7_MAP_CH3_MASK                    0xf0000000
#define   NF_CE7_MAP_CH3_SHIFT                           28
#define   NF_CE6_MAP_CH3_MASK                    0x0f000000
#define   NF_CE6_MAP_CH3_SHIFT                           24
#define   NF_CE5_MAP_CH3_MASK                    0x00f00000
#define   NF_CE5_MAP_CH3_SHIFT                           20
#define   NF_CE4_MAP_CH3_MASK                    0x000f0000
#define   NF_CE4_MAP_CH3_SHIFT                           16
#define   NF_CE3_MAP_CH3_MASK                    0x0000f000
#define   NF_CE3_MAP_CH3_SHIFT                           12
#define   NF_CE2_MAP_CH3_MASK                    0x00000f00
#define   NF_CE2_MAP_CH3_SHIFT                            8
#define   NF_CE1_MAP_CH3_MASK                    0x000000f0
#define   NF_CE1_MAP_CH3_SHIFT                            4
#define   NF_CE0_MAP_CH3_MASK                    0x0000000f
#define   NF_CE0_MAP_CH3_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 nf_ce0_map_ch3:4;
        u32 nf_ce1_map_ch3:4;
        u32 nf_ce2_map_ch3:4;
        u32 nf_ce3_map_ch3:4;
        u32 nf_ce4_map_ch3:4;
        u32 nf_ce5_map_ch3:4;
        u32 nf_ce6_map_ch3:4;
        u32 nf_ce7_map_ch3:4;
    } b;
} nf_ce_remap_reg3_t;

#define NF_CE_REMAP_REG4                         0x0000013c
#define   NF_CE7_MAP_CH4_MASK                    0xf0000000
#define   NF_CE7_MAP_CH4_SHIFT                           28
#define   NF_CE6_MAP_CH4_MASK                    0x0f000000
#define   NF_CE6_MAP_CH4_SHIFT                           24
#define   NF_CE5_MAP_CH4_MASK                    0x00f00000
#define   NF_CE5_MAP_CH4_SHIFT                           20
#define   NF_CE4_MAP_CH4_MASK                    0x000f0000
#define   NF_CE4_MAP_CH4_SHIFT                           16
#define   NF_CE3_MAP_CH4_MASK                    0x0000f000
#define   NF_CE3_MAP_CH4_SHIFT                           12
#define   NF_CE2_MAP_CH4_MASK                    0x00000f00
#define   NF_CE2_MAP_CH4_SHIFT                            8
#define   NF_CE1_MAP_CH4_MASK                    0x000000f0
#define   NF_CE1_MAP_CH4_SHIFT                            4
#define   NF_CE0_MAP_CH4_MASK                    0x0000000f
#define   NF_CE0_MAP_CH4_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 nf_ce0_map_ch4:4;
        u32 nf_ce1_map_ch4:4;
        u32 nf_ce2_map_ch4:4;
        u32 nf_ce3_map_ch4:4;
        u32 nf_ce4_map_ch4:4;
        u32 nf_ce5_map_ch4:4;
        u32 nf_ce6_map_ch4:4;
        u32 nf_ce7_map_ch4:4;
    } b;
} nf_ce_remap_reg4_t;

#define NF_CE_REMAP_REG5                         0x00000140
#define   NF_CE7_MAP_CH5_MASK                    0xf0000000
#define   NF_CE7_MAP_CH5_SHIFT                           28
#define   NF_CE6_MAP_CH5_MASK                    0x0f000000
#define   NF_CE6_MAP_CH5_SHIFT                           24
#define   NF_CE5_MAP_CH5_MASK                    0x00f00000
#define   NF_CE5_MAP_CH5_SHIFT                           20
#define   NF_CE4_MAP_CH5_MASK                    0x000f0000
#define   NF_CE4_MAP_CH5_SHIFT                           16
#define   NF_CE3_MAP_CH5_MASK                    0x0000f000
#define   NF_CE3_MAP_CH5_SHIFT                           12
#define   NF_CE2_MAP_CH5_MASK                    0x00000f00
#define   NF_CE2_MAP_CH5_SHIFT                            8
#define   NF_CE1_MAP_CH5_MASK                    0x000000f0
#define   NF_CE1_MAP_CH5_SHIFT                            4
#define   NF_CE0_MAP_CH5_MASK                    0x0000000f
#define   NF_CE0_MAP_CH5_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 nf_ce0_map_ch5:4;
        u32 nf_ce1_map_ch5:4;
        u32 nf_ce2_map_ch5:4;
        u32 nf_ce3_map_ch5:4;
        u32 nf_ce4_map_ch5:4;
        u32 nf_ce5_map_ch5:4;
        u32 nf_ce6_map_ch5:4;
        u32 nf_ce7_map_ch5:4;
    } b;
} nf_ce_remap_reg5_t;

#define NF_CE_REMAP_REG6                         0x00000144
#define   NF_CE7_MAP_CH6_MASK                    0xf0000000
#define   NF_CE7_MAP_CH6_SHIFT                           28
#define   NF_CE6_MAP_CH6_MASK                    0x0f000000
#define   NF_CE6_MAP_CH6_SHIFT                           24
#define   NF_CE5_MAP_CH6_MASK                    0x00f00000
#define   NF_CE5_MAP_CH6_SHIFT                           20
#define   NF_CE4_MAP_CH6_MASK                    0x000f0000
#define   NF_CE4_MAP_CH6_SHIFT                           16
#define   NF_CE3_MAP_CH6_MASK                    0x0000f000
#define   NF_CE3_MAP_CH6_SHIFT                           12
#define   NF_CE2_MAP_CH6_MASK                    0x00000f00
#define   NF_CE2_MAP_CH6_SHIFT                            8
#define   NF_CE1_MAP_CH6_MASK                    0x000000f0
#define   NF_CE1_MAP_CH6_SHIFT                            4
#define   NF_CE0_MAP_CH6_MASK                    0x0000000f
#define   NF_CE0_MAP_CH6_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 nf_ce0_map_ch6:4;
        u32 nf_ce1_map_ch6:4;
        u32 nf_ce2_map_ch6:4;
        u32 nf_ce3_map_ch6:4;
        u32 nf_ce4_map_ch6:4;
        u32 nf_ce5_map_ch6:4;
        u32 nf_ce6_map_ch6:4;
        u32 nf_ce7_map_ch6:4;
    } b;
} nf_ce_remap_reg6_t;

#define NF_CE_REMAP_REG7                         0x00000148
#define   NF_CE7_MAP_CH7_MASK                    0xf0000000
#define   NF_CE7_MAP_CH7_SHIFT                           28
#define   NF_CE6_MAP_CH7_MASK                    0x0f000000
#define   NF_CE6_MAP_CH7_SHIFT                           24
#define   NF_CE5_MAP_CH7_MASK                    0x00f00000
#define   NF_CE5_MAP_CH7_SHIFT                           20
#define   NF_CE4_MAP_CH7_MASK                    0x000f0000
#define   NF_CE4_MAP_CH7_SHIFT                           16
#define   NF_CE3_MAP_CH7_MASK                    0x0000f000
#define   NF_CE3_MAP_CH7_SHIFT                           12
#define   NF_CE2_MAP_CH7_MASK                    0x00000f00
#define   NF_CE2_MAP_CH7_SHIFT                            8
#define   NF_CE1_MAP_CH7_MASK                    0x000000f0
#define   NF_CE1_MAP_CH7_SHIFT                            4
#define   NF_CE0_MAP_CH7_MASK                    0x0000000f
#define   NF_CE0_MAP_CH7_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 nf_ce0_map_ch7:4;
        u32 nf_ce1_map_ch7:4;
        u32 nf_ce2_map_ch7:4;
        u32 nf_ce3_map_ch7:4;
        u32 nf_ce4_map_ch7:4;
        u32 nf_ce5_map_ch7:4;
        u32 nf_ce6_map_ch7:4;
        u32 nf_ce7_map_ch7:4;
    } b;
} nf_ce_remap_reg7_t;

#define NF_PWDOG_TIMER_REG0                      0x00000170
#define   NF_PROG_WDOG_TIMER_MASK                0xffffffff
#define   NF_PROG_WDOG_TIMER_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nf_prog_wdog_timer:32;
    } b;
} nf_pwdog_timer_reg0_t;

#define NF_EWDOG_TIMER_REG0                      0x00000174
#define   NF_ERZE_WDOG_TIMER_MASK                0xffffffff
#define   NF_ERZE_WDOG_TIMER_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nf_erze_wdog_timer:32;
    } b;
} nf_ewdog_timer_reg0_t;

#define NF_FORCE_ND_ERR_REG0                     0x00000178
#define   NF_FORCE_ND_ERR_MASK                   0x000000ff
#define   NF_FORCE_ND_ERR_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 nf_force_nd_err:8;
        u32 rsvd_8:24;
    } b;
} nf_force_nd_err_reg0_t;

#define NF_FAIL_REG5                             0x00000180
#define   FAIL_BIT_CHK57_MASK                    0xf0000000
#define   FAIL_BIT_CHK57_SHIFT                           28
#define   FAIL_BIT_CHK56_MASK                    0x0f000000
#define   FAIL_BIT_CHK56_SHIFT                           24
#define   FAIL_BIT_CHK55_MASK                    0x00f00000
#define   FAIL_BIT_CHK55_SHIFT                           20
#define   FAIL_BIT_CHK54_MASK                    0x000f0000
#define   FAIL_BIT_CHK54_SHIFT                           16
#define   FAIL_BIT_CHK53_MASK                    0x0000f000
#define   FAIL_BIT_CHK53_SHIFT                           12
#define   FAIL_BIT_CHK52_MASK                    0x00000f00
#define   FAIL_BIT_CHK52_SHIFT                            8
#define   FAIL_BIT_CHK51_MASK                    0x000000f0
#define   FAIL_BIT_CHK51_SHIFT                            4
#define   FAIL_BIT_CHK5_MASK                     0x0000000f
#define   FAIL_BIT_CHK5_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk5:4;
        u32 fail_bit_chk51:4;
        u32 fail_bit_chk52:4;
        u32 fail_bit_chk53:4;
        u32 fail_bit_chk54:4;
        u32 fail_bit_chk55:4;
        u32 fail_bit_chk56:4;
        u32 fail_bit_chk57:4;
    } b;
} nf_fail_reg5_t;

#define NF_FAIL_REG6                             0x00000184
#define   FAIL_BIT_CHK67_MASK                    0xf0000000
#define   FAIL_BIT_CHK67_SHIFT                           28
#define   FAIL_BIT_CHK66_MASK                    0x0f000000
#define   FAIL_BIT_CHK66_SHIFT                           24
#define   FAIL_BIT_CHK65_MASK                    0x00f00000
#define   FAIL_BIT_CHK65_SHIFT                           20
#define   FAIL_BIT_CHK64_MASK                    0x000f0000
#define   FAIL_BIT_CHK64_SHIFT                           16
#define   FAIL_BIT_CHK63_MASK                    0x0000f000
#define   FAIL_BIT_CHK63_SHIFT                           12
#define   FAIL_BIT_CHK62_MASK                    0x00000f00
#define   FAIL_BIT_CHK62_SHIFT                            8
#define   FAIL_BIT_CHK61_MASK                    0x000000f0
#define   FAIL_BIT_CHK61_SHIFT                            4
#define   FAIL_BIT_CHK6_MASK                     0x0000000f
#define   FAIL_BIT_CHK6_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk6:4;
        u32 fail_bit_chk61:4;
        u32 fail_bit_chk62:4;
        u32 fail_bit_chk63:4;
        u32 fail_bit_chk64:4;
        u32 fail_bit_chk65:4;
        u32 fail_bit_chk66:4;
        u32 fail_bit_chk67:4;
    } b;
} nf_fail_reg6_t;

#define NF_FAIL_REG7                             0x00000188
#define   FAIL_BIT_CHK77_MASK                    0xf0000000
#define   FAIL_BIT_CHK77_SHIFT                           28
#define   FAIL_BIT_CHK76_MASK                    0x0f000000
#define   FAIL_BIT_CHK76_SHIFT                           24
#define   FAIL_BIT_CHK75_MASK                    0x00f00000
#define   FAIL_BIT_CHK75_SHIFT                           20
#define   FAIL_BIT_CHK74_MASK                    0x000f0000
#define   FAIL_BIT_CHK74_SHIFT                           16
#define   FAIL_BIT_CHK73_MASK                    0x0000f000
#define   FAIL_BIT_CHK73_SHIFT                           12
#define   FAIL_BIT_CHK72_MASK                    0x00000f00
#define   FAIL_BIT_CHK72_SHIFT                            8
#define   FAIL_BIT_CHK71_MASK                    0x000000f0
#define   FAIL_BIT_CHK71_SHIFT                            4
#define   FAIL_BIT_CHK7_MASK                     0x0000000f
#define   FAIL_BIT_CHK7_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk7:4;
        u32 fail_bit_chk71:4;
        u32 fail_bit_chk72:4;
        u32 fail_bit_chk73:4;
        u32 fail_bit_chk74:4;
        u32 fail_bit_chk75:4;
        u32 fail_bit_chk76:4;
        u32 fail_bit_chk77:4;
    } b;
} nf_fail_reg7_t;

#define NF_FAIL_REG_SP                           0x00000190
#define   FAIL_BIT_CHK7_SP_MASK                  0xf0000000
#define   FAIL_BIT_CHK7_SP_SHIFT                         28
#define   FAIL_BIT_CHK6_SP_MASK                  0x0f000000
#define   FAIL_BIT_CHK6_SP_SHIFT                         24
#define   FAIL_BIT_CHK5_SP_MASK                  0x00f00000
#define   FAIL_BIT_CHK5_SP_SHIFT                         20
#define   FAIL_BIT_CHK4_SP_MASK                  0x000f0000
#define   FAIL_BIT_CHK4_SP_SHIFT                         16
#define   FAIL_BIT_CHK3_SP_MASK                  0x0000f000
#define   FAIL_BIT_CHK3_SP_SHIFT                         12
#define   FAIL_BIT_CHK2_SP_MASK                  0x00000f00
#define   FAIL_BIT_CHK2_SP_SHIFT                          8
#define   FAIL_BIT_CHK1_SP_MASK                  0x000000f0
#define   FAIL_BIT_CHK1_SP_SHIFT                          4
#define   FAIL_BIT_CHK0_SP_MASK                  0x0000000f
#define   FAIL_BIT_CHK0_SP_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk0_sp:4;
        u32 fail_bit_chk1_sp:4;
        u32 fail_bit_chk2_sp:4;
        u32 fail_bit_chk3_sp:4;
        u32 fail_bit_chk4_sp:4;
        u32 fail_bit_chk5_sp:4;
        u32 fail_bit_chk6_sp:4;
        u32 fail_bit_chk7_sp:4;
    } b;
} nf_fail_reg_sp_t;

#define NF_FAIL_REG8                             0x00000194
#define   FAIL_BIT_CHK0F_MASK                    0xf0000000
#define   FAIL_BIT_CHK0F_SHIFT                           28
#define   FAIL_BIT_CHK0E_MASK                    0x0f000000
#define   FAIL_BIT_CHK0E_SHIFT                           24
#define   FAIL_BIT_CHK0D_MASK                    0x00f00000
#define   FAIL_BIT_CHK0D_SHIFT                           20
#define   FAIL_BIT_CHK0C_MASK                    0x000f0000
#define   FAIL_BIT_CHK0C_SHIFT                           16
#define   FAIL_BIT_CHK0B_MASK                    0x0000f000
#define   FAIL_BIT_CHK0B_SHIFT                           12
#define   FAIL_BIT_CHK0A_MASK                    0x00000f00
#define   FAIL_BIT_CHK0A_SHIFT                            8
#define   FAIL_BIT_CHK09_MASK                    0x000000f0
#define   FAIL_BIT_CHK09_SHIFT                            4
#define   FAIL_BIT_CHK08_MASK                    0x0000000f
#define   FAIL_BIT_CHK08_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk08:4;
        u32 fail_bit_chk09:4;
        u32 fail_bit_chk0a:4;
        u32 fail_bit_chk0b:4;
        u32 fail_bit_chk0c:4;
        u32 fail_bit_chk0d:4;
        u32 fail_bit_chk0e:4;
        u32 fail_bit_chk0f:4;
    } b;
} nf_fail_reg8_t;

#define NF_FAIL_REG9                             0x00000198
#define   FAIL_BIT_CHK1F_MASK                    0xf0000000
#define   FAIL_BIT_CHK1F_SHIFT                           28
#define   FAIL_BIT_CHK1E_MASK                    0x0f000000
#define   FAIL_BIT_CHK1E_SHIFT                           24
#define   FAIL_BIT_CHK1D_MASK                    0x00f00000
#define   FAIL_BIT_CHK1D_SHIFT                           20
#define   FAIL_BIT_CHK1C_MASK                    0x000f0000
#define   FAIL_BIT_CHK1C_SHIFT                           16
#define   FAIL_BIT_CHK1B_MASK                    0x0000f000
#define   FAIL_BIT_CHK1B_SHIFT                           12
#define   FAIL_BIT_CHK1A_MASK                    0x00000f00
#define   FAIL_BIT_CHK1A_SHIFT                            8
#define   FAIL_BIT_CHK19_MASK                    0x000000f0
#define   FAIL_BIT_CHK19_SHIFT                            4
#define   FAIL_BIT_CHK18_MASK                    0x0000000f
#define   FAIL_BIT_CHK18_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk18:4;
        u32 fail_bit_chk19:4;
        u32 fail_bit_chk1a:4;
        u32 fail_bit_chk1b:4;
        u32 fail_bit_chk1c:4;
        u32 fail_bit_chk1d:4;
        u32 fail_bit_chk1e:4;
        u32 fail_bit_chk1f:4;
    } b;
} nf_fail_reg9_t;

#define NF_FAIL_REG10                            0x0000019c
#define   FAIL_BIT_CHK2F_MASK                    0xf0000000
#define   FAIL_BIT_CHK2F_SHIFT                           28
#define   FAIL_BIT_CHK2E_MASK                    0x0f000000
#define   FAIL_BIT_CHK2E_SHIFT                           24
#define   FAIL_BIT_CHK2D_MASK                    0x00f00000
#define   FAIL_BIT_CHK2D_SHIFT                           20
#define   FAIL_BIT_CHK2C_MASK                    0x000f0000
#define   FAIL_BIT_CHK2C_SHIFT                           16
#define   FAIL_BIT_CHK2B_MASK                    0x0000f000
#define   FAIL_BIT_CHK2B_SHIFT                           12
#define   FAIL_BIT_CHK2A_MASK                    0x00000f00
#define   FAIL_BIT_CHK2A_SHIFT                            8
#define   FAIL_BIT_CHK29_MASK                    0x000000f0
#define   FAIL_BIT_CHK29_SHIFT                            4
#define   FAIL_BIT_CHK28_MASK                    0x0000000f
#define   FAIL_BIT_CHK28_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk28:4;
        u32 fail_bit_chk29:4;
        u32 fail_bit_chk2a:4;
        u32 fail_bit_chk2b:4;
        u32 fail_bit_chk2c:4;
        u32 fail_bit_chk2d:4;
        u32 fail_bit_chk2e:4;
        u32 fail_bit_chk2f:4;
    } b;
} nf_fail_reg10_t;

#define NF_FAIL_REG11                            0x000001a0
#define   FAIL_BIT_CHK3F_MASK                    0xf0000000
#define   FAIL_BIT_CHK3F_SHIFT                           28
#define   FAIL_BIT_CHK3E_MASK                    0x0f000000
#define   FAIL_BIT_CHK3E_SHIFT                           24
#define   FAIL_BIT_CHK3D_MASK                    0x00f00000
#define   FAIL_BIT_CHK3D_SHIFT                           20
#define   FAIL_BIT_CHK3C_MASK                    0x000f0000
#define   FAIL_BIT_CHK3C_SHIFT                           16
#define   FAIL_BIT_CHK3B_MASK                    0x0000f000
#define   FAIL_BIT_CHK3B_SHIFT                           12
#define   FAIL_BIT_CHK3A_MASK                    0x00000f00
#define   FAIL_BIT_CHK3A_SHIFT                            8
#define   FAIL_BIT_CHK39_MASK                    0x000000f0
#define   FAIL_BIT_CHK39_SHIFT                            4
#define   FAIL_BIT_CHK38_MASK                    0x0000000f
#define   FAIL_BIT_CHK38_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk38:4;
        u32 fail_bit_chk39:4;
        u32 fail_bit_chk3a:4;
        u32 fail_bit_chk3b:4;
        u32 fail_bit_chk3c:4;
        u32 fail_bit_chk3d:4;
        u32 fail_bit_chk3e:4;
        u32 fail_bit_chk3f:4;
    } b;
} nf_fail_reg11_t;

#define NF_FAIL_REG12                            0x000001a4
#define   FAIL_BIT_CHK4F_MASK                    0xf0000000
#define   FAIL_BIT_CHK4F_SHIFT                           28
#define   FAIL_BIT_CHK4E_MASK                    0x0f000000
#define   FAIL_BIT_CHK4E_SHIFT                           24
#define   FAIL_BIT_CHK4D_MASK                    0x00f00000
#define   FAIL_BIT_CHK4D_SHIFT                           20
#define   FAIL_BIT_CHK4C_MASK                    0x000f0000
#define   FAIL_BIT_CHK4C_SHIFT                           16
#define   FAIL_BIT_CHK4B_MASK                    0x0000f000
#define   FAIL_BIT_CHK4B_SHIFT                           12
#define   FAIL_BIT_CHK4A_MASK                    0x00000f00
#define   FAIL_BIT_CHK4A_SHIFT                            8
#define   FAIL_BIT_CHK49_MASK                    0x000000f0
#define   FAIL_BIT_CHK49_SHIFT                            4
#define   FAIL_BIT_CHK48_MASK                    0x0000000f
#define   FAIL_BIT_CHK48_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk48:4;
        u32 fail_bit_chk49:4;
        u32 fail_bit_chk4a:4;
        u32 fail_bit_chk4b:4;
        u32 fail_bit_chk4c:4;
        u32 fail_bit_chk4d:4;
        u32 fail_bit_chk4e:4;
        u32 fail_bit_chk4f:4;
    } b;
} nf_fail_reg12_t;

#define NF_FAIL_REG13                            0x000001a8
#define   FAIL_BIT_CHK5F_MASK                    0xf0000000
#define   FAIL_BIT_CHK5F_SHIFT                           28
#define   FAIL_BIT_CHK5E_MASK                    0x0f000000
#define   FAIL_BIT_CHK5E_SHIFT                           24
#define   FAIL_BIT_CHK5D_MASK                    0x00f00000
#define   FAIL_BIT_CHK5D_SHIFT                           20
#define   FAIL_BIT_CHK5C_MASK                    0x000f0000
#define   FAIL_BIT_CHK5C_SHIFT                           16
#define   FAIL_BIT_CHK5B_MASK                    0x0000f000
#define   FAIL_BIT_CHK5B_SHIFT                           12
#define   FAIL_BIT_CHK5A_MASK                    0x00000f00
#define   FAIL_BIT_CHK5A_SHIFT                            8
#define   FAIL_BIT_CHK59_MASK                    0x000000f0
#define   FAIL_BIT_CHK59_SHIFT                            4
#define   FAIL_BIT_CHK58_MASK                    0x0000000f
#define   FAIL_BIT_CHK58_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk58:4;
        u32 fail_bit_chk59:4;
        u32 fail_bit_chk5a:4;
        u32 fail_bit_chk5b:4;
        u32 fail_bit_chk5c:4;
        u32 fail_bit_chk5d:4;
        u32 fail_bit_chk5e:4;
        u32 fail_bit_chk5f:4;
    } b;
} nf_fail_reg13_t;

#define NF_FAIL_REG14                            0x000001ac
#define   FAIL_BIT_CHK6F_MASK                    0xf0000000
#define   FAIL_BIT_CHK6F_SHIFT                           28
#define   FAIL_BIT_CHK6E_MASK                    0x0f000000
#define   FAIL_BIT_CHK6E_SHIFT                           24
#define   FAIL_BIT_CHK6D_MASK                    0x00f00000
#define   FAIL_BIT_CHK6D_SHIFT                           20
#define   FAIL_BIT_CHK6C_MASK                    0x000f0000
#define   FAIL_BIT_CHK6C_SHIFT                           16
#define   FAIL_BIT_CHK6B_MASK                    0x0000f000
#define   FAIL_BIT_CHK6B_SHIFT                           12
#define   FAIL_BIT_CHK6A_MASK                    0x00000f00
#define   FAIL_BIT_CHK6A_SHIFT                            8
#define   FAIL_BIT_CHK69_MASK                    0x000000f0
#define   FAIL_BIT_CHK69_SHIFT                            4
#define   FAIL_BIT_CHK68_MASK                    0x0000000f
#define   FAIL_BIT_CHK68_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk68:4;
        u32 fail_bit_chk69:4;
        u32 fail_bit_chk6a:4;
        u32 fail_bit_chk6b:4;
        u32 fail_bit_chk6c:4;
        u32 fail_bit_chk6d:4;
        u32 fail_bit_chk6e:4;
        u32 fail_bit_chk6f:4;
    } b;
} nf_fail_reg14_t;

#define NF_FAIL_REG15                            0x000001b0
#define   FAIL_BIT_CHK7F_MASK                    0xf0000000
#define   FAIL_BIT_CHK7F_SHIFT                           28
#define   FAIL_BIT_CHK7E_MASK                    0x0f000000
#define   FAIL_BIT_CHK7E_SHIFT                           24
#define   FAIL_BIT_CHK7D_MASK                    0x00f00000
#define   FAIL_BIT_CHK7D_SHIFT                           20
#define   FAIL_BIT_CHK7C_MASK                    0x000f0000
#define   FAIL_BIT_CHK7C_SHIFT                           16
#define   FAIL_BIT_CHK7B_MASK                    0x0000f000
#define   FAIL_BIT_CHK7B_SHIFT                           12
#define   FAIL_BIT_CHK7A_MASK                    0x00000f00
#define   FAIL_BIT_CHK7A_SHIFT                            8
#define   FAIL_BIT_CHK79_MASK                    0x000000f0
#define   FAIL_BIT_CHK79_SHIFT                            4
#define   FAIL_BIT_CHK78_MASK                    0x0000000f
#define   FAIL_BIT_CHK78_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 fail_bit_chk78:4;
        u32 fail_bit_chk79:4;
        u32 fail_bit_chk7a:4;
        u32 fail_bit_chk7b:4;
        u32 fail_bit_chk7c:4;
        u32 fail_bit_chk7d:4;
        u32 fail_bit_chk7e:4;
        u32 fail_bit_chk7f:4;
    } b;
} nf_fail_reg15_t;

#define NF_PSTCMD_REG00                          0x000001f0
#define   PSTCMD3_MASK                           0xff000000
#define   PSTCMD3_SHIFT                                  24
#define   PSTCMD2_MASK                           0x00ff0000
#define   PSTCMD2_SHIFT                                  16
#define   PSTCMD1_MASK                           0x0000ff00
#define   PSTCMD1_SHIFT                                   8
#define   PSTCMD0_MASK                           0x000000ff
#define   PSTCMD0_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 pstcmd0:8;
        u32 pstcmd1:8;
        u32 pstcmd2:8;
        u32 pstcmd3:8;
    } b;
} nf_pstcmd_reg00_t;

#define NF_PSTCMD_REG01                          0x000001f4
#define   PSTCMD7_MASK                           0xff000000
#define   PSTCMD7_SHIFT                                  24
#define   PSTCMD6_MASK                           0x00ff0000
#define   PSTCMD6_SHIFT                                  16
#define   PSTCMD5_MASK                           0x0000ff00
#define   PSTCMD5_SHIFT                                   8
#define   PSTCMD4_MASK                           0x000000ff
#define   PSTCMD4_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 pstcmd4:8;
        u32 pstcmd5:8;
        u32 pstcmd6:8;
        u32 pstcmd7:8;
    } b;
} nf_pstcmd_reg01_t;

#define NF_NCMD_FMT_PTR                          0x00000200
#define   NF_VOL_CHK_DIS_200_MASK                0x80000000
#define   NF_VOL_CHK_DIS_200_SHIFT                       31
#define   NF_NCMD_FMT_CFG_PTR_MASK               0x0000007f
#define   NF_NCMD_FMT_CFG_PTR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 nf_ncmd_fmt_cfg_ptr:7;
        u32 rsvd_7:24;
        u32 nf_vol_chk_dis_200:1;
    } b;
} nf_ncmd_fmt_ptr_t;

#define NF_NCMD_FMT_REG0                         0x00000204
#define   PSTFIX_CMD_MASK                        0x80000000
#define   PSTFIX_CMD_SHIFT                               31
#define   CMD_EXT_MASK                           0x7fe00000
#define   CMD_EXT_SHIFT                                  21
#define   RD_SCMD_MODE_MASK                      0x001c0000
#define   RD_SCMD_MODE_SHIFT                             18
#define   CMD_MP_MASK                            0x0003c000
#define   CMD_MP_SHIFT                                   14
#define   PREFIX_MODE_MASK                       0x00002000
#define   PREFIX_MODE_SHIFT                              13
#define   PREFIX_CMD1_MASK                       0x00001c00
#define   PREFIX_CMD1_SHIFT                              10
#define   PREFIX_CMD2_MASK                       0x00000380
#define   PREFIX_CMD2_SHIFT                               7
#define   PREFIX_CMD3_MASK                       0x00000070
#define   PREFIX_CMD3_SHIFT                               4
#define   NF_ADDR_4B_EN_MASK                     0x00000008
#define   NF_ADDR_4B_EN_SHIFT                             3
#define   NF_ADDR_NUM_MASK                       0x00000007
#define   NF_ADDR_NUM_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 nf_addr_num:3;
        u32 nf_addr_4b_en:1;
        u32 prefix_cmd3:3;
        u32 prefix_cmd2:3;
        u32 prefix_cmd1:3;
        u32 prefix_mode:1;
        u32 cmd_mp:4;
        u32 rd_scmd_mode:3;
        u32 cmd_ext:10;
        u32 pstfix_cmd:1;
    } b;
} nf_ncmd_fmt_reg0_t;

#define NF_NCMD_FMT_REG1                         0x00000208
#define   FREQ_DIV_SEL_MASK                      0x00000300
#define   FREQ_DIV_SEL_SHIFT                              8
#define   WCNT_SEL_MASK                          0x000000f8
#define   WCNT_SEL_SHIFT                                  3
#define   PCNT_SEL_MASK                          0x00000007
#define   PCNT_SEL_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 pcnt_sel:3;
        u32 wcnt_sel:5;
        u32 freq_div_sel:2;
        u32 rsvd_10:22;
    } b;
} nf_ncmd_fmt_reg1_t;

#define NF_DBG_REG0                              0x00000300
#define   NF_MON_STATUS_MASK                     0xffff0000
#define   NF_MON_STATUS_SHIFT                            16
#define   NF_MON_SEL_MASK                        0x0000ffff
#define   NF_MON_SEL_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 nf_mon_sel:16;
        u32 nf_mon_status:16;
    } b;
} nf_dbg_reg0_t;

#define NF_DBG_REG1                              0x00000304
#define   NF_CPU_DBG_DIN_MASK                    0xffff0000
#define   NF_CPU_DBG_DIN_SHIFT                           16
#define   NF_CPU_DBG_RD_RDY_MASK                 0x00008000
#define   NF_CPU_DBG_RD_RDY_SHIFT                        15
#define   NF_CPU_DBG_WR_RDY_MASK                 0x00004000
#define   NF_CPU_DBG_WR_RDY_SHIFT                        14
#define   NF_CPU_DBG_CH_SEL_MASK                 0x000000f0
#define   NF_CPU_DBG_CH_SEL_SHIFT                         4
#define   NF_CPU_DBG_BUF_SEL_MASK                0x00000008
#define   NF_CPU_DBG_BUF_SEL_SHIFT                        3
#define   NF_ECC_DBG_MODE_MASK                   0x00000002
#define   NF_ECC_DBG_MODE_SHIFT                           1
#define   NF_CPU_DBG_MODE_MASK                   0x00000001
#define   NF_CPU_DBG_MODE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 nf_cpu_dbg_mode:1;
        u32 nf_ecc_dbg_mode:1;
        u32 rsvd_2:1;
        u32 nf_cpu_dbg_buf_sel:1;
        u32 nf_cpu_dbg_ch_sel:4;
        u32 rsvd_8:6;
        u32 nf_cpu_dbg_wr_rdy:1;
        u32 nf_cpu_dbg_rd_rdy:1;
        u32 nf_cpu_dbg_din:16;
    } b;
} nf_dbg_reg1_t;

#define NF_DBG_REG2                              0x00000308
#define   NF_CPU_DBG_AOUT_MASK                   0xffff0000
#define   NF_CPU_DBG_AOUT_SHIFT                          16
#define   NF_CPU_DBG_DOUT_MASK                   0x0000ffff
#define   NF_CPU_DBG_DOUT_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 nf_cpu_dbg_dout:16;
        u32 nf_cpu_dbg_aout:16;
    } b;
} nf_dbg_reg2_t;

#define NF_DBG_REG3                              0x0000030c
#define   NDCU_PIN_DBG_SEL_MASK                  0x0000000f
#define   NDCU_PIN_DBG_SEL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ndcu_pin_dbg_sel:4;
        u32 rsvd_4:28;
    } b;
} nf_dbg_reg3_t;

#define NF_SCMD_REG2                             0x00000320
#define   SCMD8_MASK                             0x000000ff
#define   SCMD8_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 scmd8:8;
        u32 rsvd_8:24;
    } b;
} nf_scmd_reg2_t;

#define NF_RDY_ERR_LOC_REG0                      0x00000324
#define   NF_ERR_RANGE_SEL_MASK                  0x00000038
#define   NF_ERR_RANGE_SEL_SHIFT                          3
#define   NF_RDY_RANGE_SEL_MASK                  0x00000007
#define   NF_RDY_RANGE_SEL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 nf_rdy_range_sel:3;
        u32 nf_err_range_sel:3;
        u32 rsvd_6:26;
    } b;
} nf_rdy_err_loc_reg0_t;

#define NF_PDWN_CTRL_REG1                        0x00000328
#define   NF_CLK_EN_MASK                         0xffff0000
#define   NF_CLK_EN_SHIFT                                16
#define   EC_CLK_EN_MASK                         0x0000ffff
#define   EC_CLK_EN_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 ec_clk_en:16;
        u32 nf_clk_en:16;
    } b;
} nf_pdwn_ctrl_reg1_t;

#define NF_DDR2_TIM_REG0                         0x00000340
#define   NF_DDR2_TDQS_HIGH_TCCS_MASK            0x00000004
#define   NF_DDR2_TDQS_HIGH_TCCS_SHIFT                    2
#define   NF_DDR2_TDQS_HIGH_TWHR_MASK            0x00000002
#define   NF_DDR2_TDQS_HIGH_TWHR_SHIFT                    1
#define   NF_DDR2_TDQSRH_EN_MASK                 0x00000001
#define   NF_DDR2_TDQSRH_EN_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 nf_ddr2_tdqsrh_en:1;
        u32 nf_ddr2_tdqs_high_twhr:1;
        u32 nf_ddr2_tdqs_high_tccs:1;
        u32 rsvd_3:29;
    } b;
} nf_ddr2_tim_reg0_t;

#define NF_LPBK_REG0                             0x00000380
#define   NF_LPBK_DATA_PATTERN_MASK              0xffff0000
#define   NF_LPBK_DATA_PATTERN_SHIFT                     16
#define   NF_LPBK_DATA_SEED_MASK                 0x0000ffff
#define   NF_LPBK_DATA_SEED_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_data_seed:16;
        u32 nf_lpbk_data_pattern:16;
    } b;
} nf_lpbk_reg0_t;

#define NF_LPBK_REG1                             0x00000384
#define   NF_LPBK_RESET_PCTRL_MASK               0x00f00000
#define   NF_LPBK_RESET_PCTRL_SHIFT                      20
#define   NF_LPBK_RND_GEN_MODE_MASK              0x00030000
#define   NF_LPBK_RND_GEN_MODE_SHIFT                     16
#define   NF_LPBK_DATA_SIZE_MASK                 0x0000ffff
#define   NF_LPBK_DATA_SIZE_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_data_size:16;
        u32 nf_lpbk_rnd_gen_mode:2;
        u32 rsvd_18:2;
        u32 nf_lpbk_reset_pctrl:4;
        u32 rsvd_24:8;
    } b;
} nf_lpbk_reg1_t;

#define NF_LPBK_REG2                             0x00000388
#define   NF_LPBK_START_MASK                     0x80000000
#define   NF_LPBK_START_SHIFT                            31
#define   NF_LPBK_CH_DONE_MASK                   0x01ff0000
#define   NF_LPBK_CH_DONE_SHIFT                          16
#define   NF_LPBK_CH_EN_MASK                     0x000001ff
#define   NF_LPBK_CH_EN_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_ch_en:9;
        u32 rsvd_9:7;
        u32 nf_lpbk_ch_done:9;
        u32 rsvd_25:6;
        u32 nf_lpbk_start:1;
    } b;
} nf_lpbk_reg2_t;

#define NF_LPBK_REG3                             0x0000038c
#define   NF_LPBK_CH0_STATUS_MASK                0xffffffff
#define   NF_LPBK_CH0_STATUS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_ch0_status:32;
    } b;
} nf_lpbk_reg3_t;

#define NF_LPBK_REG4                             0x00000390
#define   NF_LPBK_CH1_STATUS_MASK                0xffffffff
#define   NF_LPBK_CH1_STATUS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_ch1_status:32;
    } b;
} nf_lpbk_reg4_t;

#define NF_LPBK_REG5                             0x00000394
#define   NF_LPBK_CH2_STATUS_MASK                0xffffffff
#define   NF_LPBK_CH2_STATUS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_ch2_status:32;
    } b;
} nf_lpbk_reg5_t;

#define NF_LPBK_REG6                             0x00000398
#define   NF_LPBK_CH3_STATUS_MASK                0xffffffff
#define   NF_LPBK_CH3_STATUS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_ch3_status:32;
    } b;
} nf_lpbk_reg6_t;

#define NF_LPBK_REG7                             0x0000039c
#define   NF_LPBK_CH4_STATUS_MASK                0xffffffff
#define   NF_LPBK_CH4_STATUS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_ch4_status:32;
    } b;
} nf_lpbk_reg7_t;

#define NF_LPBK_REG8                             0x000003a0
#define   NF_LPBK_CH5_STATUS_MASK                0xffffffff
#define   NF_LPBK_CH5_STATUS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_ch5_status:32;
    } b;
} nf_lpbk_reg8_t;

#define NF_LPBK_REG9                             0x000003a4
#define   NF_LPBK_CH6_STATUS_MASK                0xffffffff
#define   NF_LPBK_CH6_STATUS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_ch6_status:32;
    } b;
} nf_lpbk_reg9_t;

#define NF_LPBK_REG10                            0x000003a8
#define   NF_LPBK_CH7_STATUS_MASK                0xffffffff
#define   NF_LPBK_CH7_STATUS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_ch7_status:32;
    } b;
} nf_lpbk_reg10_t;

#define NF_LPBK_REG11                            0x000003ac
#define   NF_LPBK_CH8_STATUS_MASK                0xffffffff
#define   NF_LPBK_CH8_STATUS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_ch8_status:32;
    } b;
} nf_lpbk_reg11_t;

#define NF_LPBK_REG12                            0x000003b0
#define   NF_LPBK_CH03_STATUS_MASK               0xffffffff
#define   NF_LPBK_CH03_STATUS_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_ch03_status:32;
    } b;
} nf_lpbk_reg12_t;

#define NF_LPBK_REG13                            0x000003b4
#define   NF_LPBK_CH47_STATUS_MASK               0xffffffff
#define   NF_LPBK_CH47_STATUS_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 nf_lpbk_ch47_status:32;
    } b;
} nf_lpbk_reg13_t;

#define NF_SUSP_REG0                             0x00000400
#define   NF_SUSP_R2P_CHK_MASK                   0x00002000
#define   NF_SUSP_R2P_CHK_SHIFT                          13
#define   NF_SUSP_SET_FEAT_EN_MASK               0x00001000
#define   NF_SUSP_SET_FEAT_EN_SHIFT                      12
#define   NF_SUSP_RD_OOO_EN_MASK                 0x00000800
#define   NF_SUSP_RD_OOO_EN_SHIFT                        11
#define   NF_SET_FEAT_PRCT_DIS_MASK              0x00000400
#define   NF_SET_FEAT_PRCT_DIS_SHIFT                     10
#define   NF_RESM_CMD_MODE_MASK                  0x00000200
#define   NF_RESM_CMD_MODE_SHIFT                          9
#define   NF_SUSP_CMD_MODE_MASK                  0x00000100
#define   NF_SUSP_CMD_MODE_SHIFT                          8
#define   NF_SUSP_EADDR_MODE_MASK                0x000000c0
#define   NF_SUSP_EADDR_MODE_SHIFT                        6
#define   NF_SUSP_PADDR_MODE_MASK                0x00000030
#define   NF_SUSP_PADDR_MODE_SHIFT                        4
#define   NF_SUSP_PREFIX_MODE_MASK               0x0000000c
#define   NF_SUSP_PREFIX_MODE_SHIFT                       2
#define   NF_SUSP_P2E_MASK                       0x00000002
#define   NF_SUSP_P2E_SHIFT                               1
#define   NF_SUSP_EN_MASK                        0x00000001
#define   NF_SUSP_EN_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 nf_susp_en:1;
        u32 nf_susp_p2e:1;
        u32 nf_susp_prefix_mode:2;
        u32 nf_susp_paddr_mode:2;
        u32 nf_susp_eaddr_mode:2;
        u32 nf_susp_cmd_mode:1;
        u32 nf_resm_cmd_mode:1;
        u32 nf_set_feat_prct_dis:1;
        u32 nf_susp_rd_ooo_en:1;
        u32 nf_susp_set_feat_en:1;
        u32 nf_susp_r2p_chk:1;
        u32 rsvd_14:18;
    } b;
} nf_susp_reg0_t;

#define NF_SUSP_REG1                             0x00000404
#define   NF_PROG_SUSP_TIMER_MASK                0xffff0000
#define   NF_PROG_SUSP_TIMER_SHIFT                       16
#define   NF_ERASE_SUSP_TIMER_MASK               0x0000ffff
#define   NF_ERASE_SUSP_TIMER_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 nf_erase_susp_timer:16;
        u32 nf_prog_susp_timer:16;
    } b;
} nf_susp_reg1_t;

#define NF_LUN_CTRL_REG1                         0x00000480
#define   NF_LUN_ADDR_SEL_CH8_MASK               0x0000000f
#define   NF_LUN_ADDR_SEL_CH8_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 nf_lun_addr_sel_ch8:4;
        u32 rsvd_4:28;
    } b;
} nf_lun_ctrl_reg1_t;

#define NF_TIM_CTRL_REG8                         0x00000484
#define   NF_TIMING_SEL_CH8_MASK                 0x000000ff
#define   NF_TIMING_SEL_CH8_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 nf_timing_sel_ch8:8;
        u32 rsvd_8:24;
    } b;
} nf_tim_ctrl_reg8_t;

#define NF_MP_ENH_CTRL_REG0                      0x00000500
#define   MP_ADDR_SEL_CH7_MASK                   0xf0000000
#define   MP_ADDR_SEL_CH7_SHIFT                          28
#define   MP_ADDR_SEL_CH6_MASK                   0x0f000000
#define   MP_ADDR_SEL_CH6_SHIFT                          24
#define   MP_ADDR_SEL_CH5_MASK                   0x00f00000
#define   MP_ADDR_SEL_CH5_SHIFT                          20
#define   MP_ADDR_SEL_CH4_MASK                   0x000f0000
#define   MP_ADDR_SEL_CH4_SHIFT                          16
#define   MP_ADDR_SEL_CH3_MASK                   0x0000f000
#define   MP_ADDR_SEL_CH3_SHIFT                          12
#define   MP_ADDR_SEL_CH2_MASK                   0x00000f00
#define   MP_ADDR_SEL_CH2_SHIFT                           8
#define   MP_ADDR_SEL_CH1_MASK                   0x000000f0
#define   MP_ADDR_SEL_CH1_SHIFT                           4
#define   MP_ADDR_SEL_CH0_MASK                   0x0000000f
#define   MP_ADDR_SEL_CH0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 mp_addr_sel_ch0:4;
        u32 mp_addr_sel_ch1:4;
        u32 mp_addr_sel_ch2:4;
        u32 mp_addr_sel_ch3:4;
        u32 mp_addr_sel_ch4:4;
        u32 mp_addr_sel_ch5:4;
        u32 mp_addr_sel_ch6:4;
        u32 mp_addr_sel_ch7:4;
    } b;
} nf_mp_enh_ctrl_reg0_t;

#define NF_MP_ENH_CTRL_REG1                      0x00000504
#define   MP_NUM_MAX_MASK                        0xf0000000
#define   MP_NUM_MAX_SHIFT                               28

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:28;
        u32 mp_num_max:4;
    } b;
} nf_mp_enh_ctrl_reg1_t;

#define NF_SCMD_TYPE_REG0                        0x00000508
#define   NF_SCMD_TYPE_MASK                      0x0000ffff
#define   NF_SCMD_TYPE_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nf_scmd_type:16;
        u32 rsvd_16:16;
    } b;
} nf_scmd_type_reg0_t;

#define NF_WCNT_ENH_REG0                         0x00000510
#define   NF_ENH_WCNT3_MASK                      0xff000000
#define   NF_ENH_WCNT3_SHIFT                             24
#define   NF_ENH_WCNT2_MASK                      0x00ff0000
#define   NF_ENH_WCNT2_SHIFT                             16
#define   NF_ENH_WCNT1_MASK                      0x0000ff00
#define   NF_ENH_WCNT1_SHIFT                              8
#define   NF_ENH_WCNT0_MASK                      0x000000ff
#define   NF_ENH_WCNT0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nf_enh_wcnt0:8;
        u32 nf_enh_wcnt1:8;
        u32 nf_enh_wcnt2:8;
        u32 nf_enh_wcnt3:8;
    } b;
} nf_wcnt_enh_reg0_t;

#define NF_WCNT_ENH_REG1                         0x00000514
#define   NF_ENH_WCNT7_MASK                      0xff000000
#define   NF_ENH_WCNT7_SHIFT                             24
#define   NF_ENH_WCNT6_MASK                      0x00ff0000
#define   NF_ENH_WCNT6_SHIFT                             16
#define   NF_ENH_WCNT5_MASK                      0x0000ff00
#define   NF_ENH_WCNT5_SHIFT                              8
#define   NF_ENH_WCNT4_MASK                      0x000000ff
#define   NF_ENH_WCNT4_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nf_enh_wcnt4:8;
        u32 nf_enh_wcnt5:8;
        u32 nf_enh_wcnt6:8;
        u32 nf_enh_wcnt7:8;
    } b;
} nf_wcnt_enh_reg1_t;

#define NF_WCNT_ENH_REG2                         0x00000518
#define   NF_ENH_WCNT11_MASK                     0xff000000
#define   NF_ENH_WCNT11_SHIFT                            24
#define   NF_ENH_WCNT10_MASK                     0x00ff0000
#define   NF_ENH_WCNT10_SHIFT                            16
#define   NF_ENH_WCNT9_MASK                      0x0000ff00
#define   NF_ENH_WCNT9_SHIFT                              8
#define   NF_ENH_WCNT8_MASK                      0x000000ff
#define   NF_ENH_WCNT8_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nf_enh_wcnt8:8;
        u32 nf_enh_wcnt9:8;
        u32 nf_enh_wcnt10:8;
        u32 nf_enh_wcnt11:8;
    } b;
} nf_wcnt_enh_reg2_t;

#define NF_WCNT_ENH_REG3                         0x0000051c
#define   NF_ENH_WCNT15_MASK                     0xff000000
#define   NF_ENH_WCNT15_SHIFT                            24
#define   NF_ENH_WCNT14_MASK                     0x00ff0000
#define   NF_ENH_WCNT14_SHIFT                            16
#define   NF_ENH_WCNT13_MASK                     0x0000ff00
#define   NF_ENH_WCNT13_SHIFT                             8
#define   NF_ENH_WCNT12_MASK                     0x000000ff
#define   NF_ENH_WCNT12_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 nf_enh_wcnt12:8;
        u32 nf_enh_wcnt13:8;
        u32 nf_enh_wcnt14:8;
        u32 nf_enh_wcnt15:8;
    } b;
} nf_wcnt_enh_reg3_t;

#define NF_WCNT_ENH_REG4                         0x00000520
#define   NF_ENH_WCNT19_MASK                     0xff000000
#define   NF_ENH_WCNT19_SHIFT                            24
#define   NF_ENH_WCNT18_MASK                     0x00ff0000
#define   NF_ENH_WCNT18_SHIFT                            16
#define   NF_ENH_WCNT17_MASK                     0x0000ff00
#define   NF_ENH_WCNT17_SHIFT                             8
#define   NF_ENH_WCNT16_MASK                     0x000000ff
#define   NF_ENH_WCNT16_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 nf_enh_wcnt16:8;
        u32 nf_enh_wcnt17:8;
        u32 nf_enh_wcnt18:8;
        u32 nf_enh_wcnt19:8;
    } b;
} nf_wcnt_enh_reg4_t;

#define NF_WCNT_ENH_REG5                         0x00000524
#define   NF_ENH_WCNT23_MASK                     0xff000000
#define   NF_ENH_WCNT23_SHIFT                            24
#define   NF_ENH_WCNT22_MASK                     0x00ff0000
#define   NF_ENH_WCNT22_SHIFT                            16
#define   NF_ENH_WCNT21_MASK                     0x0000ff00
#define   NF_ENH_WCNT21_SHIFT                             8
#define   NF_ENH_WCNT20_MASK                     0x000000ff
#define   NF_ENH_WCNT20_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 nf_enh_wcnt20:8;
        u32 nf_enh_wcnt21:8;
        u32 nf_enh_wcnt22:8;
        u32 nf_enh_wcnt23:8;
    } b;
} nf_wcnt_enh_reg5_t;

#define NF_WCNT_ENH_REG6                         0x00000528
#define   NF_ENH_WCNT27_MASK                     0xff000000
#define   NF_ENH_WCNT27_SHIFT                            24
#define   NF_ENH_WCNT26_MASK                     0x00ff0000
#define   NF_ENH_WCNT26_SHIFT                            16
#define   NF_ENH_WCNT25_MASK                     0x0000ff00
#define   NF_ENH_WCNT25_SHIFT                             8
#define   NF_ENH_WCNT24_MASK                     0x000000ff
#define   NF_ENH_WCNT24_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 nf_enh_wcnt24:8;
        u32 nf_enh_wcnt25:8;
        u32 nf_enh_wcnt26:8;
        u32 nf_enh_wcnt27:8;
    } b;
} nf_wcnt_enh_reg6_t;

#define NF_WCNT_ENH_REG7                         0x0000052c
#define   NF_ENH_WCNT31_MASK                     0xff000000
#define   NF_ENH_WCNT31_SHIFT                            24
#define   NF_ENH_WCNT30_MASK                     0x00ff0000
#define   NF_ENH_WCNT30_SHIFT                            16
#define   NF_ENH_WCNT29_MASK                     0x0000ff00
#define   NF_ENH_WCNT29_SHIFT                             8
#define   NF_ENH_WCNT28_MASK                     0x000000ff
#define   NF_ENH_WCNT28_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 nf_enh_wcnt28:8;
        u32 nf_enh_wcnt29:8;
        u32 nf_enh_wcnt30:8;
        u32 nf_enh_wcnt31:8;
    } b;
} nf_wcnt_enh_reg7_t;

#define NF_PCNT_ENH_REG0                         0x00000530
#define   NF_ENH_PCNT3_MASK                      0xff000000
#define   NF_ENH_PCNT3_SHIFT                             24
#define   NF_ENH_PCNT2_MASK                      0x00ff0000
#define   NF_ENH_PCNT2_SHIFT                             16
#define   NF_ENH_PCNT1_MASK                      0x0000ff00
#define   NF_ENH_PCNT1_SHIFT                              8
#define   NF_ENH_PCNT0_MASK                      0x000000ff
#define   NF_ENH_PCNT0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nf_enh_pcnt0:8;
        u32 nf_enh_pcnt1:8;
        u32 nf_enh_pcnt2:8;
        u32 nf_enh_pcnt3:8;
    } b;
} nf_pcnt_enh_reg0_t;

#define NF_PCNT_ENH_REG1                         0x00000534
#define   NF_ENH_PCNT7_MASK                      0xff000000
#define   NF_ENH_PCNT7_SHIFT                             24
#define   NF_ENH_PCNT6_MASK                      0x00ff0000
#define   NF_ENH_PCNT6_SHIFT                             16
#define   NF_ENH_PCNT5_MASK                      0x0000ff00
#define   NF_ENH_PCNT5_SHIFT                              8
#define   NF_ENH_PCNT4_MASK                      0x000000ff
#define   NF_ENH_PCNT4_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nf_enh_pcnt4:8;
        u32 nf_enh_pcnt5:8;
        u32 nf_enh_pcnt6:8;
        u32 nf_enh_pcnt7:8;
    } b;
} nf_pcnt_enh_reg1_t;

#define NF_DLL_UPDT_CTRL_REG0                    0x000005a0
#define   NF_DLL_UPDT_TIMER_MASK                 0x003f0000
#define   NF_DLL_UPDT_TIMER_SHIFT                        16
#define   NF_DLL_UPDT_EN_MASK                    0x00000003
#define   NF_DLL_UPDT_EN_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 nf_dll_updt_en:2;
        u32 rsvd_2:14;
        u32 nf_dll_updt_timer:6;
        u32 rsvd_22:10;
    } b;
} nf_dll_updt_ctrl_reg0_t;

#define NF_FAC_CTRL_REG0                         0x00000600
#define   NF_FAC_ACT_CMD_NUM_MASK                0x00000f00
#define   NF_FAC_ACT_CMD_NUM_SHIFT                        8
#define   NF_FAC_SYNC_MODE_MASK                  0x00000018
#define   NF_FAC_SYNC_MODE_SHIFT                          3
#define   NF_FAC_OP_MODE_MASK                    0x00000006
#define   NF_FAC_OP_MODE_SHIFT                            1
#define   NF_FAC_MODE_EN_MASK                    0x00000001
#define   NF_FAC_MODE_EN_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 nf_fac_mode_en:1;
        u32 nf_fac_op_mode:2;
        u32 nf_fac_sync_mode:2;
        u32 rsvd_5:3;
        u32 nf_fac_act_cmd_num:4;
        u32 rsvd_12:20;
    } b;
} nf_fac_ctrl_reg0_t;

#define NF_FAC_CTRL_REG1                         0x00000604
#define   NF_FAC_GRP_THD_MASK                    0x0000000f
#define   NF_FAC_GRP_THD_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 nf_fac_grp_thd:4;
        u32 rsvd_4:28;
    } b;
} nf_fac_ctrl_reg1_t;

#define NF_WARMUP_CTRL_REG0                      0x00000620
#define   NF_GET_FEAT_WARMUP_EN_MASK             0x00004000
#define   NF_GET_FEAT_WARMUP_EN_SHIFT                    14
#define   NF_SET_FEAT_WARMUP_EN_MASK             0x00002000
#define   NF_SET_FEAT_WARMUP_EN_SHIFT                    13
#define   NF_RDST_WARMUP_EN_MASK                 0x00001000
#define   NF_RDST_WARMUP_EN_SHIFT                        12
#define   NF_RD_WARMUP_EN_MASK                   0x00000800
#define   NF_RD_WARMUP_EN_SHIFT                          11
#define   NF_WR_WARMUP_EN_MASK                   0x00000400
#define   NF_WR_WARMUP_EN_SHIFT                          10
#define   NF_RD_WARMUP_SZ_MASK                   0x000003e0
#define   NF_RD_WARMUP_SZ_SHIFT                           5
#define   NF_WR_WARMUP_SZ_MASK                   0x0000001f
#define   NF_WR_WARMUP_SZ_SHIFT                           0
typedef union {
    u32 all;
    struct {
        u32 nf_wr_warmup_sz:5;
        u32 nf_rd_warmup_sz:5;
        u32 nf_wr_warmup_en:1;
        u32 nf_rd_warmup_en:1;
        u32 nf_rdst_warmup_en:1;
        u32 nf_set_feat_warmup_en:1;
        u32 nf_get_feat_warmup_en:1;
        u32 rsvd_15:17;
    } b;
} nf_warmup_ctrl_reg0_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ nf_ctrl_reg0_t nf_ctrl_reg0;
    /* 0x0004 */ nf_ind_reg0_t nf_ind_reg0;
    /* 0x0008 */ nf_ind_reg1_t nf_ind_reg1;
    /* 0x000c */ nf_ind_reg2_t nf_ind_reg2;
    /* 0x0010 */ nf_ind_reg3_t nf_ind_reg3;
    /* 0x0014 */ nf_ind_reg4_t nf_ind_reg4;
    /* 0x0018 */ nf_ind_reg5_t nf_ind_reg5;
    /* 0x001c */ nf_ind_reg6_t nf_ind_reg6;
    /* 0x0020 */ nf_async_tim_reg0_t nf_async_tim_reg0;
    /* 0x0024 */ nf_sync_tim_reg0_t nf_sync_tim_reg0;
    /* 0x0028 */ nf_sync_tim_reg1_t nf_sync_tim_reg1;
    /* 0x002c */ nf_sync_tim_reg2_t nf_sync_tim_reg2;
    /* 0x0030 */ nf_tgl_tim_reg0_t nf_tgl_tim_reg0;
    /* 0x0034 */ nf_tgl_tim_reg1_t nf_tgl_tim_reg1;
    /* 0x0038 */ nf_gen_tim_reg0_t nf_gen_tim_reg0;
    /* 0x003c */ nf_gen_tim_reg1_t nf_gen_tim_reg1;
    /* 0x0040 */ nf_tim_ctrl_reg0_t nf_tim_ctrl_reg0;
    /* 0x0044 */ nf_tim_ctrl_reg1_t nf_tim_ctrl_reg1;
    /* 0x0048 */ nf_tim_ctrl_reg2_t nf_tim_ctrl_reg2;
    /* 0x004c */ nf_tim_ctrl_reg3_t nf_tim_ctrl_reg3;
    /* 0x0050 */ nf_tim_ctrl_reg4_t nf_tim_ctrl_reg4;
    /* 0x0054 */ nf_tim_ctrl_reg5_t nf_tim_ctrl_reg5;
    /* 0x0058 */ nf_tim_ctrl_reg6_t nf_tim_ctrl_reg6;
    /* 0x005c */ nf_tim_ctrl_reg7_t nf_tim_ctrl_reg7;
    /* 0x0060 */ nf_rcmd_reg00_t nf_rcmd_reg00;
    /* 0x0064 */ nf_rcmd_reg01_t nf_rcmd_reg01;
    /* 0x0068 */ nf_rcmd_reg10_t nf_rcmd_reg10;
    /* 0x006c */ nf_rcmd_reg11_t nf_rcmd_reg11;
    /* 0x0070 */ nf_rcmd_mp_reg00_t nf_rcmd_mp_reg00;
    /* 0x0074 */ nf_rcmd_mp_reg01_t nf_rcmd_mp_reg01;
    /* 0x0078 */ nf_rcmd_mp_reg10_t nf_rcmd_mp_reg10;
    /* 0x007c */ nf_rcmd_mp_reg11_t nf_rcmd_mp_reg11;
    /* 0x0080 */ nf_rxcmd_reg0_t nf_rxcmd_reg0;
    /* 0x0084 */ nf_rxcmd_reg1_t nf_rxcmd_reg1;
    /* 0x0088 */ nf_rxcmd_mp_reg0_t nf_rxcmd_mp_reg0;
    /* 0x008c */ nf_rxcmd_mp_reg1_t nf_rxcmd_mp_reg1;
    /* 0x0090 */ nf_rdcmd_dummy_t nf_rdcmd_dummy;
    /* 0x0094 */ nf_pcmd_reg00_t nf_pcmd_reg00;
    /* 0x0098 */ nf_pcmd_reg01_t nf_pcmd_reg01;
    /* 0x009c */ nf_pcmd_reg10_t nf_pcmd_reg10;
    /* 0x00a0 */ nf_pcmd_reg11_t nf_pcmd_reg11;
    /* 0x00a4 */ nf_pcmd_mp_reg00_t nf_pcmd_mp_reg00;
    /* 0x00a8 */ nf_pcmd_mp_reg01_t nf_pcmd_mp_reg01;
    /* 0x00ac */ nf_pcmd_mp_reg10_t nf_pcmd_mp_reg10;
    /* 0x00b0 */ nf_pcmd_mp_reg11_t nf_pcmd_mp_reg11;
    /* 0x00b4 */ nf_ecmd_reg0_t nf_ecmd_reg0;
    /* 0x00b8 */ nf_ecmd_reg1_t nf_ecmd_reg1;
    /* 0x00bc */ nf_ecmd_mp_reg0_t nf_ecmd_mp_reg0;
    /* 0x00c0 */ nf_ecmd_mp_reg1_t nf_ecmd_mp_reg1;
    /* 0x00c4 */ nf_ecmd_jdc0_t nf_ecmd_jdc0;
    /* 0x00c8 */ nf_scmd_reg0_t nf_scmd_reg0;
    /* 0x00cc */ nf_scmd_reg1_t nf_scmd_reg1;
    /* 0x00d0 */ nf_rstcmd_reg0_t nf_rstcmd_reg0;
    /* 0x00d4 */ nf_rstcmd_reg1_t nf_rstcmd_reg1;
    /* 0x00d8 */ nf_precmd_reg00_t nf_precmd_reg00;
    /* 0x00dc */ nf_precmd_reg01_t nf_precmd_reg01;
    /* 0x00e0 */ nf_precmd_reg10_t nf_precmd_reg10;
    /* 0x00e4 */ nf_precmd_reg11_t nf_precmd_reg11;
    /* 0x00e8 */ nf_precmd_reg20_t nf_precmd_reg20;
    /* 0x00ec */ nf_precmd_reg21_t nf_precmd_reg21;
    /* 0x00f0 */ nf_wcnt_reg0_t nf_wcnt_reg0;
    /* 0x00f4 */ nf_wcnt_reg1_t nf_wcnt_reg1;
    /* 0x00f8 */ nf_wcnt_reg2_t nf_wcnt_reg2;
    /* 0x00fc */ nf_wcnt_reg3_t nf_wcnt_reg3;
    /* 0x0100 */ nf_pcnt_reg0_t nf_pcnt_reg0;
    /* 0x0104 */ nf_pcnt_reg1_t nf_pcnt_reg1;
    /* 0x0108 */ nf_fail_reg0_t nf_fail_reg0;
    /* 0x010c */ nf_fail_reg1_t nf_fail_reg1;
    /* 0x0110 */ nf_fail_reg2_t nf_fail_reg2;
    /* 0x0114 */ nf_fail_reg3_t nf_fail_reg3;
    /* 0x0118 */ nf_fail_reg4_t nf_fail_reg4;
    /* 0x011c */ nf_rdy_reg0_t nf_rdy_reg0;
    /* 0x0120 */ nf_lun_ctrl_reg0_t nf_lun_ctrl_reg0;
    /* 0x0124 */ nf_pdwn_ctrl_reg0_t nf_pdwn_ctrl_reg0;
    /* 0x0128 */ nf_ddr_data_dly_ctrl_reg0_t nf_ddr_data_dly_ctrl_reg0;
    /* 0x012c */ nf_ce_remap_reg0_t nf_ce_remap_reg0;
    /* 0x0130 */ nf_ce_remap_reg1_t nf_ce_remap_reg1;
    /* 0x0134 */ nf_ce_remap_reg2_t nf_ce_remap_reg2;
    /* 0x0138 */ nf_ce_remap_reg3_t nf_ce_remap_reg3;
    /* 0x013c */ nf_ce_remap_reg4_t nf_ce_remap_reg4;
    /* 0x0140 */ nf_ce_remap_reg5_t nf_ce_remap_reg5;
    /* 0x0144 */ nf_ce_remap_reg6_t nf_ce_remap_reg6;
    /* 0x0148 */ nf_ce_remap_reg7_t nf_ce_remap_reg7;
    /* 0x014c */ u32 rsvd_14c [9];
    /* 0x0170 */ nf_pwdog_timer_reg0_t nf_pwdog_timer_reg0;
    /* 0x0174 */ nf_ewdog_timer_reg0_t nf_ewdog_timer_reg0;
    /* 0x0178 */ nf_force_nd_err_reg0_t nf_force_nd_err_reg0;
    /* 0x017c */ u32 rsvd_17c;
    /* 0x0180 */ nf_fail_reg5_t nf_fail_reg5;
    /* 0x0184 */ nf_fail_reg6_t nf_fail_reg6;
    /* 0x0188 */ nf_fail_reg7_t nf_fail_reg7;
    /* 0x018c */ u32 rsvd_18c;
    /* 0x0190 */ nf_fail_reg_sp_t nf_fail_reg_sp;
    /* 0x0194 */ nf_fail_reg8_t nf_fail_reg8;
    /* 0x0198 */ nf_fail_reg9_t nf_fail_reg9;
    /* 0x019c */ nf_fail_reg10_t nf_fail_reg10;
    /* 0x01a0 */ nf_fail_reg11_t nf_fail_reg11;
    /* 0x01a4 */ nf_fail_reg12_t nf_fail_reg12;
    /* 0x01a8 */ nf_fail_reg13_t nf_fail_reg13;
    /* 0x01ac */ nf_fail_reg14_t nf_fail_reg14;
    /* 0x01b0 */ nf_fail_reg15_t nf_fail_reg15;
    /* 0x01b4 */ u32 rsvd_1b4 [15];
    /* 0x01f0 */ nf_pstcmd_reg00_t nf_pstcmd_reg00;
    /* 0x01f4 */ nf_pstcmd_reg01_t nf_pstcmd_reg01;
    /* 0x01f8 */ u32 rsvd_1f8 [2];
    /* 0x0200 */ nf_ncmd_fmt_ptr_t nf_ncmd_fmt_ptr;
    /* 0x0204 */ nf_ncmd_fmt_reg0_t nf_ncmd_fmt_reg0;
    /* 0x0208 */ nf_ncmd_fmt_reg1_t nf_ncmd_fmt_reg1;
    /* 0x020c */ u32 rsvd_20c [61];
    /* 0x0300 */ nf_dbg_reg0_t nf_dbg_reg0;
    /* 0x0304 */ nf_dbg_reg1_t nf_dbg_reg1;
    /* 0x0308 */ nf_dbg_reg2_t nf_dbg_reg2;
    /* 0x030c */ nf_dbg_reg3_t nf_dbg_reg3;
    /* 0x0310 */ u32 rsvd_310 [4];
    /* 0x0320 */ nf_scmd_reg2_t nf_scmd_reg2;
    /* 0x0324 */ nf_rdy_err_loc_reg0_t nf_rdy_err_loc_reg0;
    /* 0x0328 */ nf_pdwn_ctrl_reg1_t nf_pdwn_ctrl_reg1;
    /* 0x032c */ u32 rsvd_32c [5];
    /* 0x0340 */ nf_ddr2_tim_reg0_t nf_ddr2_tim_reg0;
    /* 0x0344 */ u32 rsvd_344 [15];
    /* 0x0380 */ nf_lpbk_reg0_t nf_lpbk_reg0;
    /* 0x0384 */ nf_lpbk_reg1_t nf_lpbk_reg1;
    /* 0x0388 */ nf_lpbk_reg2_t nf_lpbk_reg2;
    /* 0x038c */ nf_lpbk_reg3_t nf_lpbk_reg3;
    /* 0x0390 */ nf_lpbk_reg4_t nf_lpbk_reg4;
    /* 0x0394 */ nf_lpbk_reg5_t nf_lpbk_reg5;
    /* 0x0398 */ nf_lpbk_reg6_t nf_lpbk_reg6;
    /* 0x039c */ nf_lpbk_reg7_t nf_lpbk_reg7;
    /* 0x03a0 */ nf_lpbk_reg8_t nf_lpbk_reg8;
    /* 0x03a4 */ nf_lpbk_reg9_t nf_lpbk_reg9;
    /* 0x03a8 */ nf_lpbk_reg10_t nf_lpbk_reg10;
    /* 0x03ac */ nf_lpbk_reg11_t nf_lpbk_reg11;
    /* 0x03b0 */ nf_lpbk_reg12_t nf_lpbk_reg12;
    /* 0x03b4 */ nf_lpbk_reg13_t nf_lpbk_reg13;
    /* 0x03b8 */ u32 rsvd_3b8 [18];
    /* 0x0400 */ nf_susp_reg0_t nf_susp_reg0;
    /* 0x0404 */ nf_susp_reg1_t nf_susp_reg1;
    /* 0x0408 */ u32 rsvd_408 [30];
    /* 0x0480 */ nf_lun_ctrl_reg1_t nf_lun_ctrl_reg1;
    /* 0x0484 */ nf_tim_ctrl_reg8_t nf_tim_ctrl_reg8;
    /* 0x0488 */ u32 rsvd_488 [30];
    /* 0x0500 */ nf_mp_enh_ctrl_reg0_t nf_mp_enh_ctrl_reg0;
    /* 0x0504 */ nf_mp_enh_ctrl_reg1_t nf_mp_enh_ctrl_reg1;
    /* 0x0508 */ nf_scmd_type_reg0_t nf_scmd_type_reg0;
    /* 0x050c */ u32 rsvd_50c;
    /* 0x0510 */ nf_wcnt_enh_reg0_t nf_wcnt_enh_reg0;
    /* 0x0514 */ nf_wcnt_enh_reg1_t nf_wcnt_enh_reg1;
    /* 0x0518 */ nf_wcnt_enh_reg2_t nf_wcnt_enh_reg2;
    /* 0x051c */ nf_wcnt_enh_reg3_t nf_wcnt_enh_reg3;
    /* 0x0520 */ nf_wcnt_enh_reg4_t nf_wcnt_enh_reg4;
    /* 0x0524 */ nf_wcnt_enh_reg5_t nf_wcnt_enh_reg5;
    /* 0x0528 */ nf_wcnt_enh_reg6_t nf_wcnt_enh_reg6;
    /* 0x052c */ nf_wcnt_enh_reg7_t nf_wcnt_enh_reg7;
    /* 0x0530 */ nf_pcnt_enh_reg0_t nf_pcnt_enh_reg0;
    /* 0x0534 */ nf_pcnt_enh_reg1_t nf_pcnt_enh_reg1;
    /* 0x0538 */ u32 rsvd_538 [26];
    /* 0x05a0 */ nf_dll_updt_ctrl_reg0_t nf_dll_updt_ctrl_reg0;
    /* 0x05a4 */ u32 rsvd_5a4 [23];
    /* 0x0600 */ nf_fac_ctrl_reg0_t nf_fac_ctrl_reg0;
    /* 0x0604 */ nf_fac_ctrl_reg1_t nf_fac_ctrl_reg1;
    /* 0x0608 */ u32 rsvd_608 [6];
    /* 0x0620 */ nf_warmup_ctrl_reg0_t nf_warmup_ctrl_reg0;
} ncb_ndcu_regs_t;


#endif /* rev 2002 */