//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _NCB_CRYPTO_REGISTER_H_
#define _NCB_CRYPTO_REGISTER_H_

#define CRYPTO_CAPABILITY_REG                    0x00000000
#define   VERSION_MASK                           0xff000000
#define   VERSION_SHIFT                                  24
#define   SM4_SUPPORT_MASK                       0x00020000
#define   SM4_SUPPORT_SHIFT                              17
#define   AES_SUPPORT_MASK                       0x00010000
#define   AES_SUPPORT_SHIFT                              16
#define   CFG_NUM_MASK                           0x0000ff00
#define   CFG_NUM_SHIFT                                   8
#define   CAP_NUM_MASK                           0x000000ff
#define   CAP_NUM_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 cap_num:8;
        u32 cfg_num:8;
        u32 aes_support:1;
        u32 sm4_support:1;
        u32 rsvd_18:6;
        u32 version:8;
    } b;
} crypto_capability_reg_t;

#define CRYPTO_CAPABILITY0_REG                   0x00000004
#define   KEY_SIZE_MASK                          0x00ff0000
#define   KEY_SIZE_SHIFT                                 16
#define   DU_SIZE_MASK                           0x0000ff00
#define   DU_SIZE_SHIFT                                   8
#define   ALGORITHM_ID_MASK                      0x000000ff
#define   ALGORITHM_ID_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 algorithm_id:8;
        u32 du_size:8;
        u32 key_size:8;
        u32 rsvd_24:8;
    } b;
} crypto_capability0_reg_t;

#define CRYPTO_CAPABILITY1_REG                   0x00000008
#define   KEY_SIZE_8_MASK                        0x00ff0000
#define   KEY_SIZE_8_SHIFT                               16
#define   DU_SIZE_8_MASK                         0x0000ff00
#define   DU_SIZE_8_SHIFT                                 8
#define   ALGORITHM_ID_8_MASK                    0x000000ff
#define   ALGORITHM_ID_8_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 algorithm_id_8:8;
        u32 du_size_8:8;
        u32 key_size_8:8;
        u32 rsvd_24:8;
    } b;
} crypto_capability1_reg_t;

#define CRYPTO_SYS_CFG_REG                       0x00000080
#define   REQUIRE_CLK_MASK                       0x80000000
#define   REQUIRE_CLK_SHIFT                              31
#define   KEY_MEM_WR_INIT_VAL_MASK               0x00700000
#define   KEY_MEM_WR_INIT_VAL_SHIFT                      20
#define   KEY_MEM_RD_INIT_VAL_MASK               0x00070000
#define   KEY_MEM_RD_INIT_VAL_SHIFT                      16
#define   SM4_MODE_EN_MASK                       0x00000001
#define   SM4_MODE_EN_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 sm4_mode_en:1;
        u32 rsvd_1:15;
        u32 key_mem_rd_init_val:3;
        u32 rsvd_19:1;
        u32 key_mem_wr_init_val:3;
        u32 rsvd_23:8;
        u32 require_clk:1;
    } b;
} crypto_sys_cfg_reg_t;

#define CRYPTO_CFG0_REG                          0x00000100
#define   CFG_EN_MASK                            0x80000000
#define   CFG_EN_SHIFT                                   31
#define   DU_SIZE_SEL_MASK                       0x0000ff00
#define   DU_SIZE_SEL_SHIFT                               8
#define   KEY_SIZE_SEL_MASK                      0x000000f0
#define   KEY_SIZE_SEL_SHIFT                              4
#define   ALG_ID_SEL_MASK                        0x0000000f
#define   ALG_ID_SEL_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 alg_id_sel:4;
        u32 key_size_sel:4;
        u32 du_size_sel:8;
        u32 rsvd_16:15;
        u32 cfg_en:1;
    } b;
} crypto_cfg0_reg_t;

#define CRYPTO_CFG1_REG                          0x00000104
#define   CFG_EN_104_MASK                        0x80000000
#define   CFG_EN_104_SHIFT                               31
#define   DU_SIZE_SEL_104_MASK                   0x0000ff00
#define   DU_SIZE_SEL_104_SHIFT                           8
#define   KEY_SIZE_SEL_104_MASK                  0x000000f0
#define   KEY_SIZE_SEL_104_SHIFT                          4
#define   ALG_ID_SEL_104_MASK                    0x0000000f
#define   ALG_ID_SEL_104_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 alg_id_sel_104:4;
        u32 key_size_sel_104:4;
        u32 du_size_sel_104:8;
        u32 rsvd_16:15;
        u32 cfg_en_104:1;
    } b;
} crypto_cfg1_reg_t;

#define CRYPTO_CFG2_REG                          0x00000108
#define   CFG_EN_108_MASK                        0x80000000
#define   CFG_EN_108_SHIFT                               31
#define   DU_SIZE_SEL_108_MASK                   0x0000ff00
#define   DU_SIZE_SEL_108_SHIFT                           8
#define   KEY_SIZE_SEL_108_MASK                  0x000000f0
#define   KEY_SIZE_SEL_108_SHIFT                          4
#define   ALG_ID_SEL_108_MASK                    0x0000000f
#define   ALG_ID_SEL_108_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 alg_id_sel_108:4;
        u32 key_size_sel_108:4;
        u32 du_size_sel_108:8;
        u32 rsvd_16:15;
        u32 cfg_en_108:1;
    } b;
} crypto_cfg2_reg_t;

#define CRYPTO_CFG3_REG                          0x0000010c
#define   CFG_EN_10c_MASK                        0x80000000
#define   CFG_EN_10c_SHIFT                               31
#define   DU_SIZE_SEL_10c_MASK                   0x0000ff00
#define   DU_SIZE_SEL_10c_SHIFT                           8
#define   KEY_SIZE_SEL_10c_MASK                  0x000000f0
#define   KEY_SIZE_SEL_10c_SHIFT                          4
#define   ALG_ID_SEL_10c_MASK                    0x0000000f
#define   ALG_ID_SEL_10c_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 alg_id_sel_10c:4;
        u32 key_size_sel_10c:4;
        u32 du_size_sel_10c:8;
        u32 rsvd_16:15;
        u32 cfg_en_10c:1;
    } b;
} crypto_cfg3_reg_t;

#define CRYPTO_SELFTEST_CFG_REG                  0x00000180
#define   ST_MODE_EN_MASK                        0x80000000
#define   ST_MODE_EN_SHIFT                               31
#define   ST_CLEAR_MASK                          0x00000002
#define   ST_CLEAR_SHIFT                                  1
#define   ST_START_TRIGGER_MASK                  0x00000001
#define   ST_START_TRIGGER_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 st_start_trigger:1;
        u32 st_clear:1;
        u32 rsvd_2:29;
        u32 st_mode_en:1;
    } b;
} crypto_selftest_cfg_reg_t;

#define CRYPTO_SELFTEST_CNT_REG                  0x00000184
#define   ST_CNT_VAL_MASK                        0x0000ffff
#define   ST_CNT_VAL_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 st_cnt_val:16;
        u32 rsvd_16:16;
    } b;
} crypto_selftest_cnt_reg_t;

#define CRYPTO_SELFTEST_STATUS_REG               0x00000188
#define   DU_CNT_REMAINING_MASK                  0xffff0000
#define   DU_CNT_REMAINING_SHIFT                         16
#define   DOUT_SIZE_ERR_MASK                     0x00000004
#define   DOUT_SIZE_ERR_SHIFT                             2
#define   DIN_SIZE_ERR_MASK                      0x00000002
#define   DIN_SIZE_ERR_SHIFT                              1
#define   FAIL_FLAG_MASK                         0x00000001
#define   FAIL_FLAG_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fail_flag:1;
        u32 din_size_err:1;
        u32 dout_size_err:1;
        u32 rsvd_3:13;
        u32 du_cnt_remaining:16;
    } b;
} crypto_selftest_status_reg_t;

#define CRYPTO_KEY_ADDR_REG                      0x00000200
#define   KEY_WRITE_VAL_MASK                     0xffffffff
#define   KEY_WRITE_VAL_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 key_write_val:32;
    } b;
} crypto_key_addr_reg_t;

#define CRYPTO_KEY_SEL_REG                       0x00000204
#define   INTERNAL_KEY_CNT_CLEARING_MASK         0x80000000
#define   INTERNAL_KEY_CNT_CLEARING_SHIFT                31
#define   PROG_DONE_MARK_CLEARING_MASK           0x40000000
#define   PROG_DONE_MARK_CLEARING_SHIFT                  30
#define   MEK_SRAM_INIT_MASK                     0x00010000
#define   MEK_SRAM_INIT_SHIFT                            16
#define   KEY_INDEX_SEL_MASK                     0x0000001f
#define   KEY_INDEX_SEL_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 key_index_sel:5;
        u32 rsvd_5:11;
        u32 mek_sram_init:1;
        u32 rsvd_17:13;
        u32 prog_done_mark_clearing:1;
        u32 internal_key_cnt_clearing:1;
    } b;
} crypto_key_sel_reg_t;

#define CRYPTO_KEY_ADDR_OFFSET_REG               0x00000208
#define   KEY_ADDR_OFFSET_MASK                   0x000001ff
#define   KEY_ADDR_OFFSET_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 key_addr_offset:9;
        u32 rsvd_9:23;
    } b;
} crypto_key_addr_offset_reg_t;

#define CRYPTO_KEY_PROG_DONE_REG                 0x0000020c
#define   KEY_PROG_DONE_MARK_MASK                0xffffffff
#define   KEY_PROG_DONE_MARK_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 key_prog_done_mark:32;
    } b;
} crypto_key_prog_done_reg_t;

#define CRYPTO_KEY_ECC_INFO_REG                  0x00000210
#define   ECC_SYNDROME_MASK                      0x03ff0000
#define   ECC_SYNDROME_SHIFT                             16
#define   ECC_SINGLE_BIT_PFIX_MASK               0x0000f000
#define   ECC_SINGLE_BIT_PFIX_SHIFT                      12
#define   ECC_SINGLE_BIT_FIX_MASK                0x00000f00
#define   ECC_SINGLE_BIT_FIX_SHIFT                        8
#define   ECC_DOUBLE_BIT_ERR_MASK                0x000000f0
#define   ECC_DOUBLE_BIT_ERR_SHIFT                        4
#define   ECC_SINGLE_BIT_ERR_MASK                0x0000000f
#define   ECC_SINGLE_BIT_ERR_SHIFT                        0
typedef union {
    u32 all;
    struct {
        u32 ecc_single_bit_err:4;
        u32 ecc_double_bit_err:4;
        u32 ecc_single_bit_fix:4;
        u32 ecc_single_bit_pfix:4;
        u32 ecc_syndrome:10;
        u32 rsvd_26:6;
    } b;
} crypto_key_ecc_info_reg_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ crypto_capability_reg_t crypto_capability_reg;
    /* 0x0004 */ crypto_capability0_reg_t crypto_capability0_reg;
    /* 0x0008 */ crypto_capability1_reg_t crypto_capability1_reg;
    /* 0x000c */ u32 rsvd_c [29];
    /* 0x0080 */ crypto_sys_cfg_reg_t crypto_sys_cfg_reg;
    /* 0x0084 */ u32 rsvd_84 [31];
    /* 0x0100 */ crypto_cfg0_reg_t crypto_cfg0_reg;
    /* 0x0104 */ crypto_cfg1_reg_t crypto_cfg1_reg;
    /* 0x0108 */ crypto_cfg2_reg_t crypto_cfg2_reg;
    /* 0x010c */ crypto_cfg3_reg_t crypto_cfg3_reg;
    /* 0x0110 */ u32 rsvd_110 [28];
    /* 0x0180 */ crypto_selftest_cfg_reg_t crypto_selftest_cfg_reg;
    /* 0x0184 */ crypto_selftest_cnt_reg_t crypto_selftest_cnt_reg;
    /* 0x0188 */ crypto_selftest_status_reg_t crypto_selftest_status_reg;
    /* 0x018c */ u32 rsvd_18c [29];
    /* 0x0200 */ crypto_key_addr_reg_t crypto_key_addr_reg;
    /* 0x0204 */ crypto_key_sel_reg_t crypto_key_sel_reg;
    /* 0x0208 */ crypto_key_addr_offset_reg_t crypto_key_addr_offset_reg;
    /* 0x020c */ crypto_key_prog_done_reg_t crypto_key_prog_done_reg;
    /* 0x0210 */ crypto_key_ecc_info_reg_t crypto_key_ecc_info_reg;
} ncb_crypto_regs_t;


#endif /* rev 1000 */