//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _NCB_TOP_WRAP_REG_REGISTER_H_
#define _NCB_TOP_WRAP_REG_REGISTER_H_

#define RAID_CTRL_REG0                           0x00000000
#define   NCB_RAID_ARB_BLK_NXTCW_SEL_MASK        0x10000000
#define   NCB_RAID_ARB_BLK_NXTCW_SEL_SHIFT               28
#define   NCB_RAID_ARB_RELS_CNT_MASK             0x0ff00000
#define   NCB_RAID_ARB_RELS_CNT_SHIFT                    20
#define   NCB_RAID_ARB_BLK_CNT_MASK              0x000ff000
#define   NCB_RAID_ARB_BLK_CNT_SHIFT                     12
#define   NCB_RAID_ARB_SWT_CMD_NUM_MASK          0x00000780
#define   NCB_RAID_ARB_SWT_CMD_NUM_SHIFT                  7
#define   NCB_RAID_ARB_XOR_CMD_NUM_MASK          0x00000078
#define   NCB_RAID_ARB_XOR_CMD_NUM_SHIFT                  3
#define   NCB_RAID_ARB_CORE_SEL_MASK             0x00000004
#define   NCB_RAID_ARB_CORE_SEL_SHIFT                     2
#define   NCB_RAID_ARB_DIS_MASK                  0x00000002
#define   NCB_RAID_ARB_DIS_SHIFT                          1
#define   NCB_RAID_EN_MASK                       0x00000001
#define   NCB_RAID_EN_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 ncb_raid_en:1;
        u32 ncb_raid_arb_dis:1;
        u32 ncb_raid_arb_core_sel:1;
        u32 ncb_raid_arb_xor_cmd_num:4;
        u32 ncb_raid_arb_swt_cmd_num:4;
        u32 rsvd_11:1;
        u32 ncb_raid_arb_blk_cnt:8;
        u32 ncb_raid_arb_rels_cnt:8;
        u32 ncb_raid_arb_blk_nxtcw_sel:1;
        u32 rsvd_29:3;
    } b;
} raid_ctrl_reg0_t;

#define NCB_DDR_BRDG_REG0                        0x00000004
#define   DDR_BRDG_PARITY_CHK_SEL_MASK           0x10000000
#define   DDR_BRDG_PARITY_CHK_SEL_SHIFT                  28
#define   DDR_BRDG_AXI_ID_MASK                   0x0f000000
#define   DDR_BRDG_AXI_ID_SHIFT                          24
#define   DDR_BRDG_MAX_AXI_RD_REQ_NUM_MASK       0x00f00000
#define   DDR_BRDG_MAX_AXI_RD_REQ_NUM_SHIFT              20
#define   DDR_BRDG_MAX_AXI_WR_REQ_NUM_MASK       0x000f0000
#define   DDR_BRDG_MAX_AXI_WR_REQ_NUM_SHIFT              16
#define   DDR_BRDG_MAX_AXI_RD_REQ_LEN_MASK       0x0000ff00
#define   DDR_BRDG_MAX_AXI_RD_REQ_LEN_SHIFT               8
#define   DDR_BRDG_MAX_AXI_WR_REQ_LEN_MASK       0x000000ff
#define   DDR_BRDG_MAX_AXI_WR_REQ_LEN_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 ddr_brdg_max_axi_wr_req_len:8;
        u32 ddr_brdg_max_axi_rd_req_len:8;
        u32 ddr_brdg_max_axi_wr_req_num:4;
        u32 ddr_brdg_max_axi_rd_req_num:4;
        u32 ddr_brdg_axi_id:4;
        u32 ddr_brdg_parity_chk_sel:1;
        u32 rsvd_29:3;
    } b;
} ncb_ddr_brdg_reg0_t;

#define NCB_DDR_BRDG_REG1                        0x00000008
#define   DDR_BRDG_STOP_AXI_IMMEDIATE_MASK       0x00007fff
#define   DDR_BRDG_STOP_AXI_IMMEDIATE_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 ddr_brdg_stop_axi_immediate:15;
        u32 rsvd_15:17;
    } b;
} ncb_ddr_brdg_reg1_t;

#define FSPM_DBG_REG0                            0x0000000c
#define   FSPM_INJECT_1BIT_ERR_MASK              0x000000f0
#define   FSPM_INJECT_1BIT_ERR_SHIFT                      4
#define   FSPM_ERR_INJECT_EN_MASK                0x0000000f
#define   FSPM_ERR_INJECT_EN_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 fspm_err_inject_en:4;
        u32 fspm_inject_1bit_err:4;
        u32 rsvd_8:24;
    } b;
} fspm_dbg_reg0_t;

#define NCB_WRAPPER_CTRL_REG0                    0x00000010
#define   NCB_SYS_SOFT_RST_MASK                  0x00000002
#define   NCB_SYS_SOFT_RST_SHIFT                          1
#define   NCB_EC_SOFT_RST_MASK                   0x00000001
#define   NCB_EC_SOFT_RST_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 ncb_ec_soft_rst:1;
        u32 ncb_sys_soft_rst:1;
        u32 rsvd_2:30;
    } b;
} ncb_wrapper_ctrl_reg0_t;

#define NCB_MEM_TIMING_CTRL_REG0                 0x00000020
#define   NCB_SHD1P_MB_WTSEL_MASK                0x30000000
#define   NCB_SHD1P_MB_WTSEL_SHIFT                       28
#define   NCB_SHD1P_MB_RTSEL_MASK                0x0c000000
#define   NCB_SHD1P_MB_RTSEL_SHIFT                       26
#define   NCB_HD1P_SB_WTSEL_MASK                 0x03000000
#define   NCB_HD1P_SB_WTSEL_SHIFT                        24
#define   NCB_HD1P_SB_RTSEL_MASK                 0x00c00000
#define   NCB_HD1P_SB_RTSEL_SHIFT                        22
#define   NCB_HD1P_MB_WTSEL_HVT_MASK             0x00300000
#define   NCB_HD1P_MB_WTSEL_HVT_SHIFT                    20
#define   NCB_HD1P_MB_RTSEL_HVT_MASK             0x000c0000
#define   NCB_HD1P_MB_RTSEL_HVT_SHIFT                    18
#define   NCB_HD1P_MB_WTSEL_SVT_MASK             0x00030000
#define   NCB_HD1P_MB_WTSEL_SVT_SHIFT                    16
#define   NCB_HD1P_MB_RTSEL_SVT_MASK             0x0000c000
#define   NCB_HD1P_MB_RTSEL_SVT_SHIFT                    14
#define   NCB_RF2P_KP_MASK                       0x00000700
#define   NCB_RF2P_KP_SHIFT                               8
#define   NCB_RF2P_WTSEL_MASK                    0x000000c0
#define   NCB_RF2P_WTSEL_SHIFT                            6
#define   NCB_RF2P_RTSEL_MASK                    0x00000030
#define   NCB_RF2P_RTSEL_SHIFT                            4
#define   NCB_RF1P_WTSEL_MASK                    0x0000000c
#define   NCB_RF1P_WTSEL_SHIFT                            2
#define   NCB_RF1P_RTSEL_MASK                    0x00000003
#define   NCB_RF1P_RTSEL_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 ncb_rf1p_rtsel:2;
        u32 ncb_rf1p_wtsel:2;
        u32 ncb_rf2p_rtsel:2;
        u32 ncb_rf2p_wtsel:2;
        u32 ncb_rf2p_kp:3;
        u32 rsvd_11:3;
        u32 ncb_hd1p_mb_rtsel_svt:2;
        u32 ncb_hd1p_mb_wtsel_svt:2;
        u32 ncb_hd1p_mb_rtsel_hvt:2;
        u32 ncb_hd1p_mb_wtsel_hvt:2;
        u32 ncb_hd1p_sb_rtsel:2;
        u32 ncb_hd1p_sb_wtsel:2;
        u32 ncb_shd1p_mb_rtsel:2;
        u32 ncb_shd1p_mb_wtsel:2;
        u32 rsvd_30:2;
    } b;
} ncb_mem_timing_ctrl_reg0_t;

#define NCB_MEM_TIMING_CTRL_REG1                 0x00000024
#define   NCB_UHD_RF2P_MTSEL_MASK                0x00300000
#define   NCB_UHD_RF2P_MTSEL_SHIFT                       20
#define   NCB_UHD_RF2P_WTSEL_MASK                0x000c0000
#define   NCB_UHD_RF2P_WTSEL_SHIFT                       18
#define   NCB_UHD_RF2P_RTSEL_MASK                0x00030000
#define   NCB_UHD_RF2P_RTSEL_SHIFT                       16
#define   NCB_UHD_RF1P_WTSEL_MASK                0x0000c000
#define   NCB_UHD_RF1P_WTSEL_SHIFT                       14
#define   NCB_UHD_RF1P_RTSEL_MASK                0x00003000
#define   NCB_UHD_RF1P_RTSEL_SHIFT                       12
#define   NCB_SRAM1P_WTSEL_MASK                  0x000000c0
#define   NCB_SRAM1P_WTSEL_SHIFT                          6
#define   NCB_SRAM1P_RTSEL_MASK                  0x00000030
#define   NCB_SRAM1P_RTSEL_SHIFT                          4
#define   NCB_SHD1P_SB_WTSEL_MASK                0x0000000c
#define   NCB_SHD1P_SB_WTSEL_SHIFT                        2
#define   NCB_SHD1P_SB_RTSEL_MASK                0x00000003
#define   NCB_SHD1P_SB_RTSEL_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ncb_shd1p_sb_rtsel:2;
        u32 ncb_shd1p_sb_wtsel:2;
        u32 ncb_sram1p_rtsel:2;
        u32 ncb_sram1p_wtsel:2;
        u32 rsvd_8:4;
        u32 ncb_uhd_rf1p_rtsel:2;
        u32 ncb_uhd_rf1p_wtsel:2;
        u32 ncb_uhd_rf2p_rtsel:2;
        u32 ncb_uhd_rf2p_wtsel:2;
        u32 ncb_uhd_rf2p_mtsel:2;
        u32 rsvd_22:10;
    } b;
} ncb_mem_timing_ctrl_reg1_t;

#define NCB_MEM_TIMING_CTRL_REG2                 0x00000028
#define   NCB_ROM_TM_MASK                        0x00000040
#define   NCB_ROM_TM_SHIFT                                6
#define   NCB_ROM_TRB_MASK                       0x00000030
#define   NCB_ROM_TRB_SHIFT                               4
#define   NCB_ROM_RTSEL_MASK                     0x0000000c
#define   NCB_ROM_RTSEL_SHIFT                             2
#define   NCB_ROM_PTSEL_MASK                     0x00000003
#define   NCB_ROM_PTSEL_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 ncb_rom_ptsel:2;
        u32 ncb_rom_rtsel:2;
        u32 ncb_rom_trb:2;
        u32 ncb_rom_tm:1;
        u32 rsvd_7:25;
    } b;
} ncb_mem_timing_ctrl_reg2_t;

#define RAID_ARB_DBG_REG0                        0x0000002c
#define   RAID_ARB_DBG_STATUS_MASK               0xffff0000
#define   RAID_ARB_DBG_STATUS_SHIFT                      16
#define   RAID_ARB_DBG_SEL_MASK                  0x0000ffff
#define   RAID_ARB_DBG_SEL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 raid_arb_dbg_sel:16;
        u32 raid_arb_dbg_status:16;
    } b;
} raid_arb_dbg_reg0_t;

#define DDR_BRIDGE_DBG_REG0                      0x00000030
#define   DDR_BRIDGE_DBG_STATUS_MASK             0xffff0000
#define   DDR_BRIDGE_DBG_STATUS_SHIFT                    16
#define   DDR_BRIDGE_DBG_SEL_MASK                0x0000ffff
#define   DDR_BRIDGE_DBG_SEL_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ddr_bridge_dbg_sel:16;
        u32 ddr_bridge_dbg_status:16;
    } b;
} ddr_bridge_dbg_reg0_t;

#define RAID_COMPL_DBG_REG0                      0x00000034
#define   RAID_COMPL_DBG_STATUS_MASK             0xffff0000
#define   RAID_COMPL_DBG_STATUS_SHIFT                    16
#define   RAID_COMPL_DBG_SEL_MASK                0x0000ffff
#define   RAID_COMPL_DBG_SEL_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 raid_compl_dbg_sel:16;
        u32 raid_compl_dbg_status:16;
    } b;
} raid_compl_dbg_reg0_t;

#define RAID_COMPL_QUE_BASE_ADDR                 0x00000040
#define   RAID_COMPL_QUE_ENTRY_MAX_SZ_MASK       0xff000000
#define   RAID_COMPL_QUE_ENTRY_MAX_SZ_SHIFT              24
#define   RAID_COMPL_QUE_BASE_ADDR_MASK          0x007fffff
#define   RAID_COMPL_QUE_BASE_ADDR_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 raid_compl_que_base_addr:23;
        u32 rsvd_23:1;
        u32 raid_compl_que_entry_max_sz:8;
    } b;
} raid_compl_que_base_addr_t;

#define RAID_COMPL_QUE_PTRS                      0x00000044
#define   RAID_COMPL_QUE_RD_PTR_MASK             0x0000ff00
#define   RAID_COMPL_QUE_RD_PTR_SHIFT                     8
#define   RAID_COMPL_QUE_WR_PTR_MASK             0x000000ff
#define   RAID_COMPL_QUE_WR_PTR_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 raid_compl_que_wr_ptr:8;
        u32 raid_compl_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} raid_compl_que_ptrs_t;

#define RAID_COMPL_QUE_WRPTR_BASE_ADDR           0x00000048
#define   RAID_COMPL_QUE_WRPTR_UPDT_EN_MASK      0x80000000
#define   RAID_COMPL_QUE_WRPTR_UPDT_EN_SHIFT             31
#define   RAID_COMPL_QUE_WRPTR_BASE_ADDR_MASK    0x007fffff
#define   RAID_COMPL_QUE_WRPTR_BASE_ADDR_SHIFT            0

typedef union {
    u32 all;
    struct {
        u32 raid_compl_que_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 raid_compl_que_wrptr_updt_en:1;
    } b;
} raid_compl_que_wrptr_base_addr_t;

#define RAID_COMPL_CTRL_REG0                     0x00000050
#define   NCB_RAID6_EN_MASK                      0x80000000
#define   NCB_RAID6_EN_SHIFT                             31
#define   RAID_COMPL_CTRL_EN_MASK                0x00000001
#define   RAID_COMPL_CTRL_EN_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 raid_compl_ctrl_en:1;
        u32 rsvd_1:30;
        u32 ncb_raid6_en:1;
    } b;
} raid_compl_ctrl_reg0_t;

#define RAID_COMPL_CTRL_REG1                     0x00000054
#define   SET_LAST_FLAG_MASK                     0x80000000
#define   SET_LAST_FLAG_SHIFT                            31
#define   CLEAR_LAST_FLAG_MASK                   0x40000000
#define   CLEAR_LAST_FLAG_SHIFT                          30
#define   ADD_NUM_OPS_MASK                       0x20000000
#define   ADD_NUM_OPS_SHIFT                              29
#define   RESET_OPS_MASK                         0x10000000
#define   RESET_OPS_SHIFT                                28
#define   DIRECT_SET_INTERNAL_CNT_MASK           0x02000000
#define   DIRECT_SET_INTERNAL_CNT_SHIFT                  25
#define   DIRECT_SET_EXPECTED_CNT_MASK           0x01000000
#define   DIRECT_SET_EXPECTED_CNT_SHIFT                  24
#define   RAID_ID_SEL_MASK                       0x003f0000
#define   RAID_ID_SEL_SHIFT                              16
#define   W_DU_CNT_MASK                          0x00001fff
#define   W_DU_CNT_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 w_du_cnt:13;
        u32 rsvd_13:3;
        u32 raid_id_sel:6;
        u32 rsvd_22:2;
        u32 direct_set_expected_cnt:1;
        u32 direct_set_internal_cnt:1;
        u32 rsvd_26:2;
        u32 reset_ops:1;
        u32 add_num_ops:1;
        u32 clear_last_flag:1;
        u32 set_last_flag:1;
    } b;
} raid_compl_ctrl_reg1_t;

#define RAID_COMPL_STATUS_REG0                   0x00000058
#define   RAID_ID_LAST_FLAG_MASK                 0x80000000
#define   RAID_ID_LAST_FLAG_SHIFT                        31
#define   BUSY_FLAG_MASK                         0x40000000
#define   BUSY_FLAG_SHIFT                                30
#define   EXPECTED_DU_NUM_VAL_MASK               0x1fff0000
#define   EXPECTED_DU_NUM_VAL_SHIFT                      16
#define   COMPLETED_DU_CNT_VAL_MASK              0x00001fff
#define   COMPLETED_DU_CNT_VAL_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 completed_du_cnt_val:13;
        u32 rsvd_13:3;
        u32 expected_du_num_val:13;
        u32 rsvd_29:1;
        u32 busy_flag:1;
        u32 raid_id_last_flag:1;
    } b;
} raid_compl_status_reg0_t;

#define RAID_TOP_WRAP_INT_STATUS_REG             0x00000060
#define   RAID_COMPL_INVALID_ADD_OPS_STATUS_MASK 0x00000002
#define   RAID_COMPL_INVALID_ADD_OPS_STATUS_SHIFT          1
#define   RAID_COMPL_INT_STATUS_MASK             0x00000001
#define   RAID_COMPL_INT_STATUS_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 raid_compl_int_status:1;
        u32 raid_compl_invalid_add_ops_status:1;
        u32 rsvd_2:30;
    } b;
} raid_top_wrap_int_status_reg_t;

#define RAID_TOP_WRAP_INT_EN_REG                 0x00000064
#define   RAID_COMPL_INVALID_ADD_OPS_INT_EN_MASK 0x00000002
#define   RAID_COMPL_INVALID_ADD_OPS_INT_EN_SHIFT          1
#define   RAID_COMPL_INT_EN_MASK                 0x00000001
#define   RAID_COMPL_INT_EN_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 raid_compl_int_en:1;
        u32 raid_compl_invalid_add_ops_int_en:1;
        u32 rsvd_2:30;
    } b;
} raid_top_wrap_int_en_reg_t;

#define RAID_TOP_WRAP_INT_MASK_REG               0x00000068
#define   RAIDC_INVALID_ADD_OPS_INT_MASK_CPU3_MASK 0x02000000
#define   RAIDC_INVALID_ADD_OPS_INT_MASK_CPU3_SHIFT         25
#define   RAIDC_INT_MASK_CPU3_MASK               0x01000000
#define   RAIDC_INT_MASK_CPU3_SHIFT                      24
#define   RAIDC_INVALID_ADD_OPS_INT_MASK_CPU2_MASK 0x00020000
#define   RAIDC_INVALID_ADD_OPS_INT_MASK_CPU2_SHIFT         17
#define   RAIDC_INT_MASK_CPU2_MASK               0x00010000
#define   RAIDC_INT_MASK_CPU2_SHIFT                      16
#define   RAIDC_INVALID_ADD_OPS_INT_MASK_CPU1_MASK 0x00000200
#define   RAIDC_INVALID_ADD_OPS_INT_MASK_CPU1_SHIFT          9
#define   RAIDC_INT_MASK_CPU1_MASK               0x00000100
#define   RAIDC_INT_MASK_CPU1_SHIFT                       8
#define   RAIDC_INVALID_ADD_OPS_INT_MASK_CPU0_MASK 0x00000002
#define   RAIDC_INVALID_ADD_OPS_INT_MASK_CPU0_SHIFT          1
#define   RAIDC_INT_MASK_CPU0_MASK               0x00000001
#define   RAIDC_INT_MASK_CPU0_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 raidc_int_mask_cpu0:1;
        u32 raidc_invalid_add_ops_int_mask_cpu0:1;
        u32 rsvd_2:6;
        u32 raidc_int_mask_cpu1:1;
        u32 raidc_invalid_add_ops_int_mask_cpu1:1;
        u32 rsvd_10:6;
        u32 raidc_int_mask_cpu2:1;
        u32 raidc_invalid_add_ops_int_mask_cpu2:1;
        u32 rsvd_18:6;
        u32 raidc_int_mask_cpu3:1;
        u32 raidc_invalid_add_ops_int_mask_cpu3:1;
        u32 rsvd_26:6;
    } b;
} raid_top_wrap_int_mask_reg_t;

#define RAID_TOP_WRAP_INT_CPU_SEL_REG            0x0000006c
#define   INT_CPU_SEL_MASK                       0x0000000f
#define   INT_CPU_SEL_SHIFT                               0
typedef union {
    u32 all;
    struct {
        u32 int_cpu_sel:4;
        u32 rsvd_4:28;
    } b;
} raid_top_wrap_int_cpu_sel_reg_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ raid_ctrl_reg0_t raid_ctrl_reg0;
    /* 0x0004 */ ncb_ddr_brdg_reg0_t ncb_ddr_brdg_reg0;
    /* 0x0008 */ ncb_ddr_brdg_reg1_t ncb_ddr_brdg_reg1;
    /* 0x000c */ fspm_dbg_reg0_t fspm_dbg_reg0;
    /* 0x0010 */ ncb_wrapper_ctrl_reg0_t ncb_wrapper_ctrl_reg0;
    /* 0x0014 */ u32 rsvd_14 [3];
    /* 0x0020 */ ncb_mem_timing_ctrl_reg0_t ncb_mem_timing_ctrl_reg0;
    /* 0x0024 */ ncb_mem_timing_ctrl_reg1_t ncb_mem_timing_ctrl_reg1;
    /* 0x0028 */ ncb_mem_timing_ctrl_reg2_t ncb_mem_timing_ctrl_reg2;
    /* 0x002c */ raid_arb_dbg_reg0_t raid_arb_dbg_reg0;
    /* 0x0030 */ ddr_bridge_dbg_reg0_t ddr_bridge_dbg_reg0;
    /* 0x0034 */ raid_compl_dbg_reg0_t raid_compl_dbg_reg0;
    /* 0x0038 */ u32 rsvd_38 [2];
    /* 0x0040 */ raid_compl_que_base_addr_t raid_compl_que_base_addr;
    /* 0x0044 */ raid_compl_que_ptrs_t raid_compl_que_ptrs;
    /* 0x0048 */ raid_compl_que_wrptr_base_addr_t raid_compl_que_wrptr_base_addr;
    /* 0x004c */ u32 rsvd_4c;
    /* 0x0050 */ raid_compl_ctrl_reg0_t raid_compl_ctrl_reg0;
    /* 0x0054 */ raid_compl_ctrl_reg1_t raid_compl_ctrl_reg1;
    /* 0x0058 */ raid_compl_status_reg0_t raid_compl_status_reg0;
    /* 0x005c */ u32 rsvd_5c;
    /* 0x0060 */ raid_top_wrap_int_status_reg_t raid_top_wrap_int_status_reg;
    /* 0x0064 */ raid_top_wrap_int_en_reg_t raid_top_wrap_int_en_reg;
    /* 0x0068 */ raid_top_wrap_int_mask_reg_t raid_top_wrap_int_mask_reg;
    /* 0x006c */ raid_top_wrap_int_cpu_sel_reg_t raid_top_wrap_int_cpu_sel_reg;
} ncb_top_wrap_reg_regs_t;


#endif /* rev 1002 */