//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _NCB_FICU_REGISTER_H_
#define _NCB_FICU_REGISTER_H_

#define FICU_CTRL_REG0                           0x00000000
#define   FICU_ARD_MODE_MASK                     0x30000000
#define   FICU_ARD_MODE_SHIFT                            28
#define   FICU_DU_LOGS_FIFO_EN_MASK              0x08000000
#define   FICU_DU_LOGS_FIFO_EN_SHIFT                     27
#define   FICU_RAID_EN_MASK                      0x04000000
#define   FICU_RAID_EN_SHIFT                             26
#define   FICU_AXI_ACTIVE_REQ_NUM_MASK           0x03c00000
#define   FICU_AXI_ACTIVE_REQ_NUM_SHIFT                  22
#define   FICU_FINST_INFO_PTR_EARLY_RELS_MASK    0x00020000
#define   FICU_FINST_INFO_PTR_EARLY_RELS_SHIFT           17
#define   FICU_FCMD_CQ_LOC_SEL_MASK              0x00010000
#define   FICU_FCMD_CQ_LOC_SEL_SHIFT                     16
#define   FICU_BUSY_MASK                         0x00008000
#define   FICU_BUSY_SHIFT                                15
#define   FICU_FSPM_INIT_MASK                    0x00004000
#define   FICU_FSPM_INIT_SHIFT                           14
#define   FICU_RAIDM_BLK_NUM_MODE_MASK           0x00002000
#define   FICU_RAIDM_BLK_NUM_MODE_SHIFT                  13
#define   FICU_FINST_FMT_SEL_MASK                0x00001000
#define   FICU_FINST_FMT_SEL_SHIFT                       12
#define   FICU_QOS_MGMT_EN_MASK                  0x00000800
#define   FICU_QOS_MGMT_EN_SHIFT                         11
#define   FICU_HALT_ON_INTF_WR_ERR_MASK          0x00000200
#define   FICU_HALT_ON_INTF_WR_ERR_SHIFT                  9
#define   FICU_HALT_ON_INTF_RD_ERR_MASK          0x00000100
#define   FICU_HALT_ON_INTF_RD_ERR_SHIFT                  8
#define   FICU_ABORT_MODE_MASK                   0x000000c0
#define   FICU_ABORT_MODE_SHIFT                           6
#define   FICU_REG_RD_MODE_SEL_MASK              0x00000004
#define   FICU_REG_RD_MODE_SEL_SHIFT                      2
#define   FICU_FORCE_CLK_EN_MASK                 0x00000002
#define   FICU_FORCE_CLK_EN_SHIFT                         1
#define   FICU_ENABLE_MASK                       0x00000001
#define   FICU_ENABLE_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 ficu_enable:1;
        u32 ficu_force_clk_en:1;
        u32 ficu_reg_rd_mode_sel:1;
        u32 rsvd_3:3;
        u32 ficu_abort_mode:2;
        u32 ficu_halt_on_intf_rd_err:1;
        u32 ficu_halt_on_intf_wr_err:1;
        u32 rsvd_10:1;
        u32 ficu_qos_mgmt_en:1;
        u32 ficu_finst_fmt_sel:1;
        u32 ficu_raidm_blk_num_mode:1;
        u32 ficu_fspm_init:1;
        u32 ficu_busy:1;
        u32 ficu_fcmd_cq_loc_sel:1;
        u32 ficu_finst_info_ptr_early_rels:1;
        u32 rsvd_18:4;
        u32 ficu_axi_active_req_num:4;
        u32 ficu_raid_en:1;
        u32 ficu_du_logs_fifo_en:1;
        u32 ficu_ard_mode:2;
        u32 rsvd_30:2;
    } b;
} ficu_ctrl_reg0_t;

#define FICU_CTRL_REG1                           0x00000004
#define   FICU_LUT_CFG_SEL_MASK                  0xe0000000
#define   FICU_LUT_CFG_SEL_SHIFT                         29
#define   FICU_TOT_FINST_NUM_LMT_MASK            0x00ff0000
#define   FICU_TOT_FINST_NUM_LMT_SHIFT                   16
#define   FICU_ACTIVE_FCMD_NUM_MASK              0x000000ff
#define   FICU_ACTIVE_FCMD_NUM_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 ficu_active_fcmd_num:8;
        u32 rsvd_8:8;
        u32 ficu_tot_finst_num_lmt:8;
        u32 rsvd_24:5;
        u32 ficu_lut_cfg_sel:3;
    } b;
} ficu_ctrl_reg1_t;

#define FICU_INT_EN_REG0                         0x00000008
#define   FICU_NO_DQS_ERR_EN_MASK                0x00002000
#define   FICU_NO_DQS_ERR_EN_SHIFT                       13
#define   FICU_ARD_FIFO_ERR_EN_MASK              0x00001000
#define   FICU_ARD_FIFO_ERR_EN_SHIFT                     12
#define   FICU_LST_LLRM_DONE_EN_MASK             0x00000800
#define   FICU_LST_LLRM_DONE_EN_SHIFT                    11
#define   FICU_IF_RW_ERR_EN_MASK                 0x00000400
#define   FICU_IF_RW_ERR_EN_SHIFT                        10
#define   FICU_FCMD_GRP1_CQ_DONE_EN_MASK         0x00000040
#define   FICU_FCMD_GRP1_CQ_DONE_EN_SHIFT                 6
#define   FICU_FCMD_GRP0_CQ_DONE_EN_MASK         0x00000020
#define   FICU_FCMD_GRP0_CQ_DONE_EN_SHIFT                 5
#define   FICU_FINST_ERR_EN_MASK                 0x00000010
#define   FICU_FINST_ERR_EN_SHIFT                         4
#define   FICU_SQ_GRP1_FCMD_ERR_EN_MASK          0x00000004
#define   FICU_SQ_GRP1_FCMD_ERR_EN_SHIFT                  2
#define   FICU_SQ_GRP0_FCMD_ERR_EN_MASK          0x00000002
#define   FICU_SQ_GRP0_FCMD_ERR_EN_SHIFT                  1
#define   FICU_FSPM_FCMD_CQ_DONE_EN_MASK         0x00000001
#define   FICU_FSPM_FCMD_CQ_DONE_EN_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_fcmd_cq_done_en:1;
        u32 ficu_sq_grp0_fcmd_err_en:1;
        u32 ficu_sq_grp1_fcmd_err_en:1;
        u32 rsvd_3:1;
        u32 ficu_finst_err_en:1;
        u32 ficu_fcmd_grp0_cq_done_en:1;
        u32 ficu_fcmd_grp1_cq_done_en:1;
        u32 rsvd_7:3;
        u32 ficu_if_rw_err_en:1;
        u32 ficu_lst_llrm_done_en:1;
        u32 ficu_ard_fifo_err_en:1;
        u32 ficu_no_dqs_err_en:1;
        u32 rsvd_14:18;
    } b;
} ficu_int_en_reg0_t;

#define FICU_INT_STATUS_REG0                     0x0000000c
#define   FICU_NO_DQS_ERR_INT_MASK               0x00002000
#define   FICU_NO_DQS_ERR_INT_SHIFT                      13
#define   FICU_ARD_FIFO_ERR_INT_MASK             0x00001000
#define   FICU_ARD_FIFO_ERR_INT_SHIFT                    12
#define   FICU_LST_LLRM_DONE_INT_MASK            0x00000800
#define   FICU_LST_LLRM_DONE_INT_SHIFT                   11
#define   FICU_IF_RW_ERR_INT_MASK                0x00000400
#define   FICU_IF_RW_ERR_INT_SHIFT                       10
#define   FICU_FCMD_GRP1_CQ_DONE_INT_MASK        0x00000040
#define   FICU_FCMD_GRP1_CQ_DONE_INT_SHIFT                6
#define   FICU_FCMD_GRP0_CQ_DONE_INT_MASK        0x00000020
#define   FICU_FCMD_GRP0_CQ_DONE_INT_SHIFT                5
#define   FICU_FINST_ERR_INT_MASK                0x00000010
#define   FICU_FINST_ERR_INT_SHIFT                        4
#define   FICU_SQ_GRP1_FCMD_ERR_INT_MASK         0x00000004
#define   FICU_SQ_GRP1_FCMD_ERR_INT_SHIFT                 2
#define   FICU_SQ_GRP0_FCMD_ERR_INT_MASK         0x00000002
#define   FICU_SQ_GRP0_FCMD_ERR_INT_SHIFT                 1
#define   FICU_FSPM_FCMD_CQ_DONE_INT_MASK        0x00000001
#define   FICU_FSPM_FCMD_CQ_DONE_INT_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_fcmd_cq_done_int:1;
        u32 ficu_sq_grp0_fcmd_err_int:1;
        u32 ficu_sq_grp1_fcmd_err_int:1;
        u32 rsvd_3:1;
        u32 ficu_finst_err_int:1;
        u32 ficu_fcmd_grp0_cq_done_int:1;
        u32 ficu_fcmd_grp1_cq_done_int:1;
        u32 rsvd_7:3;
        u32 ficu_if_rw_err_int:1;
        u32 ficu_lst_llrm_done_int:1;
        u32 ficu_ard_fifo_err_int:1;
        u32 ficu_no_dqs_err_int:1;
        u32 rsvd_14:18;
    } b;
} ficu_int_status_reg0_t;

#define FICU_INT_SRC_REG                         0x00000010
#define   FICU_NO_DQS_ERR_MASK                   0x00002000
#define   FICU_NO_DQS_ERR_SHIFT                          13
#define   FICU_ARD_FIFO_ERR_MASK                 0x00001000
#define   FICU_ARD_FIFO_ERR_SHIFT                        12
#define   FICU_LST_BIN_DONE_MASK                 0x00000800
#define   FICU_LST_BIN_DONE_SHIFT                        11
#define   FICU_IF_RW_ERR_MASK                    0x00000400
#define   FICU_IF_RW_ERR_SHIFT                           10
#define   FICU_FCMD_GRP1_CQ_DONE_MASK            0x00000040
#define   FICU_FCMD_GRP1_CQ_DONE_SHIFT                    6
#define   FICU_FCMD_GRP0_CQ_DONE_MASK            0x00000020
#define   FICU_FCMD_GRP0_CQ_DONE_SHIFT                    5
#define   FICU_FINST_ERR_MASK                    0x00000010
#define   FICU_FINST_ERR_SHIFT                            4
#define   RVD_MASK                               0x00000008
#define   RVD_SHIFT                                       3
#define   FICU_SQ_GRP1_FCMD_ERR_MASK             0x00000004
#define   FICU_SQ_GRP1_FCMD_ERR_SHIFT                     2
#define   FICU_SQ_GRP0_FCMD_ERR_MASK             0x00000002
#define   FICU_SQ_GRP0_FCMD_ERR_SHIFT                     1
#define   FICU_FSPM_FCMD_CQ_DONE_MASK            0x00000001
#define   FICU_FSPM_FCMD_CQ_DONE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_fcmd_cq_done:1;
        u32 ficu_sq_grp0_fcmd_err:1;
        u32 ficu_sq_grp1_fcmd_err:1;
        u32 rvd:1;
        u32 ficu_finst_err:1;
        u32 ficu_fcmd_grp0_cq_done:1;
        u32 ficu_fcmd_grp1_cq_done:1;
        u32 rsvd_7:3;
        u32 ficu_if_rw_err:1;
        u32 ficu_lst_bin_done:1;
        u32 ficu_ard_fifo_err:1;
        u32 ficu_no_dqs_err:1;
        u32 rsvd_14:18;
    } b;
} ficu_int_src_reg_t;

#define FICU_STATUS_REG0                         0x00000014
#define   FICU_IF_ERR_FLAG_MASK                  0xfc000000
#define   FICU_IF_ERR_FLAG_SHIFT                         26
#define   FICU_FINST_ERR_CODE_MASK               0x01f00000
#define   FICU_FINST_ERR_CODE_SHIFT                      20
#define   FICU_PROC_FINST_CNT_MASK               0x000ffc00
#define   FICU_PROC_FINST_CNT_SHIFT                      10
#define   FICU_DONE_FINST_CNT_MASK               0x000003ff
#define   FICU_DONE_FINST_CNT_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ficu_done_finst_cnt:10;
        u32 ficu_proc_finst_cnt:10;
        u32 ficu_finst_err_code:5;
        u32 rsvd_25:1;
        u32 ficu_if_err_flag:6;
    } b;
} ficu_status_reg0_t;

#define FICU_STATUS_REG1                         0x00000018
#define   FICU_NF_ERR_MASK                       0x80000000
#define   FICU_NF_ERR_SHIFT                              31
#define   FICU_EC_ERR_MASK                       0x40000000
#define   FICU_EC_ERR_SHIFT                              30
#define   FICU_EC_ERR_D0E1_MASK                  0x20000000
#define   FICU_EC_ERR_D0E1_SHIFT                         29
#define   FICU_ARD_ERR_MASK                      0x10000000
#define   FICU_ARD_ERR_SHIFT                             28
#define   FICU_RAID_SWITCH_ERR_MASK              0x08000000
#define   FICU_RAID_SWITCH_ERR_SHIFT                     27
#define   FICU_ERR_VSC_EN_MASK                   0x04000000
#define   FICU_ERR_VSC_EN_SHIFT                          26
#define   FICU_ERR_NDCMD_FMT_SEL_MASK            0x03f80000
#define   FICU_ERR_NDCMD_FMT_SEL_SHIFT                   19
#define   FICU_ERR_TLC_EN_MASK                   0x00040000
#define   FICU_ERR_TLC_EN_SHIFT                          18
#define   FICU_ERR_FCMD_ID_MASK                  0x00000fff
#define   FICU_ERR_FCMD_ID_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ficu_err_fcmd_id:12;
        u32 rsvd_12:6;
        u32 ficu_err_tlc_en:1;
        u32 ficu_err_ndcmd_fmt_sel:7;
        u32 ficu_err_vsc_en:1;
        u32 ficu_raid_switch_err:1;
        u32 ficu_ard_err:1;
        u32 ficu_ec_err_d0e1:1;
        u32 ficu_ec_err:1;
        u32 ficu_nf_err:1;
    } b;
} ficu_status_reg1_t;

#define FICU_STATUS_REG2                         0x0000001c
#define   FICU_ERR_DU_ID_MASK                    0xe0000000
#define   FICU_ERR_DU_ID_SHIFT                           29
#define   FICU_ERR_FINST_STATUS_MASK             0x0ffffc00
#define   FICU_ERR_FINST_STATUS_SHIFT                    10
#define   FICU_ERR_FINST_ID_MASK                 0x000003ff
#define   FICU_ERR_FINST_ID_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 ficu_err_finst_id:10;
        u32 ficu_err_finst_status:18;
        u32 rsvd_28:1;
        u32 ficu_err_du_id:3;
    } b;
} ficu_status_reg2_t;

#define FICU_STATUS_REG3                         0x00000020
#define   FICU_ERR_CH_ID_MASK                    0xf0000000
#define   FICU_ERR_CH_ID_SHIFT                           28
#define   FICU_ERR_DEV_ID_MASK                   0x0f000000
#define   FICU_ERR_DEV_ID_SHIFT                          24
#define   FICU_ERR_VOL_SEL_MASK                  0x00f00000
#define   FICU_ERR_VOL_SEL_SHIFT                         20
#define   FICU_ERR_DU_MP_ID_MASK                 0x000f0000
#define   FICU_ERR_DU_MP_ID_SHIFT                        16
#define   FICU_ERR_FINST_COL_ADDR_MASK           0x0000ffff
#define   FICU_ERR_FINST_COL_ADDR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 ficu_err_finst_col_addr:16;
        u32 ficu_err_du_mp_id:4;
        u32 ficu_err_vol_sel:4;
        u32 ficu_err_dev_id:4;
        u32 ficu_err_ch_id:4;
    } b;
} ficu_status_reg3_t;

#define FICU_STATUS_REG4                         0x00000024
#define   FICU_ERR_FINST_ROW_ADDR_MASK           0xffffffff
#define   FICU_ERR_FINST_ROW_ADDR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 ficu_err_finst_row_addr:32;
    } b;
} ficu_status_reg4_t;

#define FICU_STATUS_REG5                         0x00000028
#define   FICU_ERR_FINST_RAID_ID_MASK            0x00003f00
#define   FICU_ERR_FINST_RAID_ID_SHIFT                    8
#define   FICU_ERR_FINST_RAID_SRAM_BANK_ID_MASK  0x000000e0
#define   FICU_ERR_FINST_RAID_SRAM_BANK_ID_SHIFT          5
#define   FICU_ERR_FINST_RAID_CMD_MASK           0x0000001f
#define   FICU_ERR_FINST_RAID_CMD_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 ficu_err_finst_raid_cmd:5;
        u32 ficu_err_finst_raid_sram_bank_id:3;
        u32 ficu_err_finst_raid_id:6;
        u32 rsvd_14:18;
    } b;
} ficu_status_reg5_t;

#define FICU_STATUS_REG6                         0x0000002c
#define   FICU_ERR_FINST_RAID_STATUS_MASK        0x00ffffff
#define   FICU_ERR_FINST_RAID_STATUS_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 ficu_err_finst_raid_status:24;
        u32 rsvd_24:8;
    } b;
} ficu_status_reg6_t;

#define FICU_LUT_ST_ADDR_REG                     0x00000054
#define   FICU_LUT_ST_ADDR_MASK                  0xffffffff
#define   FICU_LUT_ST_ADDR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ficu_lut_st_addr:32;
    } b;
} ficu_lut_st_addr_reg_t;

#define FICU_LUT_END_ADDR_REG                    0x00000058
#define   FICU_LUT_END_ADDR_MASK                 0xffffffff
#define   FICU_LUT_END_ADDR_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 ficu_lut_end_addr:32;
    } b;
} ficu_lut_end_addr_reg_t;

#define FICU_ERD_PARA_FIFO_ST_ADDR_REG           0x0000005c
#define   FICU_ERD_PARA_FIFO_ST_ADDR_MASK        0xffffffff
#define   FICU_ERD_PARA_FIFO_ST_ADDR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 ficu_erd_para_fifo_st_addr:32;
    } b;
} ficu_erd_para_fifo_st_addr_reg_t;

#define FICU_ERD_PARA_FIFO_END_ADDR_REG          0x00000060
#define   FICU_ERD_PARA_FIFO_END_ADDR_MASK       0xffffffff
#define   FICU_ERD_PARA_FIFO_END_ADDR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 ficu_erd_para_fifo_end_addr:32;
    } b;
} ficu_erd_para_fifo_end_addr_reg_t;

#define FICU_ERD_PARA_FIFO_PTR_REG               0x00000064
#define   FICU_ERD_PARA_FIFO_PTR_MASK            0xffffffff
#define   FICU_ERD_PARA_FIFO_PTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ficu_erd_para_fifo_ptr:32;
    } b;
} ficu_erd_para_fifo_ptr_reg_t;

#define FICU_DU_LOGS_FIFO_ST_ADDR_REG            0x00000074
#define   FICU_DU_LOGS_FIFO_ST_ADDR_MASK         0xffffffff
#define   FICU_DU_LOGS_FIFO_ST_ADDR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 ficu_du_logs_fifo_st_addr:32;
    } b;
} ficu_du_logs_fifo_st_addr_reg_t;

#define FICU_DU_LOGS_FIFO_END_ADDR_REG           0x00000078
#define   FICU_DU_LOGS_FIFO_END_ADDR_MASK        0xffffffff
#define   FICU_DU_LOGS_FIFO_END_ADDR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 ficu_du_logs_fifo_end_addr:32;
    } b;
} ficu_du_logs_fifo_end_addr_reg_t;

#define FICU_DU_LOGS_FIFO_PTR_REG                0x0000007c
#define   FICU_DU_LGOS_FIFO_PTR_MASK             0xffffffff
#define   FICU_DU_LGOS_FIFO_PTR_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ficu_du_lgos_fifo_ptr:32;
    } b;
} ficu_du_logs_fifo_ptr_reg_t;

#define FICU_GET_PARAM_FIFO_ST_ADDR_REG          0x00000080
#define   FICU_GET_PARAM_FIFO_ST_ADDR_MASK       0xffffffff
#define   FICU_GET_PARAM_FIFO_ST_ADDR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 ficu_get_param_fifo_st_addr:32;
    } b;
} ficu_get_param_fifo_st_addr_reg_t;

#define FICU_GET_PARAM_FIFO_END_ADDR_REG         0x00000084
#define   FICU_GET_PARAM_FIFO_END_ADDR_MASK      0xffffffff
#define   FICU_GET_PARAM_FIFO_END_ADDR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 ficu_get_param_fifo_end_addr:32;
    } b;
} ficu_get_param_fifo_end_addr_reg_t;

#define FICU_GET_PARAM_FIFO_PTR_REG              0x00000088
#define   FICU_GET_PARAM_FIFO_PTR_MASK           0xffffffff
#define   FICU_GET_PARAM_FIFO_PTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 ficu_get_param_fifo_ptr:32;
    } b;
} ficu_get_param_fifo_ptr_reg_t;

#define FICU_ARD_CONF_REG0                       0x0000008c
#define   FICU_ARD_TMPL_BASE_ADDR_MASK           0xffffffff
#define   FICU_ARD_TMPL_BASE_ADDR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 ficu_ard_tmpl_base_addr:32;
    } b;
} ficu_ard_conf_reg0_t;

#define FICU_ARD_CONF_REG1                       0x00000090
#define   FICU_ARD_TMPL0_OFFSET_ADDR_MASK        0xffff0000
#define   FICU_ARD_TMPL0_OFFSET_ADDR_SHIFT               16
#define   FICU_ARD_TMPL0_LOOP_MASK               0x0000001f
#define   FICU_ARD_TMPL0_LOOP_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ficu_ard_tmpl0_loop:5;
        u32 rsvd_5:11;
        u32 ficu_ard_tmpl0_offset_addr:16;
    } b;
} ficu_ard_conf_reg1_t;

#define FICU_ARD_CONF_REG2                       0x00000094
#define   FICU_ARD_TMPL1_OFFSET_ADDR_MASK        0xffff0000
#define   FICU_ARD_TMPL1_OFFSET_ADDR_SHIFT               16
#define   FICU_ARD_TMPL1_LOOP_MASK               0x0000001f
#define   FICU_ARD_TMPL1_LOOP_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ficu_ard_tmpl1_loop:5;
        u32 rsvd_5:11;
        u32 ficu_ard_tmpl1_offset_addr:16;
    } b;
} ficu_ard_conf_reg2_t;

#define FICU_ARD_CONF_REG3                       0x00000098
#define   FICU_ARD_TMPL2_OFFSET_ADDR_MASK        0xffff0000
#define   FICU_ARD_TMPL2_OFFSET_ADDR_SHIFT               16
#define   FICU_ARD_TMPL2_LOOP_MASK               0x0000001f
#define   FICU_ARD_TMPL2_LOOP_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ficu_ard_tmpl2_loop:5;
        u32 rsvd_5:11;
        u32 ficu_ard_tmpl2_offset_addr:16;
    } b;
} ficu_ard_conf_reg3_t;

#define FICU_ARD_CONF_REG4                       0x0000009c
#define   FICU_ARD_TMPL3_OFFSET_ADDR_MASK        0xffff0000
#define   FICU_ARD_TMPL3_OFFSET_ADDR_SHIFT               16
#define   FICU_ARD_TMPL3_LOOP_MASK               0x0000001f
#define   FICU_ARD_TMPL3_LOOP_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ficu_ard_tmpl3_loop:5;
        u32 rsvd_5:11;
        u32 ficu_ard_tmpl3_offset_addr:16;
    } b;
} ficu_ard_conf_reg4_t;

#define FICU_ARD_CONF_REG5                       0x000000a0
#define   FICU_ARD_TMPL4_OFFSET_ADDR_MASK        0xffff0000
#define   FICU_ARD_TMPL4_OFFSET_ADDR_SHIFT               16
#define   FICU_ARD_TMPL4_LOOP_MASK               0x0000001f
#define   FICU_ARD_TMPL4_LOOP_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ficu_ard_tmpl4_loop:5;
        u32 rsvd_5:11;
        u32 ficu_ard_tmpl4_offset_addr:16;
    } b;
} ficu_ard_conf_reg5_t;

#define FICU_ARD_CONF_REG6                       0x000000a4
#define   FICU_ARD_TMPL5_OFFSET_ADDR_MASK        0xffff0000
#define   FICU_ARD_TMPL5_OFFSET_ADDR_SHIFT               16
#define   FICU_ARD_TMPL5_LOOP_MASK               0x0000001f
#define   FICU_ARD_TMPL5_LOOP_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ficu_ard_tmpl5_loop:5;
        u32 rsvd_5:11;
        u32 ficu_ard_tmpl5_offset_addr:16;
    } b;
} ficu_ard_conf_reg6_t;

#define FICU_ARD_CONF_REG7                       0x000000a8
#define   FICU_ARD_TMPL6_OFFSET_ADDR_MASK        0xffff0000
#define   FICU_ARD_TMPL6_OFFSET_ADDR_SHIFT               16
#define   FICU_ARD_TMPL6_LOOP_MASK               0x0000001f
#define   FICU_ARD_TMPL6_LOOP_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ficu_ard_tmpl6_loop:5;
        u32 rsvd_5:11;
        u32 ficu_ard_tmpl6_offset_addr:16;
    } b;
} ficu_ard_conf_reg7_t;

#define FICU_XFCNT_LUT_CONF_REG                  0x000000ac
#define   FICU_XFCNT_LUT_CONF_PTR_MASK           0x0000001f
#define   FICU_XFCNT_LUT_CONF_PTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 ficu_xfcnt_lut_conf_ptr:5;
        u32 rsvd_5:27;
    } b;
} ficu_xfcnt_lut_conf_reg_t;

#define FICU_XFCNT_LUT_VAL_REG                   0x000000b0
#define   FICU_XFCNT_LUT_VAL_MASK                0x0000ffff
#define   FICU_XFCNT_LUT_VAL_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ficu_xfcnt_lut_val:16;
        u32 rsvd_16:16;
    } b;
} ficu_xfcnt_lut_val_reg_t;

#define FICU_FSPM_INIT_REG                       0x000000b4
#define   FICU_FSPM_INIT_SZ_MASK                 0xffff0000
#define   FICU_FSPM_INIT_SZ_SHIFT                        16
#define   FICU_FSPM_INIT_ST_ADDR_MASK            0x0000ffff
#define   FICU_FSPM_INIT_ST_ADDR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_init_st_addr:16;
        u32 ficu_fspm_init_sz:16;
    } b;
} ficu_fspm_init_reg_t;

#define FICU_VSC_TMPL_INFO_CONF_REG              0x000000c0
#define   FICU_VSC_TMPL_INFO_CONF_PTR_MASK       0x0000001f
#define   FICU_VSC_TMPL_INFO_CONF_PTR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 ficu_vsc_tmpl_info_conf_ptr:5;
        u32 rsvd_5:27;
    } b;
} ficu_vsc_tmpl_info_conf_reg_t;

#define FICU_VSC_TMPL_INFO_REG                   0x000000c4
#define   FICU_VSC_TMPL_ST_ADDR_MASK             0xffff0000
#define   FICU_VSC_TMPL_ST_ADDR_SHIFT                    16
#define   FICU_VSC_TMPL_FINST_NUM_MASK           0x000000ff
#define   FICU_VSC_TMPL_FINST_NUM_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 ficu_vsc_tmpl_finst_num:8;
        u32 rsvd_8:8;
        u32 ficu_vsc_tmpl_st_addr:16;
    } b;
} ficu_vsc_tmpl_info_reg_t;

#define FICU_FCMD_CQ_ST_ADDR_REG                 0x000000c8
#define   FICU_FCMD_CQ_ST_ADDR_MASK              0xffffffff
#define   FICU_FCMD_CQ_ST_ADDR_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 ficu_fcmd_cq_st_addr:32;
    } b;
} ficu_fcmd_cq_st_addr_reg_t;

#define FICU_FCMD_CQ_END_ADDR_REG                0x000000cc
#define   FICU_FCMD_CQ_END_ADDR_MASK             0xffffffff
#define   FICU_FCMD_CQ_END_ADDR_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ficu_fcmd_cq_end_addr:32;
    } b;
} ficu_fcmd_cq_end_addr_reg_t;

#define FICU_FCMD_CQ_CNT_REG                     0x000000d0
#define   FICU_FCMD_CQ_CNT_MASK                  0x0000ffff
#define   FICU_FCMD_CQ_CNT_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fcmd_cq_cnt:16;
        u32 rsvd_16:16;
    } b;
} ficu_fcmd_cq_cnt_reg_t;

#define FICU_CH_MAPPING_REG                      0x000000d4
#define   FICU_PHY_CH7_MAP_MASK                  0xf0000000
#define   FICU_PHY_CH7_MAP_SHIFT                         28
#define   FICU_PHY_CH6_MAP_MASK                  0x0f000000
#define   FICU_PHY_CH6_MAP_SHIFT                         24
#define   FICU_PHY_CH5_MAP_MASK                  0x00f00000
#define   FICU_PHY_CH5_MAP_SHIFT                         20
#define   FICU_PHY_CH4_MAP_MASK                  0x000f0000
#define   FICU_PHY_CH4_MAP_SHIFT                         16
#define   FICU_PHY_CH3_MAP_MASK                  0x0000f000
#define   FICU_PHY_CH3_MAP_SHIFT                         12
#define   FICU_PHY_CH2_MAP_MASK                  0x00000f00
#define   FICU_PHY_CH2_MAP_SHIFT                          8
#define   FICU_PHY_CH1_MAP_MASK                  0x000000f0
#define   FICU_PHY_CH1_MAP_SHIFT                          4
#define   FICU_PHY_CH0_MAP_MASK                  0x0000000f
#define   FICU_PHY_CH0_MAP_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ficu_phy_ch0_map:4;
        u32 ficu_phy_ch1_map:4;
        u32 ficu_phy_ch2_map:4;
        u32 ficu_phy_ch3_map:4;
        u32 ficu_phy_ch4_map:4;
        u32 ficu_phy_ch5_map:4;
        u32 ficu_phy_ch6_map:4;
        u32 ficu_phy_ch7_map:4;
    } b;
} ficu_ch_mapping_reg_t;

#define FICU_CH_REV_MAPPING_REG                  0x000000d8
#define   FICU_LOG_CH7_MAP_MASK                  0xf0000000
#define   FICU_LOG_CH7_MAP_SHIFT                         28
#define   FICU_LOG_CH6_MAP_MASK                  0x0f000000
#define   FICU_LOG_CH6_MAP_SHIFT                         24
#define   FICU_LOG_CH5_MAP_MASK                  0x00f00000
#define   FICU_LOG_CH5_MAP_SHIFT                         20
#define   FICU_LOG_CH4_MAP_MASK                  0x000f0000
#define   FICU_LOG_CH4_MAP_SHIFT                         16
#define   FICU_LOG_CH3_MAP_MASK                  0x0000f000
#define   FICU_LOG_CH3_MAP_SHIFT                         12
#define   FICU_LOG_CH2_MAP_MASK                  0x00000f00
#define   FICU_LOG_CH2_MAP_SHIFT                          8
#define   FICU_LOG_CH1_MAP_MASK                  0x000000f0
#define   FICU_LOG_CH1_MAP_SHIFT                          4
#define   FICU_LOG_CH0_MAP_MASK                  0x0000000f
#define   FICU_LOG_CH0_MAP_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ficu_log_ch0_map:4;
        u32 ficu_log_ch1_map:4;
        u32 ficu_log_ch2_map:4;
        u32 ficu_log_ch3_map:4;
        u32 ficu_log_ch4_map:4;
        u32 ficu_log_ch5_map:4;
        u32 ficu_log_ch6_map:4;
        u32 ficu_log_ch7_map:4;
    } b;
} ficu_ch_rev_mapping_reg_t;

#define FICU_REF_MASK_REG0                       0x000000dc
#define   FICU_REF_MASK_VAL0_MASK                0xffffffff
#define   FICU_REF_MASK_VAL0_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ficu_ref_mask_val0:32;
    } b;
} ficu_ref_mask_reg0_t;

#define FICU_REF_MASK_REG1                       0x000000e0
#define   FICU_REF_MASK_VAL1_MASK                0xffffffff
#define   FICU_REF_MASK_VAL1_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ficu_ref_mask_val1:32;
    } b;
} ficu_ref_mask_reg1_t;

#define FICU_MP_ROW_OFFSET                       0x000000e4
#define   FICU_MP_ROW_OFFSET_MASK                0xffffffff
#define   FICU_MP_ROW_OFFSET_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ficu_mp_row_offset:32;
    } b;
} ficu_mp_row_offset_t;

#define FICU_FSPM_ST_ADDR_REG                    0x000000e8
#define   FICU_FSPM_ST_ADDR_MASK                 0xffffffff
#define   FICU_FSPM_ST_ADDR_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_st_addr:32;
    } b;
} ficu_fspm_st_addr_reg_t;

#define FICU_FSPM_END_ADDR_REG                   0x000000ec
#define   FICU_FSPM_END_ADDR_MASK                0xffffffff
#define   FICU_FSPM_END_ADDR_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_end_addr:32;
    } b;
} ficu_fspm_end_addr_reg_t;

#define FICU_SYS_SRAM_ST_ADDR_REG                0x000000f0
#define   FICU_SYS_SRAM_ST_ADDR_MASK             0xffffffff
#define   FICU_SYS_SRAM_ST_ADDR_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ficu_sys_sram_st_addr:32;
    } b;
} ficu_sys_sram_st_addr_reg_t;

#define FICU_SYS_SRAM_END_ADDR_REG               0x000000f4
#define   FICU_SYS_SRAM_END_ADDR_MASK            0xffffffff
#define   FICU_SYS_SRAM_END_ADDR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ficu_sys_sram_end_addr:32;
    } b;
} ficu_sys_sram_end_addr_reg_t;

#define FICU_FDA_DTAG_LIST_DTCM_BASE_ADDR0_REG   0x000000f8
#define   FICU_FDA_DTAG_LIST_DTCM_BASE_ADDR0_MASK 0xffffffff
#define   FICU_FDA_DTAG_LIST_DTCM_BASE_ADDR0_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fda_dtag_list_dtcm_base_addr0:32;
    } b;
} ficu_fda_dtag_list_dtcm_base_addr0_reg_t;

#define FICU_FDA_DTAG_LIST_DTCM_BASE_ADDR1_REG   0x000000fc
#define   FICU_FDA_DTAG_LIST_DTCM_BASE_ADDR1_MASK 0xffffffff
#define   FICU_FDA_DTAG_LIST_DTCM_BASE_ADDR1_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fda_dtag_list_dtcm_base_addr1:32;
    } b;
} ficu_fda_dtag_list_dtcm_base_addr1_reg_t;

#define FICU_FDA_DTAG_LIST_SRAM_BASE_ADDR0_REG   0x00000100
#define   FICU_FDA_DTAG_LIST_SRAM_BASE_ADDR0_MASK 0xffffffff
#define   FICU_FDA_DTAG_LIST_SRAM_BASE_ADDR0_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fda_dtag_list_sram_base_addr0:32;
    } b;
} ficu_fda_dtag_list_sram_base_addr0_reg_t;

#define FICU_FDA_DTAG_LIST_SRAM_BASE_ADDR1_REG   0x00000104
#define   FICU_FDA_DTAG_LIST_SRAM_BASE_ADDR1_MASK 0xffffffff
#define   FICU_FDA_DTAG_LIST_SRAM_BASE_ADDR1_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fda_dtag_list_sram_base_addr1:32;
    } b;
} ficu_fda_dtag_list_sram_base_addr1_reg_t;

#define FICU_COST_LLR_LIST_DTCM_BASE_ADDR0_REG   0x00000108
#define   FICU_COST_LLR_LIST_DTCM_BASE_ADDR0_MASK 0xffffffff
#define   FICU_COST_LLR_LIST_DTCM_BASE_ADDR0_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_cost_llr_list_dtcm_base_addr0:32;
    } b;
} ficu_cost_llr_list_dtcm_base_addr0_reg_t;

#define FICU_COST_LLR_LIST_DTCM_BASE_ADDR1_REG   0x0000010c
#define   FICU_COST_LLR_LIST_DTCM_BASE_ADDR1_MASK 0xffffffff
#define   FICU_COST_LLR_LIST_DTCM_BASE_ADDR1_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_cost_llr_list_dtcm_base_addr1:32;
    } b;
} ficu_cost_llr_list_dtcm_base_addr1_reg_t;

#define FICU_COST_LLR_LIST_SRAM_BASE_ADDR0_REG   0x00000110
#define   FICU_COST_LLR_LIST_SRAM_BASE_ADDR0_MASK 0xffffffff
#define   FICU_COST_LLR_LIST_SRAM_BASE_ADDR0_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_cost_llr_list_sram_base_addr0:32;
    } b;
} ficu_cost_llr_list_sram_base_addr0_reg_t;

#define FICU_COST_LLR_LIST_SRAM_BASE_ADDR1_REG   0x00000114
#define   FICU_COST_LLR_LIST_SRAM_BASE_ADDR1_MASK 0xffffffff
#define   FICU_COST_LLR_LIST_SRAM_BASE_ADDR1_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_cost_llr_list_sram_base_addr1:32;
    } b;
} ficu_cost_llr_list_sram_base_addr1_reg_t;

#define FICU_LDA_LIST_DTCM_BASE_ADDR0_REG        0x00000118
#define   FICU_LDA_LIST_DTCM_BASE_ADDR0_MASK     0xffffffff
#define   FICU_LDA_LIST_DTCM_BASE_ADDR0_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_lda_list_dtcm_base_addr0:32;
    } b;
} ficu_lda_list_dtcm_base_addr0_reg_t;

#define FICU_LDA_LIST_DTCM_BASE_ADDR1_REG        0x0000011c
#define   FICU_LDA_LIST_DTCM_BASE_ADDR1_MASK     0xffffffff
#define   FICU_LDA_LIST_DTCM_BASE_ADDR1_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_lda_list_dtcm_base_addr1:32;
    } b;
} ficu_lda_list_dtcm_base_addr1_reg_t;

#define FICU_LDA_LIST_SRAM_BASE_ADDR0_REG        0x00000120
#define   FICU_LDA_LIST_SRAM_BASE_ADDR0_MASK     0xffffffff
#define   FICU_LDA_LIST_SRAM_BASE_ADDR0_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_lda_list_sram_base_addr0:32;
    } b;
} ficu_lda_list_sram_base_addr0_reg_t;

#define FICU_LDA_LIST_SRAM_BASE_ADDR1_REG        0x00000124
#define   FICU_LDA_LIST_SRAM_BASE_ADDR1_MASK     0xffffffff
#define   FICU_LDA_LIST_SRAM_BASE_ADDR1_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_lda_list_sram_base_addr1:32;
    } b;
} ficu_lda_list_sram_base_addr1_reg_t;

#define FICU_META_DTAG_MAP_SRAM_BASE_ADDR_REG    0x00000128
#define   FICU_META_DTAG_MAP_SRAM_BASE_ADDR_MASK 0xffffffff
#define   FICU_META_DTAG_MAP_SRAM_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_meta_dtag_map_sram_base_addr:32;
    } b;
} ficu_meta_dtag_map_sram_base_addr_reg_t;

#define FICU_META_DTAG_MAP_DDR_BASE_ADDR_REG     0x0000012c
#define   FICU_META_DTAG_MAP_DDR_BASE_ADDR_MASK  0xffffffff
#define   FICU_META_DTAG_MAP_DDR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_meta_dtag_map_ddr_base_addr:32;
    } b;
} ficu_meta_dtag_map_ddr_base_addr_reg_t;

#define FICU_META_IDX_MAP_SRAM_BASE_ADDR_REG     0x00000130
#define   FICU_META_IDX_MAP_SRAM_BASE_ADDR_MASK  0xffffffff
#define   FICU_META_IDX_MAP_SRAM_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_meta_idx_map_sram_base_addr:32;
    } b;
} ficu_meta_idx_map_sram_base_addr_reg_t;

#define FICU_META_IDX_MAP_DDR_BASE_ADDR_REG      0x00000134
#define   FICU_META_IDX_MAP_DDR_BASE_ADDR_MASK   0xffffffff
#define   FICU_META_IDX_MAP_DDR_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 ficu_meta_idx_map_ddr_base_addr:32;
    } b;
} ficu_meta_idx_map_ddr_base_addr_reg_t;

#define FICU_META_DTAG_IDX_MAP_UNIT_SIZE_REG     0x00000138
#define   FICU_META_DTAG_IDX_MAP_UNIT_SIZE_MASK  0x0000007f
#define   FICU_META_DTAG_IDX_MAP_UNIT_SIZE_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_meta_dtag_idx_map_unit_size:7;
        u32 rsvd_7:25;
    } b;
} ficu_meta_dtag_idx_map_unit_size_reg_t;

#define FICU_META_AUTO_IDX_ENC_BASE_ADDR0_REG    0x0000013c
#define   FICU_META_AUTO_IDX_ENC_BASE_ADDR0_MASK 0xffffffff
#define   FICU_META_AUTO_IDX_ENC_BASE_ADDR0_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_meta_auto_idx_enc_base_addr0:32;
    } b;
} ficu_meta_auto_idx_enc_base_addr0_reg_t;

#define FICU_META_AUTO_IDX_ENC_BASE_ADDR1_REG    0x00000140
#define   FICU_META_AUTO_IDX_ENC_BASE_ADDR1_MASK 0xffffffff
#define   FICU_META_AUTO_IDX_ENC_BASE_ADDR1_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_meta_auto_idx_enc_base_addr1:32;
    } b;
} ficu_meta_auto_idx_enc_base_addr1_reg_t;

#define FICU_META_AUTO_IDX_DEC_BASE_ADDR0_REG    0x00000144
#define   FICU_META_AUTO_IDX_DEC_BASE_ADDR0_MASK 0xffffffff
#define   FICU_META_AUTO_IDX_DEC_BASE_ADDR0_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_meta_auto_idx_dec_base_addr0:32;
    } b;
} ficu_meta_auto_idx_dec_base_addr0_reg_t;

#define FICU_META_AUTO_IDX_DEC_BASE_ADDR1_REG    0x00000148
#define   FICU_META_AUTO_IDX_DEC_BASE_ADDR1_MASK 0xffffffff
#define   FICU_META_AUTO_IDX_DEC_BASE_ADDR1_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_meta_auto_idx_dec_base_addr1:32;
    } b;
} ficu_meta_auto_idx_dec_base_addr1_reg_t;

#define FICU_META_DTAG_MAP_HMB_BASE_ADDR_REG     0x0000014c
#define   FICU_META_DTAG_MAP_HMB_BASE_ADDR_MASK  0xffffffff
#define   FICU_META_DTAG_MAP_HMB_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_meta_dtag_map_hmb_base_addr:32;
    } b;
} ficu_meta_dtag_map_hmb_base_addr_reg_t;

#define FICU_META_IDX_MAP_HMB_BASE_ADDR_REG      0x00000150
#define   FICU_META_IDX_MAP_HMB_BASE_ADDR_MASK   0xffffffff
#define   FICU_META_IDX_MAP_HMB_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 ficu_meta_idx_map_hmb_base_addr:32;
    } b;
} ficu_meta_idx_map_hmb_base_addr_reg_t;

#define FICU_PDA_CONF_REG0                       0x00000168
#define   FICU_FDA_GEN_MODE_SEL_MASK             0x80000000
#define   FICU_FDA_GEN_MODE_SEL_SHIFT                    31
#define   FICU_PDA_VLD_MSB_MASK                  0x00fc0000
#define   FICU_PDA_VLD_MSB_SHIFT                         18
#define   FICU_SPB_OFFSET_MASK                   0x0003f000
#define   FICU_SPB_OFFSET_SHIFT                          12
#define   FICU_PDA_PAGE_OFFSET_MASK              0x00000f80
#define   FICU_PDA_PAGE_OFFSET_SHIFT                      7
#define   FICU_PDA_INTLV_OFFSET_MASK             0x0000007c
#define   FICU_PDA_INTLV_OFFSET_SHIFT                     2
#define   FICU_PDA_DU_OFFSET_MASK                0x00000003
#define   FICU_PDA_DU_OFFSET_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ficu_pda_du_offset:2;
        u32 ficu_pda_intlv_offset:5;
        u32 ficu_pda_page_offset:5;
        u32 ficu_spb_offset:6;
        u32 ficu_pda_vld_msb:6;
        u32 rsvd_24:7;
        u32 ficu_fda_gen_mode_sel:1;
    } b;
} ficu_pda_conf_reg0_t;

#define FICU_PDA_CONF_REG1                       0x0000016c
#define   FICU_PDA_INTLV_PLN_BW_MASK             0x001e0000
#define   FICU_PDA_INTLV_PLN_BW_SHIFT                    17
#define   FICU_PDA_INTLV_LUN_BW_MASK             0x0001e000
#define   FICU_PDA_INTLV_LUN_BW_SHIFT                    13
#define   FICU_PDA_INTLV_CH_BW_MASK              0x00001e00
#define   FICU_PDA_INTLV_CH_BW_SHIFT                      9
#define   FICU_PDA_INTLV_CE_BW_MASK              0x000001e0
#define   FICU_PDA_INTLV_CE_BW_SHIFT                      5
#define   FICU_PDA_INTLV_TYPE_MASK               0x0000001f
#define   FICU_PDA_INTLV_TYPE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ficu_pda_intlv_type:5;
        u32 ficu_pda_intlv_ce_bw:4;
        u32 ficu_pda_intlv_ch_bw:4;
        u32 ficu_pda_intlv_lun_bw:4;
        u32 ficu_pda_intlv_pln_bw:4;
        u32 rsvd_21:11;
    } b;
} ficu_pda_conf_reg1_t;

#define FICU_ROW_ADDR_CONF_REG                   0x00000170
#define   FICU_ROW_PAGE_PER_WL_MASK              0x00700000
#define   FICU_ROW_PAGE_PER_WL_SHIFT                     20
#define   FICU_ROW_VLD_MSB_MASK                  0x000f8000
#define   FICU_ROW_VLD_MSB_SHIFT                         15
#define   FICU_ROW_LUN_OFFSET_MASK               0x00007c00
#define   FICU_ROW_LUN_OFFSET_SHIFT                      10
#define   FICU_ROW_BLK_OFFSET_MASK               0x000003e0
#define   FICU_ROW_BLK_OFFSET_SHIFT                       5
#define   FICU_ROW_PAGE_OFFSET_MASK              0x0000001f
#define   FICU_ROW_PAGE_OFFSET_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 ficu_row_page_offset:5;
        u32 ficu_row_blk_offset:5;
        u32 ficu_row_lun_offset:5;
        u32 ficu_row_vld_msb:5;
        u32 ficu_row_page_per_wl:3;
        u32 rsvd_23:9;
    } b;
} ficu_row_addr_conf_reg_t;

#define FICU_PDA_CONF_REG2                       0x00000174
#define   FICU_PDA_CH_OFFSET_MASK                0xf0000000
#define   FICU_PDA_CH_OFFSET_SHIFT                       28
#define   FICU_PDA_PAGE_PER_BLK_MASK             0x001fff00
#define   FICU_PDA_PAGE_PER_BLK_SHIFT                     8
#define   FICU_PDA_CE_PER_CH_MASK                0x000000f0
#define   FICU_PDA_CE_PER_CH_SHIFT                        4
#define   FICU_PDA_TOTAL_NUM_CH_MASK             0x0000000f
#define   FICU_PDA_TOTAL_NUM_CH_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ficu_pda_total_num_ch:4;
        u32 ficu_pda_ce_per_ch:4;
        u32 ficu_pda_page_per_blk:13;
        u32 rsvd_21:7;
        u32 ficu_pda_ch_offset:4;
    } b;
} ficu_pda_conf_reg2_t;

#define FICU_NF_FINST_CNT_REG                    0x00000178
#define   FICU_NF_FINST_DONE_CNT_MASK            0xffff0000
#define   FICU_NF_FINST_DONE_CNT_SHIFT                   16
#define   FICU_NF_FINST_ST_CNT_MASK              0x0000ffff
#define   FICU_NF_FINST_ST_CNT_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 ficu_nf_finst_st_cnt:16;
        u32 ficu_nf_finst_done_cnt:16;
    } b;
} ficu_nf_finst_cnt_reg_t;

#define FICU_DU_DONE_CNT_REG                     0x00000180
#define   FICU_DEC_DU_DONE_CNT_MASK              0xffff0000
#define   FICU_DEC_DU_DONE_CNT_SHIFT                     16
#define   FICU_ENC_DU_DONE_CNT_MASK              0x0000ffff
#define   FICU_ENC_DU_DONE_CNT_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 ficu_enc_du_done_cnt:16;
        u32 ficu_dec_du_done_cnt:16;
    } b;
} ficu_du_done_cnt_reg_t;

#define FICU_DU_RCV_DONE_CNT_REG                 0x00000184
#define   FICU_DEC_DU_RCV_DONE_CNT_MASK          0xffff0000
#define   FICU_DEC_DU_RCV_DONE_CNT_SHIFT                 16
#define   FICU_ENC_DU_RCV_DONE_CNT_MASK          0x0000ffff
#define   FICU_ENC_DU_RCV_DONE_CNT_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 ficu_enc_du_rcv_done_cnt:16;
        u32 ficu_dec_du_rcv_done_cnt:16;
    } b;
} ficu_du_rcv_done_cnt_reg_t;

#define FICU_DU_START_CNT_REG                    0x00000188
#define   FICU_DEC_DU_START_CNT_MASK             0xffff0000
#define   FICU_DEC_DU_START_CNT_SHIFT                    16
#define   FICU_ENC_DU_START_CNT_MASK             0x0000ffff
#define   FICU_ENC_DU_START_CNT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 ficu_enc_du_start_cnt:16;
        u32 ficu_dec_du_start_cnt:16;
    } b;
} ficu_du_start_cnt_reg_t;

#define FICU_FCMD_STATUS_REG0                    0x0000018c
#define   FICU_UNCOMPL_FCMD_NUM_MASK             0xff000000
#define   FICU_UNCOMPL_FCMD_NUM_SHIFT                    24
#define   FICU_FCMD_STATUS_RD_PTR_MASK           0x000000ff
#define   FICU_FCMD_STATUS_RD_PTR_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 ficu_fcmd_status_rd_ptr:8;
        u32 rsvd_8:16;
        u32 ficu_uncompl_fcmd_num:8;
    } b;
} ficu_fcmd_status_reg0_t;

#define FICU_FCMD_STATUS_REG1                    0x00000190
#define   FICU_FCMD_ERR_DETECTED_MASK            0x80000000
#define   FICU_FCMD_ERR_DETECTED_SHIFT                   31
#define   FICU_FCMD_EC_ERR_MASK                  0x40000000
#define   FICU_FCMD_EC_ERR_SHIFT                         30
#define   FICU_FCMD_NF_ERR_MASK                  0x20000000
#define   FICU_FCMD_NF_ERR_SHIFT                         29
#define   FICU_FCMD_ARD_ERR_MASK                 0x10000000
#define   FICU_FCMD_ARD_ERR_SHIFT                        28
#define   FICU_FCMD_COMPL_FINST_NUM_MASK         0x007ff000
#define   FICU_FCMD_COMPL_FINST_NUM_SHIFT                12
#define   FICU_FCMD_TOTAL_FINST_NUM_MASK         0x000007ff
#define   FICU_FCMD_TOTAL_FINST_NUM_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 ficu_fcmd_total_finst_num:11;
        u32 rsvd_11:1;
        u32 ficu_fcmd_compl_finst_num:11;
        u32 rsvd_23:5;
        u32 ficu_fcmd_ard_err:1;
        u32 ficu_fcmd_nf_err:1;
        u32 ficu_fcmd_ec_err:1;
        u32 ficu_fcmd_err_detected:1;
    } b;
} ficu_fcmd_status_reg1_t;

#define FICU_FCMD_STATUS_REG2                    0x00000194
#define   FICU_FCMD_ERR_DU_ID_MASK               0xe0000000
#define   FICU_FCMD_ERR_DU_ID_SHIFT                      29
#define   FICU_FCMD_ERR_DU_MP_ID_MASK            0x1e000000
#define   FICU_FCMD_ERR_DU_MP_ID_SHIFT                   25
#define   FICU_FCMD_ERR_FINST_ID_MASK            0x000003ff
#define   FICU_FCMD_ERR_FINST_ID_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ficu_fcmd_err_finst_id:10;
        u32 rsvd_10:15;
        u32 ficu_fcmd_err_du_mp_id:4;
        u32 ficu_fcmd_err_du_id:3;
    } b;
} ficu_fcmd_status_reg2_t;

#define FICU_FCMD_STATUS_REG3                    0x00000198
#define   FICU_FCMD_ERR_FINST_STATUS_MASK        0xffffc000
#define   FICU_FCMD_ERR_FINST_STATUS_SHIFT               14
#define   FICU_FCMD_ID_MASK                      0x00000fff
#define   FICU_FCMD_ID_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 ficu_fcmd_id:12;
        u32 rsvd_12:2;
        u32 ficu_fcmd_err_finst_status:18;
    } b;
} ficu_fcmd_status_reg3_t;

#define FICU_FINST_STATUS_REG0                   0x0000019c
#define   FICU_UNCOMPL_FINST_NUM_MASK            0xff000000
#define   FICU_UNCOMPL_FINST_NUM_SHIFT                   24
#define   FICU_FINST_STATUS_RD_PTR_MASK          0x000000ff
#define   FICU_FINST_STATUS_RD_PTR_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 ficu_finst_status_rd_ptr:8;
        u32 rsvd_8:16;
        u32 ficu_uncompl_finst_num:8;
    } b;
} ficu_finst_status_reg0_t;

#define FICU_FINST_STATUS_REG1                   0x000001a0
#define   FICU_FINST_ERR_DETECTED_MASK           0x80000000
#define   FICU_FINST_ERR_DETECTED_SHIFT                  31
#define   FICU_FINST_EC_ERR_MASK                 0x40000000
#define   FICU_FINST_EC_ERR_SHIFT                        30
#define   FICU_FINST_NF_ERR_MASK                 0x20000000
#define   FICU_FINST_NF_ERR_SHIFT                        29
#define   FICU_FINST_EC_COMPL_MASK               0x10000000
#define   FICU_FINST_EC_COMPL_SHIFT                      28
#define   FICU_FINST_NF_COMPL_MASK               0x08000000
#define   FICU_FINST_NF_COMPL_SHIFT                      27
#define   FICU_FINST_IDX_MASK                    0x03ff0000
#define   FICU_FINST_IDX_SHIFT                           16
#define   FICU_FINST_COMPL_DU_NUM_MASK           0x00007f00
#define   FICU_FINST_COMPL_DU_NUM_SHIFT                   8
#define   FICU_FINST_TOTAL_DU_NUM_MASK           0x0000007f
#define   FICU_FINST_TOTAL_DU_NUM_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 ficu_finst_total_du_num:7;
        u32 rsvd_7:1;
        u32 ficu_finst_compl_du_num:7;
        u32 rsvd_15:1;
        u32 ficu_finst_idx:10;
        u32 rsvd_26:1;
        u32 ficu_finst_nf_compl:1;
        u32 ficu_finst_ec_compl:1;
        u32 ficu_finst_nf_err:1;
        u32 ficu_finst_ec_err:1;
        u32 ficu_finst_err_detected:1;
    } b;
} ficu_finst_status_reg1_t;

#define FICU_FINST_STATUS_REG2                   0x000001a4
#define   FICU_FINST_STATUS_MASK                 0x07fffe00
#define   FICU_FINST_STATUS_SHIFT                         9
#define   FICU_FINST_FCMD_LUT_ID_MASK            0x000000ff
#define   FICU_FINST_FCMD_LUT_ID_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ficu_finst_fcmd_lut_id:8;
        u32 rsvd_8:1;
        u32 ficu_finst_status:18;
        u32 rsvd_27:5;
    } b;
} ficu_finst_status_reg2_t;

#define FICU_ARD_FINST_STATUS_REG0               0x000001a8
#define   FICU_UNCOMPL_ARD_FINST_NUM_MASK        0xf0000000
#define   FICU_UNCOMPL_ARD_FINST_NUM_SHIFT               28
#define   FICU_ARD_FINST_LOOP_IDX_MASK           0x0001f000
#define   FICU_ARD_FINST_LOOP_IDX_SHIFT                  12
#define   FICU_ARD_FINST_EC_COMPL_MASK           0x00000200
#define   FICU_ARD_FINST_EC_COMPL_SHIFT                   9
#define   FICU_ARD_FINST_NF_COMPL_MASK           0x00000100
#define   FICU_ARD_FINST_NF_COMPL_SHIFT                   8
#define   FICU_ARD_FINST_STATUS_RD_PTR_MASK      0x0000000f
#define   FICU_ARD_FINST_STATUS_RD_PTR_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 ficu_ard_finst_status_rd_ptr:4;
        u32 rsvd_4:4;
        u32 ficu_ard_finst_nf_compl:1;
        u32 ficu_ard_finst_ec_compl:1;
        u32 rsvd_10:2;
        u32 ficu_ard_finst_loop_idx:5;
        u32 rsvd_17:11;
        u32 ficu_uncompl_ard_finst_num:4;
    } b;
} ficu_ard_finst_status_reg0_t;

#define FICU_ARD_DU_CNT_REG                      0x000001ac
#define   FICU_ARD_DU_DONE_CNT_MASK              0xffff0000
#define   FICU_ARD_DU_DONE_CNT_SHIFT                     16
#define   FICU_ARD_DU_ST_CNT_MASK                0x0000ffff
#define   FICU_ARD_DU_ST_CNT_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ficu_ard_du_st_cnt:16;
        u32 ficu_ard_du_done_cnt:16;
    } b;
} ficu_ard_du_cnt_reg_t;

#define FICU_ENC_RAID_PAR_DU_CNT_REG             0x000001b0
#define   FICU_ENC_RAID_PAR_DU_DONE_CNT_MASK     0xffff0000
#define   FICU_ENC_RAID_PAR_DU_DONE_CNT_SHIFT            16
#define   FICU_ENC_RAID_PAR_DU_ST_CNT_MASK       0x0000ffff
#define   FICU_ENC_RAID_PAR_DU_ST_CNT_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 ficu_enc_raid_par_du_st_cnt:16;
        u32 ficu_enc_raid_par_du_done_cnt:16;
    } b;
} ficu_enc_raid_par_du_cnt_reg_t;

#define FICU_DEC_RAID_PAR_DU_CNT_REG             0x000001b4
#define   FICU_DEC_RAID_PAR_DU_DONE_CNT_MASK     0xffff0000
#define   FICU_DEC_RAID_PAR_DU_DONE_CNT_SHIFT            16
#define   FICU_DEC_RAID_PAR_DU_ST_CNT_MASK       0x0000ffff
#define   FICU_DEC_RAID_PAR_DU_ST_CNT_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 ficu_dec_raid_par_du_st_cnt:16;
        u32 ficu_dec_raid_par_du_done_cnt:16;
    } b;
} ficu_dec_raid_par_du_cnt_reg_t;

#define FICU_DUMMY_DU_DTAG_REG                   0x000001b8
#define   FICU_DUMMY_DU_DTAG_MASK                0x00ffffff
#define   FICU_DUMMY_DU_DTAG_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ficu_dummy_du_dtag:24;
        u32 rsvd_24:8;
    } b;
} ficu_dummy_du_dtag_reg_t;

#define FICU_FSPM_ECC_ERR_INJECT                 0x000001bc
#define   FICU_FSPM_1ST_ERR_LOC_MASK             0x003f0000
#define   FICU_FSPM_1ST_ERR_LOC_SHIFT                    16
#define   FICU_FSPM_INJECT_1BIT_ERR_MASK         0x00000002
#define   FICU_FSPM_INJECT_1BIT_ERR_SHIFT                 1
#define   FICU_FSPM_ERR_INJECT_EN_MASK           0x00000001
#define   FICU_FSPM_ERR_INJECT_EN_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_err_inject_en:1;
        u32 ficu_fspm_inject_1bit_err:1;
        u32 rsvd_2:14;
        u32 ficu_fspm_1st_err_loc:6;
        u32 rsvd_22:10;
    } b;
} ficu_fspm_ecc_err_inject_t;

#define FICU_FSPM_NORM_FINST_QUE0_CNT_REG        0x000001c0
#define   FICU_PROC_NORM_FINST_QUE0_CNT_MASK     0xffff0000
#define   FICU_PROC_NORM_FINST_QUE0_CNT_SHIFT            16
#define   FICU_FSPM_NORM_FINST_QUE0_CNT_MASK     0x0000ffff
#define   FICU_FSPM_NORM_FINST_QUE0_CNT_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_norm_finst_que0_cnt:16;
        u32 ficu_proc_norm_finst_que0_cnt:16;
    } b;
} ficu_fspm_norm_finst_que0_cnt_reg_t;

#define FICU_FSPM_HIGH_FINST_QUE0_CNT_REG        0x000001c4
#define   FICU_PROC_HIGH_FINST_QUE0_CNT_MASK     0xffff0000
#define   FICU_PROC_HIGH_FINST_QUE0_CNT_SHIFT            16
#define   FICU_FSPM_HIGH_FINST_QUE0_CNT_MASK     0x0000ffff
#define   FICU_FSPM_HIGH_FINST_QUE0_CNT_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_high_finst_que0_cnt:16;
        u32 ficu_proc_high_finst_que0_cnt:16;
    } b;
} ficu_fspm_high_finst_que0_cnt_reg_t;

#define FICU_FSPM_URGENT_FINST_QUE0_CNT_REG      0x000001c8
#define   FICU_PROC_URGENT_FINST_QUE0_CNT_MASK   0xffff0000
#define   FICU_PROC_URGENT_FINST_QUE0_CNT_SHIFT          16
#define   FICU_FSPM_URGENT_FINST_QUE0_CNT_MASK   0x0000ffff
#define   FICU_FSPM_URGENT_FINST_QUE0_CNT_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_urgent_finst_que0_cnt:16;
        u32 ficu_proc_urgent_finst_que0_cnt:16;
    } b;
} ficu_fspm_urgent_finst_que0_cnt_reg_t;

#define FICU_FSPM_NORM_FINST_QUE0_ST_ADDR_REG    0x000001cc
#define   FICU_FSPM_NORM_FINST_QUE0_ST_ADDR_MASK 0xffffffff
#define   FICU_FSPM_NORM_FINST_QUE0_ST_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_norm_finst_que0_st_addr:32;
    } b;
} ficu_fspm_norm_finst_que0_st_addr_reg_t;

#define FICU_FSPM_NORM_FINST_QUE0_END_ADDR_REG   0x000001d0
#define   FICU_FSPM_NORM_FINST_QUE0_END_ADDR_MASK 0xffffffff
#define   FICU_FSPM_NORM_FINST_QUE0_END_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_norm_finst_que0_end_addr:32;
    } b;
} ficu_fspm_norm_finst_que0_end_addr_reg_t;

#define FICU_FSPM_NORM_FINST_QUE0_PTR_REG        0x000001d4
#define   FICU_FSPM_NORM_FINST_QUE0_PTR_MASK     0xffffffff
#define   FICU_FSPM_NORM_FINST_QUE0_PTR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_norm_finst_que0_ptr:32;
    } b;
} ficu_fspm_norm_finst_que0_ptr_reg_t;

#define FICU_FSPM_HIGH_FINST_QUE0_ST_ADDR_REG    0x000001d8
#define   FICU_FSPM_HIGH_FINST_QUE0_ST_ADDR_MASK 0xffffffff
#define   FICU_FSPM_HIGH_FINST_QUE0_ST_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_high_finst_que0_st_addr:32;
    } b;
} ficu_fspm_high_finst_que0_st_addr_reg_t;

#define FICU_FSPM_HIGH_FINST_QUE0_END_ADDR_REG   0x000001dc
#define   FICU_FSPM_HIGH_FINST_QUE0_END_ADDR_MASK 0xffffffff
#define   FICU_FSPM_HIGH_FINST_QUE0_END_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_high_finst_que0_end_addr:32;
    } b;
} ficu_fspm_high_finst_que0_end_addr_reg_t;

#define FICU_FSPM_HIGH_FINST_QUE0_PTR_REG        0x000001e0
#define   FICU_FSPM_HIGH_FINST_QUE0_PTR_MASK     0xffffffff
#define   FICU_FSPM_HIGH_FINST_QUE0_PTR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_high_finst_que0_ptr:32;
    } b;
} ficu_fspm_high_finst_que0_ptr_reg_t;

#define FICU_FSPM_URGENT_FINST_QUE0_ST_ADDR_REG  0x000001e4
#define   FICU_FSPM_URGENT_FINST_QUE0_ST_ADDR_MASK 0xffffffff
#define   FICU_FSPM_URGENT_FINST_QUE0_ST_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_urgent_finst_que0_st_addr:32;
    } b;
} ficu_fspm_urgent_finst_que0_st_addr_reg_t;

#define FICU_FSPM_URGENT_FINST_QUE0_END_ADDR_REG 0x000001e8
#define   FICU_FSPM_URGENT_FINST_QUE0_END_ADDR_MASK 0xffffffff
#define   FICU_FSPM_URGENT_FINST_QUE0_END_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_urgent_finst_que0_end_addr:32;
    } b;
} ficu_fspm_urgent_finst_que0_end_addr_reg_t;

#define FICU_FSPM_URGENT_FINST_QUE0_PTR_REG      0x000001ec
#define   FICU_FSPM_URGENT_FINST_QUE0_PTR_MASK   0xffffffff
#define   FICU_FSPM_URGENT_FINST_QUE0_PTR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_urgent_finst_que0_ptr:32;
    } b;
} ficu_fspm_urgent_finst_que0_ptr_reg_t;

#define FICU_FSPM_NORM_FINST_QUE1_CNT_REG        0x000001f0
#define   FICU_PROC_NORM_FINST_QUE1_CNT_MASK     0xffff0000
#define   FICU_PROC_NORM_FINST_QUE1_CNT_SHIFT            16
#define   FICU_FSPM_NORM_FINST_QUE1_CNT_MASK     0x0000ffff
#define   FICU_FSPM_NORM_FINST_QUE1_CNT_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_norm_finst_que1_cnt:16;
        u32 ficu_proc_norm_finst_que1_cnt:16;
    } b;
} ficu_fspm_norm_finst_que1_cnt_reg_t;

#define FICU_FSPM_HIGH_FINST_QUE1_CNT_REG        0x000001f4
#define   FICU_PROC_HIGH_FINST_QUE1_CNT_MASK     0xffff0000
#define   FICU_PROC_HIGH_FINST_QUE1_CNT_SHIFT            16
#define   FICU_FSPM_HIGH_FINST_QUE1_CNT_MASK     0x0000ffff
#define   FICU_FSPM_HIGH_FINST_QUE1_CNT_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_high_finst_que1_cnt:16;
        u32 ficu_proc_high_finst_que1_cnt:16;
    } b;
} ficu_fspm_high_finst_que1_cnt_reg_t;

#define FICU_FSPM_URGENT_FINST_QUE1_CNT_REG      0x000001f8
#define   FICU_PROC_URGENT_FINST_QUE1_CNT_MASK   0xffff0000
#define   FICU_PROC_URGENT_FINST_QUE1_CNT_SHIFT          16
#define   FICU_FSPM_URGENT_FINST_QUE1_CNT_MASK   0x0000ffff
#define   FICU_FSPM_URGENT_FINST_QUE1_CNT_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_urgent_finst_que1_cnt:16;
        u32 ficu_proc_urgent_finst_que1_cnt:16;
    } b;
} ficu_fspm_urgent_finst_que1_cnt_reg_t;

#define FICU_FSPM_NORM_FINST_QUE1_ST_ADDR_REG    0x000001fc
#define   FICU_FSPM_NORM_FINST_QUE1_ST_ADDR_MASK 0xffffffff
#define   FICU_FSPM_NORM_FINST_QUE1_ST_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_norm_finst_que1_st_addr:32;
    } b;
} ficu_fspm_norm_finst_que1_st_addr_reg_t;

#define FICU_FSPM_NORM_FINST_QUE1_END_ADDR_REG   0x00000200
#define   FICU_FSPM_NORM_FINST_QUE1_END_ADDR_MASK 0xffffffff
#define   FICU_FSPM_NORM_FINST_QUE1_END_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_norm_finst_que1_end_addr:32;
    } b;
} ficu_fspm_norm_finst_que1_end_addr_reg_t;

#define FICU_FSPM_NORM_FINST_QUE1_PTR_REG        0x00000204
#define   FICU_FSPM_NORM_FINST_QUE1_PTR_MASK     0xffffffff
#define   FICU_FSPM_NORM_FINST_QUE1_PTR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_norm_finst_que1_ptr:32;
    } b;
} ficu_fspm_norm_finst_que1_ptr_reg_t;

#define FICU_FSPM_HIGH_FINST_QUE1_ST_ADDR_REG    0x00000208
#define   FICU_FSPM_HIGH_FINST_QUE1_ST_ADDR_MASK 0xffffffff
#define   FICU_FSPM_HIGH_FINST_QUE1_ST_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_high_finst_que1_st_addr:32;
    } b;
} ficu_fspm_high_finst_que1_st_addr_reg_t;

#define FICU_FSPM_HIGH_FINST_QUE1_END_ADDR_REG   0x0000020c
#define   FICU_FSPM_HIGH_FINST_QUE1_END_ADDR_MASK 0xffffffff
#define   FICU_FSPM_HIGH_FINST_QUE1_END_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_high_finst_que1_end_addr:32;
    } b;
} ficu_fspm_high_finst_que1_end_addr_reg_t;

#define FICU_FSPM_HIGH_FINST_QUE1_PTR_REG        0x00000210
#define   FICU_FSPM_HIGH_FINST_QUE1_PTR_MASK     0xffffffff
#define   FICU_FSPM_HIGH_FINST_QUE1_PTR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_high_finst_que1_ptr:32;
    } b;
} ficu_fspm_high_finst_que1_ptr_reg_t;

#define FICU_FSPM_URGENT_FINST_QUE1_ST_ADDR_REG  0x00000214
#define   FICU_FSPM_URGENT_FINST_QUE1_ST_ADDR_MASK 0xffffffff
#define   FICU_FSPM_URGENT_FINST_QUE1_ST_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_urgent_finst_que1_st_addr:32;
    } b;
} ficu_fspm_urgent_finst_que1_st_addr_reg_t;

#define FICU_FSPM_URGENT_FINST_QUE1_END_ADDR_REG 0x00000218
#define   FICU_FSPM_URGENT_FINST_QUE1_END_ADDR_MASK 0xffffffff
#define   FICU_FSPM_URGENT_FINST_QUE1_END_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_urgent_finst_que1_end_addr:32;
    } b;
} ficu_fspm_urgent_finst_que1_end_addr_reg_t;

#define FICU_FSPM_URGENT_FINST_QUE1_PTR_REG      0x0000021c
#define   FICU_FSPM_URGENT_FINST_QUE1_PTR_MASK   0xffffffff
#define   FICU_FSPM_URGENT_FINST_QUE1_PTR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_urgent_finst_que1_ptr:32;
    } b;
} ficu_fspm_urgent_finst_que1_ptr_reg_t;

#define FICU_INT_EN_REG1                         0x00000230
#define   FICU_NO_DQS_ERR_EN_230_MASK            0x00002000
#define   FICU_NO_DQS_ERR_EN_230_SHIFT                   13
#define   FICU_ARD_FIFO_ERR_EN_230_MASK          0x00001000
#define   FICU_ARD_FIFO_ERR_EN_230_SHIFT                 12
#define   FICU_LST_LLRM_DONE_EN_230_MASK         0x00000800
#define   FICU_LST_LLRM_DONE_EN_230_SHIFT                11
#define   FICU_IF_RW_ERR_EN_230_MASK             0x00000400
#define   FICU_IF_RW_ERR_EN_230_SHIFT                    10
#define   FICU_FCMD_GRP1_CQ_DONE_EN_230_MASK     0x00000040
#define   FICU_FCMD_GRP1_CQ_DONE_EN_230_SHIFT             6
#define   FICU_FCMD_GRP0_CQ_DONE_EN_230_MASK     0x00000020
#define   FICU_FCMD_GRP0_CQ_DONE_EN_230_SHIFT             5
#define   FICU_FINST_ERR_EN_230_MASK             0x00000010
#define   FICU_FINST_ERR_EN_230_SHIFT                     4
#define   FICU_SQ_GRP1_FCMD_ERR_EN_230_MASK      0x00000004
#define   FICU_SQ_GRP1_FCMD_ERR_EN_230_SHIFT              2
#define   FICU_SQ_GRP0_FCMD_ERR_EN_230_MASK      0x00000002
#define   FICU_SQ_GRP0_FCMD_ERR_EN_230_SHIFT              1
#define   FICU_FSPM_FCMD_CQ_DONE_EN_230_MASK     0x00000001
#define   FICU_FSPM_FCMD_CQ_DONE_EN_230_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_fcmd_cq_done_en_230:1;
        u32 ficu_sq_grp0_fcmd_err_en_230:1;
        u32 ficu_sq_grp1_fcmd_err_en_230:1;
        u32 rsvd_3:1;
        u32 ficu_finst_err_en_230:1;
        u32 ficu_fcmd_grp0_cq_done_en_230:1;
        u32 ficu_fcmd_grp1_cq_done_en_230:1;
        u32 rsvd_7:3;
        u32 ficu_if_rw_err_en_230:1;
        u32 ficu_lst_llrm_done_en_230:1;
        u32 ficu_ard_fifo_err_en_230:1;
        u32 ficu_no_dqs_err_en_230:1;
        u32 rsvd_14:18;
    } b;
} ficu_int_en_reg1_t;

#define FICU_INT_STATUS_REG1                     0x00000234
#define   FICU_NO_DQS_ERR_INT_234_MASK           0x00002000
#define   FICU_NO_DQS_ERR_INT_234_SHIFT                  13
#define   FICU_ARD_FIFO_ERR_INT_234_MASK         0x00001000
#define   FICU_ARD_FIFO_ERR_INT_234_SHIFT                12
#define   FICU_LST_BIN_DONE_INT_MASK             0x00000800
#define   FICU_LST_BIN_DONE_INT_SHIFT                    11
#define   FICU_IF_RW_ERR_INT_234_MASK            0x00000400
#define   FICU_IF_RW_ERR_INT_234_SHIFT                   10
#define   FICU_FCMD_GRP1_CQ_DONE_INT_234_MASK    0x00000040
#define   FICU_FCMD_GRP1_CQ_DONE_INT_234_SHIFT            6
#define   FICU_FCMD_GRP0_CQ_DONE_INT_234_MASK    0x00000020
#define   FICU_FCMD_GRP0_CQ_DONE_INT_234_SHIFT            5
#define   FICU_FINST_ERR_INT_234_MASK            0x00000010
#define   FICU_FINST_ERR_INT_234_SHIFT                    4
#define   FICU_SQ_GRP1_FCMD_ERR_INT_234_MASK     0x00000004
#define   FICU_SQ_GRP1_FCMD_ERR_INT_234_SHIFT             2
#define   FICU_SQ_GRP0_FCMD_ERR_INT_234_MASK     0x00000002
#define   FICU_SQ_GRP0_FCMD_ERR_INT_234_SHIFT             1
#define   FICU_FSPM_FCMD_CQ_DONE_INT_234_MASK    0x00000001
#define   FICU_FSPM_FCMD_CQ_DONE_INT_234_SHIFT            0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_fcmd_cq_done_int_234:1;
        u32 ficu_sq_grp0_fcmd_err_int_234:1;
        u32 ficu_sq_grp1_fcmd_err_int_234:1;
        u32 rsvd_3:1;
        u32 ficu_finst_err_int_234:1;
        u32 ficu_fcmd_grp0_cq_done_int_234:1;
        u32 ficu_fcmd_grp1_cq_done_int_234:1;
        u32 rsvd_7:3;
        u32 ficu_if_rw_err_int_234:1;
        u32 ficu_lst_bin_done_int:1;
        u32 ficu_ard_fifo_err_int_234:1;
        u32 ficu_no_dqs_err_int_234:1;
        u32 rsvd_14:18;
    } b;
} ficu_int_status_reg1_t;

#define FICU_INT_EN_REG2                         0x00000238
#define   FICU_NO_DQS_ERR_EN_238_MASK            0x00002000
#define   FICU_NO_DQS_ERR_EN_238_SHIFT                   13
#define   FICU_ARD_FIFO_ERR_EN_238_MASK          0x00001000
#define   FICU_ARD_FIFO_ERR_EN_238_SHIFT                 12
#define   FICU_LST_LLRM_DONE_EN_238_MASK         0x00000800
#define   FICU_LST_LLRM_DONE_EN_238_SHIFT                11
#define   FICU_IF_RW_ERR_EN_238_MASK             0x00000400
#define   FICU_IF_RW_ERR_EN_238_SHIFT                    10
#define   FICU_FCMD_GRP1_CQ_DONE_EN_238_MASK     0x00000040
#define   FICU_FCMD_GRP1_CQ_DONE_EN_238_SHIFT             6
#define   FICU_FCMD_GRP0_CQ_DONE_EN_238_MASK     0x00000020
#define   FICU_FCMD_GRP0_CQ_DONE_EN_238_SHIFT             5
#define   FICU_FINST_ERR_EN_238_MASK             0x00000010
#define   FICU_FINST_ERR_EN_238_SHIFT                     4
#define   FICU_SQ_GRP1_FCMD_ERR_EN_238_MASK      0x00000004
#define   FICU_SQ_GRP1_FCMD_ERR_EN_238_SHIFT              2
#define   FICU_SQ_GRP0_FCMD_ERR_EN_238_MASK      0x00000002
#define   FICU_SQ_GRP0_FCMD_ERR_EN_238_SHIFT              1
#define   FICU_FSPM_FCMD_CQ_DONE_EN_238_MASK     0x00000001
#define   FICU_FSPM_FCMD_CQ_DONE_EN_238_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_fcmd_cq_done_en_238:1;
        u32 ficu_sq_grp0_fcmd_err_en_238:1;
        u32 ficu_sq_grp1_fcmd_err_en_238:1;
        u32 rsvd_3:1;
        u32 ficu_finst_err_en_238:1;
        u32 ficu_fcmd_grp0_cq_done_en_238:1;
        u32 ficu_fcmd_grp1_cq_done_en_238:1;
        u32 rsvd_7:3;
        u32 ficu_if_rw_err_en_238:1;
        u32 ficu_lst_llrm_done_en_238:1;
        u32 ficu_ard_fifo_err_en_238:1;
        u32 ficu_no_dqs_err_en_238:1;
        u32 rsvd_14:18;
    } b;
} ficu_int_en_reg2_t;

#define FICU_INT_STATUS_REG2                     0x0000023c
#define   FICU_NO_DQS_ERR_INT_23c_MASK           0x00002000
#define   FICU_NO_DQS_ERR_INT_23c_SHIFT                  13
#define   FICU_ARD_FIFO_ERR_INT_23c_MASK         0x00001000
#define   FICU_ARD_FIFO_ERR_INT_23c_SHIFT                12
#define   FICU_LST_BIN_DONE_INT_23c_MASK         0x00000800
#define   FICU_LST_BIN_DONE_INT_23c_SHIFT                11
#define   FICU_IF_RW_ERR_INT_23c_MASK            0x00000400
#define   FICU_IF_RW_ERR_INT_23c_SHIFT                   10
#define   FICU_FCMD_GRP1_CQ_DONE_INT_23c_MASK    0x00000040
#define   FICU_FCMD_GRP1_CQ_DONE_INT_23c_SHIFT            6
#define   FICU_FCMD_GRP0_CQ_DONE_INT_23c_MASK    0x00000020
#define   FICU_FCMD_GRP0_CQ_DONE_INT_23c_SHIFT            5
#define   FICU_FINST_ERR_INT_23c_MASK            0x00000010
#define   FICU_FINST_ERR_INT_23c_SHIFT                    4
#define   FICU_SQ_GRP1_FCMD_ERR_INT_23c_MASK     0x00000004
#define   FICU_SQ_GRP1_FCMD_ERR_INT_23c_SHIFT             2
#define   FICU_SQ_GRP0_FCMD_ERR_INT_23c_MASK     0x00000002
#define   FICU_SQ_GRP0_FCMD_ERR_INT_23c_SHIFT             1
#define   FICU_FSPM_FCMD_CQ_DONE_INT_23c_MASK    0x00000001
#define   FICU_FSPM_FCMD_CQ_DONE_INT_23c_SHIFT            0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_fcmd_cq_done_int_23c:1;
        u32 ficu_sq_grp0_fcmd_err_int_23c:1;
        u32 ficu_sq_grp1_fcmd_err_int_23c:1;
        u32 rsvd_3:1;
        u32 ficu_finst_err_int_23c:1;
        u32 ficu_fcmd_grp0_cq_done_int_23c:1;
        u32 ficu_fcmd_grp1_cq_done_int_23c:1;
        u32 rsvd_7:3;
        u32 ficu_if_rw_err_int_23c:1;
        u32 ficu_lst_bin_done_int_23c:1;
        u32 ficu_ard_fifo_err_int_23c:1;
        u32 ficu_no_dqs_err_int_23c:1;
        u32 rsvd_14:18;
    } b;
} ficu_int_status_reg2_t;

#define FICU_INT_EN_REG3                         0x00000240
#define   FICU_NO_DQS_ERR_EN_240_MASK            0x00002000
#define   FICU_NO_DQS_ERR_EN_240_SHIFT                   13
#define   FICU_ARD_FIFO_ERR_EN_240_MASK          0x00001000
#define   FICU_ARD_FIFO_ERR_EN_240_SHIFT                 12
#define   FICU_LST_LLRM_DONE_EN_240_MASK         0x00000800
#define   FICU_LST_LLRM_DONE_EN_240_SHIFT                11
#define   FICU_IF_RW_ERR_EN_240_MASK             0x00000400
#define   FICU_IF_RW_ERR_EN_240_SHIFT                    10
#define   FICU_FCMD_GRP1_CQ_DONE_EN_240_MASK     0x00000040
#define   FICU_FCMD_GRP1_CQ_DONE_EN_240_SHIFT             6
#define   FICU_FCMD_GRP0_CQ_DONE_EN_240_MASK     0x00000020
#define   FICU_FCMD_GRP0_CQ_DONE_EN_240_SHIFT             5
#define   FICU_FINST_ERR_EN_240_MASK             0x00000010
#define   FICU_FINST_ERR_EN_240_SHIFT                     4
#define   FICU_SQ_GRP1_FCMD_ERR_EN_240_MASK      0x00000004
#define   FICU_SQ_GRP1_FCMD_ERR_EN_240_SHIFT              2
#define   FICU_SQ_GRP0_FCMD_ERR_EN_240_MASK      0x00000002
#define   FICU_SQ_GRP0_FCMD_ERR_EN_240_SHIFT              1
#define   FICU_FSPM_FCMD_CQ_DONE_EN_240_MASK     0x00000001
#define   FICU_FSPM_FCMD_CQ_DONE_EN_240_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_fcmd_cq_done_en_240:1;
        u32 ficu_sq_grp0_fcmd_err_en_240:1;
        u32 ficu_sq_grp1_fcmd_err_en_240:1;
        u32 rsvd_3:1;
        u32 ficu_finst_err_en_240:1;
        u32 ficu_fcmd_grp0_cq_done_en_240:1;
        u32 ficu_fcmd_grp1_cq_done_en_240:1;
        u32 rsvd_7:3;
        u32 ficu_if_rw_err_en_240:1;
        u32 ficu_lst_llrm_done_en_240:1;
        u32 ficu_ard_fifo_err_en_240:1;
        u32 ficu_no_dqs_err_en_240:1;
        u32 rsvd_14:18;
    } b;
} ficu_int_en_reg3_t;

#define FICU_INT_STATUS_REG3                     0x00000244
#define   FICU_NO_DQS_ERR_INT_244_MASK           0x00002000
#define   FICU_NO_DQS_ERR_INT_244_SHIFT                  13
#define   FICU_ARD_FIFO_ERR_INT_244_MASK         0x00001000
#define   FICU_ARD_FIFO_ERR_INT_244_SHIFT                12
#define   FICU_LST_LLRM_DONE_INT_244_MASK        0x00000800
#define   FICU_LST_LLRM_DONE_INT_244_SHIFT               11
#define   FICU_IF_RW_ERR_INT_244_MASK            0x00000400
#define   FICU_IF_RW_ERR_INT_244_SHIFT                   10
#define   FICU_FCMD_GRP1_CQ_DONE_INT_244_MASK    0x00000040
#define   FICU_FCMD_GRP1_CQ_DONE_INT_244_SHIFT            6
#define   FICU_FCMD_GRP0_CQ_DONE_INT_244_MASK    0x00000020
#define   FICU_FCMD_GRP0_CQ_DONE_INT_244_SHIFT            5
#define   FICU_FINST_ERR_INT_244_MASK            0x00000010
#define   FICU_FINST_ERR_INT_244_SHIFT                    4
#define   FICU_SQ_GRP1_FCMD_ERR_INT_244_MASK     0x00000004
#define   FICU_SQ_GRP1_FCMD_ERR_INT_244_SHIFT             2
#define   FICU_SQ_GRP0_FCMD_ERR_INT_244_MASK     0x00000002
#define   FICU_SQ_GRP0_FCMD_ERR_INT_244_SHIFT             1
#define   FICU_FSPM_FCMD_CQ_DONE_INT_244_MASK    0x00000001
#define   FICU_FSPM_FCMD_CQ_DONE_INT_244_SHIFT            0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_fcmd_cq_done_int_244:1;
        u32 ficu_sq_grp0_fcmd_err_int_244:1;
        u32 ficu_sq_grp1_fcmd_err_int_244:1;
        u32 rsvd_3:1;
        u32 ficu_finst_err_int_244:1;
        u32 ficu_fcmd_grp0_cq_done_int_244:1;
        u32 ficu_fcmd_grp1_cq_done_int_244:1;
        u32 rsvd_7:3;
        u32 ficu_if_rw_err_int_244:1;
        u32 ficu_lst_llrm_done_int_244:1;
        u32 ficu_ard_fifo_err_int_244:1;
        u32 ficu_no_dqs_err_int_244:1;
        u32 rsvd_14:18;
    } b;
} ficu_int_status_reg3_t;

#define FICU_DEBUG_REG                           0x00000300
#define   FICU_DBG_STATUS_MASK                   0xffff0000
#define   FICU_DBG_STATUS_SHIFT                          16
#define   FICU_DBG_SEL_MASK                      0x0000ffff
#define   FICU_DBG_SEL_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 ficu_dbg_sel:16;
        u32 ficu_dbg_status:16;
    } b;
} ficu_debug_reg_t;

#define FICU_DEBUG_PIN_REG                       0x00000304
#define   FICU_PIN_DBG_SEL_MASK                  0x0000000f
#define   FICU_PIN_DBG_SEL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ficu_pin_dbg_sel:4;
        u32 rsvd_4:28;
    } b;
} ficu_debug_pin_reg_t;

#define FICU_DEBUG_ST_REG                        0x00000308
#define   FICU_DBG_ST_REG_MASK                   0x0000ffff
#define   FICU_DBG_ST_REG_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 ficu_dbg_st_reg:16;
        u32 rsvd_16:16;
    } b;
} ficu_debug_st_reg_t;

#define FICU_CTRL_REG2                           0x0000030c
#define   FICU_NF_CH_ST_REQ_LOCK_EN_MASK         0x80000000
#define   FICU_NF_CH_ST_REQ_LOCK_EN_SHIFT                31
#define   FICU_RAID_COMPL_IF_DISABLE_MASK        0x40000000
#define   FICU_RAID_COMPL_IF_DISABLE_SHIFT               30
#define   FSPM_FINST_QUE_REQ_ERR_MASK            0x00000008
#define   FSPM_FINST_QUE_REQ_ERR_SHIFT                    3
#define   FICU_SOFT_RST_COMPL_MASK               0x00000004
#define   FICU_SOFT_RST_COMPL_SHIFT                       2
#define   FICU_ARD_LOOP_CHK_DISABLE_MASK         0x00000002
#define   FICU_ARD_LOOP_CHK_DISABLE_SHIFT                 1
#define   FICU_CLK_GATING_FLEX_CTRL_MASK         0x00000001
#define   FICU_CLK_GATING_FLEX_CTRL_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 ficu_clk_gating_flex_ctrl:1;
        u32 ficu_ard_loop_chk_disable:1;
        u32 ficu_soft_rst_compl:1;
        u32 fspm_finst_que_req_err:1;
        u32 rsvd_4:26;
        u32 ficu_raid_compl_if_disable:1;
        u32 ficu_nf_ch_st_req_lock_en:1;
    } b;
} ficu_ctrl_reg2_t;

#define FICU_ARD_FINST_STATUS_REG1               0x00000310
#define   FICU_ARD_TASK_DEV_ID_MASK              0x00007800
#define   FICU_ARD_TASK_DEV_ID_SHIFT                     11
#define   FICU_ARD_TASK_CH_ID_MASK               0x00000780
#define   FICU_ARD_TASK_CH_ID_SHIFT                       7
#define   FICU_ARD_TASK_MP_IDX_MASK              0x00000078
#define   FICU_ARD_TASK_MP_IDX_SHIFT                      3
#define   FICU_ARD_TASK_DU_IDX_MASK              0x00000007
#define   FICU_ARD_TASK_DU_IDX_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 ficu_ard_task_du_idx:3;
        u32 ficu_ard_task_mp_idx:4;
        u32 ficu_ard_task_ch_id:4;
        u32 ficu_ard_task_dev_id:4;
        u32 rsvd_15:17;
    } b;
} ficu_ard_finst_status_reg1_t;

#define FICU_ARD_FINST_STATUS_REG2               0x00000314
#define   FICU_ARD_TASK_FINST_LUT_ID_MASK        0x00ff0000
#define   FICU_ARD_TASK_FINST_LUT_ID_SHIFT               16
#define   FICU_ARD_TASK_DU_TAG_MASK              0x0000fe00
#define   FICU_ARD_TASK_DU_TAG_SHIFT                      9
#define   FICU_ARD_TASK_DU_FMT_SEL_MASK          0x000001f0
#define   FICU_ARD_TASK_DU_FMT_SEL_SHIFT                  4
#define   FICU_ARD_TASK_FIFO_CNT_MASK            0x0000000f
#define   FICU_ARD_TASK_FIFO_CNT_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ficu_ard_task_fifo_cnt:4;
        u32 ficu_ard_task_du_fmt_sel:5;
        u32 ficu_ard_task_du_tag:7;
        u32 ficu_ard_task_finst_lut_id:8;
        u32 rsvd_24:8;
    } b;
} ficu_ard_finst_status_reg2_t;

#define FICU_FSPM_SRAM_ECC_ERR                   0x00000318
#define   FICU_FSPM_SRAM1_ECC_ERR_DETECT_MASK    0x40000000
#define   FICU_FSPM_SRAM1_ECC_ERR_DETECT_SHIFT           30
#define   FICU_FSPM_SRAM1_ECC_ERR_LOC_MASK       0x3fff0000
#define   FICU_FSPM_SRAM1_ECC_ERR_LOC_SHIFT              16
#define   FICU_FSPM_SRAM0_ECC_ERR_DETECT_MASK    0x00004000
#define   FICU_FSPM_SRAM0_ECC_ERR_DETECT_SHIFT           14
#define   FICU_FSPM_SRAM0_ECC_ERR_LOC_MASK       0x00003fff
#define   FICU_FSPM_SRAM0_ECC_ERR_LOC_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 ficu_fspm_sram0_ecc_err_loc:14;
        u32 ficu_fspm_sram0_ecc_err_detect:1;
        u32 rsvd_15:1;
        u32 ficu_fspm_sram1_ecc_err_loc:14;
        u32 ficu_fspm_sram1_ecc_err_detect:1;
        u32 rsvd_31:1;
    } b;
} ficu_fspm_sram_ecc_err_t;

#define FICU_DEC_ERD_DU_ST_CNT_REG               0x0000031c
#define   FIC_DEC_ERD_DU_ST_CNT_MASK             0x0000ffff
#define   FIC_DEC_ERD_DU_ST_CNT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 fic_dec_erd_du_st_cnt:16;
        u32 rsvd_16:16;
    } b;
} ficu_dec_erd_du_st_cnt_reg_t;

#define FICU_DEC_ERD_DU_DONE_CNT_REG             0x00000320
#define   FIC_DEC_ERD_DU_RCV_CNT_MASK            0xffff0000
#define   FIC_DEC_ERD_DU_RCV_CNT_SHIFT                   16
#define   FIC_DEC_ERD_DU_DONE_CNT_MASK           0x0000ffff
#define   FIC_DEC_ERD_DU_DONE_CNT_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 fic_dec_erd_du_done_cnt:16;
        u32 fic_dec_erd_du_rcv_cnt:16;
    } b;
} ficu_dec_erd_du_done_cnt_reg_t;

#define FICU_NORM_FINST_QUE0_BASE_ADDR           0x00000400
#define   NORM_FINST_QUE0_ENTRY_MAX_SZ_MASK      0xff000000
#define   NORM_FINST_QUE0_ENTRY_MAX_SZ_SHIFT             24
#define   NORM_FINST_QUE0_BASE_ADDR_MASK         0x007fffff
#define   NORM_FINST_QUE0_BASE_ADDR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 norm_finst_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 norm_finst_que0_entry_max_sz:8;
    } b;
} ficu_norm_finst_que0_base_addr_t;

#define FICU_NORM_FINST_QUE0_PTRS                0x00000404
#define   NORM_FINST_QUE0_RD_PTR_MASK            0x0000ff00
#define   NORM_FINST_QUE0_RD_PTR_SHIFT                    8
#define   NORM_FINST_QUE0_WR_PTR_MASK            0x000000ff
#define   NORM_FINST_QUE0_WR_PTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 norm_finst_que0_wr_ptr:8;
        u32 norm_finst_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} ficu_norm_finst_que0_ptrs_t;

#define FICU_NORM_FINST_QUE0_RDPTR_BASE_ADDR     0x00000408
#define   NORM_FINST_QUE0_RDPTR_UPDT_EN_MASK     0x80000000
#define   NORM_FINST_QUE0_RDPTR_UPDT_EN_SHIFT            31
#define   NORM_FINST_QUE0_RDPTR_BASE_ADDR_MASK   0x007fffff
#define   NORM_FINST_QUE0_RDPTR_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 norm_finst_que0_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 norm_finst_que0_rdptr_updt_en:1;
    } b;
} ficu_norm_finst_que0_rdptr_base_addr_t;

#define FICU_HIGH_FINST_QUE0_BASE_ADDR           0x0000040c
#define   HIGH_FINST_QUE0_ENTRY_MAX_SZ_MASK      0xff000000
#define   HIGH_FINST_QUE0_ENTRY_MAX_SZ_SHIFT             24
#define   HIGH_FINST_QUE0_BASE_ADDR_MASK         0x007fffff
#define   HIGH_FINST_QUE0_BASE_ADDR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 high_finst_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 high_finst_que0_entry_max_sz:8;
    } b;
} ficu_high_finst_que0_base_addr_t;

#define FICU_HIGH_FINST_QUE0_PTRS                0x00000410
#define   HIGH_FINST_QUE0_RD_PTR_MASK            0x0000ff00
#define   HIGH_FINST_QUE0_RD_PTR_SHIFT                    8
#define   HIGH_FINST_QUE0_WR_PTR_MASK            0x000000ff
#define   HIGH_FINST_QUE0_WR_PTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 high_finst_que0_wr_ptr:8;
        u32 high_finst_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} ficu_high_finst_que0_ptrs_t;

#define FICU_HIGH_FINST_QUE0_RDPTR_BASE_ADDR     0x00000414
#define   HIGH_FINST_QUE0_RDPTR_UPDT_EN_MASK     0x80000000
#define   HIGH_FINST_QUE0_RDPTR_UPDT_EN_SHIFT            31
#define   HIGH_FINST_QUE0_RDPTR_BASE_ADDR_MASK   0x007fffff
#define   HIGH_FINST_QUE0_RDPTR_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 high_finst_que0_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 high_finst_que0_rdptr_updt_en:1;
    } b;
} ficu_high_finst_que0_rdptr_base_addr_t;

#define FICU_URGENT_FINST_QUE0_BASE_ADDR         0x00000418
#define   URGENT_FINST_QUE0_ENTRY_MAX_SZ_MASK    0xff000000
#define   URGENT_FINST_QUE0_ENTRY_MAX_SZ_SHIFT           24
#define   URGENT_FINST_QUE0_BASE_ADDR_MASK       0x007fffff
#define   URGENT_FINST_QUE0_BASE_ADDR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 urgent_finst_que0_base_addr:23;
        u32 rsvd_23:1;
        u32 urgent_finst_que0_entry_max_sz:8;
    } b;
} ficu_urgent_finst_que0_base_addr_t;

#define FICU_URGENT_FINST_QUE0_PTRS              0x0000041c
#define   URGENT_FINST_QUE0_RD_PTR_MASK          0x0000ff00
#define   URGENT_FINST_QUE0_RD_PTR_SHIFT                  8
#define   URGENT_FINST_QUE0_WR_PTR_MASK          0x000000ff
#define   URGENT_FINST_QUE0_WR_PTR_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 urgent_finst_que0_wr_ptr:8;
        u32 urgent_finst_que0_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} ficu_urgent_finst_que0_ptrs_t;

#define FICU_URGENT_FINST_QUE0_RDPTR_BASE_ADDR   0x00000420
#define   URGENT_FINST_QUE0_RDPTR_UPDT_EN_MASK   0x80000000
#define   URGENT_FINST_QUE0_RDPTR_UPDT_EN_SHIFT          31
#define   URGENT_FINST_QUE0_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   URGENT_FINST_QUE0_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 urgent_finst_que0_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 urgent_finst_que0_rdptr_updt_en:1;
    } b;
} ficu_urgent_finst_que0_rdptr_base_addr_t;

#define FICU_NORM_FINST_QUE1_BASE_ADDR           0x00000424
#define   NORM_FINST_QUE1_ENTRY_MAX_SZ_MASK      0xff000000
#define   NORM_FINST_QUE1_ENTRY_MAX_SZ_SHIFT             24
#define   NORM_FINST_QUE1_BASE_ADDR_MASK         0x007fffff
#define   NORM_FINST_QUE1_BASE_ADDR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 norm_finst_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 norm_finst_que1_entry_max_sz:8;
    } b;
} ficu_norm_finst_que1_base_addr_t;

#define FICU_NORM_FINST_QUE1_PTRS                0x00000428
#define   NORM_FINST_QUE1_RD_PTR_MASK            0x0000ff00
#define   NORM_FINST_QUE1_RD_PTR_SHIFT                    8
#define   NORM_FINST_QUE1_WR_PTR_MASK            0x000000ff
#define   NORM_FINST_QUE1_WR_PTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 norm_finst_que1_wr_ptr:8;
        u32 norm_finst_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} ficu_norm_finst_que1_ptrs_t;

#define FICU_NORM_FINST_QUE1_RDPTR_BASE_ADDR     0x0000042c
#define   NORM_FINST_QUE1_RDPTR_UPDT_EN_MASK     0x80000000
#define   NORM_FINST_QUE1_RDPTR_UPDT_EN_SHIFT            31
#define   NORM_FINST_QUE1_RDPTR_BASE_ADDR_MASK   0x007fffff
#define   NORM_FINST_QUE1_RDPTR_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 norm_finst_que1_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 norm_finst_que1_rdptr_updt_en:1;
    } b;
} ficu_norm_finst_que1_rdptr_base_addr_t;

#define FICU_HIGH_FINST_QUE1_BASE_ADDR           0x00000430
#define   HIGH_FINST_QUE1_ENTRY_MAX_SZ_MASK      0xff000000
#define   HIGH_FINST_QUE1_ENTRY_MAX_SZ_SHIFT             24
#define   HIGH_FINST_QUE1_BASE_ADDR_MASK         0x007fffff
#define   HIGH_FINST_QUE1_BASE_ADDR_SHIFT                 0

typedef union {
    u32 all;
    struct {
        u32 high_finst_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 high_finst_que1_entry_max_sz:8;
    } b;
} ficu_high_finst_que1_base_addr_t;

#define FICU_HIGH_FINST_QUE1_PTRS                0x00000434
#define   HIGH_FINST_QUE1_RD_PTR_MASK            0x0000ff00
#define   HIGH_FINST_QUE1_RD_PTR_SHIFT                    8
#define   HIGH_FINST_QUE1_WR_PTR_MASK            0x000000ff
#define   HIGH_FINST_QUE1_WR_PTR_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 high_finst_que1_wr_ptr:8;
        u32 high_finst_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} ficu_high_finst_que1_ptrs_t;

#define FICU_HIGH_FINST_QUE1_RDPTR_BASE_ADDR     0x00000438
#define   HIGH_FINST_QUE1_RDPTR_UPDT_EN_MASK     0x80000000
#define   HIGH_FINST_QUE1_RDPTR_UPDT_EN_SHIFT            31
#define   HIGH_FINST_QUE1_RDPTR_BASE_ADDR_MASK   0x007fffff
#define   HIGH_FINST_QUE1_RDPTR_BASE_ADDR_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 high_finst_que1_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 high_finst_que1_rdptr_updt_en:1;
    } b;
} ficu_high_finst_que1_rdptr_base_addr_t;

#define FICU_URGENT_FINST_QUE1_BASE_ADDR         0x0000043c
#define   URGENT_FINST_QUE1_ENTRY_MAX_SZ_MASK    0xff000000
#define   URGENT_FINST_QUE1_ENTRY_MAX_SZ_SHIFT           24
#define   URGENT_FINST_QUE1_BASE_ADDR_MASK       0x007fffff
#define   URGENT_FINST_QUE1_BASE_ADDR_SHIFT               0

typedef union {
    u32 all;
    struct {
        u32 urgent_finst_que1_base_addr:23;
        u32 rsvd_23:1;
        u32 urgent_finst_que1_entry_max_sz:8;
    } b;
} ficu_urgent_finst_que1_base_addr_t;

#define FICU_URGENT_FINST_QUE1_PTRS              0x00000440
#define   URGENT_FINST_QUE1_RD_PTR_MASK          0x0000ff00
#define   URGENT_FINST_QUE1_RD_PTR_SHIFT                  8
#define   URGENT_FINST_QUE1_WR_PTR_MASK          0x000000ff
#define   URGENT_FINST_QUE1_WR_PTR_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 urgent_finst_que1_wr_ptr:8;
        u32 urgent_finst_que1_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} ficu_urgent_finst_que1_ptrs_t;

#define FICU_URGENT_FINST_QUE1_RDPTR_BASE_ADDR   0x00000444
#define   URGENT_FINST_QUE1_RDPTR_UPDT_EN_MASK   0x80000000
#define   URGENT_FINST_QUE1_RDPTR_UPDT_EN_SHIFT          31
#define   URGENT_FINST_QUE1_RDPTR_BASE_ADDR_MASK 0x007fffff
#define   URGENT_FINST_QUE1_RDPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 urgent_finst_que1_rdptr_base_addr:23;
        u32 rsvd_23:8;
        u32 urgent_finst_que1_rdptr_updt_en:1;
    } b;
} ficu_urgent_finst_que1_rdptr_base_addr_t;

#define FICU_GRP0_FCMD_COMPL_QUE_BASE_ADDR       0x00000460
#define   GRP0_FCMD_COMPL_QUE_ENTRY_MAX_SZ_MASK  0xff000000
#define   GRP0_FCMD_COMPL_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   GRP0_FCMD_COMPL_QUE_BASE_ADDR_MASK     0x007fffff
#define   GRP0_FCMD_COMPL_QUE_BASE_ADDR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 grp0_fcmd_compl_que_base_addr:23;
        u32 rsvd_23:1;
        u32 grp0_fcmd_compl_que_entry_max_sz:8;
    } b;
} ficu_grp0_fcmd_compl_que_base_addr_t;

#define FICU_GRP0_FCMD_COMPL_QUE_PTRS            0x00000464
#define   GRP0_FCMD_COMPL_QUE_RD_PTR_MASK        0x0000ff00
#define   GRP0_FCMD_COMPL_QUE_RD_PTR_SHIFT                8
#define   GRP0_FCMD_COMPL_QUE_WR_PTR_MASK        0x000000ff
#define   GRP0_FCMD_COMPL_QUE_WR_PTR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 grp0_fcmd_compl_que_wr_ptr:8;
        u32 grp0_fcmd_compl_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} ficu_grp0_fcmd_compl_que_ptrs_t;

#define FICU_GRP0_FCMD_COMPL_QUE_WRPTR_BASE_ADDR 0x00000468
#define   GRP0_FCMD_COMPL_QUE_WRPTR_UPDT_EN_MASK 0x80000000
#define   GRP0_FCMD_COMPL_QUE_WRPTR_UPDT_EN_SHIFT         31
#define   GRP0_FCMD_COMPL_QUE_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   GRP0_FCMD_COMPL_QUE_WRPTR_BASE_ADDR_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 grp0_fcmd_compl_que_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 grp0_fcmd_compl_que_wrptr_updt_en:1;
    } b;
} ficu_grp0_fcmd_compl_que_wrptr_base_addr_t;

#define FICU_GRP1_FCMD_COMPL_QUE_BASE_ADDR       0x0000046c
#define   GRP1_FCMD_COMPL_QUE_ENTRY_MAX_SZ_MASK  0xff000000
#define   GRP1_FCMD_COMPL_QUE_ENTRY_MAX_SZ_SHIFT         24
#define   GRP1_FCMD_COMPL_QUE_BASE_ADDR_MASK     0x007fffff
#define   GRP1_FCMD_COMPL_QUE_BASE_ADDR_SHIFT             0

typedef union {
    u32 all;
    struct {
        u32 grp1_fcmd_compl_que_base_addr:23;
        u32 rsvd_23:1;
        u32 grp1_fcmd_compl_que_entry_max_sz:8;
    } b;
} ficu_grp1_fcmd_compl_que_base_addr_t;

#define FICU_GRP1_FCMD_COMPL_QUE_PTRS            0x00000470
#define   GRP1_FCMD_COMPL_QUE_RD_PTR_MASK        0x0000ff00
#define   GRP1_FCMD_COMPL_QUE_RD_PTR_SHIFT                8
#define   GRP1_FCMD_COMPL_QUE_WR_PTR_MASK        0x000000ff
#define   GRP1_FCMD_COMPL_QUE_WR_PTR_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 grp1_fcmd_compl_que_wr_ptr:8;
        u32 grp1_fcmd_compl_que_rd_ptr:8;
        u32 rsvd_16:16;
    } b;
} ficu_grp1_fcmd_compl_que_ptrs_t;

#define FICU_GRP1_FCMD_COMPL_QUE_WRPTR_BASE_ADDR 0x00000474
#define   GRP1_FCMD_COMPL_QUE_WRPTR_UPDT_EN_MASK 0x80000000
#define   GRP1_FCMD_COMPL_QUE_WRPTR_UPDT_EN_SHIFT         31
#define   GRP1_FCMD_COMPL_QUE_WRPTR_BASE_ADDR_MASK 0x007fffff
#define   GRP1_FCMD_COMPL_QUE_WRPTR_BASE_ADDR_SHIFT          0
typedef union {
    u32 all;
    struct {
        u32 grp1_fcmd_compl_que_wrptr_base_addr:23;
        u32 rsvd_23:8;
        u32 grp1_fcmd_compl_que_wrptr_updt_en:1;
    } b;
} ficu_grp1_fcmd_compl_que_wrptr_base_addr_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ ficu_ctrl_reg0_t ficu_ctrl_reg0;
    /* 0x0004 */ ficu_ctrl_reg1_t ficu_ctrl_reg1;
    /* 0x0008 */ ficu_int_en_reg0_t ficu_int_en_reg0;
    /* 0x000c */ ficu_int_status_reg0_t ficu_int_status_reg0;
    /* 0x0010 */ ficu_int_src_reg_t ficu_int_src_reg;
    /* 0x0014 */ ficu_status_reg0_t ficu_status_reg0;
    /* 0x0018 */ ficu_status_reg1_t ficu_status_reg1;
    /* 0x001c */ ficu_status_reg2_t ficu_status_reg2;
    /* 0x0020 */ ficu_status_reg3_t ficu_status_reg3;
    /* 0x0024 */ ficu_status_reg4_t ficu_status_reg4;
    /* 0x0028 */ ficu_status_reg5_t ficu_status_reg5;
    /* 0x002c */ ficu_status_reg6_t ficu_status_reg6;
    /* 0x0030 */ u32 rsvd_30 [9];
    /* 0x0054 */ ficu_lut_st_addr_reg_t ficu_lut_st_addr_reg;
    /* 0x0058 */ ficu_lut_end_addr_reg_t ficu_lut_end_addr_reg;
    /* 0x005c */ ficu_erd_para_fifo_st_addr_reg_t ficu_erd_para_fifo_st_addr_reg;
    /* 0x0060 */ ficu_erd_para_fifo_end_addr_reg_t ficu_erd_para_fifo_end_addr_reg;
    /* 0x0064 */ ficu_erd_para_fifo_ptr_reg_t ficu_erd_para_fifo_ptr_reg;
    /* 0x0068 */ u32 rsvd_68 [3];
    /* 0x0074 */ ficu_du_logs_fifo_st_addr_reg_t ficu_du_logs_fifo_st_addr_reg;
    /* 0x0078 */ ficu_du_logs_fifo_end_addr_reg_t ficu_du_logs_fifo_end_addr_reg;
    /* 0x007c */ ficu_du_logs_fifo_ptr_reg_t ficu_du_logs_fifo_ptr_reg;
    /* 0x0080 */ ficu_get_param_fifo_st_addr_reg_t ficu_get_param_fifo_st_addr_reg;
    /* 0x0084 */ ficu_get_param_fifo_end_addr_reg_t ficu_get_param_fifo_end_addr_reg;
    /* 0x0088 */ ficu_get_param_fifo_ptr_reg_t ficu_get_param_fifo_ptr_reg;
    /* 0x008c */ ficu_ard_conf_reg0_t ficu_ard_conf_reg0;
    /* 0x0090 */ ficu_ard_conf_reg1_t ficu_ard_conf_reg1;
    /* 0x0094 */ ficu_ard_conf_reg2_t ficu_ard_conf_reg2;
    /* 0x0098 */ ficu_ard_conf_reg3_t ficu_ard_conf_reg3;
    /* 0x009c */ ficu_ard_conf_reg4_t ficu_ard_conf_reg4;
    /* 0x00a0 */ ficu_ard_conf_reg5_t ficu_ard_conf_reg5;
    /* 0x00a4 */ ficu_ard_conf_reg6_t ficu_ard_conf_reg6;
    /* 0x00a8 */ ficu_ard_conf_reg7_t ficu_ard_conf_reg7;
    /* 0x00ac */ ficu_xfcnt_lut_conf_reg_t ficu_xfcnt_lut_conf_reg;
    /* 0x00b0 */ ficu_xfcnt_lut_val_reg_t ficu_xfcnt_lut_val_reg;
    /* 0x00b4 */ ficu_fspm_init_reg_t ficu_fspm_init_reg;
    /* 0x00b8 */ u32 rsvd_b8 [2];
    /* 0x00c0 */ ficu_vsc_tmpl_info_conf_reg_t ficu_vsc_tmpl_info_conf_reg;
    /* 0x00c4 */ ficu_vsc_tmpl_info_reg_t ficu_vsc_tmpl_info_reg;
    /* 0x00c8 */ ficu_fcmd_cq_st_addr_reg_t ficu_fcmd_cq_st_addr_reg;
    /* 0x00cc */ ficu_fcmd_cq_end_addr_reg_t ficu_fcmd_cq_end_addr_reg;
    /* 0x00d0 */ ficu_fcmd_cq_cnt_reg_t ficu_fcmd_cq_cnt_reg;
    /* 0x00d4 */ ficu_ch_mapping_reg_t ficu_ch_mapping_reg;
    /* 0x00d8 */ ficu_ch_rev_mapping_reg_t ficu_ch_rev_mapping_reg;
    /* 0x00dc */ ficu_ref_mask_reg0_t ficu_ref_mask_reg0;
    /* 0x00e0 */ ficu_ref_mask_reg1_t ficu_ref_mask_reg1;
    /* 0x00e4 */ ficu_mp_row_offset_t ficu_mp_row_offset;
    /* 0x00e8 */ ficu_fspm_st_addr_reg_t ficu_fspm_st_addr_reg;
    /* 0x00ec */ ficu_fspm_end_addr_reg_t ficu_fspm_end_addr_reg;
    /* 0x00f0 */ ficu_sys_sram_st_addr_reg_t ficu_sys_sram_st_addr_reg;
    /* 0x00f4 */ ficu_sys_sram_end_addr_reg_t ficu_sys_sram_end_addr_reg;
    /* 0x00f8 */ ficu_fda_dtag_list_dtcm_base_addr0_reg_t ficu_fda_dtag_list_dtcm_base_addr0_reg;
    /* 0x00fc */ ficu_fda_dtag_list_dtcm_base_addr1_reg_t ficu_fda_dtag_list_dtcm_base_addr1_reg;
    /* 0x0100 */ ficu_fda_dtag_list_sram_base_addr0_reg_t ficu_fda_dtag_list_sram_base_addr0_reg;
    /* 0x0104 */ ficu_fda_dtag_list_sram_base_addr1_reg_t ficu_fda_dtag_list_sram_base_addr1_reg;
    /* 0x0108 */ ficu_cost_llr_list_dtcm_base_addr0_reg_t ficu_cost_llr_list_dtcm_base_addr0_reg;
    /* 0x010c */ ficu_cost_llr_list_dtcm_base_addr1_reg_t ficu_cost_llr_list_dtcm_base_addr1_reg;
    /* 0x0110 */ ficu_cost_llr_list_sram_base_addr0_reg_t ficu_cost_llr_list_sram_base_addr0_reg;
    /* 0x0114 */ ficu_cost_llr_list_sram_base_addr1_reg_t ficu_cost_llr_list_sram_base_addr1_reg;
    /* 0x0118 */ ficu_lda_list_dtcm_base_addr0_reg_t ficu_lda_list_dtcm_base_addr0_reg;
    /* 0x011c */ ficu_lda_list_dtcm_base_addr1_reg_t ficu_lda_list_dtcm_base_addr1_reg;
    /* 0x0120 */ ficu_lda_list_sram_base_addr0_reg_t ficu_lda_list_sram_base_addr0_reg;
    /* 0x0124 */ ficu_lda_list_sram_base_addr1_reg_t ficu_lda_list_sram_base_addr1_reg;
    /* 0x0128 */ ficu_meta_dtag_map_sram_base_addr_reg_t ficu_meta_dtag_map_sram_base_addr_reg;
    /* 0x012c */ ficu_meta_dtag_map_ddr_base_addr_reg_t ficu_meta_dtag_map_ddr_base_addr_reg;
    /* 0x0130 */ ficu_meta_idx_map_sram_base_addr_reg_t ficu_meta_idx_map_sram_base_addr_reg;
    /* 0x0134 */ ficu_meta_idx_map_ddr_base_addr_reg_t ficu_meta_idx_map_ddr_base_addr_reg;
    /* 0x0138 */ ficu_meta_dtag_idx_map_unit_size_reg_t ficu_meta_dtag_idx_map_unit_size_reg;
    /* 0x013c */ ficu_meta_auto_idx_enc_base_addr0_reg_t ficu_meta_auto_idx_enc_base_addr0_reg;
    /* 0x0140 */ ficu_meta_auto_idx_enc_base_addr1_reg_t ficu_meta_auto_idx_enc_base_addr1_reg;
    /* 0x0144 */ ficu_meta_auto_idx_dec_base_addr0_reg_t ficu_meta_auto_idx_dec_base_addr0_reg;
    /* 0x0148 */ ficu_meta_auto_idx_dec_base_addr1_reg_t ficu_meta_auto_idx_dec_base_addr1_reg;
    /* 0x014c */ ficu_meta_dtag_map_hmb_base_addr_reg_t ficu_meta_dtag_map_hmb_base_addr_reg;
    /* 0x0150 */ ficu_meta_idx_map_hmb_base_addr_reg_t ficu_meta_idx_map_hmb_base_addr_reg;
    /* 0x0154 */ u32 rsvd_154 [5];
    /* 0x0168 */ ficu_pda_conf_reg0_t ficu_pda_conf_reg0;
    /* 0x016c */ ficu_pda_conf_reg1_t ficu_pda_conf_reg1;
    /* 0x0170 */ ficu_row_addr_conf_reg_t ficu_row_addr_conf_reg;
    /* 0x0174 */ ficu_pda_conf_reg2_t ficu_pda_conf_reg2;
    /* 0x0178 */ ficu_nf_finst_cnt_reg_t ficu_nf_finst_cnt_reg;
    /* 0x017c */ u32 rsvd_17c;
    /* 0x0180 */ ficu_du_done_cnt_reg_t ficu_du_done_cnt_reg;
    /* 0x0184 */ ficu_du_rcv_done_cnt_reg_t ficu_du_rcv_done_cnt_reg;
    /* 0x0188 */ ficu_du_start_cnt_reg_t ficu_du_start_cnt_reg;
    /* 0x018c */ ficu_fcmd_status_reg0_t ficu_fcmd_status_reg0;
    /* 0x0190 */ ficu_fcmd_status_reg1_t ficu_fcmd_status_reg1;
    /* 0x0194 */ ficu_fcmd_status_reg2_t ficu_fcmd_status_reg2;
    /* 0x0198 */ ficu_fcmd_status_reg3_t ficu_fcmd_status_reg3;
    /* 0x019c */ ficu_finst_status_reg0_t ficu_finst_status_reg0;
    /* 0x01a0 */ ficu_finst_status_reg1_t ficu_finst_status_reg1;
    /* 0x01a4 */ ficu_finst_status_reg2_t ficu_finst_status_reg2;
    /* 0x01a8 */ ficu_ard_finst_status_reg0_t ficu_ard_finst_status_reg0;
    /* 0x01ac */ ficu_ard_du_cnt_reg_t ficu_ard_du_cnt_reg;
    /* 0x01b0 */ ficu_enc_raid_par_du_cnt_reg_t ficu_enc_raid_par_du_cnt_reg;
    /* 0x01b4 */ ficu_dec_raid_par_du_cnt_reg_t ficu_dec_raid_par_du_cnt_reg;
    /* 0x01b8 */ ficu_dummy_du_dtag_reg_t ficu_dummy_du_dtag_reg;
    /* 0x01bc */ ficu_fspm_ecc_err_inject_t ficu_fspm_ecc_err_inject;
    /* 0x01c0 */ ficu_fspm_norm_finst_que0_cnt_reg_t ficu_fspm_norm_finst_que0_cnt_reg;
    /* 0x01c4 */ ficu_fspm_high_finst_que0_cnt_reg_t ficu_fspm_high_finst_que0_cnt_reg;
    /* 0x01c8 */ ficu_fspm_urgent_finst_que0_cnt_reg_t ficu_fspm_urgent_finst_que0_cnt_reg;
    /* 0x01cc */ ficu_fspm_norm_finst_que0_st_addr_reg_t ficu_fspm_norm_finst_que0_st_addr_reg;
    /* 0x01d0 */ ficu_fspm_norm_finst_que0_end_addr_reg_t ficu_fspm_norm_finst_que0_end_addr_reg;
    /* 0x01d4 */ ficu_fspm_norm_finst_que0_ptr_reg_t ficu_fspm_norm_finst_que0_ptr_reg;
    /* 0x01d8 */ ficu_fspm_high_finst_que0_st_addr_reg_t ficu_fspm_high_finst_que0_st_addr_reg;
    /* 0x01dc */ ficu_fspm_high_finst_que0_end_addr_reg_t ficu_fspm_high_finst_que0_end_addr_reg;
    /* 0x01e0 */ ficu_fspm_high_finst_que0_ptr_reg_t ficu_fspm_high_finst_que0_ptr_reg;
    /* 0x01e4 */ ficu_fspm_urgent_finst_que0_st_addr_reg_t ficu_fspm_urgent_finst_que0_st_addr_reg;
    /* 0x01e8 */ ficu_fspm_urgent_finst_que0_end_addr_reg_t ficu_fspm_urgent_finst_que0_end_addr_reg;
    /* 0x01ec */ ficu_fspm_urgent_finst_que0_ptr_reg_t ficu_fspm_urgent_finst_que0_ptr_reg;
    /* 0x01f0 */ ficu_fspm_norm_finst_que1_cnt_reg_t ficu_fspm_norm_finst_que1_cnt_reg;
    /* 0x01f4 */ ficu_fspm_high_finst_que1_cnt_reg_t ficu_fspm_high_finst_que1_cnt_reg;
    /* 0x01f8 */ ficu_fspm_urgent_finst_que1_cnt_reg_t ficu_fspm_urgent_finst_que1_cnt_reg;
    /* 0x01fc */ ficu_fspm_norm_finst_que1_st_addr_reg_t ficu_fspm_norm_finst_que1_st_addr_reg;
    /* 0x0200 */ ficu_fspm_norm_finst_que1_end_addr_reg_t ficu_fspm_norm_finst_que1_end_addr_reg;
    /* 0x0204 */ ficu_fspm_norm_finst_que1_ptr_reg_t ficu_fspm_norm_finst_que1_ptr_reg;
    /* 0x0208 */ ficu_fspm_high_finst_que1_st_addr_reg_t ficu_fspm_high_finst_que1_st_addr_reg;
    /* 0x020c */ ficu_fspm_high_finst_que1_end_addr_reg_t ficu_fspm_high_finst_que1_end_addr_reg;
    /* 0x0210 */ ficu_fspm_high_finst_que1_ptr_reg_t ficu_fspm_high_finst_que1_ptr_reg;
    /* 0x0214 */ ficu_fspm_urgent_finst_que1_st_addr_reg_t ficu_fspm_urgent_finst_que1_st_addr_reg;
    /* 0x0218 */ ficu_fspm_urgent_finst_que1_end_addr_reg_t ficu_fspm_urgent_finst_que1_end_addr_reg;
    /* 0x021c */ ficu_fspm_urgent_finst_que1_ptr_reg_t ficu_fspm_urgent_finst_que1_ptr_reg;
    /* 0x0220 */ u32 rsvd_220 [4];
    /* 0x0230 */ ficu_int_en_reg1_t ficu_int_en_reg1;
    /* 0x0234 */ ficu_int_status_reg1_t ficu_int_status_reg1;
    /* 0x0238 */ ficu_int_en_reg2_t ficu_int_en_reg2;
    /* 0x023c */ ficu_int_status_reg2_t ficu_int_status_reg2;
    /* 0x0240 */ ficu_int_en_reg3_t ficu_int_en_reg3;
    /* 0x0244 */ ficu_int_status_reg3_t ficu_int_status_reg3;
    /* 0x0248 */ u32 rsvd_248 [46];
    /* 0x0300 */ ficu_debug_reg_t ficu_debug_reg;
    /* 0x0304 */ ficu_debug_pin_reg_t ficu_debug_pin_reg;
    /* 0x0308 */ ficu_debug_st_reg_t ficu_debug_st_reg;
    /* 0x030c */ ficu_ctrl_reg2_t ficu_ctrl_reg2;
    /* 0x0310 */ ficu_ard_finst_status_reg1_t ficu_ard_finst_status_reg1;
    /* 0x0314 */ ficu_ard_finst_status_reg2_t ficu_ard_finst_status_reg2;
    /* 0x0318 */ ficu_fspm_sram_ecc_err_t ficu_fspm_sram_ecc_err;
    /* 0x031c */ ficu_dec_erd_du_st_cnt_reg_t ficu_dec_erd_du_st_cnt_reg;
    /* 0x0320 */ ficu_dec_erd_du_done_cnt_reg_t ficu_dec_erd_du_done_cnt_reg;
    /* 0x0324 */ u32 rsvd_324 [55];
    /* 0x0400 */ ficu_norm_finst_que0_base_addr_t ficu_norm_finst_que0_base_addr;
    /* 0x0404 */ ficu_norm_finst_que0_ptrs_t ficu_norm_finst_que0_ptrs;
    /* 0x0408 */ ficu_norm_finst_que0_rdptr_base_addr_t ficu_norm_finst_que0_rdptr_base_addr;
    /* 0x040c */ ficu_high_finst_que0_base_addr_t ficu_high_finst_que0_base_addr;
    /* 0x0410 */ ficu_high_finst_que0_ptrs_t ficu_high_finst_que0_ptrs;
    /* 0x0414 */ ficu_high_finst_que0_rdptr_base_addr_t ficu_high_finst_que0_rdptr_base_addr;
    /* 0x0418 */ ficu_urgent_finst_que0_base_addr_t ficu_urgent_finst_que0_base_addr;
    /* 0x041c */ ficu_urgent_finst_que0_ptrs_t ficu_urgent_finst_que0_ptrs;
    /* 0x0420 */ ficu_urgent_finst_que0_rdptr_base_addr_t ficu_urgent_finst_que0_rdptr_base_addr;
    /* 0x0424 */ ficu_norm_finst_que1_base_addr_t ficu_norm_finst_que1_base_addr;
    /* 0x0428 */ ficu_norm_finst_que1_ptrs_t ficu_norm_finst_que1_ptrs;
    /* 0x042c */ ficu_norm_finst_que1_rdptr_base_addr_t ficu_norm_finst_que1_rdptr_base_addr;
    /* 0x0430 */ ficu_high_finst_que1_base_addr_t ficu_high_finst_que1_base_addr;
    /* 0x0434 */ ficu_high_finst_que1_ptrs_t ficu_high_finst_que1_ptrs;
    /* 0x0438 */ ficu_high_finst_que1_rdptr_base_addr_t ficu_high_finst_que1_rdptr_base_addr;
    /* 0x043c */ ficu_urgent_finst_que1_base_addr_t ficu_urgent_finst_que1_base_addr;
    /* 0x0440 */ ficu_urgent_finst_que1_ptrs_t ficu_urgent_finst_que1_ptrs;
    /* 0x0444 */ ficu_urgent_finst_que1_rdptr_base_addr_t ficu_urgent_finst_que1_rdptr_base_addr;
    /* 0x0448 */ u32 rsvd_448 [6];
    /* 0x0460 */ ficu_grp0_fcmd_compl_que_base_addr_t ficu_grp0_fcmd_compl_que_base_addr;
    /* 0x0464 */ ficu_grp0_fcmd_compl_que_ptrs_t ficu_grp0_fcmd_compl_que_ptrs;
    /* 0x0468 */ ficu_grp0_fcmd_compl_que_wrptr_base_addr_t ficu_grp0_fcmd_compl_que_wrptr_base_addr;
    /* 0x046c */ ficu_grp1_fcmd_compl_que_base_addr_t ficu_grp1_fcmd_compl_que_base_addr;
    /* 0x0470 */ ficu_grp1_fcmd_compl_que_ptrs_t ficu_grp1_fcmd_compl_que_ptrs;
    /* 0x0474 */ ficu_grp1_fcmd_compl_que_wrptr_base_addr_t ficu_grp1_fcmd_compl_que_wrptr_base_addr;
} ncb_ficu_regs_t;


#endif /* rev 1011 */