//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _RAID_TOP_REGISTER_H_
#define _RAID_TOP_REGISTER_H_

#define RAID_CFG_BLK_REG                         0x00000000
#define   RAID_CFG_TOTAL_BLK_NUM_MASK            0x0000007f
#define   RAID_CFG_TOTAL_BLK_NUM_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 raid_cfg_total_blk_num:7;
        u32 rsvd_7:25;
    } b;
} raid_cfg_blk_reg_t;

#define RAID_CFG_SRAM_REG                        0x00000004
#define   RAID_CFG_SRAM_BLK_NUM_PER_BANK_MASK    0x00700000
#define   RAID_CFG_SRAM_BLK_NUM_PER_BANK_SHIFT           20
#define   RAID_CFG_SRAM_BANK_NUM_MASK            0x000f0000
#define   RAID_CFG_SRAM_BANK_NUM_SHIFT                   16
#define   RAID_CFG_SRAM_BLK_SIZE_MASK            0x00000fff
#define   RAID_CFG_SRAM_BLK_SIZE_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 raid_cfg_sram_blk_size:12;
        u32 rsvd_12:4;
        u32 raid_cfg_sram_bank_num:4;
        u32 raid_cfg_sram_blk_num_per_bank:3;
        u32 rsvd_23:9;
    } b;
} raid_cfg_sram_reg_t;

#define RAID_CTRS_REG0                           0x00000008
#define   RAID_INACCU_ERR_CFG_MASK               0x01800000
#define   RAID_INACCU_ERR_CFG_SHIFT                      23
#define   RAID_BYPASS_ERR_EN_MASK                0x00400000
#define   RAID_BYPASS_ERR_EN_SHIFT                       22
#define   RAID_BYPASS_CMD_REQ_EN_MASK            0x00200000
#define   RAID_BYPASS_CMD_REQ_EN_SHIFT                   21
#define   RAID_BANK_ID_SRC_SEL_MASK              0x00100000
#define   RAID_BANK_ID_SRC_SEL_SHIFT                     20
#define   RAID_XOR_BLK_NXTCW_CTRL_MASK           0x00030000
#define   RAID_XOR_BLK_NXTCW_CTRL_SHIFT                  16
#define   RAID_ID_RESET_ID_MASK                  0x00003f00
#define   RAID_ID_RESET_ID_SHIFT                          8
#define   RAID_ID_RESET_MASK                     0x00000010
#define   RAID_ID_RESET_SHIFT                             4
#define   RAID6_EN_MASK                          0x00000004
#define   RAID6_EN_SHIFT                                  2
#define   RAID_RESET_MASK                        0x00000002
#define   RAID_RESET_SHIFT                                1
#define   RAID_EN_MASK                           0x00000001
#define   RAID_EN_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 raid_en:1;
        u32 raid_reset:1;
        u32 raid6_en:1;
        u32 rsvd_3:1;
        u32 raid_id_reset:1;
        u32 rsvd_5:3;
        u32 raid_id_reset_id:6;
        u32 rsvd_14:2;
        u32 raid_xor_blk_nxtcw_ctrl:2;
        u32 rsvd_18:2;
        u32 raid_bank_id_src_sel:1;
        u32 raid_bypass_cmd_req_en:1;
        u32 raid_bypass_err_en:1;
        u32 raid_inaccu_err_cfg:2;
        u32 rsvd_25:7;
    } b;
} raid_ctrs_reg0_t;

#define RAID_DBG_REG                             0x0000000c
#define   RAID_DBG_STATUS_MASK                   0xffff0000
#define   RAID_DBG_STATUS_SHIFT                          16
#define   RAID_DBG_SEL_MASK                      0x0000ffff
#define   RAID_DBG_SEL_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 raid_dbg_sel:16;
        u32 raid_dbg_status:16;
    } b;
} raid_dbg_reg_t;

#define RAID_ENG_INT_FAULT_REG                   0x00000010
#define   RAIDM_ECC_FAULT_MASK_MASK              0x00000020
#define   RAIDM_ECC_FAULT_MASK_SHIFT                      5
#define   RAIDM_ECC_FAULT_MASK                   0x00000010
#define   RAIDM_ECC_FAULT_SHIFT                           4
#define   RAID_ENGINE_DEC_BUF_OVFL_FAULT_MASK_MASK 0x00000008
#define   RAID_ENGINE_DEC_BUF_OVFL_FAULT_MASK_SHIFT          3
#define   RAID_ENGINE_DEC_BUF_OVFL_FAULT_MASK    0x00000004
#define   RAID_ENGINE_DEC_BUF_OVFL_FAULT_SHIFT            2
#define   RAID_ENGINE_ENC_BUF_OVFL_FAULT_MASK_MASK 0x00000002
#define   RAID_ENGINE_ENC_BUF_OVFL_FAULT_MASK_SHIFT          1
#define   RAID_ENGINE_ENC_BUF_OVFL_FAULT_MASK    0x00000001
#define   RAID_ENGINE_ENC_BUF_OVFL_FAULT_SHIFT            0

typedef union {
    u32 all;
    struct {
        u32 raid_engine_enc_buf_ovfl_fault:1;
        u32 raid_engine_enc_buf_ovfl_fault_mask:1;
        u32 raid_engine_dec_buf_ovfl_fault:1;
        u32 raid_engine_dec_buf_ovfl_fault_mask:1;
        u32 raidm_ecc_fault:1;
        u32 raidm_ecc_fault_mask:1;
        u32 rsvd_6:26;
    } b;
} raid_eng_int_fault_reg_t;

#define RAID_CFG_DDR_ST_ADDR_REG                 0x00000014
#define   RAID_CFG_DDR_ST_ADDR_MASK              0xffffffff
#define   RAID_CFG_DDR_ST_ADDR_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 raid_cfg_ddr_st_addr:32;
    } b;
} raid_cfg_ddr_st_addr_reg_t;

#define RAID_CFG_DDR_END_ADDR_REG                0x00000018
#define   RAID_CFG_DDR_END_ADDR_MASK             0xffffffff
#define   RAID_CFG_DDR_END_ADDR_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 raid_cfg_ddr_end_addr:32;
    } b;
} raid_cfg_ddr_end_addr_reg_t;

#define RAID_CFG_DDR_REG                         0x0000001c
#define   RAID_CFG_DDR_ADDR_ROUND_SEL_MASK       0x00010000
#define   RAID_CFG_DDR_ADDR_ROUND_SEL_SHIFT              16
#define   RAID_CFG_DDR_BLK_SIZE_MASK             0x00000fff
#define   RAID_CFG_DDR_BLK_SIZE_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 raid_cfg_ddr_blk_size:12;
        u32 rsvd_12:4;
        u32 raid_cfg_ddr_addr_round_sel:1;
        u32 rsvd_17:15;
    } b;
} raid_cfg_ddr_reg_t;

#define RAID_ENC_XOR_FAULT_MASK_REG              0x00000020
#define   RAID_ENC_XOR_FAULT_MASK_MASK           0xffffffff
#define   RAID_ENC_XOR_FAULT_MASK_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 raid_enc_xor_fault_mask:32;
    } b;
} raid_enc_xor_fault_mask_reg_t;

#define RAID_ENC_XOR_FAULT_REG                   0x00000024
#define   RAID_ENC_XOR_FAULT_MASK                0xffffffff
#define   RAID_ENC_XOR_FAULT_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 raid_enc_xor_fault:32;
    } b;
} raid_enc_xor_fault_reg_t;

#define RAID_DEC_XOR_FAULT_MASK_REG              0x00000028
#define   RAID_DEC_XOR_FAULT_MASK_MASK           0xffffffff
#define   RAID_DEC_XOR_FAULT_MASK_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 raid_dec_xor_fault_mask:32;
    } b;
} raid_dec_xor_fault_mask_reg_t;

#define RAID_DEC_XOR_FAULT_REG                   0x0000002c
#define   RAID_DEC_XOR_FAULT_MASK                0xffffffff
#define   RAID_DEC_XOR_FAULT_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 raid_dec_xor_fault:32;
    } b;
} raid_dec_xor_fault_reg_t;

#define RAID_SUS_SWITCH_FAULT_MASK_REG           0x00000030
#define   RAID_SUS_SWITCH_FAULT_MASK_MASK        0xffffffff
#define   RAID_SUS_SWITCH_FAULT_MASK_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 raid_sus_switch_fault_mask:32;
    } b;
} raid_sus_switch_fault_mask_reg_t;

#define RAID_SUS_SWITCH_FAULT_REG                0x00000034
#define   RAID_SUS_SWITCH_FAULT_MASK             0xffffffff
#define   RAID_SUS_SWITCH_FAULT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 raid_sus_switch_fault:32;
    } b;
} raid_sus_switch_fault_reg_t;

#define RAID_RES_SWITCH_FAULT_MASK_REG           0x00000038
#define   RAID_RES_SWITCH_FAULT_MASK_MASK        0xffffffff
#define   RAID_RES_SWITCH_FAULT_MASK_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 raid_res_switch_fault_mask:32;
    } b;
} raid_res_switch_fault_mask_reg_t;

#define RAID_RES_SWITCH_FAULT_REG                0x0000003c
#define   RAID_RES_SWITCH_FAULT_MASK             0xffffffff
#define   RAID_RES_SWITCH_FAULT_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 raid_res_switch_fault:32;
    } b;
} raid_res_switch_fault_reg_t;

#define RAID_ID_STATUS_REG                       0x00000040
#define   RAID_ID_STATUS_MASK                    0xffffff00
#define   RAID_ID_STATUS_SHIFT                            8
#define   RAID_ID_STATUS_SEL_ID_MASK             0x0000003f
#define   RAID_ID_STATUS_SEL_ID_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 raid_id_status_sel_id:6;
        u32 rsvd_6:2;
        u32 raid_id_status:24;
    } b;
} raid_id_status_reg_t;

#define RAID_PWR_CTRL_REG                        0x00000044
#define   RAID_STATUS_SAVE_SWITCH_INFO_MASK      0x00000004
#define   RAID_STATUS_SAVE_SWITCH_INFO_SHIFT              2
#define   RAID_STATUS_RESTORE_EN_MASK            0x00000002
#define   RAID_STATUS_RESTORE_EN_SHIFT                    1
#define   RAID_STATUS_SAVE_EN_MASK               0x00000001
#define   RAID_STATUS_SAVE_EN_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 raid_status_save_en:1;
        u32 raid_status_restore_en:1;
        u32 raid_status_save_switch_info:1;
        u32 rsvd_3:29;
    } b;
} raid_pwr_ctrl_reg_t;

#define RAID_MEMORY_CONFIG_REG                   0x00000048
#define   RAID_STATUS_MEM_WTSEL_MASK             0x0000000c
#define   RAID_STATUS_MEM_WTSEL_SHIFT                     2
#define   RAID_STATUS_MEM_RTSEL_MASK             0x00000003
#define   RAID_STATUS_MEM_RTSEL_SHIFT                     0
typedef union {
    u32 all;
    struct {
        u32 raid_status_mem_rtsel:2;
        u32 raid_status_mem_wtsel:2;
        u32 rsvd_4:28;
    } b;
} raid_memory_config_reg_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ raid_cfg_blk_reg_t raid_cfg_blk_reg;
    /* 0x0004 */ raid_cfg_sram_reg_t raid_cfg_sram_reg;
    /* 0x0008 */ raid_ctrs_reg0_t raid_ctrs_reg0;
    /* 0x000c */ raid_dbg_reg_t raid_dbg_reg;
    /* 0x0010 */ raid_eng_int_fault_reg_t raid_eng_int_fault_reg;
    /* 0x0014 */ raid_cfg_ddr_st_addr_reg_t raid_cfg_ddr_st_addr_reg;
    /* 0x0018 */ raid_cfg_ddr_end_addr_reg_t raid_cfg_ddr_end_addr_reg;
    /* 0x001c */ raid_cfg_ddr_reg_t raid_cfg_ddr_reg;
    /* 0x0020 */ raid_enc_xor_fault_mask_reg_t raid_enc_xor_fault_mask_reg;
    /* 0x0024 */ raid_enc_xor_fault_reg_t raid_enc_xor_fault_reg;
    /* 0x0028 */ raid_dec_xor_fault_mask_reg_t raid_dec_xor_fault_mask_reg;
    /* 0x002c */ raid_dec_xor_fault_reg_t raid_dec_xor_fault_reg;
    /* 0x0030 */ raid_sus_switch_fault_mask_reg_t raid_sus_switch_fault_mask_reg;
    /* 0x0034 */ raid_sus_switch_fault_reg_t raid_sus_switch_fault_reg;
    /* 0x0038 */ raid_res_switch_fault_mask_reg_t raid_res_switch_fault_mask_reg;
    /* 0x003c */ raid_res_switch_fault_reg_t raid_res_switch_fault_reg;
    /* 0x0040 */ raid_id_status_reg_t raid_id_status_reg;
    /* 0x0044 */ raid_pwr_ctrl_reg_t raid_pwr_ctrl_reg;
    /* 0x0048 */ raid_memory_config_reg_t raid_memory_config_reg;
} raid_top_regs_t;


#endif /* rev 1011 */