//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _CPU1_CFG_H_
#define _CPU1_CFG_H_

#define CPU_CTRL                                 0x00000000
#define   HALT_CPU4_MASK                         0x00080000
#define   HALT_CPU4_SHIFT                                19
#define   HALT_CPU3_MASK                         0x00040000
#define   HALT_CPU3_SHIFT                                18
#define   HALT_CPU2_MASK                         0x00020000
#define   HALT_CPU2_SHIFT                                17
#define   HALT_CPU1_MASK                         0x00010000
#define   HALT_CPU1_SHIFT                                16
#define   CPU4_RST_N_MASK                        0x00000008
#define   CPU4_RST_N_SHIFT                                3
#define   CPU3_RST_N_MASK                        0x00000004
#define   CPU3_RST_N_SHIFT                                2
#define   CPU2_RST_N_MASK                        0x00000002
#define   CPU2_RST_N_SHIFT                                1
#define   CPU1_RST_N_MASK                        0x00000001
#define   CPU1_RST_N_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 cpu1_rst_n:1;
        u32 cpu2_rst_n:1;
        u32 cpu3_rst_n:1;
        u32 cpu4_rst_n:1;
        u32 rsvd_4:12;
        u32 halt_cpu1:1;
        u32 halt_cpu2:1;
        u32 halt_cpu3:1;
        u32 halt_cpu4:1;
        u32 rsvd_20:12;
    } b;
} cpu_ctrl_t;

#define CPU_GRP1_AXI_DLOCK                       0x00000010
#define   CPU_GRP1_AXIP_DLOCK_IRQ_MASK           0x20000000
#define   CPU_GRP1_AXIP_DLOCK_IRQ_SHIFT                  29
#define   CPU_GRP1_AXIP_DLOCK_WR_MASK            0x10000000
#define   CPU_GRP1_AXIP_DLOCK_WR_SHIFT                   28
#define   CPU_GRP1_AXIP_DLOCK_ID_MASK            0x0f000000
#define   CPU_GRP1_AXIP_DLOCK_ID_SHIFT                   24
#define   CPU_GRP1_AXIP_DLOCK_SLV_MASK           0x00700000
#define   CPU_GRP1_AXIP_DLOCK_SLV_SHIFT                  20
#define   CPU_GRP1_AXIP_DLOCK_MST_MASK           0x00070000
#define   CPU_GRP1_AXIP_DLOCK_MST_SHIFT                  16
#define   CPU_GRP1_AXIM_DLOCK_IRQ_MASK           0x00002000
#define   CPU_GRP1_AXIM_DLOCK_IRQ_SHIFT                  13
#define   CPU_GRP1_AXIM_DLOCK_WR_MASK            0x00001000
#define   CPU_GRP1_AXIM_DLOCK_WR_SHIFT                   12
#define   CPU_GRP1_AXIM_DLOCK_ID_MASK            0x00000700
#define   CPU_GRP1_AXIM_DLOCK_ID_SHIFT                    8
#define   CPU_GRP1_AXIM_DLOCK_SLV_MASK           0x000000f0
#define   CPU_GRP1_AXIM_DLOCK_SLV_SHIFT                   4
#define   CPU_GRP1_AXIM_DLOCK_MST_MASK           0x0000000f
#define   CPU_GRP1_AXIM_DLOCK_MST_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 cpu_grp1_axim_dlock_mst:4;
        u32 cpu_grp1_axim_dlock_slv:4;
        u32 cpu_grp1_axim_dlock_id:3;
        u32 rsvd_11:1;
        u32 cpu_grp1_axim_dlock_wr:1;
        u32 cpu_grp1_axim_dlock_irq:1;
        u32 rsvd_14:2;
        u32 cpu_grp1_axip_dlock_mst:3;
        u32 rsvd_19:1;
        u32 cpu_grp1_axip_dlock_slv:3;
        u32 rsvd_23:1;
        u32 cpu_grp1_axip_dlock_id:4;
        u32 cpu_grp1_axip_dlock_wr:1;
        u32 cpu_grp1_axip_dlock_irq:1;
        u32 rsvd_30:2;
    } b;
} cpu_grp1_axi_dlock_t;

#define CPU_AXI_EXCLU_CTRL                       0x00000014
#define   VSLV3_BUSY_MASK                        0x08000000
#define   VSLV3_BUSY_SHIFT                               27
#define   VSLV2_BUSY_MASK                        0x04000000
#define   VSLV2_BUSY_SHIFT                               26
#define   VSLV1_BUSY_MASK                        0x02000000
#define   VSLV1_BUSY_SHIFT                               25
#define   VSLV0_BUSY_MASK                        0x01000000
#define   VSLV0_BUSY_SHIFT                               24
#define   DEFULT_WCHNL_ST_MASK                   0x00300000
#define   DEFULT_WCHNL_ST_SHIFT                          20
#define   VSLV3_ST_MASK                          0x000f0000
#define   VSLV3_ST_SHIFT                                 16
#define   VSLV2_ST_MASK                          0x0000f000
#define   VSLV2_ST_SHIFT                                 12
#define   VSLV1_ST_MASK                          0x00000f00
#define   VSLV1_ST_SHIFT                                  8
#define   VSLV0_ST_MASK                          0x000000f0
#define   VSLV0_ST_SHIFT                                  4
#define   DIS_EXCLU_MASK                         0x00000001
#define   DIS_EXCLU_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 dis_exclu:1;
        u32 rsvd_1:3;
        u32 vslv0_st:4;
        u32 vslv1_st:4;
        u32 vslv2_st:4;
        u32 vslv3_st:4;
        u32 defult_wchnl_st:2;
        u32 rsvd_22:2;
        u32 vslv0_busy:1;
        u32 vslv1_busy:1;
        u32 vslv2_busy:1;
        u32 vslv3_busy:1;
        u32 rsvd_28:4;
    } b;
} cpu_axi_exclu_ctrl_t;

#define AXI_PAR_ERR_INT_REG                      0x00000030
#define   PARITY_MASK                            0x00ff0000
#define   PARITY_SHIFT                                   16
#define   AXIM_PAR_ERR_INT_MASK_MASK             0x00000100
#define   AXIM_PAR_ERR_INT_MASK_SHIFT                     8
#define   AXIM_PAR_ERR_INT_MASK                  0x00000001
#define   AXIM_PAR_ERR_INT_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 axim_par_err_int:1;
        u32 rsvd_1:7;
        u32 axim_par_err_int_mask:1;
        u32 rsvd_9:7;
        u32 parity:8;
        u32 rsvd_24:8;
    } b;
} axi_par_err_int_reg_t;

#define AXI_PAR_DATA_H                           0x00000034
#define   AXI_PAR_DATA_H_MASK                    0xffffffff
#define   AXI_PAR_DATA_H_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 axi_par_data_h:32;
    } b;
} axi_par_data_h_t;

#define AXI_PAR_DATA_L                           0x00000038
#define   AXI_PAR_DATA_L_MASK                    0xffffffff
#define   AXI_PAR_DATA_L_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 axi_par_data_l:32;
    } b;
} axi_par_data_l_t;

#define SPIN_LOCK_STS_0                          0x00000040
#define   SPIN_LOCK_STS_0_MASK                   0xffffffff
#define   SPIN_LOCK_STS_0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 spin_lock_sts_0:32;
    } b;
} spin_lock_sts_0_t;

#define SPIN_LOCK_STS_1                          0x00000044
#define   SPIN_LOCK_STS_1_MASK                   0xffffffff
#define   SPIN_LOCK_STS_1_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 spin_lock_sts_1:32;
    } b;
} spin_lock_sts_1_t;

#define SPIN_LOCK_STS_2                          0x00000048
#define   SPIN_LOCK_STS_2_MASK                   0xffffffff
#define   SPIN_LOCK_STS_2_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 spin_lock_sts_2:32;
    } b;
} spin_lock_sts_2_t;

#define SPIN_LOCK_STS_3                          0x0000004c
#define   SPIN_LOCK_STS_3_MASK                   0xffffffff
#define   SPIN_LOCK_STS_3_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 spin_lock_sts_3:32;
    } b;
} spin_lock_sts_3_t;

#define SPIN_LOCK_STS_4                          0x00000050
#define   SPIN_LOCK_STS_4_MASK                   0xffffffff
#define   SPIN_LOCK_STS_4_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 spin_lock_sts_4:32;
    } b;
} spin_lock_sts_4_t;

#define SPIN_LOCK_STS_5                          0x00000054
#define   SPIN_LOCK_STS_5_MASK                   0xffffffff
#define   SPIN_LOCK_STS_5_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 spin_lock_sts_5:32;
    } b;
} spin_lock_sts_5_t;

#define SPIN_LOCK_STS_6                          0x00000058
#define   SPIN_LOCK_STS_6_MASK                   0xffffffff
#define   SPIN_LOCK_STS_6_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 spin_lock_sts_6:32;
    } b;
} spin_lock_sts_6_t;

#define SPIN_LOCK_STS_7                          0x0000005c
#define   SPIN_LOCK_STS_7_MASK                   0xffffffff
#define   SPIN_LOCK_STS_7_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 spin_lock_sts_7:32;
    } b;
} spin_lock_sts_7_t;

#define MSG_WP_REG1                              0x00000080
#define   WPTR_PHASE_MIRROR_FROM1_MASK           0x80000000
#define   WPTR_PHASE_MIRROR_FROM1_SHIFT                  31
#define   WRITE_POINTER_MIRROR_FROM1_MASK        0x7fff0000
#define   WRITE_POINTER_MIRROR_FROM1_SHIFT               16
#define   WPTR_PHASE_TO1_MASK                    0x00008000
#define   WPTR_PHASE_TO1_SHIFT                           15
#define   WRITE_POINTER_TO1_MASK                 0x00007fff
#define   WRITE_POINTER_TO1_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 write_pointer_to1:15;
        u32 wptr_phase_to1:1;
        u32 write_pointer_mirror_from1:15;
        u32 wptr_phase_mirror_from1:1;
    } b;
} msg_wp_reg1_t;

#define MSG_RP_REG1                              0x00000084
#define   RPTR_PHASE_MIRROR_FROM1_MASK           0x80000000
#define   RPTR_PHASE_MIRROR_FROM1_SHIFT                  31
#define   READ_POINTER_MIRROR_FROM1_MASK         0x7fff0000
#define   READ_POINTER_MIRROR_FROM1_SHIFT                16
#define   RPTR_PHASE_1_MASK                      0x00008000
#define   RPTR_PHASE_1_SHIFT                             15
#define   READ_POINTER_1_MASK                    0x00007fff
#define   READ_POINTER_1_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 read_pointer_1:15;
        u32 rptr_phase_1:1;
        u32 read_pointer_mirror_from1:15;
        u32 rptr_phase_mirror_from1:1;
    } b;
} msg_rp_reg1_t;

#define MSG_WP_REG2                              0x00000090
#define   WPTR_PHASE_MIRROR_FROM2_MASK           0x80000000
#define   WPTR_PHASE_MIRROR_FROM2_SHIFT                  31
#define   WRITE_POINTER_MIRROR_FROM2_MASK        0x7fff0000
#define   WRITE_POINTER_MIRROR_FROM2_SHIFT               16
#define   WPTR_PHASE_TO2_MASK                    0x00008000
#define   WPTR_PHASE_TO2_SHIFT                           15
#define   WRITE_POINTER_TO2_MASK                 0x00007fff
#define   WRITE_POINTER_TO2_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 write_pointer_to2:15;
        u32 wptr_phase_to2:1;
        u32 write_pointer_mirror_from2:15;
        u32 wptr_phase_mirror_from2:1;
    } b;
} msg_wp_reg2_t;

#define MSG_RP_REG2                              0x00000094
#define   RPTR_PHASE_MIRROR_FROM2_MASK           0x80000000
#define   RPTR_PHASE_MIRROR_FROM2_SHIFT                  31
#define   READ_POINTER_MIRROR_FROM2_MASK         0x7fff0000
#define   READ_POINTER_MIRROR_FROM2_SHIFT                16
#define   RPTR_PHASE_2_MASK                      0x00008000
#define   RPTR_PHASE_2_SHIFT                             15
#define   READ_POINTER_2_MASK                    0x00007fff
#define   READ_POINTER_2_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 read_pointer_2:15;
        u32 rptr_phase_2:1;
        u32 read_pointer_mirror_from2:15;
        u32 rptr_phase_mirror_from2:1;
    } b;
} msg_rp_reg2_t;

#define MSG_WP_REG3                              0x000000a0
#define   WPTR_PHASE_MIRROR_FROM3_MASK           0x80000000
#define   WPTR_PHASE_MIRROR_FROM3_SHIFT                  31
#define   WRITE_POINTER_MIRROR_FROM3_MASK        0x7fff0000
#define   WRITE_POINTER_MIRROR_FROM3_SHIFT               16
#define   WPTR_PHASE_TO3_MASK                    0x00008000
#define   WPTR_PHASE_TO3_SHIFT                           15
#define   WRITE_POINTER_TO3_MASK                 0x00007fff
#define   WRITE_POINTER_TO3_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 write_pointer_to3:15;
        u32 wptr_phase_to3:1;
        u32 write_pointer_mirror_from3:15;
        u32 wptr_phase_mirror_from3:1;
    } b;
} msg_wp_reg3_t;

#define MSG_RP_REG3                              0x000000a4
#define   RPTR_PHASE_MIRROR_FROM3_MASK           0x80000000
#define   RPTR_PHASE_MIRROR_FROM3_SHIFT                  31
#define   READ_POINTER_MIRROR_FROM3_MASK         0x7fff0000
#define   READ_POINTER_MIRROR_FROM3_SHIFT                16
#define   RPTR_PHASE_3_MASK                      0x00008000
#define   RPTR_PHASE_3_SHIFT                             15
#define   READ_POINTER_3_MASK                    0x00007fff
#define   READ_POINTER_3_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 read_pointer_3:15;
        u32 rptr_phase_3:1;
        u32 read_pointer_mirror_from3:15;
        u32 rptr_phase_mirror_from3:1;
    } b;
} msg_rp_reg3_t;

#define MSG_WP_REG4                              0x000000b0
#define   WPTR_PHASE_MIRROR_FROM4_MASK           0x80000000
#define   WPTR_PHASE_MIRROR_FROM4_SHIFT                  31
#define   WRITE_POINTER_MIRROR_FROM4_MASK        0x7fff0000
#define   WRITE_POINTER_MIRROR_FROM4_SHIFT               16
#define   WPTR_PHASE_TO4_MASK                    0x00008000
#define   WPTR_PHASE_TO4_SHIFT                           15
#define   WRITE_POINTER_TO4_MASK                 0x00007fff
#define   WRITE_POINTER_TO4_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 write_pointer_to4:15;
        u32 wptr_phase_to4:1;
        u32 write_pointer_mirror_from4:15;
        u32 wptr_phase_mirror_from4:1;
    } b;
} msg_wp_reg4_t;

#define MSG_RP_REG4                              0x000000b4
#define   RPTR_PHASE_MIRROR_FROM4_MASK           0x80000000
#define   RPTR_PHASE_MIRROR_FROM4_SHIFT                  31
#define   READ_POINTER_MIRROR_FROM4_MASK         0x7fff0000
#define   READ_POINTER_MIRROR_FROM4_SHIFT                16
#define   RPTR_PHASE_4_MASK                      0x00008000
#define   RPTR_PHASE_4_SHIFT                             15
#define   READ_POINTER_4_MASK                    0x00007fff
#define   READ_POINTER_4_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 read_pointer_4:15;
        u32 rptr_phase_4:1;
        u32 read_pointer_mirror_from4:15;
        u32 rptr_phase_mirror_from4:1;
    } b;
} msg_rp_reg4_t;

#define MSG_INT_CTRL                             0x000000c0
#define   CPU_MSG_NON_EMPTY_INT_MASK_MASK        0x000f0000
#define   CPU_MSG_NON_EMPTY_INT_MASK_SHIFT               16
#define   CPU_MSG_NON_EMPTY_INT_STATUS_MASK      0x0000000f
#define   CPU_MSG_NON_EMPTY_INT_STATUS_SHIFT              0
typedef union {
    u32 all;
    struct {
        u32 cpu_msg_non_empty_int_status:4;
        u32 rsvd_4:12;
        u32 cpu_msg_non_empty_int_mask:4;
        u32 rsvd_20:12;
    } b;
} msg_int_ctrl_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ cpu_ctrl_t cpu_ctrl;
    /* 0x0004 */ u32 rsvd_4 [3];
    /* 0x0010 */ cpu_grp1_axi_dlock_t cpu_grp1_axi_dlock;
    /* 0x0014 */ cpu_axi_exclu_ctrl_t cpu_axi_exclu_ctrl;
    /* 0x0018 */ u32 rsvd_18 [6];
    /* 0x0030 */ axi_par_err_int_reg_t axi_par_err_int_reg;
    /* 0x0034 */ axi_par_data_h_t axi_par_data_h;
    /* 0x0038 */ axi_par_data_l_t axi_par_data_l;
    /* 0x003c */ u32 rsvd_3c;
    /* 0x0040 */ spin_lock_sts_0_t spin_lock_sts_0;
    /* 0x0044 */ spin_lock_sts_1_t spin_lock_sts_1;
    /* 0x0048 */ spin_lock_sts_2_t spin_lock_sts_2;
    /* 0x004c */ spin_lock_sts_3_t spin_lock_sts_3;
    /* 0x0050 */ spin_lock_sts_4_t spin_lock_sts_4;
    /* 0x0054 */ spin_lock_sts_5_t spin_lock_sts_5;
    /* 0x0058 */ spin_lock_sts_6_t spin_lock_sts_6;
    /* 0x005c */ spin_lock_sts_7_t spin_lock_sts_7;
    /* 0x0060 */ u32 rsvd_60 [8];
    /* 0x0080 */ msg_wp_reg1_t msg_wp_reg1;
    /* 0x0084 */ msg_rp_reg1_t msg_rp_reg1;
    /* 0x0088 */ u32 rsvd_88 [2];
    /* 0x0090 */ msg_wp_reg2_t msg_wp_reg2;
    /* 0x0094 */ msg_rp_reg2_t msg_rp_reg2;
    /* 0x0098 */ u32 rsvd_98 [2];
    /* 0x00a0 */ msg_wp_reg3_t msg_wp_reg3;
    /* 0x00a4 */ msg_rp_reg3_t msg_rp_reg3;
    /* 0x00a8 */ u32 rsvd_a8 [2];
    /* 0x00b0 */ msg_wp_reg4_t msg_wp_reg4;
    /* 0x00b4 */ msg_rp_reg4_t msg_rp_reg4;
    /* 0x00b8 */ u32 rsvd_b8 [2];
    /* 0x00c0 */ msg_int_ctrl_t msg_int_ctrl;
} cpu1_cfg_regs_t;


#endif /* rev 5 */