//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _ITRNG_REG_H_
#define _ITRNG_REG_H_

#define REVID                                    0x00000000
#define   REVID_ARCH_MASK                        0xff000000
#define   REVID_ARCH_SHIFT                               24
#define   REVID_MAJOR_MASK                       0x00ff0000
#define   REVID_MAJOR_SHIFT                              16
#define   REVID_MINOR_MASK                       0x0000ffff
#define   REVID_MINOR_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 revid_minor:16;
        u32 revid_major:8;
        u32 revid_arch:8;
    } b;
} revid_t;

#define REVID_MISC                               0x00000004
#define   REVID_MISC_MASK                        0xffffffff
#define   REVID_MISC_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 revid_misc:32;
    } b;
} revid_misc_t;

#define MODE                                     0x00000008
#define   NONCE_MODE_MASK                        0x00000002
#define   NONCE_MODE_SHIFT                                1
#define   FUNC_MODE_MASK                         0x00000001
#define   FUNC_MODE_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 func_mode:1;
        u32 nonce_mode:1;
        u32 rsvd_2:30;
    } b;
} mode_t;

#define CNTL                                     0x0000000c
#define   RAND_AUTO_CLR_DIS_MASK                 0x80000000
#define   RAND_AUTO_CLR_DIS_SHIFT                        31
#define   SEED_AUTO_CLR_DIS_MASK                 0x40000000
#define   SEED_AUTO_CLR_DIS_SHIFT                        30
#define   WHITEN_STRICT_MASK                     0x20000000
#define   WHITEN_STRICT_SHIFT                            29
#define   WHITEN_DIS_MASK                        0x10000000
#define   WHITEN_DIS_SHIFT                               28
#define   DRO_SEL_MASK                           0x01fe0000
#define   DRO_SEL_SHIFT                                  17
#define   DRO_EN_MASK                            0x00010000
#define   DRO_EN_SHIFT                                   16
#define   ED_SEL_MASK                            0x00008000
#define   ED_SEL_SHIFT                                   15
#define   ED_BYP_MASK                            0x00004000
#define   ED_BYP_SHIFT                                   14
#define   MBRN_SEL_MASK                          0x00000ff0
#define   MBRN_SEL_SHIFT                                  4
#define   CLEAR_ES_MASK                          0x00000008
#define   CLEAR_ES_SHIFT                                  3
#define   LP_DIS_PRNG_MASK                       0x00000002
#define   LP_DIS_PRNG_SHIFT                               1
#define   LP_DIS_MBRN_MASK                       0x00000001
#define   LP_DIS_MBRN_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 lp_dis_mbrn:1;
        u32 lp_dis_prng:1;
        u32 rsvd_2:1;
        u32 clear_es:1;
        u32 mbrn_sel:8;
        u32 rsvd_12:2;
        u32 ed_byp:1;
        u32 ed_sel:1;
        u32 dro_en:1;
        u32 dro_sel:8;
        u32 rsvd_25:3;
        u32 whiten_dis:1;
        u32 whiten_strict:1;
        u32 seed_auto_clr_dis:1;
        u32 rand_auto_clr_dis:1;
    } b;
} cntl_t;

#define STS                                      0x00000010
#define   STS_WATCHDOG_ERR_MASK                  0x80000000
#define   STS_WATCHDOG_ERR_SHIFT                         31
#define   STS_MON_COLLECTING_MASK                0x20000000
#define   STS_MON_COLLECTING_SHIFT                       29
#define   STS_MON_ERR_MASK                       0x10000000
#define   STS_MON_ERR_SHIFT                              28
#define   STS_PRNG_LOCKUP_MASK                   0x02000000
#define   STS_PRNG_LOCKUP_SHIFT                          25
#define   STS_LFSR_LOCKUP_MASK                   0x01000000
#define   STS_LFSR_LOCKUP_SHIFT                          24
#define   STS_PRNG_HOLD_MASK                     0x00020000
#define   STS_PRNG_HOLD_SHIFT                            17
#define   STS_MBRN_HOLD_MASK                     0x00010000
#define   STS_MBRN_HOLD_SHIFT                            16
#define   STS_RAND_GEN_MASK                      0x00002000
#define   STS_RAND_GEN_SHIFT                             13
#define   STS_SEED_SOURCE_MASK                   0x00000700
#define   STS_SEED_SOURCE_SHIFT                           8
#define   STS_SEEDING_MASK                       0x00000020
#define   STS_SEEDING_SHIFT                               5
#define   STS_SEEDED_MASK                        0x00000010
#define   STS_SEEDED_SHIFT                                4
#define   STS_MODE_MASK                          0x00000003
#define   STS_MODE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 sts_mode:2;
        u32 rsvd_2:2;
        u32 sts_seeded:1;
        u32 sts_seeding:1;
        u32 rsvd_6:2;
        u32 sts_seed_source:3;
        u32 rsvd_11:2;
        u32 sts_rand_gen:1;
        u32 rsvd_14:2;
        u32 sts_mbrn_hold:1;
        u32 sts_prng_hold:1;
        u32 rsvd_18:6;
        u32 sts_lfsr_lockup:1;
        u32 sts_prng_lockup:1;
        u32 rsvd_26:2;
        u32 sts_mon_err:1;
        u32 sts_mon_collecting:1;
        u32 rsvd_30:1;
        u32 sts_watchdog_err:1;
    } b;
} sts_t;

#define REQ                                      0x00000014
#define   REQ_MONITOR_TEST_MASK                  0x40000000
#define   REQ_MONITOR_TEST_SHIFT                         30
#define   REQ_KNOWN_ANSWER_TEST_MASK             0x10000000
#define   REQ_KNOWN_ANSWER_TEST_SHIFT                    28
#define   REQ_INFINITE_ES_MASK                   0x00010000
#define   REQ_INFINITE_ES_SHIFT                          16
#define   REQ_RAND_GEN_MASK                      0x00000020
#define   REQ_RAND_GEN_SHIFT                              5
#define   REQ_SEED_QUICK_MASK                    0x00000004
#define   REQ_SEED_QUICK_SHIFT                            2
#define   REQ_SEED_NONCE_MASK                    0x00000002
#define   REQ_SEED_NONCE_SHIFT                            1
#define   REQ_SEED_MASK                          0x00000001
#define   REQ_SEED_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 req_seed:1;
        u32 req_seed_nonce:1;
        u32 req_seed_quick:1;
        u32 rsvd_3:2;
        u32 req_rand_gen:1;
        u32 rsvd_6:10;
        u32 req_infinite_es:1;
        u32 rsvd_17:11;
        u32 req_known_answer_test:1;
        u32 rsvd_29:1;
        u32 req_monitor_test:1;
        u32 rsvd_31:1;
    } b;
} req_t;

#define REQSTS                                   0x00000018
#define   REQ_PASS_MONITOR_TEST_MASK             0x80000000
#define   REQ_PASS_MONITOR_TEST_SHIFT                    31
#define   REQ_DONE_MONITOR_TEST_MASK             0x40000000
#define   REQ_DONE_MONITOR_TEST_SHIFT                    30
#define   REQ_PASS_KNOWN_ANSWER_TEST_MASK        0x20000000
#define   REQ_PASS_KNOWN_ANSWER_TEST_SHIFT               29
#define   REQ_DONE_KNOWN_ANSWER_TEST_MASK        0x10000000
#define   REQ_DONE_KNOWN_ANSWER_TEST_SHIFT               28
#define   REQ_DONE_INFINITE_ES_MASK              0x00010000
#define   REQ_DONE_INFINITE_ES_SHIFT                     16
#define   REQ_DONE_RAND_GEN_MASK                 0x00000020
#define   REQ_DONE_RAND_GEN_SHIFT                         5
#define   REQ_DONE_SEED_QUICK_MASK               0x00000004
#define   REQ_DONE_SEED_QUICK_SHIFT                       2
#define   REQ_DONE_SEED_NONCE_MASK               0x00000002
#define   REQ_DONE_SEED_NONCE_SHIFT                       1
#define   REQ_DONE_SEED_MASK                     0x00000001
#define   REQ_DONE_SEED_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 req_done_seed:1;
        u32 req_done_seed_nonce:1;
        u32 req_done_seed_quick:1;
        u32 rsvd_3:2;
        u32 req_done_rand_gen:1;
        u32 rsvd_6:10;
        u32 req_done_infinite_es:1;
        u32 rsvd_17:11;
        u32 req_done_known_answer_test:1;
        u32 req_pass_known_answer_test:1;
        u32 req_done_monitor_test:1;
        u32 req_pass_monitor_test:1;
    } b;
} reqsts_t;

#define CMD                                      0x0000001c
#define   SSRB_SEL_BYP_DLY_MASK                  0x00000070
#define   SSRB_SEL_BYP_DLY_SHIFT                          4
#define   SSRB_SEL_BYP_PN_MASK                   0x00000008
#define   SSRB_SEL_BYP_PN_SHIFT                           3
#define   SSRB_SEL_BYP_MASK                      0x00000004
#define   SSRB_SEL_BYP_SHIFT                              2
#define   SSRB_LFSR_DIS_MASK                     0x00000002
#define   SSRB_LFSR_DIS_SHIFT                             1
#define   CMD_LFSR_LD_MASK                       0x00000001
#define   CMD_LFSR_LD_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 cmd_lfsr_ld:1;
        u32 ssrb_lfsr_dis:1;
        u32 ssrb_sel_byp:1;
        u32 ssrb_sel_byp_pn:1;
        u32 ssrb_sel_byp_dly:3;
        u32 rsvd_7:25;
    } b;
} cmd_t;

#define SEED_0                                   0x00000020
#define   SEED_BY0_MASK                          0xffffffff
#define   SEED_BY0_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 seed_by0:32;
    } b;
} seed_0_t;

#define SEED_1                                   0x00000024
#define   SEED_BY1_MASK                          0xffffffff
#define   SEED_BY1_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 seed_by1:32;
    } b;
} seed_1_t;

#define SEED_2                                   0x00000028
#define   SEED_BY2_MASK                          0xffffffff
#define   SEED_BY2_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 seed_by2:32;
    } b;
} seed_2_t;

#define SEED_3                                   0x0000002c
#define   SEED_BY3_MASK                          0xffffffff
#define   SEED_BY3_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 seed_by3:32;
    } b;
} seed_3_t;

#define SEED_4                                   0x00000030
#define   SEED_BY4_MASK                          0xffffffff
#define   SEED_BY4_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 seed_by4:32;
    } b;
} seed_4_t;

#define SEED_5                                   0x00000034
#define   SEED_BY5_MASK                          0xffffffff
#define   SEED_BY5_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 seed_by5:32;
    } b;
} seed_5_t;

#define SEED_6                                   0x00000038
#define   SEED_BY6_MASK                          0xffffffff
#define   SEED_BY6_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 seed_by6:32;
    } b;
} seed_6_t;

#define SEED_7                                   0x0000003c
#define   SEED_BY7_MASK                          0xffffffff
#define   SEED_BY7_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 seed_by7:32;
    } b;
} seed_7_t;

#define RAND_0                                   0x00000040
#define   RAND_BY0_MASK                          0xffffffff
#define   RAND_BY0_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rand_by0:32;
    } b;
} rand_0_t;

#define RAND_1                                   0x00000044
#define   RAND_BY1_MASK                          0xffffffff
#define   RAND_BY1_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rand_by1:32;
    } b;
} rand_1_t;

#define RAND_2                                   0x00000048
#define   RAND_BY2_MASK                          0xffffffff
#define   RAND_BY2_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rand_by2:32;
    } b;
} rand_2_t;

#define RAND_3                                   0x0000004c
#define   RAND_BY3_MASK                          0xffffffff
#define   RAND_BY3_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rand_by3:32;
    } b;
} rand_3_t;

#define RAND_4                                   0x00000050
#define   RAND_BY4_MASK                          0xffffffff
#define   RAND_BY4_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rand_by4:32;
    } b;
} rand_4_t;

#define RAND_5                                   0x00000054
#define   RAND_BY5_MASK                          0xffffffff
#define   RAND_BY5_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rand_by5:32;
    } b;
} rand_5_t;

#define RAND_6                                   0x00000058
#define   RAND_BY6_MASK                          0xffffffff
#define   RAND_BY6_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rand_by6:32;
    } b;
} rand_6_t;

#define RAND_7                                   0x0000005c
#define   RAND_BY7_MASK                          0xffffffff
#define   RAND_BY7_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 rand_by7:32;
    } b;
} rand_7_t;

#define DEBUG                                    0x0000006c
#define   DEBUG10_MASK                           0x00000400
#define   DEBUG10_SHIFT                                  10
#define   DEBUG09_MASK                           0x00000200
#define   DEBUG09_SHIFT                                   9
#define   DEBUG08_MASK                           0x00000100
#define   DEBUG08_SHIFT                                   8
#define   DEBUG03_MASK                           0x00000008
#define   DEBUG03_SHIFT                                   3
#define   DEBUG02_MASK                           0x00000004
#define   DEBUG02_SHIFT                                   2
#define   DEBUG01_MASK                           0x00000002
#define   DEBUG01_SHIFT                                   1
#define   DEBUG00_MASK                           0x00000001
#define   DEBUG00_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 debug00:1;
        u32 debug01:1;
        u32 debug02:1;
        u32 debug03:1;
        u32 rsvd_4:4;
        u32 debug08:1;
        u32 debug09:1;
        u32 debug10:1;
        u32 rsvd_11:21;
    } b;
} debug_t;

#define TIMER                                    0x00000070
#define   SEEDING_TIMER_MASK                     0xffffffff
#define   SEEDING_TIMER_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 seeding_timer:32;
    } b;
} timer_t;

#define IRQ_EN                                   0x00000078
#define   IEN_ALL_MASK                           0x80000000
#define   IEN_ALL_SHIFT                                  31
#define   IEN_WATCHDOG_ERR_MASK                  0x00020000
#define   IEN_WATCHDOG_ERR_SHIFT                         17
#define   IEN_MON_ERR_MASK                       0x00010000
#define   IEN_MON_ERR_SHIFT                              16
#define   IEN_PRNG_LOCKUP_MASK                   0x00000008
#define   IEN_PRNG_LOCKUP_SHIFT                           3
#define   IEN_LFSR_LOCKUP_MASK                   0x00000004
#define   IEN_LFSR_LOCKUP_SHIFT                           2
#define   IEN_RAND_GEN_DONE_MASK                 0x00000002
#define   IEN_RAND_GEN_DONE_SHIFT                         1
#define   IEN_SEED_DONE_MASK                     0x00000001
#define   IEN_SEED_DONE_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 ien_seed_done:1;
        u32 ien_rand_gen_done:1;
        u32 ien_lfsr_lockup:1;
        u32 ien_prng_lockup:1;
        u32 rsvd_4:12;
        u32 ien_mon_err:1;
        u32 ien_watchdog_err:1;
        u32 rsvd_18:13;
        u32 ien_all:1;
    } b;
} irq_en_t;

#define IRQ_FLAG                                 0x0000007c
#define   IFLAG_WATCHDOG_ERR_MASK                0x00020000
#define   IFLAG_WATCHDOG_ERR_SHIFT                       17
#define   IFLAG_MON_ERR_MASK                     0x00010000
#define   IFLAG_MON_ERR_SHIFT                            16
#define   IFLAG_PRNG_LOCKUP_MASK                 0x00000008
#define   IFLAG_PRNG_LOCKUP_SHIFT                         3
#define   IFLAG_LFSR_LOCKUP_MASK                 0x00000004
#define   IFLAG_LFSR_LOCKUP_SHIFT                         2
#define   IFLAG_RAND_GEN_DONE_MASK               0x00000002
#define   IFLAG_RAND_GEN_DONE_SHIFT                       1
#define   IFLAG_SEED_DONE_MASK                   0x00000001
#define   IFLAG_SEED_DONE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 iflag_seed_done:1;
        u32 iflag_rand_gen_done:1;
        u32 iflag_lfsr_lockup:1;
        u32 iflag_prng_lockup:1;
        u32 rsvd_4:12;
        u32 iflag_mon_err:1;
        u32 iflag_watchdog_err:1;
        u32 rsvd_18:14;
    } b;
} irq_flag_t;

#define MON_0                                    0x000000e0
#define   MON_LONG_LEVEL_MASK                    0x00700000
#define   MON_LONG_LEVEL_SHIFT                           20
#define   MON_POKER_LEVEL_MASK                   0x00070000
#define   MON_POKER_LEVEL_SHIFT                          16
#define   MON_RUNS_LEVEL_MASK                    0x00007000
#define   MON_RUNS_LEVEL_SHIFT                           12
#define   MON_MONO_LEVEL_MASK                    0x00000700
#define   MON_MONO_LEVEL_SHIFT                            8
#define   WATCHDOG_CLEAR_MASK                    0x00000004
#define   WATCHDOG_CLEAR_SHIFT                            2
#define   MON_FORCE_START_MASK                   0x00000002
#define   MON_FORCE_START_SHIFT                           1
#define   MON_EN_MASK                            0x00000001
#define   MON_EN_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 mon_en:1;
        u32 mon_force_start:1;
        u32 watchdog_clear:1;
        u32 rsvd_3:5;
        u32 mon_mono_level:3;
        u32 rsvd_11:1;
        u32 mon_runs_level:3;
        u32 rsvd_15:1;
        u32 mon_poker_level:3;
        u32 rsvd_19:1;
        u32 mon_long_level:3;
        u32 rsvd_23:9;
    } b;
} mon_0_t;

#define MON_1                                    0x000000e4
#define   MON_SLEEP_INTERVAL_MASK                0xffff0000
#define   MON_SLEEP_INTERVAL_SHIFT                       16
#define   MON_SLEEP_NUM_MASK                     0x0000ffff
#define   MON_SLEEP_NUM_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 mon_sleep_num:16;
        u32 mon_sleep_interval:16;
    } b;
} mon_1_t;

#define MON_2                                    0x000000e8
#define   MON_TEST_OUT_SEL_3_MASK                0x00070000
#define   MON_TEST_OUT_SEL_3_SHIFT                       16
#define   MON_TEST_OUT_SEL_2_MASK                0x00001000
#define   MON_TEST_OUT_SEL_2_SHIFT                       12
#define   MON_TEST_OUT_SEL_MASK                  0x00000700
#define   MON_TEST_OUT_SEL_SHIFT                          8
#define   MON_RESULT_MASK                        0x0000000f
#define   MON_RESULT_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 mon_result:4;
        u32 rsvd_4:4;
        u32 mon_test_out_sel:3;
        u32 rsvd_11:1;
        u32 mon_test_out_sel_2:1;
        u32 rsvd_13:3;
        u32 mon_test_out_sel_3:3;
        u32 rsvd_19:13;
    } b;
} mon_2_t;

#define MON_3                                    0x000000ec
#define   MON_TEST_OUT_MASK                      0xffffffff
#define   MON_TEST_OUT_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 mon_test_out:32;
    } b;
} mon_3_t;

#define MON_4                                    0x000000f0
#define   MON_TEST_CNT_MASK                      0xffffffff
#define   MON_TEST_CNT_SHIFT                              0
typedef union {
    u32 all;
    struct {
        u32 mon_test_cnt:32;
    } b;
} mon_4_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ revid_t revid;
    /* 0x0004 */ revid_misc_t revid_misc;
    /* 0x0008 */ mode_t mode;
    /* 0x000c */ cntl_t cntl;
    /* 0x0010 */ sts_t sts;
    /* 0x0014 */ req_t req;
    /* 0x0018 */ reqsts_t reqsts;
    /* 0x001c */ cmd_t cmd;
    /* 0x0020 */ seed_0_t seed_0;
    /* 0x0024 */ seed_1_t seed_1;
    /* 0x0028 */ seed_2_t seed_2;
    /* 0x002c */ seed_3_t seed_3;
    /* 0x0030 */ seed_4_t seed_4;
    /* 0x0034 */ seed_5_t seed_5;
    /* 0x0038 */ seed_6_t seed_6;
    /* 0x003c */ seed_7_t seed_7;
    /* 0x0040 */ rand_0_t rand_0;
    /* 0x0044 */ rand_1_t rand_1;
    /* 0x0048 */ rand_2_t rand_2;
    /* 0x004c */ rand_3_t rand_3;
    /* 0x0050 */ rand_4_t rand_4;
    /* 0x0054 */ rand_5_t rand_5;
    /* 0x0058 */ rand_6_t rand_6;
    /* 0x005c */ rand_7_t rand_7;
    /* 0x0060 */ u32 rsvd_60 [3];
    /* 0x006c */ debug_t debug;
    /* 0x0070 */ timer_t timer;
    /* 0x0074 */ u32 rsvd_74;
    /* 0x0078 */ irq_en_t irq_en;
    /* 0x007c */ irq_flag_t irq_flag;
    /* 0x0080 */ u32 rsvd_80 [24];
    /* 0x00e0 */ mon_0_t mon_0;
    /* 0x00e4 */ mon_1_t mon_1;
    /* 0x00e8 */ mon_2_t mon_2;
    /* 0x00ec */ mon_3_t mon_3;
    /* 0x00f0 */ mon_4_t mon_4;
} itrng_reg_regs_t;


#endif /* rev 0 */