//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _L2CACHE_H_
#define _L2CACHE_H_

#define CACHE_CONFIG_REG                         0x00000000
#define   SKIP_NONSEQ_WA_EN_MASK                 0x00400000
#define   SKIP_NONSEQ_WA_EN_SHIFT                        22
#define   SKIP_NONSEQ_RA_EN_MASK                 0x00200000
#define   SKIP_NONSEQ_RA_EN_SHIFT                        21
#define   AUTO_PRELOAD_FIFO_SEL_MASK             0x00100000
#define   AUTO_PRELOAD_FIFO_SEL_SHIFT                    20
#define   AUTO_PRELOAD_MODE_MASK                 0x00080000
#define   AUTO_PRELOAD_MODE_SHIFT                        19
#define   AUTO_PRELOAD_EN_MASK                   0x00040000
#define   AUTO_PRELOAD_EN_SHIFT                          18
#define   L3_RD_ERR_PROP_DIS_MASK                0x00020000
#define   L3_RD_ERR_PROP_DIS_SHIFT                       17
#define   AXI_SLV_WR_DATA_CHK_DIS_MASK           0x00010000
#define   AXI_SLV_WR_DATA_CHK_DIS_SHIFT                  16
#define   LRU_OVWR_DIS_MASK                      0x00008000
#define   LRU_OVWR_DIS_SHIFT                             15
#define   RETRVD_EB_DIRTY_EN_MASK                0x00004000
#define   RETRVD_EB_DIRTY_EN_SHIFT                       14
#define   INCR_RD_SPTR_MODE_MASK                 0x00002000
#define   INCR_RD_SPTR_MODE_SHIFT                        13
#define   AXI_MAS_RD_DATA_CHK_DIS_MASK           0x00001000
#define   AXI_MAS_RD_DATA_CHK_DIS_SHIFT                  12
#define   EB_L3_WR_ABORT_DIS_MASK                0x00000800
#define   EB_L3_WR_ABORT_DIS_SHIFT                       11
#define   AXI_ERR_DIS_MASK                       0x00000400
#define   AXI_ERR_DIS_SHIFT                              10
#define   MEM_ERR_DIS_MASK                       0x00000200
#define   MEM_ERR_DIS_SHIFT                               9
#define   L3_WR_FAIL_DROP_MASK                   0x00000100
#define   L3_WR_FAIL_DROP_SHIFT                           8
#define   MEMORY_TYPE_CTRL_MASK                  0x00000070
#define   MEMORY_TYPE_CTRL_SHIFT                          4
#define   CACHE_INITIALIZE_MASK                  0x00000008
#define   CACHE_INITIALIZE_SHIFT                          3
#define   CACHE_RESET_MASK                       0x00000004
#define   CACHE_RESET_SHIFT                               2
#define   CACHE_BYPASS_MASK                      0x00000002
#define   CACHE_BYPASS_SHIFT                              1
#define   CACHE_LINE_SIZE_SEL_MASK               0x00000001
#define   CACHE_LINE_SIZE_SEL_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 cache_line_size_sel:1;
        u32 cache_bypass:1;
        u32 cache_reset:1;
        u32 cache_initialize:1;
        u32 memory_type_ctrl:3;
        u32 rsvd_7:1;
        u32 l3_wr_fail_drop:1;
        u32 mem_err_dis:1;
        u32 axi_err_dis:1;
        u32 eb_l3_wr_abort_dis:1;
        u32 axi_mas_rd_data_chk_dis:1;
        u32 incr_rd_sptr_mode:1;
        u32 retrvd_eb_dirty_en:1;
        u32 lru_ovwr_dis:1;
        u32 axi_slv_wr_data_chk_dis:1;
        u32 l3_rd_err_prop_dis:1;
        u32 auto_preload_en:1;
        u32 auto_preload_mode:1;
        u32 auto_preload_fifo_sel:1;
        u32 skip_nonseq_ra_en:1;
        u32 skip_nonseq_wa_en:1;
        u32 rsvd_23:9;
    } b;
} cache_config_reg_t;

#define PRELOAD_ADDRESS_REG                      0x00000010
#define   PRELOAD_FIFO_SEL_MASK                  0x80000000
#define   PRELOAD_FIFO_SEL_SHIFT                         31
#define   PRELOAD_ADDRESS_MASK                   0x7fffffff
#define   PRELOAD_ADDRESS_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 preload_address:31;
        u32 preload_fifo_sel:1;
    } b;
} preload_address_reg_t;

#define PRELOAD_FIFO_STATUS_REG                  0x00000014
#define   PRELOAD_FIFO_PENDING_CMD_CNT_MASK      0x00007f00
#define   PRELOAD_FIFO_PENDING_CMD_CNT_SHIFT              8
#define   PRELOAD_FIFO_EMPTY_MASK                0x00000002
#define   PRELOAD_FIFO_EMPTY_SHIFT                        1
#define   PRELOAD_FIFO_FULL_MASK                 0x00000001
#define   PRELOAD_FIFO_FULL_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 preload_fifo_full:1;
        u32 preload_fifo_empty:1;
        u32 rsvd_2:6;
        u32 preload_fifo_pending_cmd_cnt:7;
        u32 rsvd_15:17;
    } b;
} preload_fifo_status_reg_t;

#define FLUSH_ADDRESS_REG                        0x00000018
#define   FLUSH_ADDRESS_MASK                     0x7fffffff
#define   FLUSH_ADDRESS_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 flush_address:31;
        u32 rsvd_31:1;
    } b;
} flush_address_reg_t;

#define FLUSH_WAY_SET_REG                        0x0000001c
#define   FLUSH_WAY_INDEX_MASK                   0x00070000
#define   FLUSH_WAY_INDEX_SHIFT                          16
#define   FLUSH_SET_INDEX_MASK                   0x000001ff
#define   FLUSH_SET_INDEX_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 flush_set_index:9;
        u32 rsvd_9:7;
        u32 flush_way_index:3;
        u32 rsvd_19:13;
    } b;
} flush_way_set_reg_t;

#define INVALIDATE_ADDRESS_REG                   0x00000020
#define   INVALIDATE_ADDRESS_MASK                0x7fffffff
#define   INVALIDATE_ADDRESS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 invalidate_address:31;
        u32 rsvd_31:1;
    } b;
} invalidate_address_reg_t;

#define INVALIDATE_WAY_SET_REG                   0x00000024
#define   INVALIDATE_WAY_INDEX_MASK              0x00070000
#define   INVALIDATE_WAY_INDEX_SHIFT                     16
#define   INVALIDATE_SET_INDEX_MASK              0x000001ff
#define   INVALIDATE_SET_INDEX_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 invalidate_set_index:9;
        u32 rsvd_9:7;
        u32 invalidate_way_index:3;
        u32 rsvd_19:13;
    } b;
} invalidate_way_set_reg_t;

#define COMMON_FIFO_STATUS_REG                   0x00000028
#define   COMMON_FIFO_PENDING_PCMD_CNT_MASK      0xff000000
#define   COMMON_FIFO_PENDING_PCMD_CNT_SHIFT             24
#define   COMMON_FIFO_PENDING_FCMD_CNT_MASK      0x00ff0000
#define   COMMON_FIFO_PENDING_FCMD_CNT_SHIFT             16
#define   COMMON_FIFO_PENDING_ICMD_CNT_MASK      0x0000ff00
#define   COMMON_FIFO_PENDING_ICMD_CNT_SHIFT              8
#define   COMMON_FIFO_EMPTY_MASK                 0x00000002
#define   COMMON_FIFO_EMPTY_SHIFT                         1
#define   COMMON_FIFO_FULL_MASK                  0x00000001
#define   COMMON_FIFO_FULL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 common_fifo_full:1;
        u32 common_fifo_empty:1;
        u32 rsvd_2:6;
        u32 common_fifo_pending_icmd_cnt:8;
        u32 common_fifo_pending_fcmd_cnt:8;
        u32 common_fifo_pending_pcmd_cnt:8;
    } b;
} common_fifo_status_reg_t;

#define TAG_MEM_CONFIG_REG                       0x00000030
#define   RDATA_FIFO_MTSEL_MASK                  0x60000000
#define   RDATA_FIFO_MTSEL_SHIFT                         29
#define   RDATA_FIFO_RTSEL_MASK                  0x18000000
#define   RDATA_FIFO_RTSEL_SHIFT                         27
#define   RDATA_FIFO_WTSEL_MASK                  0x06000000
#define   RDATA_FIFO_WTSEL_SHIFT                         25
#define   RDATA_FIFO_PWDN_MASK                   0x01000000
#define   RDATA_FIFO_PWDN_SHIFT                          24
#define   WDATA_FIFO_MTSEL_MASK                  0x00600000
#define   WDATA_FIFO_MTSEL_SHIFT                         21
#define   WDATA_FIFO_RTSEL_MASK                  0x00180000
#define   WDATA_FIFO_RTSEL_SHIFT                         19
#define   WDATA_FIFO_WTSEL_MASK                  0x00060000
#define   WDATA_FIFO_WTSEL_SHIFT                         17
#define   WDATA_FIFO_PWDN_MASK                   0x00010000
#define   WDATA_FIFO_PWDN_SHIFT                          16
#define   DATA_MEM_RTSEL_MASK                    0x00001800
#define   DATA_MEM_RTSEL_SHIFT                           11
#define   DATA_MEM_WTSEL_MASK                    0x00000600
#define   DATA_MEM_WTSEL_SHIFT                            9
#define   DATA_MEM_PWDN_MASK                     0x00000100
#define   DATA_MEM_PWDN_SHIFT                             8
#define   TAG_MEM_RTSEL_MASK                     0x00000018
#define   TAG_MEM_RTSEL_SHIFT                             3
#define   TAG_MEM_WTSEL_MASK                     0x00000006
#define   TAG_MEM_WTSEL_SHIFT                             1
#define   TAG_MEM_PWDN_MASK                      0x00000001
#define   TAG_MEM_PWDN_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 tag_mem_pwdn:1;
        u32 tag_mem_wtsel:2;
        u32 tag_mem_rtsel:2;
        u32 rsvd_5:3;
        u32 data_mem_pwdn:1;
        u32 data_mem_wtsel:2;
        u32 data_mem_rtsel:2;
        u32 rsvd_13:3;
        u32 wdata_fifo_pwdn:1;
        u32 wdata_fifo_wtsel:2;
        u32 wdata_fifo_rtsel:2;
        u32 wdata_fifo_mtsel:2;
        u32 rsvd_23:1;
        u32 rdata_fifo_pwdn:1;
        u32 rdata_fifo_wtsel:2;
        u32 rdata_fifo_rtsel:2;
        u32 rdata_fifo_mtsel:2;
        u32 rsvd_31:1;
    } b;
} tag_mem_config_reg_t;

#define MEM_EXT_ACC_REG_0                        0x00000038
#define   MEM_EXT_ACC_EN_MASK                    0x80000000
#define   MEM_EXT_ACC_EN_SHIFT                           31
#define   MEM_EXT_ACC_SEL_ID_MASK                0x01000000
#define   MEM_EXT_ACC_SEL_ID_SHIFT                       24
#define   MEM_EXT_ACC_DW_SEL_MASK                0x001f0000
#define   MEM_EXT_ACC_DW_SEL_SHIFT                       16
#define   MEM_EXT_ACC_ADR_MASK                   0x00000fff
#define   MEM_EXT_ACC_ADR_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 mem_ext_acc_adr:12;
        u32 rsvd_12:4;
        u32 mem_ext_acc_dw_sel:5;
        u32 rsvd_21:3;
        u32 mem_ext_acc_sel_id:1;
        u32 rsvd_25:6;
        u32 mem_ext_acc_en:1;
    } b;
} mem_ext_acc_reg_0_t;

#define MEM_EXT_ACC_REG_1                        0x0000003c
#define   MEM_EXT_ACC_DOUT_MASK                  0xffffffff
#define   MEM_EXT_ACC_DOUT_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 mem_ext_acc_dout:32;
    } b;
} mem_ext_acc_reg_1_t;

#define INTERRUPT_STATUS_REG                     0x00000040
#define   ERROR_INT_MASK_MASK                    0x00000100
#define   ERROR_INT_MASK_SHIFT                            8
#define   ERROR_INT_MASK                         0x00000001
#define   ERROR_INT_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 error_int:1;
        u32 rsvd_1:7;
        u32 error_int_mask:1;
        u32 rsvd_9:23;
    } b;
} interrupt_status_reg_t;

#define ERROR_LOG_CTRL_REG                       0x00000044
#define   ERROR_LOG_RESET_MASK                   0x00000001
#define   ERROR_LOG_RESET_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 error_log_reset:1;
        u32 rsvd_1:31;
    } b;
} error_log_ctrl_reg_t;

#define ERROR_LOG_REG_0                          0x00000048
#define   ERROR_LOG_0_MASK                       0xffffffff
#define   ERROR_LOG_0_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 error_log_0:32;
    } b;
} error_log_reg_0_t;

#define ERROR_LOG_REG_1                          0x0000004c
#define   ERROR_LOG_1_MASK                       0xffffffff
#define   ERROR_LOG_1_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 error_log_1:32;
    } b;
} error_log_reg_1_t;

#define CACHE_RD_INFO_CTRL_REG                   0x00000060
#define   CACHE_RD_EB_HIT_CONFIG_MASK            0x00000300
#define   CACHE_RD_EB_HIT_CONFIG_SHIFT                    8
#define   CACHE_RD_CYCLE_SEL_MASK                0x00000030
#define   CACHE_RD_CYCLE_SEL_SHIFT                        4
#define   CACHE_RD_INFO_RESET_MASK               0x00000002
#define   CACHE_RD_INFO_RESET_SHIFT                       1
#define   CACHE_RD_INFO_EN_MASK                  0x00000001
#define   CACHE_RD_INFO_EN_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cache_rd_info_en:1;
        u32 cache_rd_info_reset:1;
        u32 rsvd_2:2;
        u32 cache_rd_cycle_sel:2;
        u32 rsvd_6:2;
        u32 cache_rd_eb_hit_config:2;
        u32 rsvd_10:22;
    } b;
} cache_rd_info_ctrl_reg_t;

#define CACHE_RD_INFO_0_REG                      0x00000064
#define   CACHE_RD_COUNT_MASK                    0xffffffff
#define   CACHE_RD_COUNT_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 cache_rd_count:32;
    } b;
} cache_rd_info_0_reg_t;

#define CACHE_RD_INFO_1_REG                      0x00000068
#define   CACHE_RD_HIT_COUNT_MASK                0xffffffff
#define   CACHE_RD_HIT_COUNT_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 cache_rd_hit_count:32;
    } b;
} cache_rd_info_1_reg_t;

#define CACHE_RD_INFO_2_REG                      0x0000006c
#define   CACHE_RD_CYCLE_COUNT_MASK              0xffffffff
#define   CACHE_RD_CYCLE_COUNT_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cache_rd_cycle_count:32;
    } b;
} cache_rd_info_2_reg_t;

#define CACHE_WR_INFO_CTRL_REG                   0x00000070
#define   CACHE_WR_EB_HIT_CONFIG_MASK            0x00000300
#define   CACHE_WR_EB_HIT_CONFIG_SHIFT                    8
#define   CACHE_WR_CYCLE_SEL_MASK                0x00000030
#define   CACHE_WR_CYCLE_SEL_SHIFT                        4
#define   CACHE_WR_INFO_RESET_MASK               0x00000002
#define   CACHE_WR_INFO_RESET_SHIFT                       1
#define   CACHE_WR_INFO_EN_MASK                  0x00000001
#define   CACHE_WR_INFO_EN_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cache_wr_info_en:1;
        u32 cache_wr_info_reset:1;
        u32 rsvd_2:2;
        u32 cache_wr_cycle_sel:2;
        u32 rsvd_6:2;
        u32 cache_wr_eb_hit_config:2;
        u32 rsvd_10:22;
    } b;
} cache_wr_info_ctrl_reg_t;

#define CACHE_WR_INFO_0_REG                      0x00000074
#define   CACHE_WR_COUNT_MASK                    0xffffffff
#define   CACHE_WR_COUNT_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 cache_wr_count:32;
    } b;
} cache_wr_info_0_reg_t;

#define CACHE_WR_INFO_1_REG                      0x00000078
#define   CACHE_WR_HIT_COUNT_MASK                0xffffffff
#define   CACHE_WR_HIT_COUNT_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 cache_wr_hit_count:32;
    } b;
} cache_wr_info_1_reg_t;

#define CACHE_WR_INFO_2_REG                      0x0000007c
#define   CACHE_WR_CYCLE_COUNT_MASK              0xffffffff
#define   CACHE_WR_CYCLE_COUNT_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 cache_wr_cycle_count:32;
    } b;
} cache_wr_info_2_reg_t;

#define CACHE_DEBUG_REG                          0x00000080
#define   CACHE_DEBUG_STATUS_MASK                0x0000ffff
#define   CACHE_DEBUG_STATUS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 cache_debug_status:16;
        u32 rsvd_16:16;
    } b;
} cache_debug_reg_t;

#define CACHE_DEBUG_SEL_REG                      0x00000084
#define   CACHE_DEBUG_PIN_SEL_MASK               0x80000000
#define   CACHE_DEBUG_PIN_SEL_SHIFT                      31
#define   CACHE_DEBUG_SEL_MASK                   0x000fffff
#define   CACHE_DEBUG_SEL_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 cache_debug_sel:20;
        u32 rsvd_20:11;
        u32 cache_debug_pin_sel:1;
    } b;
} cache_debug_sel_reg_t;

#define AXI_MAS_DEBUG_REG                        0x00000090
#define   AXI_MAS_WR_CMD_Q_NUM_MASK              0xff000000
#define   AXI_MAS_WR_CMD_Q_NUM_SHIFT                     24
#define   AXI_MAS_RD_CMD_Q_NUM_MASK              0x00ff0000
#define   AXI_MAS_RD_CMD_Q_NUM_SHIFT                     16
#define   AXI_MAS_WR_ADDR_CH_ST_MASK             0x00004000
#define   AXI_MAS_WR_ADDR_CH_ST_SHIFT                    14
#define   AXI_MAS_WR_DATA_CH_ST_MASK             0x00002000
#define   AXI_MAS_WR_DATA_CH_ST_SHIFT                    13
#define   AXI_MAS_WR_RESP_CH_ST_MASK             0x00001000
#define   AXI_MAS_WR_RESP_CH_ST_SHIFT                    12
#define   AXI_MAS_RD_ADDR_CH_ST_MASK             0x00000200
#define   AXI_MAS_RD_ADDR_CH_ST_SHIFT                     9
#define   AXI_MAS_RD_DATA_CH_ST_MASK             0x00000100
#define   AXI_MAS_RD_DATA_CH_ST_SHIFT                     8
#define   AXI_MAS_WR_DBG_MASK                    0x00000004
#define   AXI_MAS_WR_DBG_SHIFT                            2
#define   AXI_MAS_RD_DBG_MASK                    0x00000002
#define   AXI_MAS_RD_DBG_SHIFT                            1
#define   AXI_MAS_SW_RESET_MASK                  0x00000001
#define   AXI_MAS_SW_RESET_SHIFT                          0
typedef union {
    u32 all;
    struct {
        u32 axi_mas_sw_reset:1;
        u32 axi_mas_rd_dbg:1;
        u32 axi_mas_wr_dbg:1;
        u32 rsvd_3:5;
        u32 axi_mas_rd_data_ch_st:1;
        u32 axi_mas_rd_addr_ch_st:1;
        u32 rsvd_10:2;
        u32 axi_mas_wr_resp_ch_st:1;
        u32 axi_mas_wr_data_ch_st:1;
        u32 axi_mas_wr_addr_ch_st:1;
        u32 rsvd_15:1;
        u32 axi_mas_rd_cmd_q_num:8;
        u32 axi_mas_wr_cmd_q_num:8;
    } b;
} axi_mas_debug_reg_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ cache_config_reg_t cache_config_reg;
    /* 0x0004 */ u32 rsvd_4 [3];
    /* 0x0010 */ preload_address_reg_t preload_address_reg;
    /* 0x0014 */ preload_fifo_status_reg_t preload_fifo_status_reg;
    /* 0x0018 */ flush_address_reg_t flush_address_reg;
    /* 0x001c */ flush_way_set_reg_t flush_way_set_reg;
    /* 0x0020 */ invalidate_address_reg_t invalidate_address_reg;
    /* 0x0024 */ invalidate_way_set_reg_t invalidate_way_set_reg;
    /* 0x0028 */ common_fifo_status_reg_t common_fifo_status_reg;
    /* 0x002c */ u32 rsvd_2c;
    /* 0x0030 */ tag_mem_config_reg_t tag_mem_config_reg;
    /* 0x0034 */ u32 rsvd_34;
    /* 0x0038 */ mem_ext_acc_reg_0_t mem_ext_acc_reg_0;
    /* 0x003c */ mem_ext_acc_reg_1_t mem_ext_acc_reg_1;
    /* 0x0040 */ interrupt_status_reg_t interrupt_status_reg;
    /* 0x0044 */ error_log_ctrl_reg_t error_log_ctrl_reg;
    /* 0x0048 */ error_log_reg_0_t error_log_reg_0;
    /* 0x004c */ error_log_reg_1_t error_log_reg_1;
    /* 0x0050 */ u32 rsvd_50 [4];
    /* 0x0060 */ cache_rd_info_ctrl_reg_t cache_rd_info_ctrl_reg;
    /* 0x0064 */ cache_rd_info_0_reg_t cache_rd_info_0_reg;
    /* 0x0068 */ cache_rd_info_1_reg_t cache_rd_info_1_reg;
    /* 0x006c */ cache_rd_info_2_reg_t cache_rd_info_2_reg;
    /* 0x0070 */ cache_wr_info_ctrl_reg_t cache_wr_info_ctrl_reg;
    /* 0x0074 */ cache_wr_info_0_reg_t cache_wr_info_0_reg;
    /* 0x0078 */ cache_wr_info_1_reg_t cache_wr_info_1_reg;
    /* 0x007c */ cache_wr_info_2_reg_t cache_wr_info_2_reg;
    /* 0x0080 */ cache_debug_reg_t cache_debug_reg;
    /* 0x0084 */ cache_debug_sel_reg_t cache_debug_sel_reg;
    /* 0x0088 */ u32 rsvd_88 [2];
    /* 0x0090 */ axi_mas_debug_reg_t axi_mas_debug_reg;
} l2cache_regs_t;


#endif /* rev 0 */