//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _MC_REG_H_
#define _MC_REG_H_

#define DEVICE_MODE                              0x00000000
#define   ENCRYPT_EN_MASK                        0x10000000
#define   ENCRYPT_EN_SHIFT                               28
#define   DQS_INTERVAL_TIMER_MASK                0x0ff00000
#define   DQS_INTERVAL_TIMER_SHIFT                       20
#define   DDR_3DS_EN_MASK                        0x00080000
#define   DDR_3DS_EN_SHIFT                               19
#define   OOO_REF_PER_BANK_ENABLE_MASK           0x00040000
#define   OOO_REF_PER_BANK_ENABLE_SHIFT                  18
#define   REF_PER_BANK_ENABLE_MASK               0x00020000
#define   REF_PER_BANK_ENABLE_SHIFT                      17
#define   PULL_IN_REF_ENABLE_MASK                0x00010000
#define   PULL_IN_REF_ENABLE_SHIFT                       16
#define   BURST_LENGTH_MASK                      0x00007000
#define   BURST_LENGTH_SHIFT                             12
#define   SUBPHY_DATA_UPPER_MAP_ENB_MASK         0x00000800
#define   SUBPHY_DATA_UPPER_MAP_ENB_SHIFT                11
#define   DATA_WIDTH_MASK                        0x00000700
#define   DATA_WIDTH_SHIFT                                8
#define   DATA_MASK_ENABLE_MASK                  0x00000080
#define   DATA_MASK_ENABLE_SHIFT                          7
#define   MODE_3T_MASK                           0x00000040
#define   MODE_3T_SHIFT                                   6
#define   MODE_2T_MASK                           0x00000020
#define   MODE_2T_SHIFT                                   5
#define   ADDR_MIRRORING_ENB_MASK                0x00000010
#define   ADDR_MIRRORING_ENB_SHIFT                        4
#define   DRAM_TYPE_MASK                         0x0000000f
#define   DRAM_TYPE_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 dram_type:4;
        u32 addr_mirroring_enb:1;
        u32 mode_2t:1;
        u32 mode_3t:1;
        u32 data_mask_enable:1;
        u32 data_width:3;
        u32 subphy_data_upper_map_enb:1;
        u32 burst_length:3;
        u32 rsvd_15:1;
        u32 pull_in_ref_enable:1;
        u32 ref_per_bank_enable:1;
        u32 ooo_ref_per_bank_enable:1;
        u32 ddr_3ds_en:1;
        u32 dqs_interval_timer:8;
        u32 encrypt_en:1;
        u32 rsvd_29:3;
    } b;
} device_mode_t;

#define DEVICE_CONFIG0                           0x00000004
#define   CAS_WRITE_LATENCY_MASK                 0x0ff00000
#define   CAS_WRITE_LATENCY_SHIFT                        20
#define   NWR_MASK                               0x0003f000
#define   NWR_SHIFT                                      12
#define   CAS_LATENCY_MASK                       0x00000ff0
#define   CAS_LATENCY_SHIFT                               4
#define   WL_SELECT_MASK                         0x00000001
#define   WL_SELECT_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 wl_select:1;
        u32 rsvd_1:3;
        u32 cas_latency:8;
        u32 nwr:6;
        u32 rsvd_18:2;
        u32 cas_write_latency:8;
        u32 rsvd_28:4;
    } b;
} device_config0_t;

#define DEVICE_CONFIG1                           0x00000008
#define   MPR_FORMAT_SEL_MASK                    0xc0000000
#define   MPR_FORMAT_SEL_SHIFT                           30
#define   MPR_PAGE_SEL_MASK                      0x30000000
#define   MPR_PAGE_SEL_SHIFT                             28
#define   MP_OPERATION_MASK                      0x08000000
#define   MP_OPERATION_SHIFT                             27
#define   PDA_ENABLE_MASK                        0x04000000
#define   PDA_ENABLE_SHIFT                               26
#define   SR_ABORT_MODE_MASK                     0x02000000
#define   SR_ABORT_MODE_SHIFT                            25
#define   GEARDOWN_MASK                          0x01000000
#define   GEARDOWN_SHIFT                                 24
#define   FINE_GRANULARITY_REF_MODE_MASK         0x00e00000
#define   FINE_GRANULARITY_REF_MODE_SHIFT                21
#define   CA_PARITY_PRESISTENT_ERROR_MASK        0x00100000
#define   CA_PARITY_PRESISTENT_ERROR_SHIFT               20
#define   CRC_DM_WRITE_LATENCY_MASK              0x000e0000
#define   CRC_DM_WRITE_LATENCY_SHIFT                     17
#define   CRC_ENABLE_MASK                        0x00010000
#define   CRC_ENABLE_SHIFT                               16
#define   INTERNAL_VREF_MONITOR_MASK             0x00008000
#define   INTERNAL_VREF_MONITOR_SHIFT                    15
#define   TEMP_CNTL_REF_MODE_MASK                0x00004000
#define   TEMP_CNTL_REF_MODE_SHIFT                       14
#define   TEMP_CNTL_REF_RANGE_MASK               0x00002000
#define   TEMP_CNTL_REF_RANGE_SHIFT                      13
#define   AUTO_SELF_REFRESH_MODE_MASK            0x00001800
#define   AUTO_SELF_REFRESH_MODE_SHIFT                   11
#define   DRAM_DLL_RESET_MASK                    0x00000400
#define   DRAM_DLL_RESET_SHIFT                           10
#define   DRAM_DLL_DISABLE_MASK                  0x00000200
#define   DRAM_DLL_DISABLE_SHIFT                          9
#define   PWDN_MODE_MASK                         0x00000100
#define   PWDN_MODE_SHIFT                                 8
#define   CA_PARITY_LATENCY_MASK                 0x000000f0
#define   CA_PARITY_LATENCY_SHIFT                         4
#define   CA_LATENCY_MASK                        0x0000000f
#define   CA_LATENCY_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 ca_latency:4;
        u32 ca_parity_latency:4;
        u32 pwdn_mode:1;
        u32 dram_dll_disable:1;
        u32 dram_dll_reset:1;
        u32 auto_self_refresh_mode:2;
        u32 temp_cntl_ref_range:1;
        u32 temp_cntl_ref_mode:1;
        u32 internal_vref_monitor:1;
        u32 crc_enable:1;
        u32 crc_dm_write_latency:3;
        u32 ca_parity_presistent_error:1;
        u32 fine_granularity_ref_mode:3;
        u32 geardown:1;
        u32 sr_abort_mode:1;
        u32 pda_enable:1;
        u32 mp_operation:1;
        u32 mpr_page_sel:2;
        u32 mpr_format_sel:2;
    } b;
} device_config1_t;

#define DEVICE_CONFIG2                           0x0000000c
#define   FSP_WR_MASK                            0x80000000
#define   FSP_WR_SHIFT                                   31
#define   FSP_OP_MASK                            0x40000000
#define   FSP_OP_SHIFT                                   30
#define   SOC_ODT_MASK                           0x00003800
#define   SOC_ODT_SHIFT                                  11
#define   TRR_MODE_BA_MASK                       0x00000700
#define   TRR_MODE_BA_SHIFT                               8
#define   TRR_MODE_ENB_MASK                      0x00000080
#define   TRR_MODE_ENB_SHIFT                              7
#define   VRCG_MASK                              0x00000040
#define   VRCG_SHIFT                                      6
#define   PU_CAL_MASK                            0x00000020
#define   PU_CAL_SHIFT                                    5
#define   THERMAL_OFFSET_MASK                    0x00000018
#define   THERMAL_OFFSET_SHIFT                            3
#define   VRO_MASK                               0x00000004
#define   VRO_SHIFT                                       2
#define   CBT_MASK                               0x00000002
#define   CBT_SHIFT                                       1
#define   PPRE_MASK                              0x00000001
#define   PPRE_SHIFT                                      0

typedef union {
    u32 all;
    struct {
        u32 ppre:1;
        u32 cbt:1;
        u32 vro:1;
        u32 thermal_offset:2;
        u32 pu_cal:1;
        u32 vrcg:1;
        u32 trr_mode_enb:1;
        u32 trr_mode_ba:3;
        u32 soc_odt:3;
        u32 rsvd_14:16;
        u32 fsp_op:1;
        u32 fsp_wr:1;
    } b;
} device_config2_t;

#define DEVICE_CONFIG3                           0x00000010
#define   DEVICE_DRIVE_STRENGTH_MASK             0x000f0000
#define   DEVICE_DRIVE_STRENGTH_SHIFT                    16
#define   NOWMEM_MODE_MASK                       0x00004000
#define   NOWMEM_MODE_SHIFT                              14
#define   NOMEM_MODE_MASK                        0x00002000
#define   NOMEM_MODE_SHIFT                               13
#define   REF_EXC_STOA_MASK                      0x00001000
#define   REF_EXC_STOA_SHIFT                             12
#define   STORE_ALL_BANK_STAGGERING_MASK         0x00000c00
#define   STORE_ALL_BANK_STAGGERING_SHIFT                10
#define   READ_DBI_ENABLE_MASK                   0x00000200
#define   READ_DBI_ENABLE_SHIFT                           9
#define   WRITE_DBI_ENABLE_MASK                  0x00000100
#define   WRITE_DBI_ENABLE_SHIFT                          8
#define   WR_POSTAMBLE_MASK                      0x00000008
#define   WR_POSTAMBLE_SHIFT                              3
#define   WR_PREAMBLE_MASK                       0x00000004
#define   WR_PREAMBLE_SHIFT                               2
#define   RD_POSTAMBLE_MASK                      0x00000002
#define   RD_POSTAMBLE_SHIFT                              1
#define   RD_PREAMBLE_MASK                       0x00000001
#define   RD_PREAMBLE_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 rd_preamble:1;
        u32 rd_postamble:1;
        u32 wr_preamble:1;
        u32 wr_postamble:1;
        u32 rsvd_4:4;
        u32 write_dbi_enable:1;
        u32 read_dbi_enable:1;
        u32 store_all_bank_staggering:2;
        u32 ref_exc_stoa:1;
        u32 nomem_mode:1;
        u32 nowmem_mode:1;
        u32 rsvd_15:1;
        u32 device_drive_strength:4;
        u32 rsvd_20:12;
    } b;
} device_config3_t;

#define DEVICE_CONFIG_TRAINING                   0x00000014
#define   CA_VREF_TRAINING_RANGE_MASK            0x00080000
#define   CA_VREF_TRAINING_RANGE_SHIFT                   19
#define   CA_VREF_TRAINING_VALUE_MASK            0x0003f000
#define   CA_VREF_TRAINING_VALUE_SHIFT                   12
#define   DQ_VREF_TRAINING_RANGE_MASK            0x00000800
#define   DQ_VREF_TRAINING_RANGE_SHIFT                   11
#define   DQ_VREF_TRAINING_VALUE_MASK            0x000003f0
#define   DQ_VREF_TRAINING_VALUE_SHIFT                    4
#define   DQ_VREF_TRAINING_MASK                  0x00000004
#define   DQ_VREF_TRAINING_SHIFT                          2
#define   READ_PREAMBLE_TRAINING_MASK            0x00000002
#define   READ_PREAMBLE_TRAINING_SHIFT                    1
#define   WRITE_LEVELING_MODE_MASK               0x00000001
#define   WRITE_LEVELING_MODE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 write_leveling_mode:1;
        u32 read_preamble_training:1;
        u32 dq_vref_training:1;
        u32 rsvd_3:1;
        u32 dq_vref_training_value:6;
        u32 rsvd_10:1;
        u32 dq_vref_training_range:1;
        u32 ca_vref_training_value:6;
        u32 rsvd_18:1;
        u32 ca_vref_training_range:1;
        u32 rsvd_20:12;
    } b;
} device_config_training_t;

#define DEVICE_CONFIG_RD_DQ_CALIBRATION          0x00000018
#define   PATTERN_UPPER_MASK                     0xff000000
#define   PATTERN_UPPER_SHIFT                            24
#define   PATTERN_LOWER_MASK                     0x00ff0000
#define   PATTERN_LOWER_SHIFT                            16
#define   INVERTER_VALUE_UPPER_MASK              0x0000ff00
#define   INVERTER_VALUE_UPPER_SHIFT                      8
#define   INVERTER_VALUE_LOWER_MASK              0x000000ff
#define   INVERTER_VALUE_LOWER_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 inverter_value_lower:8;
        u32 inverter_value_upper:8;
        u32 pattern_lower:8;
        u32 pattern_upper:8;
    } b;
} device_config_rd_dq_calibration_t;

#define POWER_CONTROL                            0x0000001c
#define   ACS_ENTER_DELAY_MASK                   0x3f000000
#define   ACS_ENTER_DELAY_SHIFT                          24
#define   ACS_EXIT_DELAY_MASK                    0x001f0000
#define   ACS_EXIT_DELAY_SHIFT                           16
#define   AC_OFF_MASK                            0x0000f000
#define   AC_OFF_SHIFT                                   12
#define   AC_ON_MASK                             0x00000f00
#define   AC_ON_SHIFT                                     8
#define   CK_ON_MASK                             0x000000f0
#define   CK_ON_SHIFT                                     4
#define   AC_OFF_EN_MASK                         0x00000004
#define   AC_OFF_EN_SHIFT                                 2
#define   ACS_EN_MASK                            0x00000002
#define   ACS_EN_SHIFT                                    1
#define   PAUSE_INIT_MASK                        0x00000001
#define   PAUSE_INIT_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 pause_init:1;
        u32 acs_en:1;
        u32 ac_off_en:1;
        u32 rsvd_3:1;
        u32 ck_on:4;
        u32 ac_on:4;
        u32 ac_off:4;
        u32 acs_exit_delay:5;
        u32 rsvd_21:3;
        u32 acs_enter_delay:6;
        u32 rsvd_30:2;
    } b;
} power_control_t;

#define CS_CONFIG_SEL                            0x00000020
#define   CS_CONFIG_CS_SEL_MASK                  0x00000003
#define   CS_CONFIG_CS_SEL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 cs_config_cs_sel:2;
        u32 rsvd_2:30;
    } b;
} cs_config_sel_t;

#define CS_CONFIG_ADDR_MAP0                      0x00000024
#define   START_ADDR_LOW_MASK                    0xfc000000
#define   START_ADDR_LOW_SHIFT                           26
#define   AREA_LENGTH_MASK                       0x000001f0
#define   AREA_LENGTH_SHIFT                               4
#define   MRAM_CS_MASK                           0x00000002
#define   MRAM_CS_SHIFT                                   1
#define   CS_ENABLE_MASK                         0x00000001
#define   CS_ENABLE_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 cs_enable:1;
        u32 mram_cs:1;
        u32 rsvd_2:2;
        u32 area_length:5;
        u32 rsvd_9:17;
        u32 start_addr_low:6;
    } b;
} cs_config_addr_map0_t;

#define CS_CONFIG_ADDR_MAP1                      0x00000028
#define   START_ADDR_HIGH_MASK                   0xffffffff
#define   START_ADDR_HIGH_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 start_addr_high:32;
    } b;
} cs_config_addr_map1_t;

#define CS_CONFIG_DEVICE0                        0x0000002c
#define   BANK_ADDR_MAPPING_MASK                 0x1f000000
#define   BANK_ADDR_MAPPING_SHIFT                        24
#define   CHIP_ID_NUM_MASK                       0x000f0000
#define   CHIP_ID_NUM_SHIFT                              16
#define   ROW_ADDR_WIDTH_NUM_MASK                0x00001f00
#define   ROW_ADDR_WIDTH_NUM_SHIFT                        8
#define   COLUMN_ADDR_WIDTH_NUM_MASK             0x000000f0
#define   COLUMN_ADDR_WIDTH_NUM_SHIFT                     4
#define   BANK_GROUP_NUM_MASK                    0x0000000c
#define   BANK_GROUP_NUM_SHIFT                            2
#define   BANK_NUM_MASK                          0x00000003
#define   BANK_NUM_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 bank_num:2;
        u32 bank_group_num:2;
        u32 column_addr_width_num:4;
        u32 row_addr_width_num:5;
        u32 rsvd_13:3;
        u32 chip_id_num:4;
        u32 rsvd_20:4;
        u32 bank_addr_mapping:5;
        u32 rsvd_29:3;
    } b;
} cs_config_device0_t;

#define CS_CONFIG_DEVICE1                        0x00000030
#define   DEVICE_DIE_DATA_WIDTH_MASK             0x0000000f
#define   DEVICE_DIE_DATA_WIDTH_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 device_die_data_width:4;
        u32 rsvd_4:28;
    } b;
} cs_config_device1_t;

#define CS_CONFIG_ODT                            0x00000034
#define   ODT_VALUE_WRITE_MASK                   0x70000000
#define   ODT_VALUE_WRITE_SHIFT                          28
#define   ODTD_CA_MASK                           0x08000000
#define   ODTD_CA_SHIFT                                  27
#define   ODT_VALUE_PARK_MASK                    0x07000000
#define   ODT_VALUE_PARK_SHIFT                           24
#define   ODT_VALUE_MASK                         0x00700000
#define   ODT_VALUE_SHIFT                                20
#define   ODTE_CS_MASK                           0x00080000
#define   ODTE_CS_SHIFT                                  19
#define   ODTE_CK_MASK                           0x00040000
#define   ODTE_CK_SHIFT                                  18
#define   OUTPUT_DRIVER_IMPEDENCE_MASK           0x00030000
#define   OUTPUT_DRIVER_IMPEDENCE_SHIFT                  16
#define   PASR_MASK                              0x0000ffff
#define   PASR_SHIFT                                      0

typedef union {
    u32 all;
    struct {
        u32 pasr:16;
        u32 output_driver_impedence:2;
        u32 odte_ck:1;
        u32 odte_cs:1;
        u32 odt_value:3;
        u32 rsvd_23:1;
        u32 odt_value_park:3;
        u32 odtd_ca:1;
        u32 odt_value_write:3;
        u32 rsvd_31:1;
    } b;
} cs_config_odt_t;

#define TZ_CONFIG_SEL                            0x00000038
#define   ADDR_MAP_REG_LOCK_MASK                 0x80000000
#define   ADDR_MAP_REG_LOCK_SHIFT                        31
#define   TZ_REG_LOCK_MASK                       0x40000000
#define   TZ_REG_LOCK_SHIFT                              30
#define   TZ_REGION_SEL_MASK                     0x0000000f
#define   TZ_REGION_SEL_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 tz_region_sel:4;
        u32 rsvd_4:26;
        u32 tz_reg_lock:1;
        u32 addr_map_reg_lock:1;
    } b;
} tz_config_sel_t;

#define TZ_REGION_X_LOW                          0x0000003c
#define   START_ADDR_LOW_3c_MASK                 0xfffff000
#define   START_ADDR_LOW_3c_SHIFT                        12
#define   AREA_LENGTH_3c_MASK                    0x00000f80
#define   AREA_LENGTH_3c_SHIFT                            7
#define   TZ_PERMISSION_UD_MASK                  0x00000030
#define   TZ_PERMISSION_UD_SHIFT                          4
#define   TZ_PERMISSION_MASK                     0x00000006
#define   TZ_PERMISSION_SHIFT                             1
#define   TZ_REGION_ENB_MASK                     0x00000001
#define   TZ_REGION_ENB_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 tz_region_enb:1;
        u32 tz_permission:2;
        u32 rsvd_3:1;
        u32 tz_permission_ud:2;
        u32 rsvd_6:1;
        u32 area_length_3c:5;
        u32 start_addr_low_3c:20;
    } b;
} tz_region_x_low_t;

#define TZ_REGION_X_HIGH                         0x00000040
#define   START_ADDR_HIGH_40_MASK                0xffffffff
#define   START_ADDR_HIGH_40_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 start_addr_high_40:32;
    } b;
} tz_region_x_high_t;

#define DRAM_TIMING_INIT0                        0x00000060
#define   TPW_RESET_MASK                         0x7ff00000
#define   TPW_RESET_SHIFT                                20
#define   TINIT1_MASK                            0x0007ffff
#define   TINIT1_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 tinit1:19;
        u32 rsvd_19:1;
        u32 tpw_reset:11;
        u32 rsvd_31:1;
    } b;
} dram_timing_init0_t;

#define DRAM_TIMING_INIT1                        0x00000064
#define   TINIT3_MASK                            0x7fffff00
#define   TINIT3_SHIFT                                    8
#define   TINIT2_MASK                            0x0000001f
#define   TINIT2_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 tinit2:5;
        u32 rsvd_5:3;
        u32 tinit3:23;
        u32 rsvd_31:1;
    } b;
} dram_timing_init1_t;

#define DRAM_TIMING_INIT2                        0x00000068
#define   TINIT5_MASK                            0x01fff000
#define   TINIT5_SHIFT                                   12
#define   TPW_RESET_EXT_MASK                     0x00000f00
#define   TPW_RESET_EXT_SHIFT                             8
#define   TINIT4_MASK                            0x0000001f
#define   TINIT4_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 tinit4:5;
        u32 rsvd_5:3;
        u32 tpw_reset_ext:4;
        u32 tinit5:13;
        u32 rsvd_25:7;
    } b;
} dram_timing_init2_t;

#define DRAM_TIMING_INIT3                        0x0000006c
#define   TZQINIT_MASK                           0x00fff000
#define   TZQINIT_SHIFT                                  12
#define   TDLLK_MASK                             0x000007ff
#define   TDLLK_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 tdllk:11;
        u32 rsvd_11:1;
        u32 tzqinit:12;
        u32 rsvd_24:8;
    } b;
} dram_timing_init3_t;

#define DRAM_TIMING_INIT4                        0x00000070
#define   TZQCL_MASK                             0x03ff0000
#define   TZQCL_SHIFT                                    16
#define   TZQCS_MASK                             0x000000ff
#define   TZQCS_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 tzqcs:8;
        u32 rsvd_8:8;
        u32 tzqcl:10;
        u32 rsvd_26:6;
    } b;
} dram_timing_init4_t;

#define DRAM_TIMING_CORE0                        0x00000074
#define   TRC_MASK                               0xff000000
#define   TRC_SHIFT                                      24
#define   TRCD_MASK                              0x00ff0000
#define   TRCD_SHIFT                                     16
#define   TRAS_MASK                              0x0000ff00
#define   TRAS_SHIFT                                      8
#define   TRRD_L_MASK                            0x0000001f
#define   TRRD_L_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 trrd_l:5;
        u32 rsvd_5:3;
        u32 tras:8;
        u32 trcd:8;
        u32 trc:8;
    } b;
} dram_timing_core0_t;

#define DRAM_TIMING_CORE1                        0x00000078
#define   TFAW_MASK                              0xfe000000
#define   TFAW_SHIFT                                     25
#define   TRPPB_MASK                             0x01f80000
#define   TRPPB_SHIFT                                    19
#define   TRPAB_MASK                             0x0003f000
#define   TRPAB_SHIFT                                    12
#define   TPPD_MASK                              0x00000700
#define   TPPD_SHIFT                                      8
#define   TCCD_S_MASK                            0x00000070
#define   TCCD_S_SHIFT                                    4
#define   TCCD_L_MASK                            0x0000000f
#define   TCCD_L_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 tccd_l:4;
        u32 tccd_s:3;
        u32 rsvd_7:1;
        u32 tppd:3;
        u32 rsvd_11:1;
        u32 trpab:6;
        u32 rsvd_18:1;
        u32 trppb:6;
        u32 tfaw:7;
    } b;
} dram_timing_core1_t;

#define DRAM_TIMING_CORE2                        0x0000007c
#define   TDQSCK_MASK                            0xf0000000
#define   TDQSCK_SHIFT                                   28
#define   TWTR_S_MASK                            0x07c00000
#define   TWTR_S_SHIFT                                   22
#define   TWTR_L_MASK                            0x003f0000
#define   TWTR_L_SHIFT                                   16
#define   TRRD_S_MASK                            0x00007800
#define   TRRD_S_SHIFT                                   11
#define   TWR_MASK                               0x000007e0
#define   TWR_SHIFT                                       5
#define   TRTP_MASK                              0x0000001f
#define   TRTP_SHIFT                                      0

typedef union {
    u32 all;
    struct {
        u32 trtp:5;
        u32 twr:6;
        u32 trrd_s:4;
        u32 rsvd_15:1;
        u32 twtr_l:6;
        u32 twtr_s:5;
        u32 rsvd_27:1;
        u32 tdqsck:4;
    } b;
} dram_timing_core2_t;

#define DRAM_TIMING_CORE3                        0x00000080
#define   TMRD_MASK                              0x3f000000
#define   TMRD_SHIFT                                     24
#define   TMRR_MASK                              0x003f0000
#define   TMRR_SHIFT                                     16
#define   TMRW_MASK                              0x00003f00
#define   TMRW_SHIFT                                      8
#define   TMOD_MASK                              0x0000001f
#define   TMOD_SHIFT                                      0

typedef union {
    u32 all;
    struct {
        u32 tmod:5;
        u32 rsvd_5:3;
        u32 tmrw:6;
        u32 rsvd_14:2;
        u32 tmrr:6;
        u32 rsvd_22:2;
        u32 tmrd:6;
        u32 rsvd_30:2;
    } b;
} dram_timing_core3_t;

#define DRAM_TIMING_REF0                         0x00000084
#define   TREFI_MASK                             0x3fff0000
#define   TREFI_SHIFT                                    16
#define   TRFC_MASK                              0x000007ff
#define   TRFC_SHIFT                                      0

typedef union {
    u32 all;
    struct {
        u32 trfc:11;
        u32 rsvd_11:5;
        u32 trefi:14;
        u32 rsvd_30:2;
    } b;
} dram_timing_ref0_t;

#define DRAM_TIMING_SR0                          0x00000088
#define   TCKSRX_MASK                            0x1f000000
#define   TCKSRX_SHIFT                                   24
#define   TCKSRE_MASK                            0x001f0000
#define   TCKSRE_SHIFT                                   16
#define   TXS_MASK                               0x00007ff0
#define   TXS_SHIFT                                       4
#define   TCKE_MASK                              0x0000000f
#define   TCKE_SHIFT                                      0

typedef union {
    u32 all;
    struct {
        u32 tcke:4;
        u32 txs:11;
        u32 rsvd_15:1;
        u32 tcksre:5;
        u32 rsvd_21:3;
        u32 tcksrx:5;
        u32 rsvd_29:3;
    } b;
} dram_timing_sr0_t;

#define DRAM_TIMING_SR1                          0x0000008c
#define   TSR_MASK                               0x3f000000
#define   TSR_SHIFT                                      24
#define   TFC_MASK                               0x000003ff
#define   TFC_SHIFT                                       0

typedef union {
    u32 all;
    struct {
        u32 tfc:10;
        u32 rsvd_10:14;
        u32 tsr:6;
        u32 rsvd_30:2;
    } b;
} dram_timing_sr1_t;

#define DRAM_TIMING_PD                           0x00000090
#define   TMPX_S_MASK                            0x30000000
#define   TMPX_S_SHIFT                                   28
#define   TMPX_LH_MASK                           0x01f00000
#define   TMPX_LH_SHIFT                                  20
#define   TPDEN_MASK                             0x00030000
#define   TPDEN_SHIFT                                    16
#define   TXPDLL_MASK                            0x00001f00
#define   TXPDLL_SHIFT                                    8
#define   TCPDED_MASK                            0x00000070
#define   TCPDED_SHIFT                                    4
#define   TXP_MASK                               0x0000000f
#define   TXP_SHIFT                                       0

typedef union {
    u32 all;
    struct {
        u32 txp:4;
        u32 tcpded:3;
        u32 rsvd_7:1;
        u32 txpdll:5;
        u32 rsvd_13:3;
        u32 tpden:2;
        u32 rsvd_18:2;
        u32 tmpx_lh:5;
        u32 rsvd_25:3;
        u32 tmpx_s:2;
        u32 rsvd_30:2;
    } b;
} dram_timing_pd_t;

#define DRAM_TIMING_OFFSPEC                      0x00000094
#define   RD_DQ_EXT_DLY_MASK                     0xf0000000
#define   RD_DQ_EXT_DLY_SHIFT                            28
#define   WR2RD_CCS_DELAY_MASK                   0x03f00000
#define   WR2RD_CCS_DELAY_SHIFT                          20
#define   WR2WR_CCS_DELAY_MASK                   0x0001f000
#define   WR2WR_CCS_DELAY_SHIFT                          12
#define   RD2WR_DELAY_MASK                       0x00000fc0
#define   RD2WR_DELAY_SHIFT                               6
#define   RD2RD_CCS_DELAY_MASK                   0x0000003f
#define   RD2RD_CCS_DELAY_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 rd2rd_ccs_delay:6;
        u32 rd2wr_delay:6;
        u32 wr2wr_ccs_delay:5;
        u32 rsvd_17:3;
        u32 wr2rd_ccs_delay:6;
        u32 rsvd_26:2;
        u32 rd_dq_ext_dly:4;
    } b;
} dram_timing_offspec_t;

#define DRAM_TIMING_TRAINING0                    0x00000098
#define   DUMMY_MASK                             0x00000001
#define   DUMMY_SHIFT                                     0

typedef union {
    u32 all;
    struct {
        u32 dummy:1;
        u32 rsvd_1:31;
    } b;
} dram_timing_training0_t;

#define MRAM_TIMING_CORE0                        0x0000009c
#define   TRC_9c_MASK                            0xff000000
#define   TRC_9c_SHIFT                                   24
#define   TRCD_9c_MASK                           0x00ff0000
#define   TRCD_9c_SHIFT                                  16
#define   TRAS_9c_MASK                           0x0000ff00
#define   TRAS_9c_SHIFT                                   8
#define   TRRD_L_9c_MASK                         0x0000001f
#define   TRRD_L_9c_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 trrd_l_9c:5;
        u32 rsvd_5:3;
        u32 tras_9c:8;
        u32 trcd_9c:8;
        u32 trc_9c:8;
    } b;
} mram_timing_core0_t;

#define MRAM_TIMING_CORE1                        0x000000a0
#define   TRRD_S_a0_MASK                         0xf8000000
#define   TRRD_S_a0_SHIFT                                27
#define   TFAW_a0_MASK                           0x01ff0000
#define   TFAW_a0_SHIFT                                  16
#define   TRP_MASK                               0x00007f00
#define   TRP_SHIFT                                       8
#define   TCCD_S_a0_MASK                         0x00000070
#define   TCCD_S_a0_SHIFT                                 4
#define   TCCD_L_a0_MASK                         0x00000007
#define   TCCD_L_a0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 tccd_l_a0:3;
        u32 rsvd_3:1;
        u32 tccd_s_a0:3;
        u32 rsvd_7:1;
        u32 trp:7;
        u32 rsvd_15:1;
        u32 tfaw_a0:9;
        u32 rsvd_25:2;
        u32 trrd_s_a0:5;
    } b;
} mram_timing_core1_t;

#define MRAM_TIMING_CORE2                        0x000000a4
#define   TWTR_S_a4_MASK                         0x1f000000
#define   TWTR_S_a4_SHIFT                                24
#define   TWTR_L_a4_MASK                         0x003f0000
#define   TWTR_L_a4_SHIFT                                16
#define   TWR_a4_MASK                            0x00003f00
#define   TWR_a4_SHIFT                                    8
#define   TRTP_a4_MASK                           0x0000000f
#define   TRTP_a4_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 trtp_a4:4;
        u32 rsvd_4:4;
        u32 twr_a4:6;
        u32 rsvd_14:2;
        u32 twtr_l_a4:6;
        u32 rsvd_22:2;
        u32 twtr_s_a4:5;
        u32 rsvd_29:3;
    } b;
} mram_timing_core2_t;

#define TIMING_MISC                              0x000000a8
#define   TODTLON_MASK                           0x01f00000
#define   TODTLON_SHIFT                                  20
#define   TOSCO_MASK                             0x0007f000
#define   TOSCO_SHIFT                                    12
#define   TMRD_a8_MASK                           0x00000f00
#define   TMRD_a8_SHIFT                                   8
#define   TXS_a8_MASK                            0x000000ff
#define   TXS_a8_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 txs_a8:8;
        u32 tmrd_a8:4;
        u32 tosco:7;
        u32 rsvd_19:1;
        u32 todtlon:5;
        u32 rsvd_25:7;
    } b;
} timing_misc_t;

#define DRAM_TIMING_3DS                          0x000000ac
#define   TRRD_DLR_MASK                          0x00f00000
#define   TRRD_DLR_SHIFT                                 20
#define   TFAW_DLR_MASK                          0x0003f000
#define   TFAW_DLR_SHIFT                                 12
#define   TRFC_DLR_MASK                          0x000001ff
#define   TRFC_DLR_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 trfc_dlr:9;
        u32 rsvd_9:3;
        u32 tfaw_dlr:6;
        u32 rsvd_18:2;
        u32 trrd_dlr:4;
        u32 rsvd_24:8;
    } b;
} dram_timing_3ds_t;

#define AXI_CNTL                                 0x000000c0
#define   AXI_DECERR_DIS_MASK                    0x00040000
#define   AXI_DECERR_DIS_SHIFT                           18
#define   AXI_B_SLVERR_DIS_MASK                  0x00020000
#define   AXI_B_SLVERR_DIS_SHIFT                         17
#define   AXI_R_SLVERR_DIS_MASK                  0x00010000
#define   AXI_R_SLVERR_DIS_SHIFT                         16
#define   EXCLUSIVE_MON_DIS_MASK                 0x00008000
#define   EXCLUSIVE_MON_DIS_SHIFT                        15
#define   AXI_INTF_MUX_STARV_VALUE_MASK          0x000000f0
#define   AXI_INTF_MUX_STARV_VALUE_SHIFT                  4
#define   READ_DATA_INTERLEAVING_DISABLE_MASK    0x00000007
#define   READ_DATA_INTERLEAVING_DISABLE_SHIFT            0

typedef union {
    u32 all;
    struct {
        u32 read_data_interleaving_disable:3;
        u32 rsvd_3:1;
        u32 axi_intf_mux_starv_value:4;
        u32 rsvd_8:7;
        u32 exclusive_mon_dis:1;
        u32 axi_r_slverr_dis:1;
        u32 axi_b_slverr_dis:1;
        u32 axi_decerr_dis:1;
        u32 rsvd_19:13;
    } b;
} axi_cntl_t;

#define SCHEDULER_CNTL                           0x000000c4
#define   SCHER_ORDER_ENB_MASK                   0x00000200
#define   SCHER_ORDER_ENB_SHIFT                           9
#define   AUTO_PRECHARGE_ENB_MASK                0x00000100
#define   AUTO_PRECHARGE_ENB_SHIFT                        8
#define   SCHER_STARV_TIMER_VALUE_INIT_MASK      0x000000ff
#define   SCHER_STARV_TIMER_VALUE_INIT_SHIFT              0

typedef union {
    u32 all;
    struct {
        u32 scher_starv_timer_value_init:8;
        u32 auto_precharge_enb:1;
        u32 scher_order_enb:1;
        u32 rsvd_10:22;
    } b;
} scheduler_cntl_t;

#define SCHER_CATEGORY_PRIORITY                  0x000000c8
#define   CAT4_PRIORITY_MASK                     0x01f00000
#define   CAT4_PRIORITY_SHIFT                            20
#define   CAT3_PRIORITY_MASK                     0x000f8000
#define   CAT3_PRIORITY_SHIFT                            15
#define   CAT2_PRIORITY_MASK                     0x00007c00
#define   CAT2_PRIORITY_SHIFT                            10
#define   CAT1_PRIORITY_MASK                     0x000003e0
#define   CAT1_PRIORITY_SHIFT                             5
#define   CAT0_PRIORITY_MASK                     0x0000001f
#define   CAT0_PRIORITY_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 cat0_priority:5;
        u32 cat1_priority:5;
        u32 cat2_priority:5;
        u32 cat3_priority:5;
        u32 cat4_priority:5;
        u32 rsvd_25:7;
    } b;
} scher_category_priority_t;

#define SCHER_CATEGORY_PRIORITY_DDR4             0x000000cc
#define   CAT8_PRIORITY_MASK                     0x000f8000
#define   CAT8_PRIORITY_SHIFT                            15
#define   CAT7_PRIORITY_MASK                     0x00007c00
#define   CAT7_PRIORITY_SHIFT                            10
#define   CAT6_PRIORITY_MASK                     0x000003e0
#define   CAT6_PRIORITY_SHIFT                             5
#define   CAT5_PRIORITY_MASK                     0x0000001f
#define   CAT5_PRIORITY_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 cat5_priority:5;
        u32 cat6_priority:5;
        u32 cat7_priority:5;
        u32 cat8_priority:5;
        u32 rsvd_20:12;
    } b;
} scher_category_priority_ddr4_t;

#define WRITE_BUFFER_CNTL                        0x000000d0
#define   FORCE_READ_SERVE_COUNT_MASK            0x000ffe00
#define   FORCE_READ_SERVE_COUNT_SHIFT                    9
#define   FORCE_READ_SERVE_ENB_MASK              0x00000100
#define   FORCE_READ_SERVE_ENB_SHIFT                      8
#define   DRAIN_LEVEL_MASK                       0x00000018
#define   DRAIN_LEVEL_SHIFT                               3
#define   DRAIN_TRIGGER_THRESHOLD_MASK           0x00000006
#define   DRAIN_TRIGGER_THRESHOLD_SHIFT                   1
#define   AUTO_DRAIN_ENB_MASK                    0x00000001
#define   AUTO_DRAIN_ENB_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 auto_drain_enb:1;
        u32 drain_trigger_threshold:2;
        u32 drain_level:2;
        u32 rsvd_5:3;
        u32 force_read_serve_enb:1;
        u32 force_read_serve_count:11;
        u32 rsvd_20:12;
    } b;
} write_buffer_cntl_t;

#define READ_STARVATION_CNTL                     0x000000d4
#define   RCP_STARVATION_CNTL_ENB_MASK           0x00010000
#define   RCP_STARVATION_CNTL_ENB_SHIFT                  16
#define   RCP_STARV_TIMER_VALUE_INIT_MASK        0x0000ffff
#define   RCP_STARV_TIMER_VALUE_INIT_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 rcp_starv_timer_value_init:16;
        u32 rcp_starvation_cntl_enb:1;
        u32 rsvd_17:15;
    } b;
} read_starvation_cntl_t;

#define AUX_CNTL                                 0x000000dc
#define   MASK_ALL_WRITES_MASK                   0x00000001
#define   MASK_ALL_WRITES_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 mask_all_writes:1;
        u32 rsvd_1:31;
    } b;
} aux_cntl_t;

#define ODT_CNTL_0                               0x000000e0
#define   DISABLE_ODT_IN_SR_MASK                 0x00000f00
#define   DISABLE_ODT_IN_SR_SHIFT                         8
#define   FORCE_ODT_MASK                         0x000000f0
#define   FORCE_ODT_SHIFT                                 4
#define   ODT_TERMINATION_ENB_MASK               0x0000000f
#define   ODT_TERMINATION_ENB_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 odt_termination_enb:4;
        u32 force_odt:4;
        u32 disable_odt_in_sr:4;
        u32 rsvd_12:20;
    } b;
} odt_cntl_0_t;

#define ODT_CNTL_1                               0x000000e4
#define   ODT_CS3_READ_ENB_MASK                  0xf0000000
#define   ODT_CS3_READ_ENB_SHIFT                         28
#define   ODT_CS3_WRITE_ENB_MASK                 0x0f000000
#define   ODT_CS3_WRITE_ENB_SHIFT                        24
#define   ODT_CS2_READ_ENB_MASK                  0x00f00000
#define   ODT_CS2_READ_ENB_SHIFT                         20
#define   ODT_CS2_WRITE_ENB_MASK                 0x000f0000
#define   ODT_CS2_WRITE_ENB_SHIFT                        16
#define   ODT_CS1_READ_ENB_MASK                  0x0000f000
#define   ODT_CS1_READ_ENB_SHIFT                         12
#define   ODT_CS1_WRITE_ENB_MASK                 0x00000f00
#define   ODT_CS1_WRITE_ENB_SHIFT                         8
#define   ODT_CS0_READ_ENB_MASK                  0x000000f0
#define   ODT_CS0_READ_ENB_SHIFT                          4
#define   ODT_CS0_WRITE_ENB_MASK                 0x0000000f
#define   ODT_CS0_WRITE_ENB_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 odt_cs0_write_enb:4;
        u32 odt_cs0_read_enb:4;
        u32 odt_cs1_write_enb:4;
        u32 odt_cs1_read_enb:4;
        u32 odt_cs2_write_enb:4;
        u32 odt_cs2_read_enb:4;
        u32 odt_cs3_write_enb:4;
        u32 odt_cs3_read_enb:4;
    } b;
} odt_cntl_1_t;

#define ODT_CNTL_2                               0x000000e8
#define   ODTLON_LATENCY_B_MASK                  0x001f0000
#define   ODTLON_LATENCY_B_SHIFT                         16
#define   ODTLON_LATENCY_A_MASK                  0x0000f000
#define   ODTLON_LATENCY_A_SHIFT                         12
#define   TODT_ON_OFF_MIN_MASK                   0x000000e0
#define   TODT_ON_OFF_MIN_SHIFT                           5
#define   ODT_EXTRA_DELAY_MASK                   0x0000001f
#define   ODT_EXTRA_DELAY_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 odt_extra_delay:5;
        u32 todt_on_off_min:3;
        u32 rsvd_8:4;
        u32 odtlon_latency_a:4;
        u32 odtlon_latency_b:5;
        u32 rsvd_21:11;
    } b;
} odt_cntl_2_t;

#define ODT_OVERRIDE_CNTL                        0x000000ec
#define   ODT_WR_START_DLY_VAL_MASK              0x01f00000
#define   ODT_WR_START_DLY_VAL_SHIFT                     20
#define   ODT_RD_START_DLY_VAL_MASK              0x0001f000
#define   ODT_RD_START_DLY_VAL_SHIFT                     12
#define   ODT_WR_EXTEND_VAL_MASK                 0x00000f00
#define   ODT_WR_EXTEND_VAL_SHIFT                         8
#define   ODT_RD_EXTEND_VAL_MASK                 0x000000f0
#define   ODT_RD_EXTEND_VAL_SHIFT                         4
#define   ODT_OVERRIDE_ENB_MASK                  0x00000001
#define   ODT_OVERRIDE_ENB_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 odt_override_enb:1;
        u32 rsvd_1:3;
        u32 odt_rd_extend_val:4;
        u32 odt_wr_extend_val:4;
        u32 odt_rd_start_dly_val:5;
        u32 rsvd_17:3;
        u32 odt_wr_start_dly_val:5;
        u32 rsvd_25:7;
    } b;
} odt_override_cntl_t;

#define RAS_CNTL                                 0x000000f0
#define   INLINE_ECC_P2_ENB_MASK                 0x00040000
#define   INLINE_ECC_P2_ENB_SHIFT                        18
#define   INLINE_ECC_P1_ENB_MASK                 0x00020000
#define   INLINE_ECC_P1_ENB_SHIFT                        17
#define   INLINE_ECC_P0_ENB_MASK                 0x00010000
#define   INLINE_ECC_P0_ENB_SHIFT                        16
#define   AXI_P2_WDATA_PARITY_ENB_MASK           0x00002000
#define   AXI_P2_WDATA_PARITY_ENB_SHIFT                  13
#define   AXI_P2_RDATA_PARITY_ENB_MASK           0x00001000
#define   AXI_P2_RDATA_PARITY_ENB_SHIFT                  12
#define   AXI_P1_WDATA_PARITY_ENB_MASK           0x00000800
#define   AXI_P1_WDATA_PARITY_ENB_SHIFT                  11
#define   AXI_P1_RDATA_PARITY_ENB_MASK           0x00000400
#define   AXI_P1_RDATA_PARITY_ENB_SHIFT                  10
#define   AXI_P0_WDATA_PARITY_ENB_MASK           0x00000200
#define   AXI_P0_WDATA_PARITY_ENB_SHIFT                   9
#define   AXI_P0_RDATA_PARITY_ENB_MASK           0x00000100
#define   AXI_P0_RDATA_PARITY_ENB_SHIFT                   8
#define   ECC_TRAINING_MODE_ENB_MASK             0x00000020
#define   ECC_TRAINING_MODE_ENB_SHIFT                     5
#define   ECC_ERR_IGNORE_MASK                    0x00000010
#define   ECC_ERR_IGNORE_SHIFT                            4
#define   ECC_DM_DIS_MASK                        0x00000004
#define   ECC_DM_DIS_SHIFT                                2
#define   SRAM_PARITY_ENB_MASK                   0x00000002
#define   SRAM_PARITY_ENB_SHIFT                           1
#define   ECC_ENB_MASK                           0x00000001
#define   ECC_ENB_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 ecc_enb:1;
        u32 sram_parity_enb:1;
        u32 ecc_dm_dis:1;
        u32 rsvd_3:1;
        u32 ecc_err_ignore:1;
        u32 ecc_training_mode_enb:1;
        u32 rsvd_6:2;
        u32 axi_p0_rdata_parity_enb:1;
        u32 axi_p0_wdata_parity_enb:1;
        u32 axi_p1_rdata_parity_enb:1;
        u32 axi_p1_wdata_parity_enb:1;
        u32 axi_p2_rdata_parity_enb:1;
        u32 axi_p2_wdata_parity_enb:1;
        u32 rsvd_14:2;
        u32 inline_ecc_p0_enb:1;
        u32 inline_ecc_p1_enb:1;
        u32 inline_ecc_p2_enb:1;
        u32 rsvd_19:13;
    } b;
} ras_cntl_t;

#define RAS_ERR_TEST                             0x000000f4
#define   FORCE_INLINE_ECC_P1_ERR_INJECT_ENB_MASK 0x00000400
#define   FORCE_INLINE_ECC_P1_ERR_INJECT_ENB_SHIFT         10
#define   FORCE_INLINE_ECC_P0_ERR_INJECT_ENB_MASK 0x00000200
#define   FORCE_INLINE_ECC_P0_ERR_INJECT_ENB_SHIFT          9
#define   FORCE_CRC_ERR_INJECT_ENB_MASK          0x00000100
#define   FORCE_CRC_ERR_INJECT_ENB_SHIFT                  8
#define   FORCE_CA_PARITY_ERR_INJECT_ENB_MASK    0x00000080
#define   FORCE_CA_PARITY_ERR_INJECT_ENB_SHIFT            7
#define   FORCE_AXI_P2_RDATA_PARITY_ERR_INJECT_ENB_MASK 0x00000020
#define   FORCE_AXI_P2_RDATA_PARITY_ERR_INJECT_ENB_SHIFT          5
#define   FORCE_AXI_P1_RDATA_PARITY_ERR_INJECT_ENB_MASK 0x00000010
#define   FORCE_AXI_P1_RDATA_PARITY_ERR_INJECT_ENB_SHIFT          4
#define   FORCE_AXI_P0_RDATA_PARITY_ERR_INJECT_ENB_MASK 0x00000008
#define   FORCE_AXI_P0_RDATA_PARITY_ERR_INJECT_ENB_SHIFT          3
#define   FORCE_SRAM_PARTIY_ERR_INJECT_ENB_MASK  0x00000004
#define   FORCE_SRAM_PARTIY_ERR_INJECT_ENB_SHIFT          2
#define   FORCE_ECC_ERR_INJECT_SEL_MASK          0x00000002
#define   FORCE_ECC_ERR_INJECT_SEL_SHIFT                  1
#define   FORCE_ECC_ERR_INJECT_ENB_MASK          0x00000001
#define   FORCE_ECC_ERR_INJECT_ENB_SHIFT                  0

typedef union {
    u32 all;
    struct {
        u32 force_ecc_err_inject_enb:1;
        u32 force_ecc_err_inject_sel:1;
        u32 force_sram_partiy_err_inject_enb:1;
        u32 force_axi_p0_rdata_parity_err_inject_enb:1;
        u32 force_axi_p1_rdata_parity_err_inject_enb:1;
        u32 force_axi_p2_rdata_parity_err_inject_enb:1;
        u32 rsvd_6:1;
        u32 force_ca_parity_err_inject_enb:1;
        u32 force_crc_err_inject_enb:1;
        u32 force_inline_ecc_p0_err_inject_enb:1;
        u32 force_inline_ecc_p1_err_inject_enb:1;
        u32 rsvd_11:21;
    } b;
} ras_err_test_t;

#define INLINE_ECC_REGION_LOW                    0x000000f8
#define   INLINE_ECC_ADDR_LOW_MASK               0xfff00000
#define   INLINE_ECC_ADDR_LOW_SHIFT                      20

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:20;
        u32 inline_ecc_addr_low:12;
    } b;
} inline_ecc_region_low_t;

#define INLINE_ECC_REGION_HIGH                   0x000000fc
#define   INLINE_ECC_ADDR_HIGH_MASK              0x000000ff
#define   INLINE_ECC_ADDR_HIGH_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 inline_ecc_addr_high:8;
        u32 rsvd_8:24;
    } b;
} inline_ecc_region_high_t;

#define MC_CMD                                   0x00000100
#define   WB_DRAIN_REQ_MASK                      0x00000004
#define   WB_DRAIN_REQ_SHIFT                              2
#define   INIT_CONT_REQ_MASK                     0x00000002
#define   INIT_CONT_REQ_SHIFT                             1
#define   DRAM_INIT_REQ_MASK                     0x00000001
#define   DRAM_INIT_REQ_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 dram_init_req:1;
        u32 init_cont_req:1;
        u32 wb_drain_req:1;
        u32 rsvd_3:29;
    } b;
} mc_cmd_t;

#define MC_DFC_CMD                               0x00000104
#define   HALT_RW_TRAFFIC_MASK                   0x00000004
#define   HALT_RW_TRAFFIC_SHIFT                           2
#define   HALT_SCDLR_MASK                        0x00000002
#define   HALT_SCDLR_SHIFT                                1
#define   DFC_MODE_ENB_MASK                      0x00000001
#define   DFC_MODE_ENB_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 dfc_mode_enb:1;
        u32 halt_scdlr:1;
        u32 halt_rw_traffic:1;
        u32 rsvd_3:29;
    } b;
} mc_dfc_cmd_t;

#define DRAM_MODE_REG_CMD                        0x00000108
#define   MODE_REG_CS_SEL_MASK                   0x0f000000
#define   MODE_REG_CS_SEL_SHIFT                          24
#define   MODE_REG_DEVICE_SEL_MASK               0x00f00000
#define   MODE_REG_DEVICE_SEL_SHIFT                      20
#define   MODE_REG_WRITE_REQ_MASK                0x00000200
#define   MODE_REG_WRITE_REQ_SHIFT                        9
#define   MODE_REG_READ_REQ_MASK                 0x00000100
#define   MODE_REG_READ_REQ_SHIFT                         8
#define   MODE_REG_ADDR_SEL_MASK                 0x000000ff
#define   MODE_REG_ADDR_SEL_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 mode_reg_addr_sel:8;
        u32 mode_reg_read_req:1;
        u32 mode_reg_write_req:1;
        u32 rsvd_10:10;
        u32 mode_reg_device_sel:4;
        u32 mode_reg_cs_sel:4;
        u32 rsvd_28:4;
    } b;
} dram_mode_reg_cmd_t;

#define MRR_MPR01_DATA                           0x0000010c
#define   MPR01_DATA_VALID_MASK                  0x80000000
#define   MPR01_DATA_VALID_SHIFT                         31
#define   MPR01_RDATA_MASK                       0x0000ffff
#define   MPR01_RDATA_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 mpr01_rdata:16;
        u32 rsvd_16:15;
        u32 mpr01_data_valid:1;
    } b;
} mrr_mpr01_data_t;

#define MPR23_DATA                               0x00000110
#define   MPR23_DATA_VALID_MASK                  0x80000000
#define   MPR23_DATA_VALID_SHIFT                         31
#define   MPR23_RDATA_MASK                       0x0000ffff
#define   MPR23_RDATA_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 mpr23_rdata:16;
        u32 rsvd_16:15;
        u32 mpr23_data_valid:1;
    } b;
} mpr23_data_t;

#define DRAM_CALIBRATION_CMD                     0x00000120
#define   DRAM_CALIBRATION_CS_SEL_MASK           0x0f000000
#define   DRAM_CALIBRATION_CS_SEL_SHIFT                  24
#define   DRAM_CALIBRATION_DEVICE_SEL_MASK       0x00f00000
#define   DRAM_CALIBRATION_DEVICE_SEL_SHIFT              20
#define   DIRECT_ACC_TEST_MODE_MASK              0x00020000
#define   DIRECT_ACC_TEST_MODE_SHIFT                     17
#define   CKE_PULL_DOWN_MODE_MASK                0x00010000
#define   CKE_PULL_DOWN_MODE_SHIFT                       16
#define   MPR_PG_READ_REQ_FOR_CAL_MASK           0x00008000
#define   MPR_PG_READ_REQ_FOR_CAL_SHIFT                  15
#define   MPR_PG_READ_REQ_MASK                   0x00004000
#define   MPR_PG_READ_REQ_SHIFT                          14
#define   MPR_PG_SEL_MASK                        0x00003000
#define   MPR_PG_SEL_SHIFT                               12
#define   MPR_BA_SEL_MASK                        0x00000c00
#define   MPR_BA_SEL_SHIFT                               10
#define   TRR_REQ_MASK                           0x00000200
#define   TRR_REQ_SHIFT                                   9
#define   DQS_OSC_STOP_REQ_MASK                  0x00000100
#define   DQS_OSC_STOP_REQ_SHIFT                          8
#define   DQS_OSC_START_REQ_MASK                 0x00000080
#define   DQS_OSC_START_REQ_SHIFT                         7
#define   RD_DQ_TRAIN_REQ_MASK                   0x00000040
#define   RD_DQ_TRAIN_REQ_SHIFT                           6
#define   WR_FIFO_TRAIN_REQ_MASK                 0x00000020
#define   WR_FIFO_TRAIN_REQ_SHIFT                         5
#define   RD_FIFO_TRAIN_REQ_MASK                 0x00000010
#define   RD_FIFO_TRAIN_REQ_SHIFT                         4
#define   ZQCR_REQ_MASK                          0x00000004
#define   ZQCR_REQ_SHIFT                                  2
#define   ZQCS_REQ_MASK                          0x00000002
#define   ZQCS_REQ_SHIFT                                  1
#define   ZQCL_REQ_MASK                          0x00000001
#define   ZQCL_REQ_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 zqcl_req:1;
        u32 zqcs_req:1;
        u32 zqcr_req:1;
        u32 rsvd_3:1;
        u32 rd_fifo_train_req:1;
        u32 wr_fifo_train_req:1;
        u32 rd_dq_train_req:1;
        u32 dqs_osc_start_req:1;
        u32 dqs_osc_stop_req:1;
        u32 trr_req:1;
        u32 mpr_ba_sel:2;
        u32 mpr_pg_sel:2;
        u32 mpr_pg_read_req:1;
        u32 mpr_pg_read_req_for_cal:1;
        u32 cke_pull_down_mode:1;
        u32 direct_acc_test_mode:1;
        u32 rsvd_18:2;
        u32 dram_calibration_device_sel:4;
        u32 dram_calibration_cs_sel:4;
        u32 rsvd_28:4;
    } b;
} dram_calibration_cmd_t;

#define TRR_MODE_REG                             0x00000124
#define   TRR_MODE_RA_MASK                       0x0003ffff
#define   TRR_MODE_RA_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 trr_mode_ra:18;
        u32 rsvd_18:14;
    } b;
} trr_mode_reg_t;

#define DIRECT_ACCESS_TEST_CNTL                  0x00000128
#define   DIRECT_ACCESS_CS_SEL_MASK              0x3c000000
#define   DIRECT_ACCESS_CS_SEL_SHIFT                     26
#define   DDR_CONTROL_PATTERN_MASK               0x03ffffff
#define   DDR_CONTROL_PATTERN_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 ddr_control_pattern:26;
        u32 direct_access_cs_sel:4;
        u32 rsvd_30:2;
    } b;
} direct_access_test_cntl_t;

#define TRAINING_STATUS                          0x0000012c
#define   RD_FIFO_TRAIN_DATA_VLD_MASK            0x00000001
#define   RD_FIFO_TRAIN_DATA_VLD_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 rd_fifo_train_data_vld:1;
        u32 rsvd_1:31;
    } b;
} training_status_t;

#define RW_TRAINING_PATTERN                      0x00000130
#define   RW_TRAINING_PATTERN_MASK               0xffffffff
#define   RW_TRAINING_PATTERN_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 rw_training_pattern:32;
    } b;
} rw_training_pattern_t;

#define DMI_TRAINING_PATTERN                     0x00000134
#define   RW_DMI_TRAINING_PATTERN_MASK           0xffffffff
#define   RW_DMI_TRAINING_PATTERN_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 rw_dmi_training_pattern:32;
    } b;
} dmi_training_pattern_t;

#define DRAM_PWR_CMD                             0x00000140
#define   DRAM_PWR_CMD_CS_SEL_MASK               0x0f000000
#define   DRAM_PWR_CMD_CS_SEL_SHIFT                      24
#define   PWDN_EXIT_REQ_MASK                     0x00000010
#define   PWDN_EXIT_REQ_SHIFT                             4
#define   MPD_REQ_MASK                           0x00000008
#define   MPD_REQ_SHIFT                                   3
#define   PPD_REQ_MASK                           0x00000004
#define   PPD_REQ_SHIFT                                   2
#define   APD_REQ_MASK                           0x00000002
#define   APD_REQ_SHIFT                                   1
#define   SR_REQ_MASK                            0x00000001
#define   SR_REQ_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 sr_req:1;
        u32 apd_req:1;
        u32 ppd_req:1;
        u32 mpd_req:1;
        u32 pwdn_exit_req:1;
        u32 rsvd_5:19;
        u32 dram_pwr_cmd_cs_sel:4;
        u32 rsvd_28:4;
    } b;
} dram_pwr_cmd_t;

#define AUTO_SR_TIMER                            0x00000148
#define   SR_IDLE_TIME_MASK                      0xffffffff
#define   SR_IDLE_TIME_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 sr_idle_time:32;
    } b;
} auto_sr_timer_t;

#define AUTO_PRECHARGE_TIMER                     0x0000014c
#define   RD_TIMER_MASK                          0xffff0000
#define   RD_TIMER_SHIFT                                 16
#define   WR_TIMER_MASK                          0x0000ffff
#define   WR_TIMER_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 wr_timer:16;
        u32 rd_timer:16;
    } b;
} auto_precharge_timer_t;

#define CLK_GATING_CNTL                          0x00000150
#define   DUMMY_150_MASK                         0x00000001
#define   DUMMY_150_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 dummy_150:1;
        u32 rsvd_1:31;
    } b;
} clk_gating_cntl_t;

#define DRAM_POWER_STATUS                        0x00000160
#define   MAX_PD_STATE_CS3_MASK                  0x00008000
#define   MAX_PD_STATE_CS3_SHIFT                         15
#define   PD_STATE_CS3_MASK                      0x00004000
#define   PD_STATE_CS3_SHIFT                             14
#define   SR_STATE_CS3_MASK                      0x00002000
#define   SR_STATE_CS3_SHIFT                             13
#define   INIT_DONE_CS3_MASK                     0x00001000
#define   INIT_DONE_CS3_SHIFT                            12
#define   MAX_PD_STATE_CS2_MASK                  0x00000800
#define   MAX_PD_STATE_CS2_SHIFT                         11
#define   PD_STATE_CS2_MASK                      0x00000400
#define   PD_STATE_CS2_SHIFT                             10
#define   SR_STATE_CS2_MASK                      0x00000200
#define   SR_STATE_CS2_SHIFT                              9
#define   INIT_DONE_CS2_MASK                     0x00000100
#define   INIT_DONE_CS2_SHIFT                             8
#define   MAX_PD_STATE_CS1_MASK                  0x00000080
#define   MAX_PD_STATE_CS1_SHIFT                          7
#define   PD_STATE_CS1_MASK                      0x00000040
#define   PD_STATE_CS1_SHIFT                              6
#define   SR_STATE_CS1_MASK                      0x00000020
#define   SR_STATE_CS1_SHIFT                              5
#define   INIT_DONE_CS1_MASK                     0x00000010
#define   INIT_DONE_CS1_SHIFT                             4
#define   MAX_PD_STATE_CS0_MASK                  0x00000008
#define   MAX_PD_STATE_CS0_SHIFT                          3
#define   PD_STATE_CS0_MASK                      0x00000004
#define   PD_STATE_CS0_SHIFT                              2
#define   SR_STATE_CS0_MASK                      0x00000002
#define   SR_STATE_CS0_SHIFT                              1
#define   INIT_DONE_CS0_MASK                     0x00000001
#define   INIT_DONE_CS0_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 init_done_cs0:1;
        u32 sr_state_cs0:1;
        u32 pd_state_cs0:1;
        u32 max_pd_state_cs0:1;
        u32 init_done_cs1:1;
        u32 sr_state_cs1:1;
        u32 pd_state_cs1:1;
        u32 max_pd_state_cs1:1;
        u32 init_done_cs2:1;
        u32 sr_state_cs2:1;
        u32 pd_state_cs2:1;
        u32 max_pd_state_cs2:1;
        u32 init_done_cs3:1;
        u32 sr_state_cs3:1;
        u32 pd_state_cs3:1;
        u32 max_pd_state_cs3:1;
        u32 rsvd_16:16;
    } b;
} dram_power_status_t;

#define DRAM_MODE_STATUS                         0x00000164
#define   CA_LATENCY_MODE_MASK                   0x00000010
#define   CA_LATENCY_MODE_SHIFT                           4
#define   CA_PARITY_MODE_MASK                    0x00000008
#define   CA_PARITY_MODE_SHIFT                            3
#define   WRITE_CRC_MODE_MASK                    0x00000004
#define   WRITE_CRC_MODE_SHIFT                            2
#define   WRITE_DBI_MODE_MASK                    0x00000002
#define   WRITE_DBI_MODE_SHIFT                            1
#define   READ_DBI_MODE_MASK                     0x00000001
#define   READ_DBI_MODE_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 read_dbi_mode:1;
        u32 write_dbi_mode:1;
        u32 write_crc_mode:1;
        u32 ca_parity_mode:1;
        u32 ca_latency_mode:1;
        u32 rsvd_5:27;
    } b;
} dram_mode_status_t;

#define MC_STATUS                                0x00000168
#define   SMTQ_PENDING_REQ_MASK                  0x20000000
#define   SMTQ_PENDING_REQ_SHIFT                         29
#define   SMTQ_SW_PENDING_REQ_MASK               0x10000000
#define   SMTQ_SW_PENDING_REQ_SHIFT                      28
#define   SMTQ_IDLE_MASK                         0x08000000
#define   SMTQ_IDLE_SHIFT                                27
#define   TIMER_UNIT_IDLE_MASK                   0x04000000
#define   TIMER_UNIT_IDLE_SHIFT                          26
#define   SCHEDULER_EMPTY_MASK                   0x02000000
#define   SCHEDULER_EMPTY_SHIFT                          25
#define   WRITE_DRAINING_MASK                    0x01000000
#define   WRITE_DRAINING_SHIFT                           24
#define   WDB_EMPTY_MASK                         0x00800000
#define   WDB_EMPTY_SHIFT                                23
#define   WCP_EMPTY_MASK                         0x00400000
#define   WCP_EMPTY_SHIFT                                22
#define   RDB_EMPTY_MASK                         0x00200000
#define   RDB_EMPTY_SHIFT                                21
#define   RCP_EMPTY_MASK                         0x00100000
#define   RCP_EMPTY_SHIFT                                20
#define   P2_WLF_BUFF_EMPTY_MASK                 0x00040000
#define   P2_WLF_BUFF_EMPTY_SHIFT                        18
#define   P1_WLF_BUFF_EMPTY_MASK                 0x00020000
#define   P1_WLF_BUFF_EMPTY_SHIFT                        17
#define   P0_WLF_BUFF_EMPTY_MASK                 0x00010000
#define   P0_WLF_BUFF_EMPTY_SHIFT                        16
#define   AXI_P1_BRESP_FIFO_EMPTY_MASK           0x00001000
#define   AXI_P1_BRESP_FIFO_EMPTY_SHIFT                  12
#define   AXI_P1_WDATA_FIFO_EMPTY_MASK           0x00000800
#define   AXI_P1_WDATA_FIFO_EMPTY_SHIFT                  11
#define   AXI_P1_WADDR_FIFO_EMPTY_MASK           0x00000400
#define   AXI_P1_WADDR_FIFO_EMPTY_SHIFT                  10
#define   AXI_P1_RDATA_FIFO_EMPTY_MASK           0x00000200
#define   AXI_P1_RDATA_FIFO_EMPTY_SHIFT                   9
#define   AXI_P1_RADDR_FIFO_EMPTY_MASK           0x00000100
#define   AXI_P1_RADDR_FIFO_EMPTY_SHIFT                   8
#define   AXI_P0_BRESP_FIFO_EMPTY_MASK           0x00000010
#define   AXI_P0_BRESP_FIFO_EMPTY_SHIFT                   4
#define   AXI_P0_WDATA_FIFO_EMPTY_MASK           0x00000008
#define   AXI_P0_WDATA_FIFO_EMPTY_SHIFT                   3
#define   AXI_P0_WADDR_FIFO_EMPTY_MASK           0x00000004
#define   AXI_P0_WADDR_FIFO_EMPTY_SHIFT                   2
#define   AXI_P0_RDATA_FIFO_EMPTY_MASK           0x00000002
#define   AXI_P0_RDATA_FIFO_EMPTY_SHIFT                   1
#define   AXI_P0_RADDR_FIFO_EMPTY_MASK           0x00000001
#define   AXI_P0_RADDR_FIFO_EMPTY_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 axi_p0_raddr_fifo_empty:1;
        u32 axi_p0_rdata_fifo_empty:1;
        u32 axi_p0_waddr_fifo_empty:1;
        u32 axi_p0_wdata_fifo_empty:1;
        u32 axi_p0_bresp_fifo_empty:1;
        u32 rsvd_5:3;
        u32 axi_p1_raddr_fifo_empty:1;
        u32 axi_p1_rdata_fifo_empty:1;
        u32 axi_p1_waddr_fifo_empty:1;
        u32 axi_p1_wdata_fifo_empty:1;
        u32 axi_p1_bresp_fifo_empty:1;
        u32 rsvd_13:3;
        u32 p0_wlf_buff_empty:1;
        u32 p1_wlf_buff_empty:1;
        u32 p2_wlf_buff_empty:1;
        u32 rsvd_19:1;
        u32 rcp_empty:1;
        u32 rdb_empty:1;
        u32 wcp_empty:1;
        u32 wdb_empty:1;
        u32 write_draining:1;
        u32 scheduler_empty:1;
        u32 timer_unit_idle:1;
        u32 smtq_idle:1;
        u32 smtq_sw_pending_req:1;
        u32 smtq_pending_req:1;
        u32 rsvd_30:2;
    } b;
} mc_status_t;

#define MC_STATUS_1                              0x0000016c
#define   DDR_INIT_STATE_MASK                    0x1f000000
#define   DDR_INIT_STATE_SHIFT                           24
#define   INLINE_ECC_CACHE_EMPTY_P2_MASK         0x00200000
#define   INLINE_ECC_CACHE_EMPTY_P2_SHIFT                21
#define   INLINE_ECC_QUEUE_EMPTY_P2_MASK         0x00100000
#define   INLINE_ECC_QUEUE_EMPTY_P2_SHIFT                20
#define   INLINE_ECC_CACHE_EMPTY_P1_MASK         0x00080000
#define   INLINE_ECC_CACHE_EMPTY_P1_SHIFT                19
#define   INLINE_ECC_QUEUE_EMPTY_P1_MASK         0x00040000
#define   INLINE_ECC_QUEUE_EMPTY_P1_SHIFT                18
#define   INLINE_ECC_CACHE_EMPTY_P0_MASK         0x00020000
#define   INLINE_ECC_CACHE_EMPTY_P0_SHIFT                17
#define   INLINE_ECC_QUEUE_EMPTY_P0_MASK         0x00010000
#define   INLINE_ECC_QUEUE_EMPTY_P0_SHIFT                16
#define   AXI_P2_BRESP_FIFO_EMPTY_MASK           0x00000010
#define   AXI_P2_BRESP_FIFO_EMPTY_SHIFT                   4
#define   AXI_P2_WDATA_FIFO_EMPTY_MASK           0x00000008
#define   AXI_P2_WDATA_FIFO_EMPTY_SHIFT                   3
#define   AXI_P2_WADDR_FIFO_EMPTY_MASK           0x00000004
#define   AXI_P2_WADDR_FIFO_EMPTY_SHIFT                   2
#define   AXI_P2_RDATA_FIFO_EMPTY_MASK           0x00000002
#define   AXI_P2_RDATA_FIFO_EMPTY_SHIFT                   1
#define   AXI_P2_RADDR_FIFO_EMPTY_MASK           0x00000001
#define   AXI_P2_RADDR_FIFO_EMPTY_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 axi_p2_raddr_fifo_empty:1;
        u32 axi_p2_rdata_fifo_empty:1;
        u32 axi_p2_waddr_fifo_empty:1;
        u32 axi_p2_wdata_fifo_empty:1;
        u32 axi_p2_bresp_fifo_empty:1;
        u32 rsvd_5:11;
        u32 inline_ecc_queue_empty_p0:1;
        u32 inline_ecc_cache_empty_p0:1;
        u32 inline_ecc_queue_empty_p1:1;
        u32 inline_ecc_cache_empty_p1:1;
        u32 inline_ecc_queue_empty_p2:1;
        u32 inline_ecc_cache_empty_p2:1;
        u32 rsvd_22:2;
        u32 ddr_init_state:5;
        u32 rsvd_29:3;
    } b;
} mc_status_1_t;

#define ECC_ERR_COUNT_STATUS                     0x00000170
#define   ECC_1BIT_ERR_COUNT_MASK                0xffffffff
#define   ECC_1BIT_ERR_COUNT_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ecc_1bit_err_count:32;
    } b;
} ecc_err_count_status_t;

#define ECC_ERR_COUNT_STATUS_1                   0x00000174
#define   ECC_2BIT_ERR_COUNT_CLR_MASK            0x20000000
#define   ECC_2BIT_ERR_COUNT_CLR_SHIFT                   29
#define   ECC_1BIT_ERR_COUNT_CLR_MASK            0x10000000
#define   ECC_1BIT_ERR_COUNT_CLR_SHIFT                   28
#define   ECC_2BIT_ERR_COUNT_MASK                0x0000ffff
#define   ECC_2BIT_ERR_COUNT_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 ecc_2bit_err_count:16;
        u32 rsvd_16:12;
        u32 ecc_1bit_err_count_clr:1;
        u32 ecc_2bit_err_count_clr:1;
        u32 rsvd_30:2;
    } b;
} ecc_err_count_status_1_t;

#define PERFORMANCE_COUNTER_SEL                  0x00000180
#define   PC_NUM_SEL_MASK                        0x00000007
#define   PC_NUM_SEL_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 pc_num_sel:3;
        u32 rsvd_3:29;
    } b;
} performance_counter_sel_t;

#define PERFORMANCE_COUNTER_CNTL0                0x00000184
#define   PC_COUNTER_CLR_MASK                    0x00000400
#define   PC_COUNTER_CLR_SHIFT                           10
#define   PC_STOP_COND_MASK                      0x00000200
#define   PC_STOP_COND_SHIFT                              9
#define   PC_START_COND_MASK                     0x00000100
#define   PC_START_COND_SHIFT                             8
#define   PC_EVENT_SEL_MASK                      0x000000fe
#define   PC_EVENT_SEL_SHIFT                              1
#define   PC_EVENT_ENB_MASK                      0x00000001
#define   PC_EVENT_ENB_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 pc_event_enb:1;
        u32 pc_event_sel:7;
        u32 pc_start_cond:1;
        u32 pc_stop_cond:1;
        u32 pc_counter_clr:1;
        u32 rsvd_11:21;
    } b;
} performance_counter_cntl0_t;

#define PERFORMANCE_COUNTER_VALUE                0x00000188
#define   PC_COUNTER_VALUE_MASK                  0xffffffff
#define   PC_COUNTER_VALUE_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pc_counter_value:32;
    } b;
} performance_counter_value_t;

#define PERFORMANCE_COUNTER_STATUS               0x0000018c
#define   PC_COUNTER_VALUE_UP_MASK               0xffff0000
#define   PC_COUNTER_VALUE_UP_SHIFT                      16
#define   PC_OVERFLOW_MASK                       0x00000001
#define   PC_OVERFLOW_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 pc_overflow:1;
        u32 rsvd_1:15;
        u32 pc_counter_value_up:16;
    } b;
} performance_counter_status_t;

#define ACTIVITY_MONITOR                         0x00000190
#define   DUMMY_190_MASK                         0x00000001
#define   DUMMY_190_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 dummy_190:1;
        u32 rsvd_1:31;
    } b;
} activity_monitor_t;

#define SRAM_TIMING_CNTL                         0x000001a0
#define   SRAM_IDLE_CYCLE_MASK                   0xff000000
#define   SRAM_IDLE_CYCLE_SHIFT                          24
#define   WB_WTC_MASK                            0x000000f0
#define   WB_WTC_SHIFT                                    4
#define   WB_RTC_MASK                            0x0000000f
#define   WB_RTC_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 wb_rtc:4;
        u32 wb_wtc:4;
        u32 rsvd_8:16;
        u32 sram_idle_cycle:8;
    } b;
} sram_timing_cntl_t;

#define DFI_PHY_CNTL0                            0x000001c4
#define   TPHY_RDCSLAT_MASK                      0xff000000
#define   TPHY_RDCSLAT_SHIFT                             24
#define   TPHY_RDCSGAP_MASK                      0x00f00000
#define   TPHY_RDCSGAP_SHIFT                             20
#define   TPHY_WRCSLAT_MASK                      0x000ff000
#define   TPHY_WRCSLAT_SHIFT                             12
#define   TPHY_WRCSGAP_MASK                      0x00000700
#define   TPHY_WRCSGAP_SHIFT                              8
#define   DFI_FREQUENCY_MASK                     0x000000f8
#define   DFI_FREQUENCY_SHIFT                             3
#define   DFI_DRAM_CLK_DISABLE_MASK              0x00000001
#define   DFI_DRAM_CLK_DISABLE_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 dfi_dram_clk_disable:1;
        u32 rsvd_1:2;
        u32 dfi_frequency:5;
        u32 tphy_wrcsgap:3;
        u32 rsvd_11:1;
        u32 tphy_wrcslat:8;
        u32 tphy_rdcsgap:4;
        u32 tphy_rdcslat:8;
    } b;
} dfi_phy_cntl0_t;

#define DFI_PHY_CNTL1                            0x000001c8
#define   TRDDATA_EN_MASK                        0xff000000
#define   TRDDATA_EN_SHIFT                               24
#define   TPHY_WRLAT_MASK                        0x0000ff00
#define   TPHY_WRLAT_SHIFT                                8
#define   TPHY_WRDATA_MASK                       0x000000ff
#define   TPHY_WRDATA_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 tphy_wrdata:8;
        u32 tphy_wrlat:8;
        u32 rsvd_16:8;
        u32 trddata_en:8;
    } b;
} dfi_phy_cntl1_t;

#define DFI_PHY_CNTL3                            0x000001d0
#define   DFI_DATA_BYTE_DISABLE_MASK             0x1ff00000
#define   DFI_DATA_BYTE_DISABLE_SHIFT                    20

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:20;
        u32 dfi_data_byte_disable:9;
        u32 rsvd_29:3;
    } b;
} dfi_phy_cntl3_t;

#define INTERRUPT_CNTL0                          0x00000200
#define   GLOBAL_INT_ENB_MASK                    0x80000000
#define   GLOBAL_INT_ENB_SHIFT                           31
#define   INLINE_ECC_P2_INT_ENB_MASK             0x00004000
#define   INLINE_ECC_P2_INT_ENB_SHIFT                    14
#define   INLINE_ECC_P1_INT_ENB_MASK             0x00002000
#define   INLINE_ECC_P1_INT_ENB_SHIFT                    13
#define   INLINE_ECC_P0_INT_ENB_MASK             0x00001000
#define   INLINE_ECC_P0_INT_ENB_SHIFT                    12
#define   CRC_CA_PARITY_ERR_INT_ENB_MASK         0x00000200
#define   CRC_CA_PARITY_ERR_INT_ENB_SHIFT                 9
#define   ECC_ERR_INT_ENB_MASK                   0x00000100
#define   ECC_ERR_INT_ENB_SHIFT                           8
#define   AXI_P2_WDATA_PARITY_ERR_INT_ENB_MASK   0x00000040
#define   AXI_P2_WDATA_PARITY_ERR_INT_ENB_SHIFT           6
#define   AXI_P1_WDATA_PARITY_ERR_INT_ENB_MASK   0x00000020
#define   AXI_P1_WDATA_PARITY_ERR_INT_ENB_SHIFT           5
#define   AXI_P0_WDATA_PARITY_ERR_INT_ENB_MASK   0x00000010
#define   AXI_P0_WDATA_PARITY_ERR_INT_ENB_SHIFT           4
#define   ERR_FIFO_INT_ENB_MASK                  0x00000008
#define   ERR_FIFO_INT_ENB_SHIFT                          3
#define   SRAM_PARITY_ERR_INT_ENB_MASK           0x00000004
#define   SRAM_PARITY_ERR_INT_ENB_SHIFT                   2
#define   ADDR_DECODE_ERR_INT_ENB_MASK           0x00000002
#define   ADDR_DECODE_ERR_INT_ENB_SHIFT                   1
#define   PC_OVERFLOW_INT_ENB_MASK               0x00000001
#define   PC_OVERFLOW_INT_ENB_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 pc_overflow_int_enb:1;
        u32 addr_decode_err_int_enb:1;
        u32 sram_parity_err_int_enb:1;
        u32 err_fifo_int_enb:1;
        u32 axi_p0_wdata_parity_err_int_enb:1;
        u32 axi_p1_wdata_parity_err_int_enb:1;
        u32 axi_p2_wdata_parity_err_int_enb:1;
        u32 rsvd_7:1;
        u32 ecc_err_int_enb:1;
        u32 crc_ca_parity_err_int_enb:1;
        u32 rsvd_10:2;
        u32 inline_ecc_p0_int_enb:1;
        u32 inline_ecc_p1_int_enb:1;
        u32 inline_ecc_p2_int_enb:1;
        u32 rsvd_15:16;
        u32 global_int_enb:1;
    } b;
} interrupt_cntl0_t;

#define INTERRUPT_CNTL1                          0x00000204
#define   INLINE_ECC_P2_INT_FORCE_MASK           0x00004000
#define   INLINE_ECC_P2_INT_FORCE_SHIFT                  14
#define   INLINE_ECC_P1_INT_FORCE_MASK           0x00002000
#define   INLINE_ECC_P1_INT_FORCE_SHIFT                  13
#define   INLINE_ECC_P0_INT_FORCE_MASK           0x00001000
#define   INLINE_ECC_P0_INT_FORCE_SHIFT                  12
#define   CRC_CA_PARITY_ERR_INT_FORCE_MASK       0x00000200
#define   CRC_CA_PARITY_ERR_INT_FORCE_SHIFT               9
#define   ECC_ERR_INT_FORCE_MASK                 0x00000100
#define   ECC_ERR_INT_FORCE_SHIFT                         8
#define   AXI_P2_WDATA_PARITY_ERR_INT_FORCE_MASK 0x00000040
#define   AXI_P2_WDATA_PARITY_ERR_INT_FORCE_SHIFT          6
#define   AXI_P1_WDATA_PARITY_ERR_INT_FORCE_MASK 0x00000020
#define   AXI_P1_WDATA_PARITY_ERR_INT_FORCE_SHIFT          5
#define   AXI_P0_WDATA_PARITY_ERR_INT_FORCE_MASK 0x00000010
#define   AXI_P0_WDATA_PARITY_ERR_INT_FORCE_SHIFT          4
#define   SRAM_PARITY_ERR_INT_FORCE_MASK         0x00000004
#define   SRAM_PARITY_ERR_INT_FORCE_SHIFT                 2
#define   ADDR_DECODE_ERR_INT_FORCE_MASK         0x00000002
#define   ADDR_DECODE_ERR_INT_FORCE_SHIFT                 1
#define   PC_OVERFLOW_INT_FORCE_MASK             0x00000001
#define   PC_OVERFLOW_INT_FORCE_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 pc_overflow_int_force:1;
        u32 addr_decode_err_int_force:1;
        u32 sram_parity_err_int_force:1;
        u32 rsvd_3:1;
        u32 axi_p0_wdata_parity_err_int_force:1;
        u32 axi_p1_wdata_parity_err_int_force:1;
        u32 axi_p2_wdata_parity_err_int_force:1;
        u32 rsvd_7:1;
        u32 ecc_err_int_force:1;
        u32 crc_ca_parity_err_int_force:1;
        u32 rsvd_10:2;
        u32 inline_ecc_p0_int_force:1;
        u32 inline_ecc_p1_int_force:1;
        u32 inline_ecc_p2_int_force:1;
        u32 rsvd_15:17;
    } b;
} interrupt_cntl1_t;

#define INTERRUPT_STATUS                         0x00000208
#define   INLINE_ECC_P2_ERR_INT_MASK             0x00004000
#define   INLINE_ECC_P2_ERR_INT_SHIFT                    14
#define   INLINE_ECC_P1_ERR_INT_MASK             0x00002000
#define   INLINE_ECC_P1_ERR_INT_SHIFT                    13
#define   INLINE_ECC_P0_ERR_INT_MASK             0x00001000
#define   INLINE_ECC_P0_ERR_INT_SHIFT                    12
#define   CRC_CA_PARITY_ERR_INT_MASK             0x00000200
#define   CRC_CA_PARITY_ERR_INT_SHIFT                     9
#define   ECC_ERR_INT_MASK                       0x00000100
#define   ECC_ERR_INT_SHIFT                               8
#define   AXI_P2_WDATA_PARITY_ERR_INT_MASK       0x00000040
#define   AXI_P2_WDATA_PARITY_ERR_INT_SHIFT               6
#define   AXI_P1_WDATA_PARITY_ERR_INT_MASK       0x00000020
#define   AXI_P1_WDATA_PARITY_ERR_INT_SHIFT               5
#define   AXI_P0_WDATA_PARITY_ERR_INT_MASK       0x00000010
#define   AXI_P0_WDATA_PARITY_ERR_INT_SHIFT               4
#define   ERR_FIFO_INT_MASK                      0x00000008
#define   ERR_FIFO_INT_SHIFT                              3
#define   SRAM_PARITY_ERR_INT_MASK               0x00000004
#define   SRAM_PARITY_ERR_INT_SHIFT                       2
#define   ADDR_DECODE_ERR_INT_MASK               0x00000002
#define   ADDR_DECODE_ERR_INT_SHIFT                       1
#define   PC_OVERFLOW_INT_MASK                   0x00000001
#define   PC_OVERFLOW_INT_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 pc_overflow_int:1;
        u32 addr_decode_err_int:1;
        u32 sram_parity_err_int:1;
        u32 err_fifo_int:1;
        u32 axi_p0_wdata_parity_err_int:1;
        u32 axi_p1_wdata_parity_err_int:1;
        u32 axi_p2_wdata_parity_err_int:1;
        u32 rsvd_7:1;
        u32 ecc_err_int:1;
        u32 crc_ca_parity_err_int:1;
        u32 rsvd_10:2;
        u32 inline_ecc_p0_err_int:1;
        u32 inline_ecc_p1_err_int:1;
        u32 inline_ecc_p2_err_int:1;
        u32 rsvd_15:17;
    } b;
} interrupt_status_t;

#define ECC_ERR_INT_THRESHOLD                    0x0000020c
#define   ECC_1BIT_ERR_THRESHOLD_MASK            0xffffffff
#define   ECC_1BIT_ERR_THRESHOLD_SHIFT                    0

typedef union {
    u32 all;
    struct {
        u32 ecc_1bit_err_threshold:32;
    } b;
} ecc_err_int_threshold_t;

#define ECC_ERR_INT_INFO0                        0x00000210
#define   ECC_ERR_RA_MASK                        0xffffc000
#define   ECC_ERR_RA_SHIFT                               14
#define   ECC_ERR_CA_MASK                        0x00003ffc
#define   ECC_ERR_CA_SHIFT                                2
#define   ECC_ERR_TYPE_MASK                      0x00000001
#define   ECC_ERR_TYPE_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 ecc_err_type:1;
        u32 rsvd_1:1;
        u32 ecc_err_ca:12;
        u32 ecc_err_ra:18;
    } b;
} ecc_err_int_info0_t;

#define ECC_ERR_INT_INFO1                        0x00000214
#define   ECC_ERR_CS_MASK                        0x0000f000
#define   ECC_ERR_CS_SHIFT                               12
#define   ECC_ERR_SA_MASK                        0x000001c0
#define   ECC_ERR_SA_SHIFT                                6
#define   ECC_ERR_BG_MASK                        0x00000030
#define   ECC_ERR_BG_SHIFT                                4
#define   ECC_ERR_BA_MASK                        0x00000007
#define   ECC_ERR_BA_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 ecc_err_ba:3;
        u32 rsvd_3:1;
        u32 ecc_err_bg:2;
        u32 ecc_err_sa:3;
        u32 rsvd_9:3;
        u32 ecc_err_cs:4;
        u32 rsvd_16:16;
    } b;
} ecc_err_int_info1_t;

#define ADDR_DECODE_ERR_INT_INFO0                0x00000218
#define   ADC_ERR_ID_MASK                        0xfffffff0
#define   ADC_ERR_ID_SHIFT                                4
#define   ADC_ERR_RW_MASK                        0x00000008
#define   ADC_ERR_RW_SHIFT                                3
#define   ADC_ERR_MSTR_PORT_MASK                 0x00000007
#define   ADC_ERR_MSTR_PORT_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 adc_err_mstr_port:3;
        u32 adc_err_rw:1;
        u32 adc_err_id:28;
    } b;
} addr_decode_err_int_info0_t;

#define ADDR_DECODE_ERR_INT_INFO1                0x0000021c
#define   ADC_ERR_ADDR_LOW_MASK                  0xffffffff
#define   ADC_ERR_ADDR_LOW_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 adc_err_addr_low:32;
    } b;
} addr_decode_err_int_info1_t;

#define ADDR_DECODE_ERR_INT_INFO2                0x00000220
#define   ADC_ERR_ADDR_HIGH_MASK                 0xffffffff
#define   ADC_ERR_ADDR_HIGH_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 adc_err_addr_high:32;
    } b;
} addr_decode_err_int_info2_t;

#define ERR_FIFO_CNTL0                           0x00000224
#define   ERR_FIFO_POP_MASK                      0x80000000
#define   ERR_FIFO_POP_SHIFT                             31
#define   ERR_FIFO_RESET_MASK                    0x40000000
#define   ERR_FIFO_RESET_SHIFT                           30
#define   ERR_FIFO_WPTR_MASK                     0x0f000000
#define   ERR_FIFO_WPTR_SHIFT                            24
#define   ERR_FIFO_RPTR_MASK                     0x000f0000
#define   ERR_FIFO_RPTR_SHIFT                            16
#define   ERR_FIFO_ECC_1BIT_EN_MASK              0x00000100
#define   ERR_FIFO_ECC_1BIT_EN_SHIFT                      8
#define   ERR_FIFO_ERR_COUNT_MASK                0x0000001f
#define   ERR_FIFO_ERR_COUNT_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 err_fifo_err_count:5;
        u32 rsvd_5:3;
        u32 err_fifo_ecc_1bit_en:1;
        u32 rsvd_9:7;
        u32 err_fifo_rptr:4;
        u32 rsvd_20:4;
        u32 err_fifo_wptr:4;
        u32 rsvd_28:2;
        u32 err_fifo_reset:1;
        u32 err_fifo_pop:1;
    } b;
} err_fifo_cntl0_t;

#define ERR_FIFO_STAT0                           0x00000228
#define   ERR_FIFO_SIZE_MASK                     0x0f000000
#define   ERR_FIFO_SIZE_SHIFT                            24
#define   ERR_FIFO_LEN_MASK                      0x00ff0000
#define   ERR_FIFO_LEN_SHIFT                             16
#define   ERR_FIFO_RMW_MASK                      0x00000200
#define   ERR_FIFO_RMW_SHIFT                              9
#define   ERR_FIFO_RW_MASK                       0x00000100
#define   ERR_FIFO_RW_SHIFT                               8
#define   ERR_FIFO_PORT_MASK                     0x00000030
#define   ERR_FIFO_PORT_SHIFT                             4
#define   ERR_FIFO_TYPE_MASK                     0x0000000f
#define   ERR_FIFO_TYPE_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 err_fifo_type:4;
        u32 err_fifo_port:2;
        u32 rsvd_6:2;
        u32 err_fifo_rw:1;
        u32 err_fifo_rmw:1;
        u32 rsvd_10:6;
        u32 err_fifo_len:8;
        u32 err_fifo_size:4;
        u32 rsvd_28:4;
    } b;
} err_fifo_stat0_t;

#define ERR_FIFO_STAT1                           0x0000022c
#define   ERR_FIFO_ID_MASK                       0x0fffffff
#define   ERR_FIFO_ID_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 err_fifo_id:28;
        u32 rsvd_28:4;
    } b;
} err_fifo_stat1_t;

#define ERR_FIFO_STAT2                           0x00000230
#define   ERR_FIFO_ADRL_MASK                     0xffffffff
#define   ERR_FIFO_ADRL_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 err_fifo_adrl:32;
    } b;
} err_fifo_stat2_t;

#define ERR_FIFO_STAT3                           0x00000234
#define   ERR_FIFO_ADRH_MASK                     0xffffffff
#define   ERR_FIFO_ADRH_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 err_fifo_adrh:32;
    } b;
} err_fifo_stat3_t;

#define AXI_P0_WDATA_PARITY_ERR_INFO0            0x00000240
#define   AXI_P0_WDATA_PARITY_ERR_ID_MASK        0x000003ff
#define   AXI_P0_WDATA_PARITY_ERR_ID_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 axi_p0_wdata_parity_err_id:10;
        u32 rsvd_10:22;
    } b;
} axi_p0_wdata_parity_err_info0_t;

#define AXI_P0_WDATA_PARITY_ERR_INFO1            0x00000244
#define   AXI_P0_WDATA_PARITY_ERR_ADDR_LOW_MASK  0xffffffff
#define   AXI_P0_WDATA_PARITY_ERR_ADDR_LOW_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 axi_p0_wdata_parity_err_addr_low:32;
    } b;
} axi_p0_wdata_parity_err_info1_t;

#define AXI_P0_WDATA_PARITY_ERR_INFO2            0x00000248
#define   AXI_P0_WDATA_PARITY_ERR_ADDR_HIGH_MASK 0xffffffff
#define   AXI_P0_WDATA_PARITY_ERR_ADDR_HIGH_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 axi_p0_wdata_parity_err_addr_high:32;
    } b;
} axi_p0_wdata_parity_err_info2_t;

#define AXI_P1_WDATA_PARITY_ERR_INFO0            0x00000250
#define   AXI_P1_WDATA_PARITY_ERR_ID_MASK        0x000003ff
#define   AXI_P1_WDATA_PARITY_ERR_ID_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 axi_p1_wdata_parity_err_id:10;
        u32 rsvd_10:22;
    } b;
} axi_p1_wdata_parity_err_info0_t;

#define AXI_P1_WDATA_PARITY_ERR_INFO1            0x00000254
#define   AXI_P1_WDATA_PARITY_ERR_ADDR_LOW_MASK  0xffffffff
#define   AXI_P1_WDATA_PARITY_ERR_ADDR_LOW_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 axi_p1_wdata_parity_err_addr_low:32;
    } b;
} axi_p1_wdata_parity_err_info1_t;

#define AXI_P1_WDATA_PARITY_ERR_INFO2            0x00000258
#define   AXI_P1_WDATA_PARITY_ERR_ADDR_HIGH_MASK 0xffffffff
#define   AXI_P1_WDATA_PARITY_ERR_ADDR_HIGH_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 axi_p1_wdata_parity_err_addr_high:32;
    } b;
} axi_p1_wdata_parity_err_info2_t;

#define AXI_P2_WDATA_PARITY_ERR_INFO0            0x00000260
#define   AXI_P2_WDATA_PARITY_ERR_ID_MASK        0x000003ff
#define   AXI_P2_WDATA_PARITY_ERR_ID_SHIFT                0

typedef union {
    u32 all;
    struct {
        u32 axi_p2_wdata_parity_err_id:10;
        u32 rsvd_10:22;
    } b;
} axi_p2_wdata_parity_err_info0_t;

#define AXI_P2_WDATA_PARITY_ERR_INFO1            0x00000264
#define   AXI_P2_WDATA_PARITY_ERR_ADDR_LOW_MASK  0xffffffff
#define   AXI_P2_WDATA_PARITY_ERR_ADDR_LOW_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 axi_p2_wdata_parity_err_addr_low:32;
    } b;
} axi_p2_wdata_parity_err_info1_t;

#define AXI_P2_WDATA_PARITY_ERR_INFO2            0x00000268
#define   AXI_P2_WDATA_PARITY_ERR_ADDR_HIGH_MASK 0xffffffff
#define   AXI_P2_WDATA_PARITY_ERR_ADDR_HIGH_SHIFT          0

typedef union {
    u32 all;
    struct {
        u32 axi_p2_wdata_parity_err_addr_high:32;
    } b;
} axi_p2_wdata_parity_err_info2_t;

#define DATA_ENCRYPT_KEY0                        0x00000280
#define   ENCRYPT_KEY0_MASK                      0xffffffff
#define   ENCRYPT_KEY0_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 encrypt_key0:32;
    } b;
} data_encrypt_key0_t;

#define DATA_ENCRYPT_KEY1                        0x00000284
#define   ENCRYPT_KEY1_MASK                      0xffffffff
#define   ENCRYPT_KEY1_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 encrypt_key1:32;
    } b;
} data_encrypt_key1_t;

#define DATA_ENCRYPT_KEY2                        0x00000288
#define   ENCRYPT_KEY2_MASK                      0xffffffff
#define   ENCRYPT_KEY2_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 encrypt_key2:32;
    } b;
} data_encrypt_key2_t;

#define DATA_ENCRYPT_KEY3                        0x0000028c
#define   ENCRYPT_KEY3_MASK                      0xffffffff
#define   ENCRYPT_KEY3_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 encrypt_key3:32;
    } b;
} data_encrypt_key3_t;

#define DATA_ENCRYPT_KEY4                        0x00000290
#define   ENCRYPT_KEY4_MASK                      0xffffffff
#define   ENCRYPT_KEY4_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 encrypt_key4:32;
    } b;
} data_encrypt_key4_t;

#define DATA_ENCRYPT_KEY5                        0x00000294
#define   ENCRYPT_KEY5_MASK                      0xffffffff
#define   ENCRYPT_KEY5_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 encrypt_key5:32;
    } b;
} data_encrypt_key5_t;

#define DATA_ENCRYPT_KEY6                        0x00000298
#define   ENCRYPT_KEY6_MASK                      0xffffffff
#define   ENCRYPT_KEY6_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 encrypt_key6:32;
    } b;
} data_encrypt_key6_t;

#define DATA_ENCRYPT_KEY7                        0x0000029c
#define   ENCRYPT_KEY7_MASK                      0xffffffff
#define   ENCRYPT_KEY7_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 encrypt_key7:32;
    } b;
} data_encrypt_key7_t;

#define INLINE_ECC_ERR_INT_PORT_SEL              0x00000300
#define   PORT_SEL_MASK                          0x00000001
#define   PORT_SEL_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 port_sel:1;
        u32 rsvd_1:31;
    } b;
} inline_ecc_err_int_port_sel_t;

#define INLINE_ECC_ERR_INT_INFO0                 0x00000304
#define   INLINE_ECC_ERR_ADDR_MASK               0xffffffff
#define   INLINE_ECC_ERR_ADDR_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 inline_ecc_err_addr:32;
    } b;
} inline_ecc_err_int_info0_t;

#define INLINE_ECC_ERR_INT_INFO2                 0x0000030c
#define   INLINE_ECC_ERR_TYPE_MASK               0x00000001
#define   INLINE_ECC_ERR_TYPE_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 inline_ecc_err_type:1;
        u32 rsvd_1:31;
    } b;
} inline_ecc_err_int_info2_t;

#define INLINE_ECC_CTRL0                         0x00000310
#define   INLINE_ECC_BURST_SIZE_MASK             0x00700000
#define   INLINE_ECC_BURST_SIZE_SHIFT                    20
#define   INLINE_ECC_INVAL_LEVEL_MASK            0x00030000
#define   INLINE_ECC_INVAL_LEVEL_SHIFT                   16
#define   INLINE_ECC_INVAL_TIMER_MASK            0x0000f000
#define   INLINE_ECC_INVAL_TIMER_SHIFT                   12
#define   INLINE_ECC_FLUSH_TIMER_MASK            0x00000f00
#define   INLINE_ECC_FLUSH_TIMER_SHIFT                    8
#define   INLINE_ECC_BRESP_MODE_MASK             0x00000080
#define   INLINE_ECC_BRESP_MODE_SHIFT                     7
#define   INLINE_ECC_BOUND_MASK                  0x00000070
#define   INLINE_ECC_BOUND_SHIFT                          4
#define   INLINE_ECC_AWUSER_EN_MASK              0x00000007
#define   INLINE_ECC_AWUSER_EN_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 inline_ecc_awuser_en:3;
        u32 rsvd_3:1;
        u32 inline_ecc_bound:3;
        u32 inline_ecc_bresp_mode:1;
        u32 inline_ecc_flush_timer:4;
        u32 inline_ecc_inval_timer:4;
        u32 inline_ecc_inval_level:2;
        u32 rsvd_18:2;
        u32 inline_ecc_burst_size:3;
        u32 rsvd_23:9;
    } b;
} inline_ecc_ctrl0_t;

#define INLINE_ECC_CTRL2                         0x00000318
#define   INLINE_ECC_NPROT_BASE_ADDR_LOW_MASK    0xfff00000
#define   INLINE_ECC_NPROT_BASE_ADDR_LOW_SHIFT           20
#define   INLINE_ECC_NPROT_AREA_MASK             0x000001f0
#define   INLINE_ECC_NPROT_AREA_SHIFT                     4
#define   INLINE_ECC_NPROT_EN_MASK               0x00000001
#define   INLINE_ECC_NPROT_EN_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 inline_ecc_nprot_en:1;
        u32 rsvd_1:3;
        u32 inline_ecc_nprot_area:5;
        u32 rsvd_9:11;
        u32 inline_ecc_nprot_base_addr_low:12;
    } b;
} inline_ecc_ctrl2_t;

#define INLINE_ECC_CTRL3                         0x0000031c
#define   INLINE_ECC_NPROT_BASE_ADDR_HIGH_MASK   0x000000ff
#define   INLINE_ECC_NPROT_BASE_ADDR_HIGH_SHIFT           0

typedef union {
    u32 all;
    struct {
        u32 inline_ecc_nprot_base_addr_high:8;
        u32 rsvd_8:24;
    } b;
} inline_ecc_ctrl3_t;

#define REVID                                    0x000003f8
#define   REVID_ARCH_MASK                        0xff000000
#define   REVID_ARCH_SHIFT                               24
#define   REVID_MAJOR_MASK                       0x00fff000
#define   REVID_MAJOR_SHIFT                              12
#define   REVID_MINOR_MASK                       0x00000fff
#define   REVID_MINOR_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 revid_minor:12;
        u32 revid_major:12;
        u32 revid_arch:8;
    } b;
} revid_t;

#define REVID_MISC                               0x000003fc
#define   REVID_MISC_MASK                        0xffffffff
#define   REVID_MISC_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 revid_misc:32;
    } b;
} revid_misc_t;

#define AXI_REQ_CNTL                             0x00000400
#define   AXI_P2_AW_REQ_CHECK_VAL_MASK           0x0f000000
#define   AXI_P2_AW_REQ_CHECK_VAL_SHIFT                  24
#define   AXI_P1_AW_REQ_CHECK_VAL_MASK           0x00f00000
#define   AXI_P1_AW_REQ_CHECK_VAL_SHIFT                  20
#define   AXI_P0_AW_REQ_CHECK_VAL_MASK           0x000f0000
#define   AXI_P0_AW_REQ_CHECK_VAL_SHIFT                  16
#define   AXI_AW_REQ_CHECK_EN_MASK               0x00000007
#define   AXI_AW_REQ_CHECK_EN_SHIFT                       0
typedef union {
    u32 all;
    struct {
        u32 axi_aw_req_check_en:3;
        u32 rsvd_3:13;
        u32 axi_p0_aw_req_check_val:4;
        u32 axi_p1_aw_req_check_val:4;
        u32 axi_p2_aw_req_check_val:4;
        u32 rsvd_28:4;
    } b;
} axi_req_cntl_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ device_mode_t device_mode;
    /* 0x0004 */ device_config0_t device_config0;
    /* 0x0008 */ device_config1_t device_config1;
    /* 0x000c */ device_config2_t device_config2;
    /* 0x0010 */ device_config3_t device_config3;
    /* 0x0014 */ device_config_training_t device_config_training;
    /* 0x0018 */ device_config_rd_dq_calibration_t device_config_rd_dq_calibration;
    /* 0x001c */ power_control_t power_control;
    /* 0x0020 */ cs_config_sel_t cs_config_sel;
    /* 0x0024 */ cs_config_addr_map0_t cs_config_addr_map0;
    /* 0x0028 */ cs_config_addr_map1_t cs_config_addr_map1;
    /* 0x002c */ cs_config_device0_t cs_config_device0;
    /* 0x0030 */ cs_config_device1_t cs_config_device1;
    /* 0x0034 */ cs_config_odt_t cs_config_odt;
    /* 0x0038 */ tz_config_sel_t tz_config_sel;
    /* 0x003c */ tz_region_x_low_t tz_region_x_low;
    /* 0x0040 */ tz_region_x_high_t tz_region_x_high;
    /* 0x0044 */ u32 rsvd_44 [7];
    /* 0x0060 */ dram_timing_init0_t dram_timing_init0;
    /* 0x0064 */ dram_timing_init1_t dram_timing_init1;
    /* 0x0068 */ dram_timing_init2_t dram_timing_init2;
    /* 0x006c */ dram_timing_init3_t dram_timing_init3;
    /* 0x0070 */ dram_timing_init4_t dram_timing_init4;
    /* 0x0074 */ dram_timing_core0_t dram_timing_core0;
    /* 0x0078 */ dram_timing_core1_t dram_timing_core1;
    /* 0x007c */ dram_timing_core2_t dram_timing_core2;
    /* 0x0080 */ dram_timing_core3_t dram_timing_core3;
    /* 0x0084 */ dram_timing_ref0_t dram_timing_ref0;
    /* 0x0088 */ dram_timing_sr0_t dram_timing_sr0;
    /* 0x008c */ dram_timing_sr1_t dram_timing_sr1;
    /* 0x0090 */ dram_timing_pd_t dram_timing_pd;
    /* 0x0094 */ dram_timing_offspec_t dram_timing_offspec;
    /* 0x0098 */ dram_timing_training0_t dram_timing_training0;
    /* 0x009c */ mram_timing_core0_t mram_timing_core0;
    /* 0x00a0 */ mram_timing_core1_t mram_timing_core1;
    /* 0x00a4 */ mram_timing_core2_t mram_timing_core2;
    /* 0x00a8 */ timing_misc_t timing_misc;
    /* 0x00ac */ dram_timing_3ds_t dram_timing_3ds;
    /* 0x00b0 */ u32 rsvd_b0 [4];
    /* 0x00c0 */ axi_cntl_t axi_cntl;
    /* 0x00c4 */ scheduler_cntl_t scheduler_cntl;
    /* 0x00c8 */ scher_category_priority_t scher_category_priority;
    /* 0x00cc */ scher_category_priority_ddr4_t scher_category_priority_ddr4;
    /* 0x00d0 */ write_buffer_cntl_t write_buffer_cntl;
    /* 0x00d4 */ read_starvation_cntl_t read_starvation_cntl;
    /* 0x00d8 */ u32 rsvd_d8;
    /* 0x00dc */ aux_cntl_t aux_cntl;
    /* 0x00e0 */ odt_cntl_0_t odt_cntl_0;
    /* 0x00e4 */ odt_cntl_1_t odt_cntl_1;
    /* 0x00e8 */ odt_cntl_2_t odt_cntl_2;
    /* 0x00ec */ odt_override_cntl_t odt_override_cntl;
    /* 0x00f0 */ ras_cntl_t ras_cntl;
    /* 0x00f4 */ ras_err_test_t ras_err_test;
    /* 0x00f8 */ inline_ecc_region_low_t inline_ecc_region_low;
    /* 0x00fc */ inline_ecc_region_high_t inline_ecc_region_high;
    /* 0x0100 */ mc_cmd_t mc_cmd;
    /* 0x0104 */ mc_dfc_cmd_t mc_dfc_cmd;
    /* 0x0108 */ dram_mode_reg_cmd_t dram_mode_reg_cmd;
    /* 0x010c */ mrr_mpr01_data_t mrr_mpr01_data;
    /* 0x0110 */ mpr23_data_t mpr23_data;
    /* 0x0114 */ u32 rsvd_114 [3];
    /* 0x0120 */ dram_calibration_cmd_t dram_calibration_cmd;
    /* 0x0124 */ trr_mode_reg_t trr_mode_reg;
    /* 0x0128 */ direct_access_test_cntl_t direct_access_test_cntl;
    /* 0x012c */ training_status_t training_status;
    /* 0x0130 */ rw_training_pattern_t rw_training_pattern;
    /* 0x0134 */ dmi_training_pattern_t dmi_training_pattern;
    /* 0x0138 */ u32 rsvd_138 [2];
    /* 0x0140 */ dram_pwr_cmd_t dram_pwr_cmd;
    /* 0x0144 */ u32 rsvd_144;
    /* 0x0148 */ auto_sr_timer_t auto_sr_timer;
    /* 0x014c */ auto_precharge_timer_t auto_precharge_timer;
    /* 0x0150 */ clk_gating_cntl_t clk_gating_cntl;
    /* 0x0154 */ u32 rsvd_154 [3];
    /* 0x0160 */ dram_power_status_t dram_power_status;
    /* 0x0164 */ dram_mode_status_t dram_mode_status;
    /* 0x0168 */ mc_status_t mc_status;
    /* 0x016c */ mc_status_1_t mc_status_1;
    /* 0x0170 */ ecc_err_count_status_t ecc_err_count_status;
    /* 0x0174 */ ecc_err_count_status_1_t ecc_err_count_status_1;
    /* 0x0178 */ u32 rsvd_178 [2];
    /* 0x0180 */ performance_counter_sel_t performance_counter_sel;
    /* 0x0184 */ performance_counter_cntl0_t performance_counter_cntl0;
    /* 0x0188 */ performance_counter_value_t performance_counter_value;
    /* 0x018c */ performance_counter_status_t performance_counter_status;
    /* 0x0190 */ activity_monitor_t activity_monitor;
    /* 0x0194 */ u32 rsvd_194 [3];
    /* 0x01a0 */ sram_timing_cntl_t sram_timing_cntl;
    /* 0x01a4 */ u32 rsvd_1a4 [8];
    /* 0x01c4 */ dfi_phy_cntl0_t dfi_phy_cntl0;
    /* 0x01c8 */ dfi_phy_cntl1_t dfi_phy_cntl1;
    /* 0x01cc */ u32 rsvd_1cc;
    /* 0x01d0 */ dfi_phy_cntl3_t dfi_phy_cntl3;
    /* 0x01d4 */ u32 rsvd_1d4 [11];
    /* 0x0200 */ interrupt_cntl0_t interrupt_cntl0;
    /* 0x0204 */ interrupt_cntl1_t interrupt_cntl1;
    /* 0x0208 */ interrupt_status_t interrupt_status;
    /* 0x020c */ ecc_err_int_threshold_t ecc_err_int_threshold;
    /* 0x0210 */ ecc_err_int_info0_t ecc_err_int_info0;
    /* 0x0214 */ ecc_err_int_info1_t ecc_err_int_info1;
    /* 0x0218 */ addr_decode_err_int_info0_t addr_decode_err_int_info0;
    /* 0x021c */ addr_decode_err_int_info1_t addr_decode_err_int_info1;
    /* 0x0220 */ addr_decode_err_int_info2_t addr_decode_err_int_info2;
    /* 0x0224 */ err_fifo_cntl0_t err_fifo_cntl0;
    /* 0x0228 */ err_fifo_stat0_t err_fifo_stat0;
    /* 0x022c */ err_fifo_stat1_t err_fifo_stat1;
    /* 0x0230 */ err_fifo_stat2_t err_fifo_stat2;
    /* 0x0234 */ err_fifo_stat3_t err_fifo_stat3;
    /* 0x0238 */ u32 rsvd_238 [2];
    /* 0x0240 */ axi_p0_wdata_parity_err_info0_t axi_p0_wdata_parity_err_info0;
    /* 0x0244 */ axi_p0_wdata_parity_err_info1_t axi_p0_wdata_parity_err_info1;
    /* 0x0248 */ axi_p0_wdata_parity_err_info2_t axi_p0_wdata_parity_err_info2;
    /* 0x024c */ u32 rsvd_24c;
    /* 0x0250 */ axi_p1_wdata_parity_err_info0_t axi_p1_wdata_parity_err_info0;
    /* 0x0254 */ axi_p1_wdata_parity_err_info1_t axi_p1_wdata_parity_err_info1;
    /* 0x0258 */ axi_p1_wdata_parity_err_info2_t axi_p1_wdata_parity_err_info2;
    /* 0x025c */ u32 rsvd_25c;
    /* 0x0260 */ axi_p2_wdata_parity_err_info0_t axi_p2_wdata_parity_err_info0;
    /* 0x0264 */ axi_p2_wdata_parity_err_info1_t axi_p2_wdata_parity_err_info1;
    /* 0x0268 */ axi_p2_wdata_parity_err_info2_t axi_p2_wdata_parity_err_info2;
    /* 0x026c */ u32 rsvd_26c [5];
    /* 0x0280 */ data_encrypt_key0_t data_encrypt_key0;
    /* 0x0284 */ data_encrypt_key1_t data_encrypt_key1;
    /* 0x0288 */ data_encrypt_key2_t data_encrypt_key2;
    /* 0x028c */ data_encrypt_key3_t data_encrypt_key3;
    /* 0x0290 */ data_encrypt_key4_t data_encrypt_key4;
    /* 0x0294 */ data_encrypt_key5_t data_encrypt_key5;
    /* 0x0298 */ data_encrypt_key6_t data_encrypt_key6;
    /* 0x029c */ data_encrypt_key7_t data_encrypt_key7;
    /* 0x02a0 */ u32 rsvd_2a0 [24];
    /* 0x0300 */ inline_ecc_err_int_port_sel_t inline_ecc_err_int_port_sel;
    /* 0x0304 */ inline_ecc_err_int_info0_t inline_ecc_err_int_info0;
    /* 0x0308 */ u32 rsvd_308;
    /* 0x030c */ inline_ecc_err_int_info2_t inline_ecc_err_int_info2;
    /* 0x0310 */ inline_ecc_ctrl0_t inline_ecc_ctrl0;
    /* 0x0314 */ u32 rsvd_314;
    /* 0x0318 */ inline_ecc_ctrl2_t inline_ecc_ctrl2;
    /* 0x031c */ inline_ecc_ctrl3_t inline_ecc_ctrl3;
    /* 0x0320 */ u32 rsvd_320 [54];
    /* 0x03f8 */ revid_t revid;
    /* 0x03fc */ revid_misc_t revid_misc;
    /* 0x0400 */ axi_req_cntl_t axi_req_cntl;
} mc_reg_regs_t;


#endif /* rev 0 */