//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _MISC_REGISTER_H_
#define _MISC_REGISTER_H_

#define UNM_SYS_INT                              0x00000000
#define   WDT_RESET_REQ_INT_MASK                 0x80000000
#define   WDT_RESET_REQ_INT_SHIFT                        31
#define   SHARED_TIMER_INT_MASK                  0x40000000
#define   SHARED_TIMER_INT_SHIFT                         30
#define   FSPM_ERR_INT_MASK                      0x20000000
#define   FSPM_ERR_INT_SHIFT                             29
#define   RAIDM_ERR_INT_MASK                     0x10000000
#define   RAIDM_ERR_INT_SHIFT                            28
#define   L2CACHE_INT_MASK                       0x08000000
#define   L2CACHE_INT_SHIFT                              27
#define   SMB1_INT_MASK                          0x04000000
#define   SMB1_INT_SHIFT                                 26
#define   SMB0_INT_MASK                          0x02000000
#define   SMB0_INT_SHIFT                                 25
#define   SPI_INT_MASK                           0x01000000
#define   SPI_INT_SHIFT                                  24
#define   UART_INT_MASK                          0x00800000
#define   UART_INT_SHIFT                                 23
#define   MC_INT_MASK                            0x00400000
#define   MC_INT_SHIFT                                   22
#define   PCIE_P0_INT1_MASK                      0x00200000
#define   PCIE_P0_INT1_SHIFT                             21
#define   PCIE_P0_INT0_MASK                      0x00100000
#define   PCIE_P0_INT0_SHIFT                             20
#define   FATAL_ERROR_INT_MASK                   0x00020000
#define   FATAL_ERROR_INT_SHIFT                          17
#define   PWR_LOSS_INT_MASK                      0x00010000
#define   PWR_LOSS_INT_SHIFT                             16
#define   TS_INT_MASK                            0x00008000
#define   TS_INT_SHIFT                                   15
#define   TRNG_INT_MASK                          0x00004000
#define   TRNG_INT_SHIFT                                 14
#define   GPIO_INT_MASK                          0x00002000
#define   GPIO_INT_SHIFT                                 13
#define   CLKREQ_DEASSERT_INT_MASK               0x00000800
#define   CLKREQ_DEASSERT_INT_SHIFT                      11
#define   CLKREQ_ASSERT_INT_MASK                 0x00000400
#define   CLKREQ_ASSERT_INT_SHIFT                        10
#define   C4_WDT_INT_MASK                        0x00000080
#define   C4_WDT_INT_SHIFT                                7
#define   C3_WDT_INT_MASK                        0x00000040
#define   C3_WDT_INT_SHIFT                                6
#define   C2_WDT_INT_MASK                        0x00000020
#define   C2_WDT_INT_SHIFT                                5
#define   C1_WDT_INT_MASK                        0x00000010
#define   C1_WDT_INT_SHIFT                                4
#define   WARM_RESET_OCCURED_MASK                0x00000008
#define   WARM_RESET_OCCURED_SHIFT                        3
#define   PERST_DEASERTED_MASK                   0x00000004
#define   PERST_DEASERTED_SHIFT                           2
#define   PERST_ASSERTED_MASK                    0x00000002
#define   PERST_ASSERTED_SHIFT                            1
#define   CHIP_RST_OCCURED_MASK                  0x00000001
#define   CHIP_RST_OCCURED_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 chip_rst_occured:1;
        u32 perst_asserted:1;
        u32 perst_deaserted:1;
        u32 warm_reset_occured:1;
        u32 c1_wdt_int:1;
        u32 c2_wdt_int:1;
        u32 c3_wdt_int:1;
        u32 c4_wdt_int:1;
        u32 rsvd_8:2;
        u32 clkreq_assert_int:1;
        u32 clkreq_deassert_int:1;
        u32 rsvd_12:1;
        u32 gpio_int:1;
        u32 trng_int:1;
        u32 ts_int:1;
        u32 pwr_loss_int:1;
        u32 fatal_error_int:1;
        u32 rsvd_18:2;
        u32 pcie_p0_int0:1;
        u32 pcie_p0_int1:1;
        u32 mc_int:1;
        u32 uart_int:1;
        u32 spi_int:1;
        u32 smb0_int:1;
        u32 smb1_int:1;
        u32 l2cache_int:1;
        u32 raidm_err_int:1;
        u32 fspm_err_int:1;
        u32 shared_timer_int:1;
        u32 wdt_reset_req_int:1;
    } b;
} unm_sys_int_t;

#define C1_SYS_INT_MASK                          0x00000004
#define   C1_SYS_INT_MASK_MASK                   0xffffffff
#define   C1_SYS_INT_MASK_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 c1_sys_int_mask:32;
    } b;
} c1_sys_int_mask_t;

#define C1_MASKED_SYS_INT                        0x00000008
#define   C1_MASKED_SYS_INT_MASK                 0xffffffff
#define   C1_MASKED_SYS_INT_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 c1_masked_sys_int:32;
    } b;
} c1_masked_sys_int_t;

#define RESET_CTRL                               0x0000000c
#define   PERST_N_MASK                           0x80000000
#define   PERST_N_SHIFT                                  31
#define   INT_PERST_N_MASK                       0x40000000
#define   INT_PERST_N_SHIFT                              30
#define   PERST_RST_PHY_SEL_MASK                 0x00400000
#define   PERST_RST_PHY_SEL_SHIFT                        22
#define   SUPER_STICKY_RST_SEL_MASK              0x00200000
#define   SUPER_STICKY_RST_SEL_SHIFT                     21
#define   WDT_CHIP_RST_EN_MASK                   0x00100000
#define   WDT_CHIP_RST_EN_SHIFT                          20
#define   CLR_LTSSM_PERST_MASK                   0x00080000
#define   CLR_LTSSM_PERST_SHIFT                          19
#define   PCIE_WRAP_REG_MODE_MASK                0x00040000
#define   PCIE_WRAP_REG_MODE_SHIFT                       18
#define   PMU_PERST_MODE_MASK                    0x00020000
#define   PMU_PERST_MODE_SHIFT                           17
#define   PERST_MODE_MASK                        0x00010000
#define   PERST_MODE_SHIFT                               16
#define   RESET_CTRL_MASK                        0x0000ffff
#define   RESET_CTRL_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 reset_ctrl:16;
        u32 perst_mode:1;
        u32 pmu_perst_mode:1;
        u32 pcie_wrap_reg_mode:1;
        u32 clr_ltssm_perst:1;
        u32 wdt_chip_rst_en:1;
        u32 super_sticky_rst_sel:1;
        u32 perst_rst_phy_sel:1;
        u32 rsvd_23:7;
        u32 int_perst_n:1;
        u32 perst_n:1;
    } b;
} reset_ctrl_t;

#define PLL0_CTRL_0                              0x00000010
#define   PLL0_LOCK_MASK                         0x80000000
#define   PLL0_LOCK_SHIFT                                31
#define   PLL0_RDY_MASK                          0x40000000
#define   PLL0_RDY_SHIFT                                 30
#define   PLL0_POSTDIV2_MASK                     0x01c00000
#define   PLL0_POSTDIV2_SHIFT                            22
#define   PLL0_POSTDIV1_MASK                     0x00380000
#define   PLL0_POSTDIV1_SHIFT                            19
#define   PLL0_FBDIV_MASK                        0x0007ff80
#define   PLL0_FBDIV_SHIFT                                7
#define   PLL0_REFDIV_MASK                       0x0000007e
#define   PLL0_REFDIV_SHIFT                               1

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:1;
        u32 pll0_refdiv:6;
        u32 pll0_fbdiv:12;
        u32 pll0_postdiv1:3;
        u32 pll0_postdiv2:3;
        u32 rsvd_25:5;
        u32 pll0_rdy:1;
        u32 pll0_lock:1;
    } b;
} pll0_ctrl_0_t;

#define PLL0_CTRL_1                              0x00000014
#define   PLL0_EXT_VAL_MASK                      0xff000000
#define   PLL0_EXT_VAL_SHIFT                             24
#define   PLL0_FRAC_MASK                         0x00ffffff
#define   PLL0_FRAC_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 pll0_frac:24;
        u32 pll0_ext_val:8;
    } b;
} pll0_ctrl_1_t;

#define PLL0_CTRL_2                              0x00000018
#define   PLL0_RESETPTR_MASK                     0x00400000
#define   PLL0_RESETPTR_SHIFT                            22
#define   PLL0_SPREAD_MASK                       0x003e0000
#define   PLL0_SPREAD_SHIFT                              17
#define   PLL0_SSCG_DIVVAL_MASK                  0x0001f800
#define   PLL0_SSCG_DIVVAL_SHIFT                         11
#define   PLL0_SEL_EXTWAVE_MASK                  0x00000400
#define   PLL0_SEL_EXTWAVE_SHIFT                         10
#define   PLL0_DOWN_SPREAD_MASK                  0x00000200
#define   PLL0_DOWN_SPREAD_SHIFT                          9
#define   PLL0_BYPASS_MASK                       0x00000100
#define   PLL0_BYPASS_SHIFT                               8
#define   PLL0_FOUT2X_PD_MASK                    0x00000080
#define   PLL0_FOUT2X_PD_SHIFT                            7
#define   PLL0_4PHASE_PD_MASK                    0x00000040
#define   PLL0_4PHASE_PD_SHIFT                            6
#define   PLL0_POSTDIV_PD_MASK                   0x00000020
#define   PLL0_POSTDIV_PD_SHIFT                           5
#define   PLL0_DSMPD_MASK                        0x00000010
#define   PLL0_DSMPD_SHIFT                                4
#define   PLL0_DACPD_MASK                        0x00000008
#define   PLL0_DACPD_SHIFT                                3
#define   PLL0_DIS_SSCG_MASK                     0x00000004
#define   PLL0_DIS_SSCG_SHIFT                             2
#define   PLL0_RESET_MASK                        0x00000002
#define   PLL0_RESET_SHIFT                                1
#define   PLL0_PD_MASK                           0x00000001
#define   PLL0_PD_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 pll0_pd:1;
        u32 pll0_reset:1;
        u32 pll0_dis_sscg:1;
        u32 pll0_dacpd:1;
        u32 pll0_dsmpd:1;
        u32 pll0_postdiv_pd:1;
        u32 pll0_4phase_pd:1;
        u32 pll0_fout2x_pd:1;
        u32 pll0_bypass:1;
        u32 pll0_down_spread:1;
        u32 pll0_sel_extwave:1;
        u32 pll0_sscg_divval:6;
        u32 pll0_spread:5;
        u32 pll0_resetptr:1;
        u32 rsvd_23:9;
    } b;
} pll0_ctrl_2_t;

#define PLL1_CTRL_0                              0x0000001c
#define   PLL1_LOCK_MASK                         0x80000000
#define   PLL1_LOCK_SHIFT                                31
#define   PLL1_RDY_MASK                          0x40000000
#define   PLL1_RDY_SHIFT                                 30
#define   PLL1_POSTDIV2_MASK                     0x01c00000
#define   PLL1_POSTDIV2_SHIFT                            22
#define   PLL1_POSTDIV1_MASK                     0x00380000
#define   PLL1_POSTDIV1_SHIFT                            19
#define   PLL1_FBDIV_MASK                        0x0007ff80
#define   PLL1_FBDIV_SHIFT                                7
#define   PLL1_REFDIV_MASK                       0x0000007e
#define   PLL1_REFDIV_SHIFT                               1

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:1;
        u32 pll1_refdiv:6;
        u32 pll1_fbdiv:12;
        u32 pll1_postdiv1:3;
        u32 pll1_postdiv2:3;
        u32 rsvd_25:5;
        u32 pll1_rdy:1;
        u32 pll1_lock:1;
    } b;
} pll1_ctrl_0_t;

#define PLL1_CTRL_1                              0x00000020
#define   PLL1_EXT_VAL_MASK                      0xff000000
#define   PLL1_EXT_VAL_SHIFT                             24
#define   PLL1_FRAC_MASK                         0x00ffffff
#define   PLL1_FRAC_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 pll1_frac:24;
        u32 pll1_ext_val:8;
    } b;
} pll1_ctrl_1_t;

#define PLL1_CTRL_2                              0x00000024
#define   PLL1_RESETPTR_MASK                     0x00400000
#define   PLL1_RESETPTR_SHIFT                            22
#define   PLL1_SPREAD_MASK                       0x003e0000
#define   PLL1_SPREAD_SHIFT                              17
#define   PLL1_SSCG_DIVVAL_MASK                  0x0001f800
#define   PLL1_SSCG_DIVVAL_SHIFT                         11
#define   PLL1_SEL_EXTWAVE_MASK                  0x00000400
#define   PLL1_SEL_EXTWAVE_SHIFT                         10
#define   PLL1_DOWN_SPREAD_MASK                  0x00000200
#define   PLL1_DOWN_SPREAD_SHIFT                          9
#define   PLL1_BYPASS_MASK                       0x00000100
#define   PLL1_BYPASS_SHIFT                               8
#define   PLL1_FOUT2X_PD_MASK                    0x00000080
#define   PLL1_FOUT2X_PD_SHIFT                            7
#define   PLL1_4PHASE_PD_MASK                    0x00000040
#define   PLL1_4PHASE_PD_SHIFT                            6
#define   PLL1_POSTDIV_PD_MASK                   0x00000020
#define   PLL1_POSTDIV_PD_SHIFT                           5
#define   PLL1_DSMPD_MASK                        0x00000010
#define   PLL1_DSMPD_SHIFT                                4
#define   PLL1_DACPD_MASK                        0x00000008
#define   PLL1_DACPD_SHIFT                                3
#define   PLL1_DIS_SSCG_MASK                     0x00000004
#define   PLL1_DIS_SSCG_SHIFT                             2
#define   PLL1_RESET_MASK                        0x00000002
#define   PLL1_RESET_SHIFT                                1
#define   PLL1_PD_MASK                           0x00000001
#define   PLL1_PD_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 pll1_pd:1;
        u32 pll1_reset:1;
        u32 pll1_dis_sscg:1;
        u32 pll1_dacpd:1;
        u32 pll1_dsmpd:1;
        u32 pll1_postdiv_pd:1;
        u32 pll1_4phase_pd:1;
        u32 pll1_fout2x_pd:1;
        u32 pll1_bypass:1;
        u32 pll1_down_spread:1;
        u32 pll1_sel_extwave:1;
        u32 pll1_sscg_divval:6;
        u32 pll1_spread:5;
        u32 pll1_resetptr:1;
        u32 rsvd_23:9;
    } b;
} pll1_ctrl_2_t;

#define CLK_SRC_MUX                              0x00000028
#define   SRAM_CLK_SEL_MASK                      0x00008000
#define   SRAM_CLK_SEL_SHIFT                             15
#define   SRAM_CLK_DIV_MASK                      0x00007000
#define   SRAM_CLK_DIV_SHIFT                             12
#define   TRACECLK_DIV_MASK                      0x00000f00
#define   TRACECLK_DIV_SHIFT                              8
#define   SRAM_CLK_SRC_MASK                      0x00000080
#define   SRAM_CLK_SRC_SHIFT                              7
#define   FICU_CLK_SRC_MASK                      0x00000040
#define   FICU_CLK_SRC_SHIFT                              6
#define   SW_CLK_SRC_MASK                        0x00000008
#define   SW_CLK_SRC_SHIFT                                3
#define   NF0_CLK_SRC_MASK                       0x00000004
#define   NF0_CLK_SRC_SHIFT                               2
#define   ECC_CLK_SRC_MASK                       0x00000002
#define   ECC_CLK_SRC_SHIFT                               1
#define   CPU_CLK_SRC_MASK                       0x00000001
#define   CPU_CLK_SRC_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 cpu_clk_src:1;
        u32 ecc_clk_src:1;
        u32 nf0_clk_src:1;
        u32 sw_clk_src:1;
        u32 rsvd_4:2;
        u32 ficu_clk_src:1;
        u32 sram_clk_src:1;
        u32 traceclk_div:4;
        u32 sram_clk_div:3;
        u32 sram_clk_sel:1;
        u32 rsvd_16:16;
    } b;
} clk_src_mux_t;

#define CLK_DIVIDER                              0x0000002c
#define   FICU_CLK_SEL_MASK                      0x20000000
#define   FICU_CLK_SEL_SHIFT                             29
#define   FICU_CLK_DIV_MASK                      0x1c000000
#define   FICU_CLK_DIV_SHIFT                             26
#define   SW_CLK_DIV_MASK                        0x00070000
#define   SW_CLK_DIV_SHIFT                               16
#define   NF0_CLK_SEL_MASK                       0x00008000
#define   NF0_CLK_SEL_SHIFT                              15
#define   NF0_CLK_DIV_MASK                       0x00007000
#define   NF0_CLK_DIV_SHIFT                              12
#define   ECC_CLK_SEL_MASK                       0x00000800
#define   ECC_CLK_SEL_SHIFT                              11
#define   ECC_CLK_DIV_MASK                       0x00000700
#define   ECC_CLK_DIV_SHIFT                               8
#define   SYS_CLK_DIV_MASK                       0x00000070
#define   SYS_CLK_DIV_SHIFT                               4
#define   CPU_CLK_SEL_MASK                       0x00000008
#define   CPU_CLK_SEL_SHIFT                               3
#define   CPU_CLK_DIV_MASK                       0x00000007
#define   CPU_CLK_DIV_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 cpu_clk_div:3;
        u32 cpu_clk_sel:1;
        u32 sys_clk_div:3;
        u32 rsvd_7:1;
        u32 ecc_clk_div:3;
        u32 ecc_clk_sel:1;
        u32 nf0_clk_div:3;
        u32 nf0_clk_sel:1;
        u32 sw_clk_div:3;
        u32 rsvd_19:7;
        u32 ficu_clk_div:3;
        u32 ficu_clk_sel:1;
        u32 rsvd_30:2;
    } b;
} clk_divider_t;

#define CLK_DIS_CTRL                             0x00000030
#define   CLK_DIS_MASK                           0x0000ffff
#define   CLK_DIS_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 clk_dis:16;
        u32 rsvd_16:16;
    } b;
} clk_dis_ctrl_t;

#define FROSC_CTRL                               0x00000034
#define   OSC2M_REG_EN_MASK                      0x04000000
#define   OSC2M_REG_EN_SHIFT                             26
#define   OSC2M_RTRIM_MASK                       0x03e00000
#define   OSC2M_RTRIM_SHIFT                              21
#define   OSC2M_CTRIM_MASK                       0x001fc000
#define   OSC2M_CTRIM_SHIFT                              14
#define   OSC2M_BW_MASK                          0x00003000
#define   OSC2M_BW_SHIFT                                 12
#define   OSC2M_ICTRL_MASK                       0x00000ff0
#define   OSC2M_ICTRL_SHIFT                               4
#define   OSC2M_CNT_MASK                         0x0000000c
#define   OSC2M_CNT_SHIFT                                 2
#define   OSC2M_KP_ST_MASK                       0x00000002
#define   OSC2M_KP_ST_SHIFT                               1
#define   OSC2M_EN_MASK                          0x00000001
#define   OSC2M_EN_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 osc2m_en:1;
        u32 osc2m_kp_st:1;
        u32 osc2m_cnt:2;
        u32 osc2m_ictrl:8;
        u32 osc2m_bw:2;
        u32 osc2m_ctrim:7;
        u32 osc2m_rtrim:5;
        u32 osc2m_reg_en:1;
        u32 rsvd_27:5;
    } b;
} frosc_ctrl_t;

#define PAD_CTRL                                 0x00000038
#define   MIN_RESET_WIDTH_MASK                   0x0fe00000
#define   MIN_RESET_WIDTH_SHIFT                          21
#define   DIS_PIN_RESET_MASK                     0x00100000
#define   DIS_PIN_RESET_SHIFT                            20
#define   UNIT_LENGTH_MASK                       0x000f0000
#define   UNIT_LENGTH_SHIFT                              16
#define   SMB_IE_MASK                            0x00001000
#define   SMB_IE_SHIFT                                   12
#define   JTAG_IE_MASK                           0x00000800
#define   JTAG_IE_SHIFT                                  11
#define   UART_IE_MASK                           0x00000400
#define   UART_IE_SHIFT                                  10
#define   SPI_IE_MASK                            0x00000200
#define   SPI_IE_SHIFT                                    9
#define   GPIO_IE_MASK                           0x00000100
#define   GPIO_IE_SHIFT                                   8
#define   SDA_PULL_UP_MASK                       0x00000020
#define   SDA_PULL_UP_SHIFT                               5
#define   SCL_PULL_UP_MASK                       0x00000010
#define   SCL_PULL_UP_SHIFT                               4
#define   UAI_PAD_PU_MASK                        0x00000008
#define   UAI_PAD_PU_SHIFT                                3
#define   SPI_PAD_PU_MASK                        0x00000004
#define   SPI_PAD_PU_SHIFT                                2
#define   JTAG_PAD_PU_MASK                       0x00000002
#define   JTAG_PAD_PU_SHIFT                               1
#define   XTAL_PAD_EN_MASK                       0x00000001
#define   XTAL_PAD_EN_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 xtal_pad_en:1;
        u32 jtag_pad_pu:1;
        u32 spi_pad_pu:1;
        u32 uai_pad_pu:1;
        u32 scl_pull_up:1;
        u32 sda_pull_up:1;
        u32 rsvd_6:2;
        u32 gpio_ie:1;
        u32 spi_ie:1;
        u32 uart_ie:1;
        u32 jtag_ie:1;
        u32 smb_ie:1;
        u32 rsvd_13:3;
        u32 unit_length:4;
        u32 dis_pin_reset:1;
        u32 min_reset_width:7;
        u32 rsvd_28:4;
    } b;
} pad_ctrl_t;

#define GPIO_CTRL                                0x0000003c
#define   GPIO_REG_EN_MASK                       0x00010000
#define   GPIO_REG_EN_SHIFT                              16
#define   GPIO_REG_VALUE_MASK                    0x0000ffff
#define   GPIO_REG_VALUE_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 gpio_reg_value:16;
        u32 gpio_reg_en:1;
        u32 rsvd_17:15;
    } b;
} gpio_ctrl_t;

#define GPIO_OUT                                 0x00000040
#define   GPIO_OUT_MASK                          0xffff0000
#define   GPIO_OUT_SHIFT                                 16
#define   GPIO_OE_MASK                           0x0000ffff
#define   GPIO_OE_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 gpio_oe:16;
        u32 gpio_out:16;
    } b;
} gpio_out_t;

#define GPIO_INT_CTRL                            0x00000044
#define   GPIO_INT_EN_MASK                       0x0000ffff
#define   GPIO_INT_EN_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 gpio_int_en:16;
        u32 rsvd_16:16;
    } b;
} gpio_int_ctrl_t;

#define GPIO_INT                                 0x00000048
#define   GPIO_INT_48_MASK                       0x0000ffff
#define   GPIO_INT_48_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 gpio_int_48:16;
        u32 rsvd_16:16;
    } b;
} gpio_int_t;

#define GPIO_INT_MODE                            0x0000004c
#define   GPIO15_INT_MODE_MASK                   0xc0000000
#define   GPIO15_INT_MODE_SHIFT                          30
#define   GPIO14_INT_MODE_MASK                   0x30000000
#define   GPIO14_INT_MODE_SHIFT                          28
#define   GPIO13_INT_MODE_MASK                   0x0c000000
#define   GPIO13_INT_MODE_SHIFT                          26
#define   GPIO12_INT_MODE_MASK                   0x03000000
#define   GPIO12_INT_MODE_SHIFT                          24
#define   GPIO11_INT_MODE_MASK                   0x00c00000
#define   GPIO11_INT_MODE_SHIFT                          22
#define   GPIO10_INT_MODE_MASK                   0x00300000
#define   GPIO10_INT_MODE_SHIFT                          20
#define   GPIO9_INT_MODE_MASK                    0x000c0000
#define   GPIO9_INT_MODE_SHIFT                           18
#define   GPIO8_INT_MODE_MASK                    0x00030000
#define   GPIO8_INT_MODE_SHIFT                           16
#define   GPIO7_INT_MODE_MASK                    0x0000c000
#define   GPIO7_INT_MODE_SHIFT                           14
#define   GPIO6_INT_MODE_MASK                    0x00003000
#define   GPIO6_INT_MODE_SHIFT                           12
#define   GPIO5_INT_MODE_MASK                    0x00000c00
#define   GPIO5_INT_MODE_SHIFT                           10
#define   GPIO4_INT_MODE_MASK                    0x00000300
#define   GPIO4_INT_MODE_SHIFT                            8
#define   GPIO3_INT_MODE_MASK                    0x000000c0
#define   GPIO3_INT_MODE_SHIFT                            6
#define   GPIO2_INT_MODE_MASK                    0x00000030
#define   GPIO2_INT_MODE_SHIFT                            4
#define   GPIO1_INT_MODE_MASK                    0x0000000c
#define   GPIO1_INT_MODE_SHIFT                            2
#define   GPIO0_INT_MODE_MASK                    0x00000003
#define   GPIO0_INT_MODE_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 gpio0_int_mode:2;
        u32 gpio1_int_mode:2;
        u32 gpio2_int_mode:2;
        u32 gpio3_int_mode:2;
        u32 gpio4_int_mode:2;
        u32 gpio5_int_mode:2;
        u32 gpio6_int_mode:2;
        u32 gpio7_int_mode:2;
        u32 gpio8_int_mode:2;
        u32 gpio9_int_mode:2;
        u32 gpio10_int_mode:2;
        u32 gpio11_int_mode:2;
        u32 gpio12_int_mode:2;
        u32 gpio13_int_mode:2;
        u32 gpio14_int_mode:2;
        u32 gpio15_int_mode:2;
    } b;
} gpio_int_mode_t;

#define VOL_MON_CTRL                             0x00000050
#define   POWER_UP_INT_EN_MASK                   0x000c0000
#define   POWER_UP_INT_EN_SHIFT                          18
#define   POWER_LOSS_INT_EN_MASK                 0x00030000
#define   POWER_LOSS_INT_EN_SHIFT                        16
#define   VTH33_SEL_MASK                         0x000000f0
#define   VTH33_SEL_SHIFT                                 4
#define   VTH25_SEL_MASK                         0x0000000f
#define   VTH25_SEL_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 vth25_sel:4;
        u32 vth33_sel:4;
        u32 rsvd_8:8;
        u32 power_loss_int_en:2;
        u32 power_up_int_en:2;
        u32 rsvd_20:12;
    } b;
} vol_mon_ctrl_t;

#define VOL_MON_STTS                             0x00000054
#define   V33_GOOD_MASK                          0x00000020
#define   V33_GOOD_SHIFT                                  5
#define   V25_GOOD_MASK                          0x00000010
#define   V25_GOOD_SHIFT                                  4
#define   POWER_UP_33V_MASK                      0x00000008
#define   POWER_UP_33V_SHIFT                              3
#define   POWER_UP_25V_MASK                      0x00000004
#define   POWER_UP_25V_SHIFT                              2
#define   POWER_LOSS_33V_MASK                    0x00000002
#define   POWER_LOSS_33V_SHIFT                            1
#define   POWER_LOSS_25V_MASK                    0x00000001
#define   POWER_LOSS_25V_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 power_loss_25v:1;
        u32 power_loss_33v:1;
        u32 power_up_25v:1;
        u32 power_up_33v:1;
        u32 v25_good:1;
        u32 v33_good:1;
        u32 rsvd_6:26;
    } b;
} vol_mon_stts_t;

#define CAB_CTRL                                 0x00000058
#define   CAB_RSVD_2_MASK                        0x0000ff00
#define   CAB_RSVD_2_SHIFT                                8
#define   CAB_RSVD_1_MASK                        0x000000ff
#define   CAB_RSVD_1_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 cab_rsvd_1:8;
        u32 cab_rsvd_2:8;
        u32 rsvd_16:16;
    } b;
} cab_ctrl_t;

#define MISC_CONFIG                              0x00000064
#define   GPIO_IN_U2_CTL_MASK                    0x00000018
#define   GPIO_IN_U2_CTL_SHIFT                            3
#define   GPIO3_IN_M2_CTL_MASK                   0x00000006
#define   GPIO3_IN_M2_CTL_SHIFT                           1
#define   CPU_CFG_DDR_PARITY_MASK                0x00000001
#define   CPU_CFG_DDR_PARITY_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 cpu_cfg_ddr_parity:1;
        u32 gpio3_in_m2_ctl:2;
        u32 gpio_in_u2_ctl:2;
        u32 rsvd_5:27;
    } b;
} misc_config_t;

#define MEM_CTRL1                                0x00000068
#define   SHDSPSBSRAM_RTSEL_MASK                 0x18000000
#define   SHDSPSBSRAM_RTSEL_SHIFT                        27
#define   SHDSPSBSRAM_WTSEL_MASK                 0x06000000
#define   SHDSPSBSRAM_WTSEL_SHIFT                        25
#define   RF2P_KP_MASK                           0x01c00000
#define   RF2P_KP_SHIFT                                  22
#define   RF2P_RCT_MASK                          0x00300000
#define   RF2P_RCT_SHIFT                                 20
#define   RF2P_WCT_MASK                          0x000c0000
#define   RF2P_WCT_SHIFT                                 18
#define   UHD2PRF_MTSEL_MASK                     0x00030000
#define   UHD2PRF_MTSEL_SHIFT                            16
#define   UHD2PRF_RTSEL_MASK                     0x0000c000
#define   UHD2PRF_RTSEL_SHIFT                            14
#define   UHD2PRF_WTSEL_MASK                     0x00003000
#define   UHD2PRF_WTSEL_SHIFT                            12
#define   HDSPMBSRAM_LVT_RTSEL_MASK              0x00000c00
#define   HDSPMBSRAM_LVT_RTSEL_SHIFT                     10
#define   HDSPMBSRAM_LVT_WTSEL_MASK              0x00000300
#define   HDSPMBSRAM_LVT_WTSEL_SHIFT                      8
#define   HDSPMBSRAM_SVT_RTSEL_MASK              0x000000c0
#define   HDSPMBSRAM_SVT_RTSEL_SHIFT                      6
#define   HDSPMBSRAM_SVT_WTSEL_MASK              0x00000030
#define   HDSPMBSRAM_SVT_WTSEL_SHIFT                      4
#define   HDSPSBSRAM_RTSEL_MASK                  0x0000000c
#define   HDSPSBSRAM_RTSEL_SHIFT                          2
#define   HDSPSBSRAM_WTSEL_MASK                  0x00000003
#define   HDSPSBSRAM_WTSEL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 hdspsbsram_wtsel:2;
        u32 hdspsbsram_rtsel:2;
        u32 hdspmbsram_svt_wtsel:2;
        u32 hdspmbsram_svt_rtsel:2;
        u32 hdspmbsram_lvt_wtsel:2;
        u32 hdspmbsram_lvt_rtsel:2;
        u32 uhd2prf_wtsel:2;
        u32 uhd2prf_rtsel:2;
        u32 uhd2prf_mtsel:2;
        u32 rf2p_wct:2;
        u32 rf2p_rct:2;
        u32 rf2p_kp:3;
        u32 shdspsbsram_wtsel:2;
        u32 shdspsbsram_rtsel:2;
        u32 rsvd_29:3;
    } b;
} mem_ctrl1_t;

#define MEM_CTRL2                                0x0000006c
#define   ROM_TM_MASK                            0x00040000
#define   ROM_TM_SHIFT                                   18
#define   ROM_TRB_MASK                           0x00030000
#define   ROM_TRB_SHIFT                                  16
#define   ROM_PTSEL_MASK                         0x0000c000
#define   ROM_PTSEL_SHIFT                                14
#define   ROM_RTSEL_MASK                         0x00003000
#define   ROM_RTSEL_SHIFT                                12
#define   RF1P_RTSEL_MASK                        0x00000c00
#define   RF1P_RTSEL_SHIFT                               10
#define   RFRP_WTSEL_MASK                        0x00000300
#define   RFRP_WTSEL_SHIFT                                8
#define   UHD1PRF_RTSEL_MASK                     0x000000c0
#define   UHD1PRF_RTSEL_SHIFT                             6
#define   UHD1PRF_WTSEL_MASK                     0x00000030
#define   UHD1PRF_WTSEL_SHIFT                             4
#define   SHDSPMBSRAM_RTSEL_MASK                 0x0000000c
#define   SHDSPMBSRAM_RTSEL_SHIFT                         2
#define   SHDSPMBSRAM_WTSEL_MASK                 0x00000003
#define   SHDSPMBSRAM_WTSEL_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 shdspmbsram_wtsel:2;
        u32 shdspmbsram_rtsel:2;
        u32 uhd1prf_wtsel:2;
        u32 uhd1prf_rtsel:2;
        u32 rfrp_wtsel:2;
        u32 rf1p_rtsel:2;
        u32 rom_rtsel:2;
        u32 rom_ptsel:2;
        u32 rom_trb:2;
        u32 rom_tm:1;
        u32 rsvd_19:13;
    } b;
} mem_ctrl2_t;

#define MEM_PS0_CTRL                             0x00000070
#define   RAIDM_PS_MASK                          0x01c00000
#define   RAIDM_PS_SHIFT                                 22
#define   SRAM14_15_PS_MASK                      0x00380000
#define   SRAM14_15_PS_SHIFT                             19
#define   ROM_PS_MASK                            0x00040000
#define   ROM_PS_SHIFT                                   18
#define   SRAM8_13_PS_MASK                       0x00038000
#define   SRAM8_13_PS_SHIFT                              15
#define   SRAM2_7_PS_MASK                        0x00007000
#define   SRAM2_7_PS_SHIFT                               12
#define   SRAM0_1_PS_MASK                        0x00000e00
#define   SRAM0_1_PS_SHIFT                                9
#define   CPU1_BTCM_H_PS_MASK                    0x000001c0
#define   CPU1_BTCM_H_PS_SHIFT                            6
#define   CPU1_BTCM_L_PS_MASK                    0x00000038
#define   CPU1_BTCM_L_PS_SHIFT                            3
#define   CPU1_ATCM_PS_MASK                      0x00000007
#define   CPU1_ATCM_PS_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cpu1_atcm_ps:3;
        u32 cpu1_btcm_l_ps:3;
        u32 cpu1_btcm_h_ps:3;
        u32 sram0_1_ps:3;
        u32 sram2_7_ps:3;
        u32 sram8_13_ps:3;
        u32 rom_ps:1;
        u32 sram14_15_ps:3;
        u32 raidm_ps:3;
        u32 rsvd_25:7;
    } b;
} mem_ps0_ctrl_t;

#define MEM_PS1_CTRL                             0x00000074
#define   DBL_SRAM_PS_MASK                       0x001c0000
#define   DBL_SRAM_PS_SHIFT                              18
#define   CPU_SHARE_BTCM_PS_MASK                 0x00038000
#define   CPU_SHARE_BTCM_PS_SHIFT                        15
#define   MC_MEM_PS_MASK                         0x00007000
#define   MC_MEM_PS_SHIFT                                12
#define   BTN_MEM_PS_MASK                        0x00000e00
#define   BTN_MEM_PS_SHIFT                                9
#define   NVME_MEM_PS_MASK                       0x000001c0
#define   NVME_MEM_PS_SHIFT                               6
#define   CPU_MEM_PS_MASK                        0x00000038
#define   CPU_MEM_PS_SHIFT                                3
#define   CRYPTO_SRAM_PS_MASK                    0x00000007
#define   CRYPTO_SRAM_PS_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 crypto_sram_ps:3;
        u32 cpu_mem_ps:3;
        u32 nvme_mem_ps:3;
        u32 btn_mem_ps:3;
        u32 mc_mem_ps:3;
        u32 cpu_share_btcm_ps:3;
        u32 dbl_sram_ps:3;
        u32 rsvd_21:11;
    } b;
} mem_ps1_ctrl_t;

#define MEM_PS2_CTRL                             0x00000078
#define   SPLK_MEM_PS_MASK                       0x38000000
#define   SPLK_MEM_PS_SHIFT                              27
#define   CPU4_BTCM_H_PS_MASK                    0x07000000
#define   CPU4_BTCM_H_PS_SHIFT                           24
#define   CPU4_BCTM_L_PS_MASK                    0x00e00000
#define   CPU4_BCTM_L_PS_SHIFT                           21
#define   CPU4_ACTM_PS_MASK                      0x001c0000
#define   CPU4_ACTM_PS_SHIFT                             18
#define   CPU3_BTCM_H_PS_MASK                    0x00038000
#define   CPU3_BTCM_H_PS_SHIFT                           15
#define   CPU3_BTCM_L_PS_MASK                    0x00007000
#define   CPU3_BTCM_L_PS_SHIFT                           12
#define   CPU3_ATCM_PS_MASK                      0x00000e00
#define   CPU3_ATCM_PS_SHIFT                              9
#define   CPU2_BTCM_H_PS_MASK                    0x000001c0
#define   CPU2_BTCM_H_PS_SHIFT                            6
#define   CPU2_BTCM_L_PS_MASK                    0x00000038
#define   CPU2_BTCM_L_PS_SHIFT                            3
#define   CPU2_ATCM_PS_MASK                      0x00000007
#define   CPU2_ATCM_PS_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cpu2_atcm_ps:3;
        u32 cpu2_btcm_l_ps:3;
        u32 cpu2_btcm_h_ps:3;
        u32 cpu3_atcm_ps:3;
        u32 cpu3_btcm_l_ps:3;
        u32 cpu3_btcm_h_ps:3;
        u32 cpu4_actm_ps:3;
        u32 cpu4_bctm_l_ps:3;
        u32 cpu4_btcm_h_ps:3;
        u32 splk_mem_ps:3;
        u32 rsvd_30:2;
    } b;
} mem_ps2_ctrl_t;

#define CHIP_ID                                  0x0000007c
#define   CHIP_ID_MASK                           0xffffffff
#define   CHIP_ID_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 chip_id:32;
    } b;
} chip_id_t;

#define PMU_CONTROL                              0x00000080
#define   EN_WAKE_BY_UART_MASK                   0x00400000
#define   EN_WAKE_BY_UART_SHIFT                          22
#define   EN_WAKE_BY_I2C_MASK                    0x00200000
#define   EN_WAKE_BY_I2C_SHIFT                           21
#define   EN_WAKE_BY_PWR_LOSS_MASK               0x00100000
#define   EN_WAKE_BY_PWR_LOSS_SHIFT                      20
#define   EN_WAKE_BY_PMU_TIMER_MASK              0x00080000
#define   EN_WAKE_BY_PMU_TIMER_SHIFT                     19
#define   L1_IDLE_EN_MASK                        0x00040000
#define   L1_IDLE_EN_SHIFT                               18
#define   BISR_EN_ON_EXIT_MASK                   0x00020000
#define   BISR_EN_ON_EXIT_SHIFT                          17
#define   STANDBY_EN_MASK                        0x00010000
#define   STANDBY_EN_SHIFT                               16
#define   PMU_TMOUT_VAL_MASK                     0x0000ff00
#define   PMU_TMOUT_VAL_SHIFT                             8
#define   PMU_TEST_MODE_MASK                     0x000000c0
#define   PMU_TEST_MODE_SHIFT                             6
#define   MASK_CLKREQ_MASK                       0x00000020
#define   MASK_CLKREQ_SHIFT                               5
#define   DIS_MAC_EXIT_L1SUB_MASK                0x00000010
#define   DIS_MAC_EXIT_L1SUB_SHIFT                        4
#define   DIS_PHY_EXIT_L1_MASK                   0x00000008
#define   DIS_PHY_EXIT_L1_SHIFT                           3
#define   EN_PMU_TMOUT_TMR_MASK                  0x00000004
#define   EN_PMU_TMOUT_TMR_SHIFT                          2
#define   PMU_START_MASK                         0x00000002
#define   PMU_START_SHIFT                                 1
#define   PMU_EN_MASK                            0x00000001
#define   PMU_EN_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 pmu_en:1;
        u32 pmu_start:1;
        u32 en_pmu_tmout_tmr:1;
        u32 dis_phy_exit_l1:1;
        u32 dis_mac_exit_l1sub:1;
        u32 mask_clkreq:1;
        u32 pmu_test_mode:2;
        u32 pmu_tmout_val:8;
        u32 standby_en:1;
        u32 bisr_en_on_exit:1;
        u32 l1_idle_en:1;
        u32 en_wake_by_pmu_timer:1;
        u32 en_wake_by_pwr_loss:1;
        u32 en_wake_by_i2c:1;
        u32 en_wake_by_uart:1;
        u32 rsvd_23:9;
    } b;
} pmu_control_t;

#define PMU_STATUS                               0x00000084
#define   PD2_BISR_DONE_MASK                     0x04000000
#define   PD2_BISR_DONE_SHIFT                            26
#define   PD1_BISR_DONE_MASK                     0x02000000
#define   PD1_BISR_DONE_SHIFT                            25
#define   PD0_BISR_DONE_MASK                     0x01000000
#define   PD0_BISR_DONE_SHIFT                            24
#define   PMU_MAC_STATE_MASK                     0x00600000
#define   PMU_MAC_STATE_SHIFT                            21
#define   PMU_CUR_STATE_MASK                     0x001f0000
#define   PMU_CUR_STATE_SHIFT                            16
#define   WAKED_BY_UART_MASK                     0x00000100
#define   WAKED_BY_UART_SHIFT                             8
#define   WAKED_BY_I2C_MASK                      0x00000080
#define   WAKED_BY_I2C_SHIFT                              7
#define   WAKED_BY_PWR_LOSS_MASK                 0x00000040
#define   WAKED_BY_PWR_LOSS_SHIFT                         6
#define   WAKED_BY_PMU_TIMER_MASK                0x00000020
#define   WAKED_BY_PMU_TIMER_SHIFT                        5
#define   WAKED_BY_PCIE_MASK                     0x00000010
#define   WAKED_BY_PCIE_SHIFT                             4
#define   PMU_EXIT_BF_PD_MASK                    0x00000008
#define   PMU_EXIT_BF_PD_SHIFT                            3
#define   PMU_TMOUT_MASK                         0x00000004
#define   PMU_TMOUT_SHIFT                                 2
#define   PD_OCCURED_MASK                        0x00000002
#define   PD_OCCURED_SHIFT                                1
#define   PMU_DONE_MASK                          0x00000001
#define   PMU_DONE_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 pmu_done:1;
        u32 pd_occured:1;
        u32 pmu_tmout:1;
        u32 pmu_exit_bf_pd:1;
        u32 waked_by_pcie:1;
        u32 waked_by_pmu_timer:1;
        u32 waked_by_pwr_loss:1;
        u32 waked_by_i2c:1;
        u32 waked_by_uart:1;
        u32 rsvd_9:7;
        u32 pmu_cur_state:5;
        u32 pmu_mac_state:2;
        u32 rsvd_23:1;
        u32 pd0_bisr_done:1;
        u32 pd1_bisr_done:1;
        u32 pd2_bisr_done:1;
        u32 rsvd_27:5;
    } b;
} pmu_status_t;

#define PMU_CLK_CTRL                             0x00000088
#define   PMU_SW_CLK_SRC_MASK                    0x00000002
#define   PMU_SW_CLK_SRC_SHIFT                            1
#define   PMU_CLK_SEL_MASK                       0x00000001
#define   PMU_CLK_SEL_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 pmu_clk_sel:1;
        u32 pmu_sw_clk_src:1;
        u32 rsvd_2:30;
    } b;
} pmu_clk_ctrl_t;

#define PWRD_CTRL                                0x0000008c
#define   PSW_CTRL_1_MASK                        0x0000007f
#define   PSW_CTRL_1_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 psw_ctrl_1:7;
        u32 rsvd_7:25;
    } b;
} pwrd_ctrl_t;

#define ISO_CTRL                                 0x00000090
#define   RESTORE_REQ_MASK                       0x00000200
#define   RESTORE_REQ_SHIFT                               9
#define   SAVE_REQ_MASK                          0x00000100
#define   SAVE_REQ_SHIFT                                  8
#define   ISO_CTRL_MASK                          0x0000007f
#define   ISO_CTRL_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 iso_ctrl:7;
        u32 rsvd_7:1;
        u32 save_req:1;
        u32 restore_req:1;
        u32 rsvd_10:22;
    } b;
} iso_ctrl_t;

#define HW_LP_MODE                               0x00000094
#define   CLK_DIS_CTRL_MASK                      0xfff00000
#define   CLK_DIS_CTRL_SHIFT                             20
#define   CORE_LDO_OUT_SEL_MASK                  0x000f0000
#define   CORE_LDO_OUT_SEL_SHIFT                         16
#define   XTAL_PD_DIS_MASK                       0x00008000
#define   XTAL_PD_DIS_SHIFT                              15
#define   PD_PLL2_MASK                           0x00004000
#define   PD_PLL2_SHIFT                                  14
#define   PD_OFF_CTRL_MASK                       0x00003f80
#define   PD_OFF_CTRL_SHIFT                               7
#define   PD_PLL1_MASK                           0x00000040
#define   PD_PLL1_SHIFT                                   6
#define   PD_PLL0_MASK                           0x00000020
#define   PD_PLL0_SHIFT                                   5
#define   SEL_OSC_CLK_MASK                       0x00000010
#define   SEL_OSC_CLK_SHIFT                               4
#define   EN_PHY_LDO_LP_MASK                     0x00000008
#define   EN_PHY_LDO_LP_SHIFT                             3
#define   DIS_PHY_LDO_MASK                       0x00000004
#define   DIS_PHY_LDO_SHIFT                               2
#define   EN_CORE_LDO_SEL_MASK                   0x00000002
#define   EN_CORE_LDO_SEL_SHIFT                           1
#define   EN_CORE_LDO_LP_MASK                    0x00000001
#define   EN_CORE_LDO_LP_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 en_core_ldo_lp:1;
        u32 en_core_ldo_sel:1;
        u32 dis_phy_ldo:1;
        u32 en_phy_ldo_lp:1;
        u32 sel_osc_clk:1;
        u32 pd_pll0:1;
        u32 pd_pll1:1;
        u32 pd_off_ctrl:7;
        u32 pd_pll2:1;
        u32 xtal_pd_dis:1;
        u32 core_ldo_out_sel:4;
        u32 clk_dis_ctrl:12;
    } b;
} hw_lp_mode_t;

#define HW_LP_MODE1                              0x00000098
#define   MEM_LP_CTRL_DIS_MASK                   0x80000000
#define   MEM_LP_CTRL_DIS_SHIFT                          31
#define   MEM_SD_MASK                            0x7fff0000
#define   MEM_SD_SHIFT                                   16
#define   LDO_WAIT_TIME_MASK                     0x0000ff00
#define   LDO_WAIT_TIME_SHIFT                             8
#define   DIS_PHY_TX_L1_MASK                     0x00000080
#define   DIS_PHY_TX_L1_SHIFT                             7
#define   DIS_PHY_PLL_L1_MASK                    0x00000040
#define   DIS_PHY_PLL_L1_SHIFT                            6
#define   CLK_DIS_EXIT_MASK                      0x00000038
#define   CLK_DIS_EXIT_SHIFT                              3
#define   HALT_MAC_EXIT_L1SUB_MASK               0x00000004
#define   HALT_MAC_EXIT_L1SUB_SHIFT                       2
#define   HALT_PHY_EXIT_L1_MASK                  0x00000002
#define   HALT_PHY_EXIT_L1_SHIFT                          1
#define   MAC_EXIT_MODE_MASK                     0x00000001
#define   MAC_EXIT_MODE_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 mac_exit_mode:1;
        u32 halt_phy_exit_l1:1;
        u32 halt_mac_exit_l1sub:1;
        u32 clk_dis_exit:3;
        u32 dis_phy_pll_l1:1;
        u32 dis_phy_tx_l1:1;
        u32 ldo_wait_time:8;
        u32 mem_sd:15;
        u32 mem_lp_ctrl_dis:1;
    } b;
} hw_lp_mode1_t;

#define LP_WAIT_TIME                             0x0000009c
#define   LP_WAIT_TIME_MASK                      0xffffffff
#define   LP_WAIT_TIME_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 lp_wait_time:32;
    } b;
} lp_wait_time_t;

#define USEC_COUNT                               0x000000a0
#define   MAC_PWR_ON_WAIT_MASK                   0xff000000
#define   MAC_PWR_ON_WAIT_SHIFT                          24
#define   US_CNT_OSC_MASK                        0x000ffc00
#define   US_CNT_OSC_SHIFT                               10
#define   US_CNT_SYS_MASK                        0x000003ff
#define   US_CNT_SYS_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 us_cnt_sys:10;
        u32 us_cnt_osc:10;
        u32 rsvd_20:4;
        u32 mac_pwr_on_wait:8;
    } b;
} usec_count_t;

#define MAC_PD_CTRL                              0x000000a4
#define   PHY_IN_L1_1_MASK                       0x10000000
#define   PHY_IN_L1_1_SHIFT                              28
#define   PHY_IN_L1_2_MASK                       0x08000000
#define   PHY_IN_L1_2_SHIFT                              27
#define   PM_LINK_IN_L1_1_MASK                   0x04000000
#define   PM_LINK_IN_L1_1_SHIFT                          26
#define   PM_LINK_IN_L1_2_MASK                   0x02000000
#define   PM_LINK_IN_L1_2_SHIFT                          25
#define   MAC_PMU_PD_L1_MASK                     0x01000000
#define   MAC_PMU_PD_L1_SHIFT                            24
#define   MAC_PMU_STATE_MASK                     0x00f00000
#define   MAC_PMU_STATE_SHIFT                            20
#define   CLK_REQ_N_MASK                         0x00080000
#define   CLK_REQ_N_SHIFT                                19
#define   PM_LINK_IN_L1_SUB_MASK                 0x00040000
#define   PM_LINK_IN_L1_SUB_SHIFT                        18
#define   RESTORE_STATE_REQ_MASK                 0x00020000
#define   RESTORE_STATE_REQ_SHIFT                        17
#define   SAVE_STATE_REQ_MASK                    0x00010000
#define   SAVE_STATE_REQ_SHIFT                           16
#define   TEST_BYPASS_LP_MASK                    0x00000010
#define   TEST_BYPASS_LP_SHIFT                            4
#define   RESTORE_STATE_ACK_MASK                 0x00000008
#define   RESTORE_STATE_ACK_SHIFT                         3
#define   SAVE_STATE_ACK_MASK                    0x00000004
#define   SAVE_STATE_ACK_SHIFT                            2
#define   L1_PWR_OFF_EN_MASK                     0x00000002
#define   L1_PWR_OFF_EN_SHIFT                             1
#define   ACK_EN_VMAIN_MASK                      0x00000001
#define   ACK_EN_VMAIN_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 ack_en_vmain:1;
        u32 l1_pwr_off_en:1;
        u32 save_state_ack:1;
        u32 restore_state_ack:1;
        u32 test_bypass_lp:1;
        u32 rsvd_5:11;
        u32 save_state_req:1;
        u32 restore_state_req:1;
        u32 pm_link_in_l1_sub:1;
        u32 clk_req_n:1;
        u32 mac_pmu_state:4;
        u32 mac_pmu_pd_l1:1;
        u32 pm_link_in_l1_2:1;
        u32 pm_link_in_l1_1:1;
        u32 phy_in_l1_2:1;
        u32 phy_in_l1_1:1;
        u32 rsvd_29:3;
    } b;
} mac_pd_ctrl_t;

#define PHY_PD_CTRL                              0x000000a8
#define   PHYC_READY_MASK                        0x00040000
#define   PHYC_READY_SHIFT                               18
#define   PHYC_RESTORE_MASK                      0x00020000
#define   PHYC_RESTORE_SHIFT                             17
#define   PHYC_SAVE_MASK                         0x00010000
#define   PHYC_SAVE_SHIFT                                16
#define   PHY3_READY_MASK                        0x00004000
#define   PHY3_READY_SHIFT                               14
#define   PHY3_RESTORE_MASK                      0x00002000
#define   PHY3_RESTORE_SHIFT                             13
#define   PHY3_SAVE_MASK                         0x00001000
#define   PHY3_SAVE_SHIFT                                12
#define   PHY2_READY_MASK                        0x00000400
#define   PHY2_READY_SHIFT                               10
#define   PHY2_RESTORE_MASK                      0x00000200
#define   PHY2_RESTORE_SHIFT                              9
#define   PHY2_SAVE_MASK                         0x00000100
#define   PHY2_SAVE_SHIFT                                 8
#define   PHY1_READY_MASK                        0x00000040
#define   PHY1_READY_SHIFT                                6
#define   PHY1_RESTORE_MASK                      0x00000020
#define   PHY1_RESTORE_SHIFT                              5
#define   PHY1_SAVE_MASK                         0x00000010
#define   PHY1_SAVE_SHIFT                                 4
#define   PHY0_READY_MASK                        0x00000004
#define   PHY0_READY_SHIFT                                2
#define   PHY0_RESTORE_MASK                      0x00000002
#define   PHY0_RESTORE_SHIFT                              1
#define   PHY0_SAVE_MASK                         0x00000001
#define   PHY0_SAVE_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 phy0_save:1;
        u32 phy0_restore:1;
        u32 phy0_ready:1;
        u32 rsvd_3:1;
        u32 phy1_save:1;
        u32 phy1_restore:1;
        u32 phy1_ready:1;
        u32 rsvd_7:1;
        u32 phy2_save:1;
        u32 phy2_restore:1;
        u32 phy2_ready:1;
        u32 rsvd_11:1;
        u32 phy3_save:1;
        u32 phy3_restore:1;
        u32 phy3_ready:1;
        u32 rsvd_15:1;
        u32 phyc_save:1;
        u32 phyc_restore:1;
        u32 phyc_ready:1;
        u32 rsvd_19:13;
    } b;
} phy_pd_ctrl_t;

#define PHY0_SAVE_INFO_0                         0x000000ac
#define   SAVED_PHY0_INFO_0_MASK                 0xffffffff
#define   SAVED_PHY0_INFO_0_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy0_info_0:32;
    } b;
} phy0_save_info_0_t;

#define PHY0_SAVE_INFO_1                         0x000000b0
#define   SAVED_PHY0_INFO_1_MASK                 0xffffffff
#define   SAVED_PHY0_INFO_1_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy0_info_1:32;
    } b;
} phy0_save_info_1_t;

#define PHY0_SAVE_INFO_2                         0x000000b4
#define   SAVED_PHY0_INFO_2_MASK                 0xffffffff
#define   SAVED_PHY0_INFO_2_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy0_info_2:32;
    } b;
} phy0_save_info_2_t;

#define PHY0_SAVE_INFO_3                         0x000000b8
#define   SAVED_PHY0_INFO_3_MASK                 0xffffffff
#define   SAVED_PHY0_INFO_3_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy0_info_3:32;
    } b;
} phy0_save_info_3_t;

#define MISC_ANA_CTRL                            0x000000bc
#define   DIS_NVME_INIT_MASK                     0x00000020
#define   DIS_NVME_INIT_SHIFT                             5
#define   DIS_RAID_INIT_MASK                     0x00000010
#define   DIS_RAID_INIT_SHIFT                             4
#define   AUTO_LOAD_DIS_MASK                     0x00000008
#define   AUTO_LOAD_DIS_SHIFT                             3
#define   PD_TC_MASK                             0x00000004
#define   PD_TC_SHIFT                                     2
#define   AUX_PWR_DET_MASK                       0x00000001
#define   AUX_PWR_DET_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 aux_pwr_det:1;
        u32 rsvd_1:1;
        u32 pd_tc:1;
        u32 auto_load_dis:1;
        u32 dis_raid_init:1;
        u32 dis_nvme_init:1;
        u32 rsvd_6:26;
    } b;
} misc_ana_ctrl_t;

#define FW_STTS_0                                0x000000c0
#define   FW_STTS_0_MASK                         0xffffffff
#define   FW_STTS_0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_0:32;
    } b;
} fw_stts_0_t;

#define FW_STTS_1                                0x000000c4
#define   FW_STTS_1_MASK                         0xffffffff
#define   FW_STTS_1_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_1:32;
    } b;
} fw_stts_1_t;

#define FW_STTS_2                                0x000000c8
#define   FW_STTS_2_MASK                         0xffffffff
#define   FW_STTS_2_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_2:32;
    } b;
} fw_stts_2_t;

#define FW_STTS_3                                0x000000cc
#define   FW_STTS_3_MASK                         0xffffffff
#define   FW_STTS_3_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_3:32;
    } b;
} fw_stts_3_t;

#define FW_STTS_4                                0x000000d0
#define   FW_STTS_4_MASK                         0xffffffff
#define   FW_STTS_4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_4:32;
    } b;
} fw_stts_4_t;

#define FW_STTS_5                                0x000000d4
#define   FW_STTS_5_MASK                         0xffffffff
#define   FW_STTS_5_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_5:32;
    } b;
} fw_stts_5_t;

#define FW_STTS_6                                0x000000d8
#define   FW_STTS_6_MASK                         0xffffffff
#define   FW_STTS_6_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_6:32;
    } b;
} fw_stts_6_t;

#define FW_STTS_7                                0x000000dc
#define   FW_STTS_7_MASK                         0xffffffff
#define   FW_STTS_7_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_7:32;
    } b;
} fw_stts_7_t;

#define FW_STTS_8                                0x000000e0
#define   FW_STTS_8_MASK                         0xffffffff
#define   FW_STTS_8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_8:32;
    } b;
} fw_stts_8_t;

#define FW_STTS_9                                0x000000e4
#define   FW_STTS_9_MASK                         0xffffffff
#define   FW_STTS_9_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_9:32;
    } b;
} fw_stts_9_t;

#define FW_STTS_10                               0x000000e8
#define   FW_STTS_10_MASK                        0xffffffff
#define   FW_STTS_10_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_10:32;
    } b;
} fw_stts_10_t;

#define FW_STTS_11                               0x000000ec
#define   FW_STTS_11_MASK                        0xffffffff
#define   FW_STTS_11_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_11:32;
    } b;
} fw_stts_11_t;

#define FW_STTS_12                               0x000000f0
#define   FW_STTS_12_MASK                        0xffffffff
#define   FW_STTS_12_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_12:32;
    } b;
} fw_stts_12_t;

#define FW_STTS_13                               0x000000f4
#define   FW_STTS_13_MASK                        0xffffffff
#define   FW_STTS_13_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_13:32;
    } b;
} fw_stts_13_t;

#define FW_STTS_14                               0x000000f8
#define   FW_STTS_14_MASK                        0xffffffff
#define   FW_STTS_14_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_14:32;
    } b;
} fw_stts_14_t;

#define FW_STTS_15                               0x000000fc
#define   FW_STTS_15_MASK                        0xffffffff
#define   FW_STTS_15_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 fw_stts_15:32;
    } b;
} fw_stts_15_t;

#define PLL2_CTRL_0                              0x00000100
#define   PLL2_LOCK_MASK                         0x80000000
#define   PLL2_LOCK_SHIFT                                31
#define   PLL2_RDY_MASK                          0x40000000
#define   PLL2_RDY_SHIFT                                 30
#define   PLL2_POSTDIV2_MASK                     0x01c00000
#define   PLL2_POSTDIV2_SHIFT                            22
#define   PLL2_POSTDIV1_MASK                     0x00380000
#define   PLL2_POSTDIV1_SHIFT                            19
#define   PLL2_FBDIV_MASK                        0x0007ff80
#define   PLL2_FBDIV_SHIFT                                7
#define   PLL2_REFDIV_MASK                       0x0000007e
#define   PLL2_REFDIV_SHIFT                               1

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:1;
        u32 pll2_refdiv:6;
        u32 pll2_fbdiv:12;
        u32 pll2_postdiv1:3;
        u32 pll2_postdiv2:3;
        u32 rsvd_25:5;
        u32 pll2_rdy:1;
        u32 pll2_lock:1;
    } b;
} pll2_ctrl_0_t;

#define PLL2_CTRL_1                              0x00000104
#define   PLL2_EXT_VAL_MASK                      0xff000000
#define   PLL2_EXT_VAL_SHIFT                             24
#define   PLL2_FRAC_MASK                         0x00ffffff
#define   PLL2_FRAC_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 pll2_frac:24;
        u32 pll2_ext_val:8;
    } b;
} pll2_ctrl_1_t;

#define PLL2_CTRL_2                              0x00000108
#define   PLL2_RESETPTR_MASK                     0x00400000
#define   PLL2_RESETPTR_SHIFT                            22
#define   PLL2_SPREAD_MASK                       0x003e0000
#define   PLL2_SPREAD_SHIFT                              17
#define   PLL2_SSCG_DIVVAL_MASK                  0x0001f800
#define   PLL2_SSCG_DIVVAL_SHIFT                         11
#define   PLL2_SEL_EXTWAVE_MASK                  0x00000400
#define   PLL2_SEL_EXTWAVE_SHIFT                         10
#define   PLL2_DOWN_SPREAD_MASK                  0x00000200
#define   PLL2_DOWN_SPREAD_SHIFT                          9
#define   PLL2_BYPASS_MASK                       0x00000100
#define   PLL2_BYPASS_SHIFT                               8
#define   PLL2_FOUT2X_PD_MASK                    0x00000080
#define   PLL2_FOUT2X_PD_SHIFT                            7
#define   PLL2_4PHASE_PD_MASK                    0x00000040
#define   PLL2_4PHASE_PD_SHIFT                            6
#define   PLL2_POSTDIV_PD_MASK                   0x00000020
#define   PLL2_POSTDIV_PD_SHIFT                           5
#define   PLL2_DSMPD_MASK                        0x00000010
#define   PLL2_DSMPD_SHIFT                                4
#define   PLL2_DACPD_MASK                        0x00000008
#define   PLL2_DACPD_SHIFT                                3
#define   PLL2_DIS_SSCG_MASK                     0x00000004
#define   PLL2_DIS_SSCG_SHIFT                             2
#define   PLL2_RESET_MASK                        0x00000002
#define   PLL2_RESET_SHIFT                                1
#define   PLL2_PD_MASK                           0x00000001
#define   PLL2_PD_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 pll2_pd:1;
        u32 pll2_reset:1;
        u32 pll2_dis_sscg:1;
        u32 pll2_dacpd:1;
        u32 pll2_dsmpd:1;
        u32 pll2_postdiv_pd:1;
        u32 pll2_4phase_pd:1;
        u32 pll2_fout2x_pd:1;
        u32 pll2_bypass:1;
        u32 pll2_down_spread:1;
        u32 pll2_sel_extwave:1;
        u32 pll2_sscg_divval:6;
        u32 pll2_spread:5;
        u32 pll2_resetptr:1;
        u32 rsvd_23:9;
    } b;
} pll2_ctrl_2_t;

#define MEM_PS0_IDLE                             0x00000110
#define   MEM_PS0_IDLE_MASK                      0x01ffffff
#define   MEM_PS0_IDLE_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 mem_ps0_idle:25;
        u32 rsvd_25:7;
    } b;
} mem_ps0_idle_t;

#define MEM_PS1_IDLE                             0x00000114
#define   MEM_PS1_IDLE_MASK                      0x001fffff
#define   MEM_PS1_IDLE_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 mem_ps1_idle:21;
        u32 rsvd_21:11;
    } b;
} mem_ps1_idle_t;

#define MEM_PS2_IDLE                             0x00000118
#define   MEM_PS2_IDLE_MASK                      0x07ffffff
#define   MEM_PS2_IDLE_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 mem_ps2_idle:27;
        u32 rsvd_27:5;
    } b;
} mem_ps2_idle_t;

#define PMU_TIMER_CTRL                           0x00000120
#define   PMU_TIMER_HALTED_MASK                  0x00000008
#define   PMU_TIMER_HALTED_SHIFT                          3
#define   PMU_TIMER_RUN_MASK                     0x00000004
#define   PMU_TIMER_RUN_SHIFT                             2
#define   PMU_TIMER_RESET_MASK                   0x00000002
#define   PMU_TIMER_RESET_SHIFT                           1
#define   PMU_TIMER_EN_MASK                      0x00000001
#define   PMU_TIMER_EN_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 pmu_timer_en:1;
        u32 pmu_timer_reset:1;
        u32 pmu_timer_run:1;
        u32 pmu_timer_halted:1;
        u32 rsvd_4:28;
    } b;
} pmu_timer_ctrl_t;

#define PMU_TIMER                                0x00000124
#define   PMU_TIMER_MASK                         0x00ffffff
#define   PMU_TIMER_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 pmu_timer:24;
        u32 rsvd_24:8;
    } b;
} pmu_timer_t;

#define PMU_WAKE_TIME                            0x00000128
#define   PMU_WAKE_TIME_MASK                     0x00ffffff
#define   PMU_WAKE_TIME_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 pmu_wake_time:24;
        u32 rsvd_24:8;
    } b;
} pmu_wake_time_t;

#define GPIO_PAD_CTRL                            0x00000130
#define   GPIO_IN_MASK                           0xffff0000
#define   GPIO_IN_SHIFT                                  16
#define   GPIO_PULL_STATUS_MASK                  0x0000ffff
#define   GPIO_PULL_STATUS_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 gpio_pull_status:16;
        u32 gpio_in:16;
    } b;
} gpio_pad_ctrl_t;

#define TEST_CTRL                                0x00000134
#define   GPIO_PULL_ENABLE_MASK                  0xffff0000
#define   GPIO_PULL_ENABLE_SHIFT                         16
#define   TRACECLK_SEL_MASK                      0x00001000
#define   TRACECLK_SEL_SHIFT                             12
#define   ETM_SELETION_MASK                      0x00000800
#define   ETM_SELETION_SHIFT                             11
#define   GREEN_LED_BLINK_EN_MASK                0x00000400
#define   GREEN_LED_BLINK_EN_SHIFT                       10
#define   ETM_MODE_EN_MASK                       0x00000080
#define   ETM_MODE_EN_SHIFT                               7
#define   BOOT_DEBUG_EN_MASK                     0x00000040
#define   BOOT_DEBUG_EN_SHIFT                             6
#define   PCIE_TEST_RST_EN_MASK                  0x00000020
#define   PCIE_TEST_RST_EN_SHIFT                          5
#define   PCIE_TEST_CLK_EN_MASK                  0x00000010
#define   PCIE_TEST_CLK_EN_SHIFT                          4
#define   DEBUG_BUS_SEL_MASK                     0x0000000e
#define   DEBUG_BUS_SEL_SHIFT                             1
#define   DEBUG_BUS_EN_MASK                      0x00000001
#define   DEBUG_BUS_EN_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 debug_bus_en:1;
        u32 debug_bus_sel:3;
        u32 pcie_test_clk_en:1;
        u32 pcie_test_rst_en:1;
        u32 boot_debug_en:1;
        u32 etm_mode_en:1;
        u32 rsvd_8:2;
        u32 green_led_blink_en:1;
        u32 etm_seletion:1;
        u32 traceclk_sel:1;
        u32 rsvd_13:3;
        u32 gpio_pull_enable:16;
    } b;
} test_ctrl_t;

#define C2_SYS_INT_MASK                          0x00000140
#define   C2_SYS_INT_MASK_MASK                   0xffffffff
#define   C2_SYS_INT_MASK_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 c2_sys_int_mask:32;
    } b;
} c2_sys_int_mask_t;

#define C2_MASKED_SYS_INT                        0x00000144
#define   C2_MASKED_SYS_INT_MASK                 0xffffffff
#define   C2_MASKED_SYS_INT_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 c2_masked_sys_int:32;
    } b;
} c2_masked_sys_int_t;

#define C3_SYS_INT_MASK                          0x00000148
#define   C3_SYS_INT_MASK_MASK                   0xffffffff
#define   C3_SYS_INT_MASK_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 c3_sys_int_mask:32;
    } b;
} c3_sys_int_mask_t;

#define C3_MASKED_SYS_INT                        0x0000014c
#define   C3_MASKED_SYS_INT_MASK                 0xffffffff
#define   C3_MASKED_SYS_INT_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 c3_masked_sys_int:32;
    } b;
} c3_masked_sys_int_t;

#define C4_SYS_INT_MASK                          0x00000150
#define   C4_SYS_INT_MASK_MASK                   0xffffffff
#define   C4_SYS_INT_MASK_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 c4_sys_int_mask:32;
    } b;
} c4_sys_int_mask_t;

#define C4_MASKED_SYS_INT                        0x00000154
#define   C4_MASKED_SYS_INT_MASK                 0xffffffff
#define   C4_MASKED_SYS_INT_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 c4_masked_sys_int:32;
    } b;
} c4_masked_sys_int_t;

#define C5_SYS_INT_MASK                          0x00000158

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} c5_sys_int_mask_t;

#define C5_MASKED_SYS_INT                        0x0000015c

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} c5_masked_sys_int_t;

#define C6_SYS_INT_MASK                          0x00000160

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} c6_sys_int_mask_t;

#define C6_MASKED_SYS_INT                        0x00000164

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} c6_masked_sys_int_t;

#define C7_SYS_INT_MASK                          0x00000168

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} c7_sys_int_mask_t;

#define C7_MASKED_SYS_INT                        0x0000016c

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} c7_masked_sys_int_t;

#define C8_SYS_INT_MASK                          0x00000170

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} c8_sys_int_mask_t;

#define C8_MASKED_SYS_INT                        0x00000174

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} c8_masked_sys_int_t;

#define PAD_CTRL1                                0x00000178
#define   XTAL_PAD_REF_MASK                      0x00c00000
#define   XTAL_PAD_REF_SHIFT                             22
#define   XTAL_PAD_RD_MASK                       0x00300000
#define   XTAL_PAD_RD_SHIFT                              20
#define   XTAL_PAD_DS_MASK                       0x000f0000
#define   XTAL_PAD_DS_SHIFT                              16
#define   PERIPH_PAD_DS_MASK                     0x0000f000
#define   PERIPH_PAD_DS_SHIFT                            12
#define   JTAG_PAD_DS_MASK                       0x00000f00
#define   JTAG_PAD_DS_SHIFT                               8
#define   GPIO_PAD_DS_MASK                       0x000000f0
#define   GPIO_PAD_DS_SHIFT                               4
#define   PCIE_PAD_DS_MASK                       0x0000000f
#define   PCIE_PAD_DS_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 pcie_pad_ds:4;
        u32 gpio_pad_ds:4;
        u32 jtag_pad_ds:4;
        u32 periph_pad_ds:4;
        u32 xtal_pad_ds:4;
        u32 xtal_pad_rd:2;
        u32 xtal_pad_ref:2;
        u32 rsvd_24:8;
    } b;
} pad_ctrl1_t;

#define CNFG0_ID_VER                             0x0000017c
#define   CNFG0_ID_VER_MASK                      0xffffffff
#define   CNFG0_ID_VER_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cnfg0_id_ver:32;
    } b;
} cnfg0_id_ver_t;

#define CNFG1_ID_VER                             0x00000180
#define   CNFG1_ID_VER_MASK                      0xffffffff
#define   CNFG1_ID_VER_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cnfg1_id_ver:32;
    } b;
} cnfg1_id_ver_t;

#define PHY0_SAVE_INFO_4                         0x00000184
#define   SAVED_PHY0_INFO_4_MASK                 0xffffffff
#define   SAVED_PHY0_INFO_4_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy0_info_4:32;
    } b;
} phy0_save_info_4_t;

#define PHY0_SAVE_INFO_5                         0x00000188
#define   SAVED_PHY0_INFO_5_MASK                 0xffffffff
#define   SAVED_PHY0_INFO_5_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy0_info_5:32;
    } b;
} phy0_save_info_5_t;

#define PHY0_SAVE_INFO_6                         0x0000018c
#define   SAVED_PHY0_INFO_6_MASK                 0xffffffff
#define   SAVED_PHY0_INFO_6_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy0_info_6:32;
    } b;
} phy0_save_info_6_t;

#define PHY1_SAVE_INFO_0                         0x00000190
#define   SAVED_PHY1_INFO_0_MASK                 0xffffffff
#define   SAVED_PHY1_INFO_0_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy1_info_0:32;
    } b;
} phy1_save_info_0_t;

#define PHY1_SAVE_INFO_1                         0x00000194
#define   SAVED_PHY1_INFO_1_MASK                 0xffffffff
#define   SAVED_PHY1_INFO_1_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy1_info_1:32;
    } b;
} phy1_save_info_1_t;

#define PHY1_SAVE_INFO_2                         0x00000198
#define   SAVED_PHY1_INFO_2_MASK                 0xffffffff
#define   SAVED_PHY1_INFO_2_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy1_info_2:32;
    } b;
} phy1_save_info_2_t;

#define PHY1_SAVE_INFO_3                         0x0000019c
#define   SAVED_PHY1_INFO_3_MASK                 0xffffffff
#define   SAVED_PHY1_INFO_3_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy1_info_3:32;
    } b;
} phy1_save_info_3_t;

#define PHY1_SAVE_INFO_4                         0x000001a0
#define   SAVED_PHY1_INFO_4_MASK                 0xffffffff
#define   SAVED_PHY1_INFO_4_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy1_info_4:32;
    } b;
} phy1_save_info_4_t;

#define PHY1_SAVE_INFO_5                         0x000001a4
#define   SAVED_PHY1_INFO_5_MASK                 0xffffffff
#define   SAVED_PHY1_INFO_5_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy1_info_5:32;
    } b;
} phy1_save_info_5_t;

#define PHY1_SAVE_INFO_6                         0x000001a8
#define   SAVED_PHY1_INFO_6_MASK                 0xffffffff
#define   SAVED_PHY1_INFO_6_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy1_info_6:32;
    } b;
} phy1_save_info_6_t;

#define PHY2_SAVE_INFO_0                         0x000001ac
#define   SAVED_PHY2_INFO_0_MASK                 0xffffffff
#define   SAVED_PHY2_INFO_0_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy2_info_0:32;
    } b;
} phy2_save_info_0_t;

#define PHY2_SAVE_INFO_1                         0x000001b0
#define   SAVED_PHY2_INFO_1_MASK                 0xffffffff
#define   SAVED_PHY2_INFO_1_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy2_info_1:32;
    } b;
} phy2_save_info_1_t;

#define PHY2_SAVE_INFO_2                         0x000001b4
#define   SAVED_PHY2_INFO_2_MASK                 0xffffffff
#define   SAVED_PHY2_INFO_2_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy2_info_2:32;
    } b;
} phy2_save_info_2_t;

#define PHY2_SAVE_INFO_3                         0x000001b8
#define   SAVED_PHY2_INFO_3_MASK                 0xffffffff
#define   SAVED_PHY2_INFO_3_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy2_info_3:32;
    } b;
} phy2_save_info_3_t;

#define PHY2_SAVE_INFO_4                         0x000001bc
#define   SAVED_PHY2_INFO_4_MASK                 0xffffffff
#define   SAVED_PHY2_INFO_4_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy2_info_4:32;
    } b;
} phy2_save_info_4_t;

#define PHY2_SAVE_INFO_5                         0x000001c0
#define   SAVED_PHY2_INFO_5_MASK                 0xffffffff
#define   SAVED_PHY2_INFO_5_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy2_info_5:32;
    } b;
} phy2_save_info_5_t;

#define PHY2_SAVE_INFO_6                         0x000001c4
#define   SAVED_PHY2_INFO_6_MASK                 0xffffffff
#define   SAVED_PHY2_INFO_6_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy2_info_6:32;
    } b;
} phy2_save_info_6_t;

#define PHY3_SAVE_INFO_0                         0x000001c8
#define   SAVED_PHY3_INFO_0_MASK                 0xffffffff
#define   SAVED_PHY3_INFO_0_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy3_info_0:32;
    } b;
} phy3_save_info_0_t;

#define PHY3_SAVE_INFO_1                         0x000001cc
#define   SAVED_PHY3_INFO_1_MASK                 0xffffffff
#define   SAVED_PHY3_INFO_1_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy3_info_1:32;
    } b;
} phy3_save_info_1_t;

#define PHY3_SAVE_INFO_2                         0x000001d0
#define   SAVED_PHY3_INFO_2_MASK                 0xffffffff
#define   SAVED_PHY3_INFO_2_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy3_info_2:32;
    } b;
} phy3_save_info_2_t;

#define PHY3_SAVE_INFO_3                         0x000001d4
#define   SAVED_PHY3_INFO_3_MASK                 0xffffffff
#define   SAVED_PHY3_INFO_3_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy3_info_3:32;
    } b;
} phy3_save_info_3_t;

#define PHY3_SAVE_INFO_4                         0x000001d8
#define   SAVED_PHY3_INFO_4_MASK                 0xffffffff
#define   SAVED_PHY3_INFO_4_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy3_info_4:32;
    } b;
} phy3_save_info_4_t;

#define PHY3_SAVE_INFO_5                         0x000001dc
#define   SAVED_PHY3_INFO_5_MASK                 0xffffffff
#define   SAVED_PHY3_INFO_5_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy3_info_5:32;
    } b;
} phy3_save_info_5_t;

#define PHY3_SAVE_INFO_6                         0x000001e0
#define   SAVED_PHY3_INFO_6_MASK                 0xffffffff
#define   SAVED_PHY3_INFO_6_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phy3_info_6:32;
    } b;
} phy3_save_info_6_t;

#define PHYC_SAVE_INFO_0                         0x000001e4
#define   SAVED_PHYC_INFO_0_MASK                 0xffffffff
#define   SAVED_PHYC_INFO_0_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phyc_info_0:32;
    } b;
} phyc_save_info_0_t;

#define PHYC_SAVE_INFO_1                         0x000001e8
#define   SAVED_PHYC_INFO_1_MASK                 0xffffffff
#define   SAVED_PHYC_INFO_1_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phyc_info_1:32;
    } b;
} phyc_save_info_1_t;

#define PHYC_SAVE_INFO_2                         0x000001ec
#define   SAVED_PHYC_INFO_2_MASK                 0xffffffff
#define   SAVED_PHYC_INFO_2_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 saved_phyc_info_2:32;
    } b;
} phyc_save_info_2_t;

#define WDT_RST_INT_STS                          0x000001f4
#define   WDT_RESET_REQ_INT_STS_MASK             0x0000000f
#define   WDT_RESET_REQ_INT_STS_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 wdt_reset_req_int_sts:4;
        u32 rsvd_4:28;
    } b;
} wdt_rst_int_sts_t;

#define SMB_WAKEUP_CTRL                          0x000001f8
#define   SMB_DEV_WAKEUP_MASK                    0x00020000
#define   SMB_DEV_WAKEUP_SHIFT                           17
#define   SMB_WAKEUP_DONE_MASK                   0x00010000
#define   SMB_WAKEUP_DONE_SHIFT                          16
#define   SMB_CUR_DEV_ADDR_MASK                  0x0000fe00
#define   SMB_CUR_DEV_ADDR_SHIFT                          9
#define   SMB_WAKEUP_ADDR_MASK                   0x000001fc
#define   SMB_WAKEUP_ADDR_SHIFT                           2
#define   SMB_CLK_STRETCH_DIS_MASK               0x00000002
#define   SMB_CLK_STRETCH_DIS_SHIFT                       1
#define   SMB_PWR_UP_MASK                        0x00000001
#define   SMB_PWR_UP_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_pwr_up:1;
        u32 smb_clk_stretch_dis:1;
        u32 smb_wakeup_addr:7;
        u32 smb_cur_dev_addr:7;
        u32 smb_wakeup_done:1;
        u32 smb_dev_wakeup:1;
        u32 rsvd_18:14;
    } b;
} smb_wakeup_ctrl_t;

#define SHARED_TIMER1_CTRL                       0x00000240
#define   SHARED_TIMER1_RESET_MASK               0x00000002
#define   SHARED_TIMER1_RESET_SHIFT                       1
#define   SHARED_TIMER1_START_MASK               0x00000001
#define   SHARED_TIMER1_START_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 shared_timer1_start:1;
        u32 shared_timer1_reset:1;
        u32 rsvd_2:30;
    } b;
} shared_timer1_ctrl_t;

#define SHARED_TIMER1_VAL_L                      0x00000244
#define   SHARED_TIMER1_VAL_LOW_MASK             0xffffffff
#define   SHARED_TIMER1_VAL_LOW_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 shared_timer1_val_low:32;
    } b;
} shared_timer1_val_l_t;

#define SHARED_TIMER1_VAL_H                      0x00000248
#define   SHARED_TIMER1_VAL_H_MASK               0xffffffff
#define   SHARED_TIMER1_VAL_H_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 shared_timer1_val_h:32;
    } b;
} shared_timer1_val_h_t;

#define TS_THRESH2                               0x0000024c
#define   LOW_TEMP_TH2_MASK                      0x00fff000
#define   LOW_TEMP_TH2_SHIFT                             12
#define   HIGH_TEMP_TH2_MASK                     0x00000fff
#define   HIGH_TEMP_TH2_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 high_temp_th2:12;
        u32 low_temp_th2:12;
        u32 rsvd_24:8;
    } b;
} ts_thresh2_t;

#define TS_CTRL                                  0x00000250
#define   TS_RDY_MASK                            0x80000000
#define   TS_RDY_SHIFT                                   31
#define   TS_CS_MASK                             0x78000000
#define   TS_CS_SHIFT                                    27
#define   TS_DOUT_TYPE_MASK                      0x04000000
#define   TS_DOUT_TYPE_SHIFT                             26
#define   SAVE_DATA_MODE_MASK                    0x00100000
#define   SAVE_DATA_MODE_SHIFT                           20
#define   RUN_CYCLE_CNT_MASK                     0x000e0000
#define   RUN_CYCLE_CNT_SHIFT                            17
#define   CLK_HALF_CYCLE_CNT_MASK                0x0000ff00
#define   CLK_HALF_CYCLE_CNT_SHIFT                        8
#define   TS_NUM_RUN_MASK                        0x000000c0
#define   TS_NUM_RUN_SHIFT                                6
#define   TS_MODE_MASK                           0x00000010
#define   TS_MODE_SHIFT                                   4
#define   TS_START_MASK                          0x00000008
#define   TS_START_SHIFT                                  3
#define   TS_CLK_EN_MASK                         0x00000004
#define   TS_CLK_EN_SHIFT                                 2
#define   TS_RSTN_MASK                           0x00000002
#define   TS_RSTN_SHIFT                                   1
#define   TS_PWR_ON_MASK                         0x00000001
#define   TS_PWR_ON_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 ts_pwr_on:1;
        u32 ts_rstn:1;
        u32 ts_clk_en:1;
        u32 ts_start:1;
        u32 ts_mode:1;
        u32 rsvd_5:1;
        u32 ts_num_run:2;
        u32 clk_half_cycle_cnt:8;
        u32 rsvd_16:1;
        u32 run_cycle_cnt:3;
        u32 save_data_mode:1;
        u32 rsvd_21:5;
        u32 ts_dout_type:1;
        u32 ts_cs:4;
        u32 ts_rdy:1;
    } b;
} ts_ctrl_t;

#define TS_TIME                                  0x00000254
#define   TS_CFG_MASK                            0xff000000
#define   TS_CFG_SHIFT                                   24
#define   TS_CLOAD_MASK                          0x00800000
#define   TS_CLOAD_SHIFT                                 23
#define   TS_AN_SEL_MASK                         0x00780000
#define   TS_AN_SEL_SHIFT                                19
#define   TS_AN_EN_MASK                          0x00040000
#define   TS_AN_EN_SHIFT                                 18
#define   RUN_INTERVAL_MASK                      0x0003ff00
#define   RUN_INTERVAL_SHIFT                              8
#define   PU_TIME_MASK                           0x000000ff
#define   PU_TIME_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 pu_time:8;
        u32 run_interval:10;
        u32 ts_an_en:1;
        u32 ts_an_sel:4;
        u32 ts_cload:1;
        u32 ts_cfg:8;
    } b;
} ts_time_t;

#define TS_THRESH1                               0x00000258
#define   INT_EN_MASK                            0x3f000000
#define   INT_EN_SHIFT                                   24
#define   LOW_TEMP_TH1_MASK                      0x00fff000
#define   LOW_TEMP_TH1_SHIFT                             12
#define   HIGH_TEMP_TH1_MASK                     0x00000fff
#define   HIGH_TEMP_TH1_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 high_temp_th1:12;
        u32 low_temp_th1:12;
        u32 int_en:6;
        u32 rsvd_30:2;
    } b;
} ts_thresh1_t;

#define TS_INT                                   0x0000025c
#define   TS_DOUT_MASK                           0x0fff0000
#define   TS_DOUT_SHIFT                                  16
#define   TS_BELOW_TH2_MASK                      0x00000020
#define   TS_BELOW_TH2_SHIFT                              5
#define   TS_ABOVE_TH2_MASK                      0x00000010
#define   TS_ABOVE_TH2_SHIFT                              4
#define   TS_FAULT_MASK                          0x00000008
#define   TS_FAULT_SHIFT                                  3
#define   TS_BELOW_TH1_MASK                      0x00000004
#define   TS_BELOW_TH1_SHIFT                              2
#define   TS_ABOVE_TH1_MASK                      0x00000002
#define   TS_ABOVE_TH1_SHIFT                              1
#define   TS_DOUT_RDY_MASK                       0x00000001
#define   TS_DOUT_RDY_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 ts_dout_rdy:1;
        u32 ts_above_th1:1;
        u32 ts_below_th1:1;
        u32 ts_fault:1;
        u32 ts_above_th2:1;
        u32 ts_below_th2:1;
        u32 rsvd_6:10;
        u32 ts_dout:12;
        u32 rsvd_28:4;
    } b;
} ts_int_t;

#define TRNG_CTRL_STTS                           0x00000260
#define   W5_SECURE_MASK                         0x80000000
#define   W5_SECURE_SHIFT                                31
#define   W5_REMINDER_MASK                       0x40000000
#define   W5_REMINDER_SHIFT                              30
#define   W5_RESEEDING_MASK                      0x20000000
#define   W5_RESEEDING_SHIFT                             29
#define   W5_SEEDED_MASK                         0x10000000
#define   W5_SEEDED_SHIFT                                28
#define   W5_RAND_BIT_MASK                       0x08000000
#define   W5_RAND_BIT_SHIFT                              27
#define   W5_RAND_VLD_MASK                       0x04000000
#define   W5_RAND_VLD_SHIFT                              26
#define   TRNG_TEST_MASK                         0x00000f00
#define   TRNG_TEST_SHIFT                                 8
#define   TRNG_SWITCH_MASK                       0x00000080
#define   TRNG_SWITCH_SHIFT                               7
#define   TRNG_INT_260_MASK                      0x00000008
#define   TRNG_INT_260_SHIFT                              3
#define   RESEED_MASK                            0x00000004
#define   RESEED_SHIFT                                    2
#define   ZEROIZE_MASK                           0x00000002
#define   ZEROIZE_SHIFT                                   1
#define   TRNG_RESET_MASK                        0x00000001
#define   TRNG_RESET_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 trng_reset:1;
        u32 zeroize:1;
        u32 reseed:1;
        u32 trng_int_260:1;
        u32 rsvd_4:3;
        u32 trng_switch:1;
        u32 trng_test:4;
        u32 rsvd_12:14;
        u32 w5_rand_vld:1;
        u32 w5_rand_bit:1;
        u32 w5_seeded:1;
        u32 w5_reseeding:1;
        u32 w5_reminder:1;
        u32 w5_secure:1;
    } b;
} trng_ctrl_stts_t;

#define TRNG_BM_CTRL                             0x00000264
#define   TRNG_CLEAR_MASK                        0x00000040
#define   TRNG_CLEAR_SHIFT                                6
#define   TRNG_GEN_REQ_MASK                      0x00000020
#define   TRNG_GEN_REQ_SHIFT                              5
#define   TRNG_PROTECT_MASK                      0x00000010
#define   TRNG_PROTECT_SHIFT                              4
#define   TRNG_BM_CS_MASK                        0x0000000e
#define   TRNG_BM_CS_SHIFT                                1
#define   TRNG_BM_RESET_MASK                     0x00000001
#define   TRNG_BM_RESET_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 trng_bm_reset:1;
        u32 trng_bm_cs:3;
        u32 trng_protect:1;
        u32 trng_gen_req:1;
        u32 trng_clear:1;
        u32 rsvd_7:25;
    } b;
} trng_bm_ctrl_t;

#define RAID_INIT_CTRL                           0x00000268
#define   RAIDM_INIT_SIZE_MASK                   0xfffe0000
#define   RAIDM_INIT_SIZE_SHIFT                          17
#define   RAIDM_INIT_ADDR_MASK                   0x0001fffc
#define   RAIDM_INIT_ADDR_SHIFT                           2
#define   RAIDM_INIT_DONE_MASK                   0x00000002
#define   RAIDM_INIT_DONE_SHIFT                           1
#define   RAIDM_INIT_ST_MASK                     0x00000001
#define   RAIDM_INIT_ST_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 raidm_init_st:1;
        u32 raidm_init_done:1;
        u32 raidm_init_addr:15;
        u32 raidm_init_size:15;
    } b;
} raid_init_ctrl_t;

#define BLK_CLK_GATE                             0x0000026c
#define   DXFR_CLK_GATE_EN_MASK                  0x00000200
#define   DXFR_CLK_GATE_EN_SHIFT                          9
#define   DXFR_MEM_LP_EN_MASK                    0x00000100
#define   DXFR_MEM_LP_EN_SHIFT                            8
#define   MEM_LOW_PMODE_MASK                     0x00000080
#define   MEM_LOW_PMODE_SHIFT                             7
#define   MEM_TFPMC_MASK                         0x0000007f
#define   MEM_TFPMC_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 mem_tfpmc:7;
        u32 mem_low_pmode:1;
        u32 dxfr_mem_lp_en:1;
        u32 dxfr_clk_gate_en:1;
        u32 rsvd_10:22;
    } b;
} blk_clk_gate_t;

#define RAIDM_ERR_INJ                            0x00000270
#define   RAIDM_2ND_ERR_INJ_LOC_MASK             0xff000000
#define   RAIDM_2ND_ERR_INJ_LOC_SHIFT                    24
#define   RAIDM_1ST_ERR_INJ_LOC_MASK             0x00ff0000
#define   RAIDM_1ST_ERR_INJ_LOC_SHIFT                    16
#define   INJECT_2BIT_ERR_MASK                   0x00000004
#define   INJECT_2BIT_ERR_SHIFT                           2
#define   INJECT_1BIT_ERR_MASK                   0x00000002
#define   INJECT_1BIT_ERR_SHIFT                           1
#define   ERR_INJECT_EN_MASK                     0x00000001
#define   ERR_INJECT_EN_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 err_inject_en:1;
        u32 inject_1bit_err:1;
        u32 inject_2bit_err:1;
        u32 rsvd_3:13;
        u32 raidm_1st_err_inj_loc:8;
        u32 raidm_2nd_err_inj_loc:8;
    } b;
} raidm_err_inj_t;

#define RAIDM_ERR_STTS0                          0x00000274
#define   RAIDM_ERR_LOC0_MASK                    0x00003ffc
#define   RAIDM_ERR_LOC0_SHIFT                            2
#define   RAIDM_ERR_FOUND0_MASK                  0x00000002
#define   RAIDM_ERR_FOUND0_SHIFT                          1
#define   RAIDM_ERR_INT_EN_MASK                  0x00000001
#define   RAIDM_ERR_INT_EN_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 raidm_err_int_en:1;
        u32 raidm_err_found0:1;
        u32 raidm_err_loc0:12;
        u32 rsvd_14:18;
    } b;
} raidm_err_stts0_t;

#define PHY_ADDRESS                              0x00000280
#define   PHY_REG_ADDRESS_MASK                   0x00000fff
#define   PHY_REG_ADDRESS_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 phy_reg_address:12;
        u32 rsvd_12:20;
    } b;
} phy_address_t;

#define PHY_DATA                                 0x00000284
#define   PHY_REG_DATA_MASK                      0xffffffff
#define   PHY_REG_DATA_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 phy_reg_data:32;
    } b;
} phy_data_t;

#define FATAL_ERR                                0x00000290
#define   RAIDM_WR_ERR_MASK                      0x00000800
#define   RAIDM_WR_ERR_SHIFT                             11
#define   RAIDM_RD_ERR_MASK                      0x00000400
#define   RAIDM_RD_ERR_SHIFT                             10
#define   FSPM0_WR_ERR_MASK                      0x00000080
#define   FSPM0_WR_ERR_SHIFT                              7
#define   FSPM0_RD_ERR_MASK                      0x00000040
#define   FSPM0_RD_ERR_SHIFT                              6
#define   BM_RAM_PERR_MASK                       0x00000020
#define   BM_RAM_PERR_SHIFT                               5
#define   CMD_PROC_BUS_PERR_MASK                 0x00000010
#define   CMD_PROC_BUS_PERR_SHIFT                         4
#define   CMD_PROC_RAM_PERR_MASK                 0x00000008
#define   CMD_PROC_RAM_PERR_SHIFT                         3
#define   NVM_CTRL_BUS_PERR_MASK                 0x00000004
#define   NVM_CTRL_BUS_PERR_SHIFT                         2
#define   NVM_CTRL_RAM_PERR_MASK                 0x00000002
#define   NVM_CTRL_RAM_PERR_SHIFT                         1
#define   SRAM_RD_ECC_ERR_MASK                   0x00000001
#define   SRAM_RD_ECC_ERR_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 sram_rd_ecc_err:1;
        u32 nvm_ctrl_ram_perr:1;
        u32 nvm_ctrl_bus_perr:1;
        u32 cmd_proc_ram_perr:1;
        u32 cmd_proc_bus_perr:1;
        u32 bm_ram_perr:1;
        u32 fspm0_rd_err:1;
        u32 fspm0_wr_err:1;
        u32 rsvd_8:2;
        u32 raidm_rd_err:1;
        u32 raidm_wr_err:1;
        u32 rsvd_12:20;
    } b;
} fatal_err_t;

#define FATAL_ERR_INT_EN                         0x00000294
#define   FATAL_ERR_INT_EN_MASK                  0x00000fff
#define   FATAL_ERR_INT_EN_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 fatal_err_int_en:12;
        u32 rsvd_12:20;
    } b;
} fatal_err_int_en_t;

#define NVM_ABT_MODE                             0x00000298
#define   NVM_ABT_MODE_MASK                      0x0000001f
#define   NVM_ABT_MODE_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nvm_abt_mode:5;
        u32 rsvd_5:27;
    } b;
} nvm_abt_mode_t;

#define NVM_ABT_CTRL                             0x0000029c
#define   NVME_CTRL_IDLE_MASK                    0x00001000
#define   NVME_CTRL_IDLE_SHIFT                           12
#define   CMD_PROC_IDLE_MASK                     0x00000800
#define   CMD_PROC_IDLE_SHIFT                            11
#define   CMD_PROC_PCIE_IDLE_MASK                0x00000400
#define   CMD_PROC_PCIE_IDLE_SHIFT                       10
#define   NVM_IDLE_MASK                          0x00000200
#define   NVM_IDLE_SHIFT                                  9
#define   NVM_PCIE_IDLE_MASK                     0x00000100
#define   NVM_PCIE_IDLE_SHIFT                             8
#define   ABT_SRC_FATAL_ERR_MASK                 0x00000020
#define   ABT_SRC_FATAL_ERR_SHIFT                         5
#define   ABT_SRC_SD_ABR_MASK                    0x00000010
#define   ABT_SRC_SD_ABR_SHIFT                            4
#define   ABT_SRC_SD_NRM_MASK                    0x00000008
#define   ABT_SRC_SD_NRM_SHIFT                            3
#define   ABT_SRC_SUB_RST_MASK                   0x00000004
#define   ABT_SRC_SUB_RST_SHIFT                           2
#define   ABT_SRC_CCEN_MASK                      0x00000002
#define   ABT_SRC_CCEN_SHIFT                              1
#define   NVM_CTRL_RST_MASK                      0x00000001
#define   NVM_CTRL_RST_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 nvm_ctrl_rst:1;
        u32 abt_src_ccen:1;
        u32 abt_src_sub_rst:1;
        u32 abt_src_sd_nrm:1;
        u32 abt_src_sd_abr:1;
        u32 abt_src_fatal_err:1;
        u32 rsvd_6:2;
        u32 nvm_pcie_idle:1;
        u32 nvm_idle:1;
        u32 cmd_proc_pcie_idle:1;
        u32 cmd_proc_idle:1;
        u32 nvme_ctrl_idle:1;
        u32 rsvd_13:19;
    } b;
} nvm_abt_ctrl_t;

#define CLK_FREQ_CTRL0                           0x000002a0
#define   XTAL_CLK_CNT_DONE_MASK                 0x00020000
#define   XTAL_CLK_CNT_DONE_SHIFT                        17
#define   XTAL_CLK_CNT_EN_MASK                   0x00010000
#define   XTAL_CLK_CNT_EN_SHIFT                          16
#define   XTAL_CLK_CNT_WINDOW_MASK               0x0000ffff
#define   XTAL_CLK_CNT_WINDOW_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 xtal_clk_cnt_window:16;
        u32 xtal_clk_cnt_en:1;
        u32 xtal_clk_cnt_done:1;
        u32 rsvd_18:14;
    } b;
} clk_freq_ctrl0_t;

#define CLK_FREQ_CTRL1                           0x000002a4
#define   CLK_CNT3_SRC_SEL_MASK                  0x00c00000
#define   CLK_CNT3_SRC_SEL_SHIFT                         22
#define   CLK_CNT2_SRC_SEL_MASK                  0x00300000
#define   CLK_CNT2_SRC_SEL_SHIFT                         20
#define   CLK_CNT1_SRC_SEL_MASK                  0x000c0000
#define   CLK_CNT1_SRC_SEL_SHIFT                         18
#define   CLK_CNT0_SRC_SEL_MASK                  0x00030000
#define   CLK_CNT0_SRC_SEL_SHIFT                         16
#define   CLK_CNT3_DIV_SEL_MASK                  0x0000c000
#define   CLK_CNT3_DIV_SEL_SHIFT                         14
#define   CLK_CNT2_DIV_SEL_MASK                  0x00003000
#define   CLK_CNT2_DIV_SEL_SHIFT                         12
#define   CLK_CNT1_DIV_SEL_MASK                  0x00000c00
#define   CLK_CNT1_DIV_SEL_SHIFT                         10
#define   CLK_CNT0_DIV_SEL_MASK                  0x00000300
#define   CLK_CNT0_DIV_SEL_SHIFT                          8

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:8;
        u32 clk_cnt0_div_sel:2;
        u32 clk_cnt1_div_sel:2;
        u32 clk_cnt2_div_sel:2;
        u32 clk_cnt3_div_sel:2;
        u32 clk_cnt0_src_sel:2;
        u32 clk_cnt1_src_sel:2;
        u32 clk_cnt2_src_sel:2;
        u32 clk_cnt3_src_sel:2;
        u32 rsvd_24:8;
    } b;
} clk_freq_ctrl1_t;

#define CLK_FREQ_CNT0                            0x000002a8
#define   CLK_CNT0_VAL_MASK                      0xffff0000
#define   CLK_CNT0_VAL_SHIFT                             16
#define   CLK_CNT1_VAL_MASK                      0x0000ffff
#define   CLK_CNT1_VAL_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 clk_cnt1_val:16;
        u32 clk_cnt0_val:16;
    } b;
} clk_freq_cnt0_t;

#define CLK_FREQ_CNT1                            0x000002ac
#define   CLK_CNT2_VAL_MASK                      0xffff0000
#define   CLK_CNT2_VAL_SHIFT                             16
#define   CLK_CNT3_VAL_MASK                      0x0000ffff
#define   CLK_CNT3_VAL_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 clk_cnt3_val:16;
        u32 clk_cnt2_val:16;
    } b;
} clk_freq_cnt1_t;

#define PRCS_MNTR_CTRL1                          0x000002b0
#define   PRCS_MNTR_START_MASK                   0x80000000
#define   PRCS_MNTR_START_SHIFT                          31
#define   PRCS_MNTR_INTR_MASK                    0x40000000
#define   PRCS_MNTR_INTR_SHIFT                           30
#define   PRCS_MNTR_CLR_MASK                     0x20000000
#define   PRCS_MNTR_CLR_SHIFT                            29
#define   PRCS_MNTR_DURATION_MASK                0x0000ffff
#define   PRCS_MNTR_DURATION_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 prcs_mntr_duration:16;
        u32 rsvd_16:13;
        u32 prcs_mntr_clr:1;
        u32 prcs_mntr_intr:1;
        u32 prcs_mntr_start:1;
    } b;
} prcs_mntr_ctrl1_t;

#define PRCS_MNTR_CTRL2                          0x000002b4
#define   PRCS_MNTR0_CNT_VAL_MASK                0x000fffff
#define   PRCS_MNTR0_CNT_VAL_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 prcs_mntr0_cnt_val:20;
        u32 rsvd_20:12;
    } b;
} prcs_mntr_ctrl2_t;

#define PRCS_MNTR_CTRL3                          0x000002b8
#define   PRCS_MNTR1_CNT_VAL_MASK                0x000fffff
#define   PRCS_MNTR1_CNT_VAL_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 prcs_mntr1_cnt_val:20;
        u32 rsvd_20:12;
    } b;
} prcs_mntr_ctrl3_t;

#define PRCS_MNTR_CTRL4                          0x000002bc
#define   PRCS_MNTR2_CNT_VAL_MASK                0x000fffff
#define   PRCS_MNTR2_CNT_VAL_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 prcs_mntr2_cnt_val:20;
        u32 rsvd_20:12;
    } b;
} prcs_mntr_ctrl4_t;

#define PRCS_MNTR_CTRL5                          0x000002c0
#define   PRCS_MNTR3_CNT_VAL_MASK                0x000fffff
#define   PRCS_MNTR3_CNT_VAL_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 prcs_mntr3_cnt_val:20;
        u32 rsvd_20:12;
    } b;
} prcs_mntr_ctrl5_t;

#define RAIDM_ERR_STTS1                          0x000002c4
#define   RAIDM_ERR_LOC1_MASK                    0x00003ffc
#define   RAIDM_ERR_LOC1_SHIFT                            2
#define   RAIDM_ERR_FOUND1_MASK                  0x00000002
#define   RAIDM_ERR_FOUND1_SHIFT                          1

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:1;
        u32 raidm_err_found1:1;
        u32 raidm_err_loc1:12;
        u32 rsvd_14:18;
    } b;
} raidm_err_stts1_t;

#define RAIDM_ERR_STTS2                          0x000002c8
#define   RAIDM_ERR_LOC2_MASK                    0x00003ffc
#define   RAIDM_ERR_LOC2_SHIFT                            2
#define   RAIDM_ERR_FOUND2_MASK                  0x00000002
#define   RAIDM_ERR_FOUND2_SHIFT                          1

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:1;
        u32 raidm_err_found2:1;
        u32 raidm_err_loc2:12;
        u32 rsvd_14:18;
    } b;
} raidm_err_stts2_t;

#define RAIDM_ERR_STTS3                          0x000002cc
#define   RAIDM_ERR_LOC3_MASK                    0x00003ffc
#define   RAIDM_ERR_LOC3_SHIFT                            2
#define   RAIDM_ERR_FOUND3_MASK                  0x00000002
#define   RAIDM_ERR_FOUND3_SHIFT                          1

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:1;
        u32 raidm_err_found3:1;
        u32 raidm_err_loc3:12;
        u32 rsvd_14:18;
    } b;
} raidm_err_stts3_t;

#define RAIDM_CPU_CNFG0                          0x000002d0
#define   RAIDM_DEC_SIZE_MASK                    0x1fff0000
#define   RAIDM_DEC_SIZE_SHIFT                           16
#define   RAIDM_BANK_SIZE_MASK                   0x00001fff
#define   RAIDM_BANK_SIZE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 raidm_bank_size:13;
        u32 rsvd_13:3;
        u32 raidm_dec_size:13;
        u32 rsvd_29:3;
    } b;
} raidm_cpu_cnfg0_t;

#define NVDLA_INT_MASK                           0x000002d4

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} nvdla_int_mask_t;

#define FSPM_SRAM0_ERR_STTS                      0x000002d8
#define   FSPM_SRAM0_ERR_LOC_MASK                0x0000fffc
#define   FSPM_SRAM0_ERR_LOC_SHIFT                        2
#define   FSPM_SRAM0_ERR_FOUND_MASK              0x00000002
#define   FSPM_SRAM0_ERR_FOUND_SHIFT                      1
#define   FSPM_ERR_INT_EN_MASK                   0x00000001
#define   FSPM_ERR_INT_EN_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 fspm_err_int_en:1;
        u32 fspm_sram0_err_found:1;
        u32 fspm_sram0_err_loc:14;
        u32 rsvd_16:16;
    } b;
} fspm_sram0_err_stts_t;

#define FSPM_SRAM1_ERR_STTS                      0x000002dc

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} fspm_sram1_err_stts_t;

#define SHARED_TIMER0_INT                        0x000002e0
#define   SHR_TIMER_INT_MASK                     0x00000001
#define   SHR_TIMER_INT_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 shr_timer_int:1;
        u32 rsvd_1:31;
    } b;
} shared_timer0_int_t;

#define SHARED_TIMER0_CTRL                       0x000002e4
#define   SHR_TIMER0_PRESCALE_MASK               0xffff0000
#define   SHR_TIMER0_PRESCALE_SHIFT                      16
#define   SHR_TIMER0_MODE_MASK                   0x00000018
#define   SHR_TIMER0_MODE_SHIFT                           3
#define   SHR_TIMER0_LOAD_MASK                   0x00000004
#define   SHR_TIMER0_LOAD_SHIFT                           2
#define   SHR_TIMER0_INT_EN_MASK                 0x00000002
#define   SHR_TIMER0_INT_EN_SHIFT                         1
#define   SHR_TIMER0_START_MASK                  0x00000001
#define   SHR_TIMER0_START_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 shr_timer0_start:1;
        u32 shr_timer0_int_en:1;
        u32 shr_timer0_load:1;
        u32 shr_timer0_mode:2;
        u32 rsvd_5:11;
        u32 shr_timer0_prescale:16;
    } b;
} shared_timer0_ctrl_t;

#define SHARED_TIMER0_VALUE                      0x000002e8
#define   SHR_TIMER0_REL_VAL_MASK                0xffff0000
#define   SHR_TIMER0_REL_VAL_SHIFT                       16
#define   SHR_TIMER0_CUR_VAL_MASK                0x0000ffff
#define   SHR_TIMER0_CUR_VAL_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 shr_timer0_cur_val:16;
        u32 shr_timer0_rel_val:16;
    } b;
} shared_timer0_value_t;

#define RAIDM_CPU_CNFG1                          0x000002f0
#define   RAIDM_BASE_ADDR_MASK                   0xffffffff
#define   RAIDM_BASE_ADDR_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 raidm_base_addr:32;
    } b;
} raidm_cpu_cnfg1_t;

#define RAIDM_CPU_CNFG2                          0x000002f4
#define   RAIDM_DBG_STATUS_MASK                  0xffff0000
#define   RAIDM_DBG_STATUS_SHIFT                         16
#define   RAIDM_DBG_SEL_MASK                     0x0000ffff
#define   RAIDM_DBG_SEL_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 raidm_dbg_sel:16;
        u32 raidm_dbg_status:16;
    } b;
} raidm_cpu_cnfg2_t;

#define RAIDM_ERR_STTS4                          0x00000300
#define   RAIDM_ERR_LOC4_MASK                    0x00003ffc
#define   RAIDM_ERR_LOC4_SHIFT                            2
#define   RAIDM_ERR_FOUND4_MASK                  0x00000002
#define   RAIDM_ERR_FOUND4_SHIFT                          1

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:1;
        u32 raidm_err_found4:1;
        u32 raidm_err_loc4:12;
        u32 rsvd_14:18;
    } b;
} raidm_err_stts4_t;

#define RAIDM_ERR_STTS5                          0x00000304
#define   RAIDM_ERR_LOC5_MASK                    0x00003ffc
#define   RAIDM_ERR_LOC5_SHIFT                            2
#define   RAIDM_ERR_FOUND5_MASK                  0x00000002
#define   RAIDM_ERR_FOUND5_SHIFT                          1

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:1;
        u32 raidm_err_found5:1;
        u32 raidm_err_loc5:12;
        u32 rsvd_14:18;
    } b;
} raidm_err_stts5_t;

#define RAIDM_ERR_STTS6                          0x00000308
#define   RAIDM_ERR_LOC6_MASK                    0x00003ffc
#define   RAIDM_ERR_LOC6_SHIFT                            2
#define   RAIDM_ERR_FOUND6_MASK                  0x00000002
#define   RAIDM_ERR_FOUND6_SHIFT                          1

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:1;
        u32 raidm_err_found6:1;
        u32 raidm_err_loc6:12;
        u32 rsvd_14:18;
    } b;
} raidm_err_stts6_t;

#define RAIDM_ERR_STTS7                          0x0000030c
#define   RAIDM_ERR_LOC7_MASK                    0x00003ffc
#define   RAIDM_ERR_LOC7_SHIFT                            2
#define   RAIDM_ERR_FOUND7_MASK                  0x00000002
#define   RAIDM_ERR_FOUND7_SHIFT                          1
typedef union {
    u32 all;
    struct {
        u32 rsvd_0:1;
        u32 raidm_err_found7:1;
        u32 raidm_err_loc7:12;
        u32 rsvd_14:18;
    } b;
} raidm_err_stts7_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ unm_sys_int_t unm_sys_int;
    /* 0x0004 */ c1_sys_int_mask_t c1_sys_int_mask;
    /* 0x0008 */ c1_masked_sys_int_t c1_masked_sys_int;
    /* 0x000c */ reset_ctrl_t reset_ctrl;
    /* 0x0010 */ pll0_ctrl_0_t pll0_ctrl_0;
    /* 0x0014 */ pll0_ctrl_1_t pll0_ctrl_1;
    /* 0x0018 */ pll0_ctrl_2_t pll0_ctrl_2;
    /* 0x001c */ pll1_ctrl_0_t pll1_ctrl_0;
    /* 0x0020 */ pll1_ctrl_1_t pll1_ctrl_1;
    /* 0x0024 */ pll1_ctrl_2_t pll1_ctrl_2;
    /* 0x0028 */ clk_src_mux_t clk_src_mux;
    /* 0x002c */ clk_divider_t clk_divider;
    /* 0x0030 */ clk_dis_ctrl_t clk_dis_ctrl;
    /* 0x0034 */ frosc_ctrl_t frosc_ctrl;
    /* 0x0038 */ pad_ctrl_t pad_ctrl;
    /* 0x003c */ gpio_ctrl_t gpio_ctrl;
    /* 0x0040 */ gpio_out_t gpio_out;
    /* 0x0044 */ gpio_int_ctrl_t gpio_int_ctrl;
    /* 0x0048 */ gpio_int_t gpio_int;
    /* 0x004c */ gpio_int_mode_t gpio_int_mode;
    /* 0x0050 */ vol_mon_ctrl_t vol_mon_ctrl;
    /* 0x0054 */ vol_mon_stts_t vol_mon_stts;
    /* 0x0058 */ cab_ctrl_t cab_ctrl;
    /* 0x005c */ u32 rsvd_5c [2];
    /* 0x0064 */ misc_config_t misc_config;
    /* 0x0068 */ mem_ctrl1_t mem_ctrl1;
    /* 0x006c */ mem_ctrl2_t mem_ctrl2;
    /* 0x0070 */ mem_ps0_ctrl_t mem_ps0_ctrl;
    /* 0x0074 */ mem_ps1_ctrl_t mem_ps1_ctrl;
    /* 0x0078 */ mem_ps2_ctrl_t mem_ps2_ctrl;
    /* 0x007c */ chip_id_t chip_id;
    /* 0x0080 */ pmu_control_t pmu_control;
    /* 0x0084 */ pmu_status_t pmu_status;
    /* 0x0088 */ pmu_clk_ctrl_t pmu_clk_ctrl;
    /* 0x008c */ pwrd_ctrl_t pwrd_ctrl;
    /* 0x0090 */ iso_ctrl_t iso_ctrl;
    /* 0x0094 */ hw_lp_mode_t hw_lp_mode;
    /* 0x0098 */ hw_lp_mode1_t hw_lp_mode1;
    /* 0x009c */ lp_wait_time_t lp_wait_time;
    /* 0x00a0 */ usec_count_t usec_count;
    /* 0x00a4 */ mac_pd_ctrl_t mac_pd_ctrl;
    /* 0x00a8 */ phy_pd_ctrl_t phy_pd_ctrl;
    /* 0x00ac */ phy0_save_info_0_t phy0_save_info_0;
    /* 0x00b0 */ phy0_save_info_1_t phy0_save_info_1;
    /* 0x00b4 */ phy0_save_info_2_t phy0_save_info_2;
    /* 0x00b8 */ phy0_save_info_3_t phy0_save_info_3;
    /* 0x00bc */ misc_ana_ctrl_t misc_ana_ctrl;
    /* 0x00c0 */ fw_stts_0_t fw_stts_0;
    /* 0x00c4 */ fw_stts_1_t fw_stts_1;
    /* 0x00c8 */ fw_stts_2_t fw_stts_2;
    /* 0x00cc */ fw_stts_3_t fw_stts_3;
    /* 0x00d0 */ fw_stts_4_t fw_stts_4;
    /* 0x00d4 */ fw_stts_5_t fw_stts_5;
    /* 0x00d8 */ fw_stts_6_t fw_stts_6;
    /* 0x00dc */ fw_stts_7_t fw_stts_7;
    /* 0x00e0 */ fw_stts_8_t fw_stts_8;
    /* 0x00e4 */ fw_stts_9_t fw_stts_9;
    /* 0x00e8 */ fw_stts_10_t fw_stts_10;
    /* 0x00ec */ fw_stts_11_t fw_stts_11;
    /* 0x00f0 */ fw_stts_12_t fw_stts_12;
    /* 0x00f4 */ fw_stts_13_t fw_stts_13;
    /* 0x00f8 */ fw_stts_14_t fw_stts_14;
    /* 0x00fc */ fw_stts_15_t fw_stts_15;
    /* 0x0100 */ pll2_ctrl_0_t pll2_ctrl_0;
    /* 0x0104 */ pll2_ctrl_1_t pll2_ctrl_1;
    /* 0x0108 */ pll2_ctrl_2_t pll2_ctrl_2;
    /* 0x010c */ u32 rsvd_10c;
    /* 0x0110 */ mem_ps0_idle_t mem_ps0_idle;
    /* 0x0114 */ mem_ps1_idle_t mem_ps1_idle;
    /* 0x0118 */ mem_ps2_idle_t mem_ps2_idle;
    /* 0x011c */ u32 rsvd_11c;
    /* 0x0120 */ pmu_timer_ctrl_t pmu_timer_ctrl;
    /* 0x0124 */ pmu_timer_t pmu_timer;
    /* 0x0128 */ pmu_wake_time_t pmu_wake_time;
    /* 0x012c */ u32 rsvd_12c;
    /* 0x0130 */ gpio_pad_ctrl_t gpio_pad_ctrl;
    /* 0x0134 */ test_ctrl_t test_ctrl;
    /* 0x0138 */ u32 rsvd_138 [2];
    /* 0x0140 */ c2_sys_int_mask_t c2_sys_int_mask;
    /* 0x0144 */ c2_masked_sys_int_t c2_masked_sys_int;
    /* 0x0148 */ c3_sys_int_mask_t c3_sys_int_mask;
    /* 0x014c */ c3_masked_sys_int_t c3_masked_sys_int;
    /* 0x0150 */ c4_sys_int_mask_t c4_sys_int_mask;
    /* 0x0154 */ c4_masked_sys_int_t c4_masked_sys_int;
    /* 0x0158 */ c5_sys_int_mask_t c5_sys_int_mask;
    /* 0x015c */ c5_masked_sys_int_t c5_masked_sys_int;
    /* 0x0160 */ c6_sys_int_mask_t c6_sys_int_mask;
    /* 0x0164 */ c6_masked_sys_int_t c6_masked_sys_int;
    /* 0x0168 */ c7_sys_int_mask_t c7_sys_int_mask;
    /* 0x016c */ c7_masked_sys_int_t c7_masked_sys_int;
    /* 0x0170 */ c8_sys_int_mask_t c8_sys_int_mask;
    /* 0x0174 */ c8_masked_sys_int_t c8_masked_sys_int;
    /* 0x0178 */ pad_ctrl1_t pad_ctrl1;
    /* 0x017c */ cnfg0_id_ver_t cnfg0_id_ver;
    /* 0x0180 */ cnfg1_id_ver_t cnfg1_id_ver;
    /* 0x0184 */ phy0_save_info_4_t phy0_save_info_4;
    /* 0x0188 */ phy0_save_info_5_t phy0_save_info_5;
    /* 0x018c */ phy0_save_info_6_t phy0_save_info_6;
    /* 0x0190 */ phy1_save_info_0_t phy1_save_info_0;
    /* 0x0194 */ phy1_save_info_1_t phy1_save_info_1;
    /* 0x0198 */ phy1_save_info_2_t phy1_save_info_2;
    /* 0x019c */ phy1_save_info_3_t phy1_save_info_3;
    /* 0x01a0 */ phy1_save_info_4_t phy1_save_info_4;
    /* 0x01a4 */ phy1_save_info_5_t phy1_save_info_5;
    /* 0x01a8 */ phy1_save_info_6_t phy1_save_info_6;
    /* 0x01ac */ phy2_save_info_0_t phy2_save_info_0;
    /* 0x01b0 */ phy2_save_info_1_t phy2_save_info_1;
    /* 0x01b4 */ phy2_save_info_2_t phy2_save_info_2;
    /* 0x01b8 */ phy2_save_info_3_t phy2_save_info_3;
    /* 0x01bc */ phy2_save_info_4_t phy2_save_info_4;
    /* 0x01c0 */ phy2_save_info_5_t phy2_save_info_5;
    /* 0x01c4 */ phy2_save_info_6_t phy2_save_info_6;
    /* 0x01c8 */ phy3_save_info_0_t phy3_save_info_0;
    /* 0x01cc */ phy3_save_info_1_t phy3_save_info_1;
    /* 0x01d0 */ phy3_save_info_2_t phy3_save_info_2;
    /* 0x01d4 */ phy3_save_info_3_t phy3_save_info_3;
    /* 0x01d8 */ phy3_save_info_4_t phy3_save_info_4;
    /* 0x01dc */ phy3_save_info_5_t phy3_save_info_5;
    /* 0x01e0 */ phy3_save_info_6_t phy3_save_info_6;
    /* 0x01e4 */ phyc_save_info_0_t phyc_save_info_0;
    /* 0x01e8 */ phyc_save_info_1_t phyc_save_info_1;
    /* 0x01ec */ phyc_save_info_2_t phyc_save_info_2;
    /* 0x01f0 */ u32 rsvd_1f0;
    /* 0x01f4 */ wdt_rst_int_sts_t wdt_rst_int_sts;
    /* 0x01f8 */ smb_wakeup_ctrl_t smb_wakeup_ctrl;
    /* 0x01fc */ u32 rsvd_1fc [17];
    /* 0x0240 */ shared_timer1_ctrl_t shared_timer1_ctrl;
    /* 0x0244 */ shared_timer1_val_l_t shared_timer1_val_l;
    /* 0x0248 */ shared_timer1_val_h_t shared_timer1_val_h;
    /* 0x024c */ ts_thresh2_t ts_thresh2;
    /* 0x0250 */ ts_ctrl_t ts_ctrl;
    /* 0x0254 */ ts_time_t ts_time;
    /* 0x0258 */ ts_thresh1_t ts_thresh1;
    /* 0x025c */ ts_int_t ts_int;
    /* 0x0260 */ trng_ctrl_stts_t trng_ctrl_stts;
    /* 0x0264 */ trng_bm_ctrl_t trng_bm_ctrl;
    /* 0x0268 */ raid_init_ctrl_t raid_init_ctrl;
    /* 0x026c */ blk_clk_gate_t blk_clk_gate;
    /* 0x0270 */ raidm_err_inj_t raidm_err_inj;
    /* 0x0274 */ raidm_err_stts0_t raidm_err_stts0;
    /* 0x0278 */ u32 rsvd_278 [2];
    /* 0x0280 */ phy_address_t phy_address;
    /* 0x0284 */ phy_data_t phy_data;
    /* 0x0288 */ u32 rsvd_288 [2];
    /* 0x0290 */ fatal_err_t fatal_err;
    /* 0x0294 */ fatal_err_int_en_t fatal_err_int_en;
    /* 0x0298 */ nvm_abt_mode_t nvm_abt_mode;
    /* 0x029c */ nvm_abt_ctrl_t nvm_abt_ctrl;
    /* 0x02a0 */ clk_freq_ctrl0_t clk_freq_ctrl0;
    /* 0x02a4 */ clk_freq_ctrl1_t clk_freq_ctrl1;
    /* 0x02a8 */ clk_freq_cnt0_t clk_freq_cnt0;
    /* 0x02ac */ clk_freq_cnt1_t clk_freq_cnt1;
    /* 0x02b0 */ prcs_mntr_ctrl1_t prcs_mntr_ctrl1;
    /* 0x02b4 */ prcs_mntr_ctrl2_t prcs_mntr_ctrl2;
    /* 0x02b8 */ prcs_mntr_ctrl3_t prcs_mntr_ctrl3;
    /* 0x02bc */ prcs_mntr_ctrl4_t prcs_mntr_ctrl4;
    /* 0x02c0 */ prcs_mntr_ctrl5_t prcs_mntr_ctrl5;
    /* 0x02c4 */ raidm_err_stts1_t raidm_err_stts1;
    /* 0x02c8 */ raidm_err_stts2_t raidm_err_stts2;
    /* 0x02cc */ raidm_err_stts3_t raidm_err_stts3;
    /* 0x02d0 */ raidm_cpu_cnfg0_t raidm_cpu_cnfg0;
    /* 0x02d4 */ nvdla_int_mask_t nvdla_int_mask;
    /* 0x02d8 */ fspm_sram0_err_stts_t fspm_sram0_err_stts;
    /* 0x02dc */ fspm_sram1_err_stts_t fspm_sram1_err_stts;
    /* 0x02e0 */ shared_timer0_int_t shared_timer0_int;
    /* 0x02e4 */ shared_timer0_ctrl_t shared_timer0_ctrl;
    /* 0x02e8 */ shared_timer0_value_t shared_timer0_value;
    /* 0x02ec */ u32 rsvd_2ec;
    /* 0x02f0 */ raidm_cpu_cnfg1_t raidm_cpu_cnfg1;
    /* 0x02f4 */ raidm_cpu_cnfg2_t raidm_cpu_cnfg2;
    /* 0x02f8 */ u32 rsvd_2f8 [2];
    /* 0x0300 */ raidm_err_stts4_t raidm_err_stts4;
    /* 0x0304 */ raidm_err_stts5_t raidm_err_stts5;
    /* 0x0308 */ raidm_err_stts6_t raidm_err_stts6;
    /* 0x030c */ raidm_err_stts7_t raidm_err_stts7;
} misc_register_regs_t;


#endif /* rev 4 */