/*
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _OTP_CTRL_REGISTER_H_
#define _OTP_CTRL_REGISTER_H_

#define CONTROL_STATUS_REG                       0x00000000
#define   PDSTB_FLAG_MASK                        0x80000000
#define   PDSTB_FLAG_SHIFT                               31
#define   OTP_IDLE_MASK                          0x40000000
#define   OTP_IDLE_SHIFT                                 30
#define   OTP_STATE_MASK                         0x0f000000
#define   OTP_STATE_SHIFT                                24
#define   AUTO_LOAD_EN_MASK                      0x00000080
#define   AUTO_LOAD_EN_SHIFT                              7
#define   FW_RST_MASK                            0x00000040
#define   FW_RST_SHIFT                                    6
#define   PROG_DONE_MASK                         0x00000020
#define   PROG_DONE_SHIFT                                 5
#define   AUTO_LOAD_RDY_MASK                     0x00000010
#define   AUTO_LOAD_RDY_SHIFT                             4
#define   PGM_MARGIN_READ_MASK                   0x00000008
#define   PGM_MARGIN_READ_SHIFT                           3
#define   INIT_MARGIN_READ_MASK                  0x00000004
#define   INIT_MARGIN_READ_SHIFT                          2
#define   PDSTB_EN_MASK                          0x00000002
#define   PDSTB_EN_SHIFT                                  1
#define   DIRECT_MODE_MASK                       0x00000001
#define   DIRECT_MODE_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 direct_mode:1;
        u32 pdstb_en:1;
        u32 init_margin_read:1;
        u32 pgm_margin_read:1;
        u32 auto_load_rdy:1;
        u32 prog_done:1;
        u32 fw_rst:1;
        u32 auto_load_en:1;
        u32 rsvd_8:16;
        u32 otp_state:4;
        u32 rsvd_28:2;
        u32 otp_idle:1;
        u32 pdstb_flag:1;
    } b;
} control_status_reg_t;

#define TIMER_CTRL_REG                           0x00000004
#define   PRG_CYC_CNT_MASK                       0x007f0000
#define   PRG_CYC_CNT_SHIFT                              16
#define   US_CNT_EN_MASK                         0x00000200
#define   US_CNT_EN_SHIFT                                 9
#define   US_CNT_MASK                            0x000001ff
#define   US_CNT_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 us_cnt:9;
        u32 us_cnt_en:1;
        u32 rsvd_10:6;
        u32 prg_cyc_cnt:7;
        u32 rsvd_23:9;
    } b;
} timer_ctrl_reg_t;

#define OTP_TIMER_0_REG                          0x00000008
#define   TSAS_MASK                              0xe0000000
#define   TSAS_SHIFT                                     29
#define   TPP_MASK                               0x1f000000
#define   TPP_SHIFT                                      24
#define   TPWI_MASK                              0x00e00000
#define   TPWI_SHIFT                                     21
#define   TPW_MASK                               0x001f0000
#define   TPW_SHIFT                                      16
#define   TCS_MASK                               0x00007f00
#define   TCS_SHIFT                                       8
#define   TASH_MASK                              0x000000e0
#define   TASH_SHIFT                                      5
#define   PCLK_HF_CYC_MASK                       0x0000001f
#define   PCLK_HF_CYC_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 pclk_hf_cyc:5;
        u32 tash:3;
        u32 tcs:7;
        u32 rsvd_15:1;
        u32 tpw:5;
        u32 tpwi:3;
        u32 tpp:5;
        u32 tsas:3;
    } b;
} otp_timer_0_reg_t;

#define OTP_TIMER_1_REG                          0x0000000c
#define   TPPR_MASK                              0x00007f00
#define   TPPR_SHIFT                                      8
#define   TVDS_VDD_MASK                          0x00000003
#define   TVDS_VDD_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 tvds_vdd:2;
        u32 rsvd_2:6;
        u32 tppr:7;
        u32 rsvd_15:17;
    } b;
} otp_timer_1_reg_t;

#define OTP_DIRECT_CTRL_REG                      0x00000010
#define   OTP_PDSTB_N_MASK                       0x00020000
#define   OTP_PDSTB_N_SHIFT                              17
#define   OTP_PCLK_MASK                          0x00010000
#define   OTP_PCLK_SHIFT                                 16
#define   OTP_PTR_MASK                           0x00008000
#define   OTP_PTR_SHIFT                                  15
#define   OTP_PCE_MASK                           0x00004000
#define   OTP_PCE_SHIFT                                  14
#define   OTP_PROG_MASK                          0x00002000
#define   OTP_PROG_SHIFT                                 13
#define   OTP_PWE_MASK                           0x00001000
#define   OTP_PWE_SHIFT                                  12
#define   OTP_PTM_MASK                           0x00000700
#define   OTP_PTM_SHIFT                                   8
#define   OTP_PA_MASK                            0x0000003f
#define   OTP_PA_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 otp_pa:6;
        u32 rsvd_6:2;
        u32 otp_ptm:3;
        u32 rsvd_11:1;
        u32 otp_pwe:1;
        u32 otp_prog:1;
        u32 otp_pce:1;
        u32 otp_ptr:1;
        u32 otp_pclk:1;
        u32 otp_pdstb_n:1;
        u32 rsvd_18:14;
    } b;
} otp_direct_ctrl_reg_t;

#define OTP_DIRECT_WD_REG                        0x00000014
#define   OTP_WD_MASK                            0xffffffff
#define   OTP_WD_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 otp_wd:32;
    } b;
} otp_direct_wd_reg_t;

#define OTP_DIRECT_RD_REG                        0x00000018
#define   OTP_RD_MASK                            0xffffffff
#define   OTP_RD_SHIFT                                    0

typedef union {
    u32 all;
    struct {
        u32 otp_rd:32;
    } b;
} otp_direct_rd_reg_t;

#define OTP_SIGNATURE_REG                        0x0000001c
#define   OTP_SIG_MASK                           0xffffffff
#define   OTP_SIG_SHIFT                                   0
typedef union {
    u32 all;
    struct {
        u32 otp_sig:32;
    } b;
} otp_signature_reg_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ control_status_reg_t control_status_reg;
    /* 0x0004 */ timer_ctrl_reg_t timer_ctrl_reg;
    /* 0x0008 */ otp_timer_0_reg_t otp_timer_0_reg;
    /* 0x000c */ otp_timer_1_reg_t otp_timer_1_reg;
    /* 0x0010 */ otp_direct_ctrl_reg_t otp_direct_ctrl_reg;
    /* 0x0014 */ otp_direct_wd_reg_t otp_direct_wd_reg;
    /* 0x0018 */ otp_direct_rd_reg_t otp_direct_rd_reg;
    /* 0x001c */ otp_signature_reg_t otp_signature_reg;
} otp_ctrl_register_regs_t;


#endif /* rev 0 */