//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _PCIE_WRAPPER_REGISTER_H_
#define _PCIE_WRAPPER_REGISTER_H_

#define PCIE_CONTROL_REG                         0x00000000
#define   REG_LINKWIDTH_FROM_TOP_MASK            0x80000000
#define   REG_LINKWIDTH_FROM_TOP_SHIFT                   31
#define   REG_PHY_L1SUB_PM_LINKWIDTH_EN_MASK     0x40000000
#define   REG_PHY_L1SUB_PM_LINKWIDTH_EN_SHIFT            30
#define   REG_PHY_L1SUB_PM_LINKWIDTH_MASK        0x30000000
#define   REG_PHY_L1SUB_PM_LINKWIDTH_SHIFT               28
#define   L1SUB_POWERDOWN_CTRL_MASK              0x04000000
#define   L1SUB_POWERDOWN_CTRL_SHIFT                     26
#define   APP_CLK_PM_EN_MASK                     0x02000000
#define   APP_CLK_PM_EN_SHIFT                            25
#define   PHYSTATUS_REG_MASK                     0x01000000
#define   PHYSTATUS_REG_SHIFT                            24
#define   APP_MARGINING_SOFTWARE_READY_MASK      0x00800000
#define   APP_MARGINING_SOFTWARE_READY_SHIFT             23
#define   APP_MARGINING_READY_MASK               0x00400000
#define   APP_MARGINING_READY_SHIFT                      22
#define   APP_L1SUB_DISABLE_MASK                 0x00200000
#define   APP_L1SUB_DISABLE_SHIFT                        21
#define   AUTO_LTSSM_CLR_EN_MASK                 0x00100000
#define   AUTO_LTSSM_CLR_EN_SHIFT                        20
#define   NVME_XFER_PENDING_EN_MASK              0x00080000
#define   NVME_XFER_PENDING_EN_SHIFT                     19
#define   APP_XFER_PENDING_MASK                  0x00040000
#define   APP_XFER_PENDING_SHIFT                         18
#define   SYS_AUX_PWR_DET_MASK                   0x00020000
#define   SYS_AUX_PWR_DET_SHIFT                          17
#define   APP_CLK_REQ_N_MASK                     0x00010000
#define   APP_CLK_REQ_N_SHIFT                            16
#define   APP_INIT_RST_MASK                      0x00008000
#define   APP_INIT_RST_SHIFT                             15
#define   APP_REQ_ENTR_L1_MASK                   0x00004000
#define   APP_REQ_ENTR_L1_SHIFT                          14
#define   APP_READY_ENTR_L23_MASK                0x00002000
#define   APP_READY_ENTR_L23_SHIFT                       13
#define   APP_REQ_EXIT_L1_MASK                   0x00001000
#define   APP_REQ_EXIT_L1_SHIFT                          12
#define   APPS_PM_XMT_PME_MASK                   0x00000800
#define   APPS_PM_XMT_PME_SHIFT                          11
#define   OUTBAND_PWRUP_CMD_MASK                 0x00000400
#define   OUTBAND_PWRUP_CMD_SHIFT                        10
#define   APP_RAS_DES_TBA_CTRL_MASK              0x00000300
#define   APP_RAS_DES_TBA_CTRL_SHIFT                      8
#define   APP_L1_PWR_OFF_EN_MASK                 0x00000080
#define   APP_L1_PWR_OFF_EN_SHIFT                         7
#define   CFG_10BITS_TAG_COMP_SUPPORT_MASK       0x00000040
#define   CFG_10BITS_TAG_COMP_SUPPORT_SHIFT               6
#define   APP_RAS_DES_SD_HOLD_LTSSM_MASK         0x00000020
#define   APP_RAS_DES_SD_HOLD_LTSSM_SHIFT                 5
#define   RX_LANE_FLIP_EN_MASK                   0x00000010
#define   RX_LANE_FLIP_EN_SHIFT                           4
#define   TX_LANE_FLIP_EN_MASK                   0x00000008
#define   TX_LANE_FLIP_EN_SHIFT                           3
#define   APP_SRIS_MODE_MASK                     0x00000004
#define   APP_SRIS_MODE_SHIFT                             2
#define   APP_REQ_RETRY_EN_MASK                  0x00000002
#define   APP_REQ_RETRY_EN_SHIFT                          1
#define   APP_LTSSM_ENABLE_MASK                  0x00000001
#define   APP_LTSSM_ENABLE_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 app_ltssm_enable:1;
        u32 app_req_retry_en:1;
        u32 app_sris_mode:1;
        u32 tx_lane_flip_en:1;
        u32 rx_lane_flip_en:1;
        u32 app_ras_des_sd_hold_ltssm:1;
        u32 cfg_10bits_tag_comp_support:1;
        u32 app_l1_pwr_off_en:1;
        u32 app_ras_des_tba_ctrl:2;
        u32 outband_pwrup_cmd:1;
        u32 apps_pm_xmt_pme:1;
        u32 app_req_exit_l1:1;
        u32 app_ready_entr_l23:1;
        u32 app_req_entr_l1:1;
        u32 app_init_rst:1;
        u32 app_clk_req_n:1;
        u32 sys_aux_pwr_det:1;
        u32 app_xfer_pending:1;
        u32 nvme_xfer_pending_en:1;
        u32 auto_ltssm_clr_en:1;
        u32 app_l1sub_disable:1;
        u32 app_margining_ready:1;
        u32 app_margining_software_ready:1;
        u32 phystatus_reg:1;
        u32 app_clk_pm_en:1;
        u32 l1sub_powerdown_ctrl:1;
        u32 rsvd_27:1;
        u32 reg_phy_l1sub_pm_linkwidth:2;
        u32 reg_phy_l1sub_pm_linkwidth_en:1;
        u32 reg_linkwidth_from_top:1;
    } b;
} pcie_control_reg_t;

#define PCIE_UNMSK_INTR                          0x00000004
#define   PM_LINKST_EXIT_L1_2_MASK               0x80000000
#define   PM_LINKST_EXIT_L1_2_SHIFT                      31
#define   PM_LINKST_ENTR_L1_2_MASK               0x40000000
#define   PM_LINKST_ENTR_L1_2_SHIFT                      30
#define   PM_LINKST_EXIT_L1_MASK                 0x20000000
#define   PM_LINKST_EXIT_L1_SHIFT                        29
#define   PM_LINKST_IN_L2_MASK                   0x10000000
#define   PM_LINKST_IN_L2_SHIFT                          28
#define   PM_LINKST_IN_L1_MASK                   0x08000000
#define   PM_LINKST_IN_L1_SHIFT                          27
#define   PM_XTLH_BLOCK_TLP_MASK                 0x04000000
#define   PM_XTLH_BLOCK_TLP_SHIFT                        26
#define   CFG_LTR_M_EN_SET_MASK                  0x02000000
#define   CFG_LTR_M_EN_SET_SHIFT                         25
#define   CFG_LTR_M_EN_CLR_MASK                  0x01000000
#define   CFG_LTR_M_EN_CLR_SHIFT                         24
#define   PM_DSTATE_CHG_MASK                     0x00800000
#define   PM_DSTATE_CHG_SHIFT                            23
#define   CFG_VPD_INT_MASK                       0x00400000
#define   CFG_VPD_INT_SHIFT                              22
#define   RADM_PM_TURNOFF_MASK                   0x00200000
#define   RADM_PM_TURNOFF_SHIFT                          21
#define   RADM_MSG_UNLOCK_MASK                   0x00100000
#define   RADM_MSG_UNLOCK_SHIFT                          20
#define   CFG_SEND_COR_ERR_MASK                  0x00080000
#define   CFG_SEND_COR_ERR_SHIFT                         19
#define   CFG_SEND_NF_ERR_MASK                   0x00040000
#define   CFG_SEND_NF_ERR_SHIFT                          18
#define   CFG_SEND_F_ERR_MASK                    0x00020000
#define   CFG_SEND_F_ERR_SHIFT                           17
#define   SLV_RASDP_ERR_MODE_MASK                0x00010000
#define   SLV_RASDP_ERR_MODE_SHIFT                       16
#define   MSTR_RASDP_ERR_MODE_MASK               0x00008000
#define   MSTR_RASDP_ERR_MODE_SHIFT                      15
#define   CFG_LINK_EQ_REQ_INT_MASK               0x00004000
#define   CFG_LINK_EQ_REQ_INT_SHIFT                      14
#define   RADM_CPL_TIMEOUT_MASK                  0x00002000
#define   RADM_CPL_TIMEOUT_SHIFT                         13
#define   SLV_RD_CPL_TIMEOUT_MASK                0x00001000
#define   SLV_RD_CPL_TIMEOUT_SHIFT                       12
#define   CFG_FLR_VF_ACTIVE_MASK                 0x00000800
#define   CFG_FLR_VF_ACTIVE_SHIFT                        11
#define   CFG_FLR_PF_ACTIVE_MASK                 0x00000400
#define   CFG_FLR_PF_ACTIVE_SHIFT                        10
#define   LINK_REQ_RST_NOT_MASK                  0x00000200
#define   LINK_REQ_RST_NOT_SHIFT                          9
#define   SMLH_REQ_RST_NOT_MASK                  0x00000100
#define   SMLH_REQ_RST_NOT_SHIFT                          8
#define   CFG_BUS_MASTER_DIS_MASK                0x00000080
#define   CFG_BUS_MASTER_DIS_SHIFT                        7
#define   CFG_BUS_MASTER_EN_MASK                 0x00000040
#define   CFG_BUS_MASTER_EN_SHIFT                         6
#define   CFG_MEM_SPACE_DIS_MASK                 0x00000020
#define   CFG_MEM_SPACE_DIS_SHIFT                         5
#define   CFG_MEM_SPACE_EN_MASK                  0x00000010
#define   CFG_MEM_SPACE_EN_SHIFT                          4
#define   RDLH_LINK_DOWN_MASK                    0x00000008
#define   RDLH_LINK_DOWN_SHIFT                            3
#define   RDLH_LINK_UP_MASK                      0x00000004
#define   RDLH_LINK_UP_SHIFT                              2
#define   SMLH_LINK_DOWN_MASK                    0x00000002
#define   SMLH_LINK_DOWN_SHIFT                            1
#define   SMLH_LINK_UP_MASK                      0x00000001
#define   SMLH_LINK_UP_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 smlh_link_up:1;
        u32 smlh_link_down:1;
        u32 rdlh_link_up:1;
        u32 rdlh_link_down:1;
        u32 cfg_mem_space_en:1;
        u32 cfg_mem_space_dis:1;
        u32 cfg_bus_master_en:1;
        u32 cfg_bus_master_dis:1;
        u32 smlh_req_rst_not:1;
        u32 link_req_rst_not:1;
        u32 cfg_flr_pf_active:1;
        u32 cfg_flr_vf_active:1;
        u32 slv_rd_cpl_timeout:1;
        u32 radm_cpl_timeout:1;
        u32 cfg_link_eq_req_int:1;
        u32 mstr_rasdp_err_mode:1;
        u32 slv_rasdp_err_mode:1;
        u32 cfg_send_f_err:1;
        u32 cfg_send_nf_err:1;
        u32 cfg_send_cor_err:1;
        u32 radm_msg_unlock:1;
        u32 radm_pm_turnoff:1;
        u32 cfg_vpd_int:1;
        u32 pm_dstate_chg:1;
        u32 cfg_ltr_m_en_clr:1;
        u32 cfg_ltr_m_en_set:1;
        u32 pm_xtlh_block_tlp:1;
        u32 pm_linkst_in_l1:1;
        u32 pm_linkst_in_l2:1;
        u32 pm_linkst_exit_l1:1;
        u32 pm_linkst_entr_l1_2:1;
        u32 pm_linkst_exit_l1_2:1;
    } b;
} pcie_unmsk_intr_t;

#define PCIE_INTR_MASK0                          0x00000008
#define   PCIE_INTR_MASK0_MASK                   0xffffffff
#define   PCIE_INTR_MASK0_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 pcie_intr_mask0:32;
    } b;
} pcie_intr_mask0_t;

#define PCIE_MASKD_INTR0                         0x0000000c
#define   PCIE_MASKD_INTR0_MASK                  0xffffffff
#define   PCIE_MASKD_INTR0_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_maskd_intr0:32;
    } b;
} pcie_maskd_intr0_t;

#define PCIE_INTR_MASK1                          0x00000010
#define   PCIE_INTR_MASK1_MASK                   0xffffffff
#define   PCIE_INTR_MASK1_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 pcie_intr_mask1:32;
    } b;
} pcie_intr_mask1_t;

#define PCIE_MASKD_INTR1                         0x00000014
#define   PCIE_MASKD_INTR1_MASK                  0xffffffff
#define   PCIE_MASKD_INTR1_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_maskd_intr1:32;
    } b;
} pcie_maskd_intr1_t;

#define PCIE_CORE_STATUS                         0x00000018
#define   CFG_FLR_VF_ACTIVE_18_MASK              0x80000000
#define   CFG_FLR_VF_ACTIVE_18_SHIFT                     31
#define   RDLH_LINK_UP_18_MASK                   0x40000000
#define   RDLH_LINK_UP_18_SHIFT                          30
#define   SMLH_LINK_UP_18_MASK                   0x20000000
#define   SMLH_LINK_UP_18_SHIFT                          29
#define   SMLH_REQ_RST_NOT_18_MASK               0x10000000
#define   SMLH_REQ_RST_NOT_18_SHIFT                      28
#define   LINK_REQ_RST_NOT_18_MASK               0x08000000
#define   LINK_REQ_RST_NOT_18_SHIFT                      27
#define   NVME_XFER_PENDING_MASK                 0x04000000
#define   NVME_XFER_PENDING_SHIFT                        26
#define   CFG_FLR_PF_ACTIVE_18_MASK              0x02000000
#define   CFG_FLR_PF_ACTIVE_18_SHIFT                     25
#define   RADM_Q_NOT_EMPTY_MASK                  0x01000000
#define   RADM_Q_NOT_EMPTY_SHIFT                         24
#define   RADM_QOVERFLOW_MASK                    0x00800000
#define   RADM_QOVERFLOW_SHIFT                           23
#define   CFG_SEND_COR_ERR_18_MASK               0x00400000
#define   CFG_SEND_COR_ERR_18_SHIFT                      22
#define   CFG_SEND_NF_ERR_18_MASK                0x00200000
#define   CFG_SEND_NF_ERR_18_SHIFT                       21
#define   CFG_SEND_F_ERR_18_MASK                 0x00100000
#define   CFG_SEND_F_ERR_18_SHIFT                        20
#define   APP_PARITY_ERRS_MASK                   0x000e0000
#define   APP_PARITY_ERRS_SHIFT                          17
#define   AXI_PARITY_ERRS_MASK                   0x0001fc00
#define   AXI_PARITY_ERRS_SHIFT                          10
#define   SMLH_LTSSM_STATE_MASK                  0x000003f0
#define   SMLH_LTSSM_STATE_SHIFT                          4
#define   SMLH_LTSSM_STATE_RCVRY_EQ_MASK         0x00000008
#define   SMLH_LTSSM_STATE_RCVRY_EQ_SHIFT                 3
#define   BRDG_SLV_XFER_PENDING_MASK             0x00000004
#define   BRDG_SLV_XFER_PENDING_SHIFT                     2
#define   BRDG_DBI_XFER_PENDING_MASK             0x00000002
#define   BRDG_DBI_XFER_PENDING_SHIFT                     1
#define   RADM_XFER_PENDING_MASK                 0x00000001
#define   RADM_XFER_PENDING_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 radm_xfer_pending:1;
        u32 brdg_dbi_xfer_pending:1;
        u32 brdg_slv_xfer_pending:1;
        u32 smlh_ltssm_state_rcvry_eq:1;
        u32 smlh_ltssm_state:6;
        u32 axi_parity_errs:7;
        u32 app_parity_errs:3;
        u32 cfg_send_f_err_18:1;
        u32 cfg_send_nf_err_18:1;
        u32 cfg_send_cor_err_18:1;
        u32 radm_qoverflow:1;
        u32 radm_q_not_empty:1;
        u32 cfg_flr_pf_active_18:1;
        u32 nvme_xfer_pending:1;
        u32 link_req_rst_not_18:1;
        u32 smlh_req_rst_not_18:1;
        u32 smlh_link_up_18:1;
        u32 rdlh_link_up_18:1;
        u32 cfg_flr_vf_active_18:1;
    } b;
} pcie_core_status_t;

#define PCIE_POWR_STATUS                         0x0000001c
#define   CLKREQ_IN_N_MASK                       0x80000000
#define   CLKREQ_IN_N_SHIFT                              31
#define   L1SUB_STATE_MASK                       0x70000000
#define   L1SUB_STATE_SHIFT                              28
#define   MAC_PMU_CS_MASK                        0x0f000000
#define   MAC_PMU_CS_SHIFT                               24
#define   MAC_PHY_POWERDOWN_MASK                 0x00f00000
#define   MAC_PHY_POWERDOWN_SHIFT                        20
#define   PM_XTLH_BLOCK_TLP_1c_MASK              0x00080000
#define   PM_XTLH_BLOCK_TLP_1c_SHIFT                     19
#define   PM_CURNT_STATE_MASK                    0x00070000
#define   PM_CURNT_STATE_SHIFT                           16
#define   PM_DSTATE_MASK                         0x0000e000
#define   PM_DSTATE_SHIFT                                13
#define   AUX_PM_EN_MASK                         0x00001000
#define   AUX_PM_EN_SHIFT                                12
#define   PM_PME_EN_MASK                         0x00000800
#define   PM_PME_EN_SHIFT                                11
#define   PM_LINKST_IN_L0S_MASK                  0x00000400
#define   PM_LINKST_IN_L0S_SHIFT                         10
#define   PM_LINKST_IN_L1_1c_MASK                0x00000200
#define   PM_LINKST_IN_L1_1c_SHIFT                        9
#define   PM_LINKST_IN_L1_1_MASK                 0x00000100
#define   PM_LINKST_IN_L1_1_SHIFT                         8
#define   PM_LINKST_IN_L1_2_MASK                 0x00000080
#define   PM_LINKST_IN_L1_2_SHIFT                         7
#define   PM_LINKST_IN_L2_1c_MASK                0x00000040
#define   PM_LINKST_IN_L2_1c_SHIFT                        6
#define   PM_LINKST_L2_EXIT_MASK                 0x00000020
#define   PM_LINKST_L2_EXIT_SHIFT                         5
#define   PM_LINKST_IN_L1SUB_MASK                0x00000010
#define   PM_LINKST_IN_L1SUB_SHIFT                        4
#define   CFG_L1SUB_EN_MASK                      0x00000008
#define   CFG_L1SUB_EN_SHIFT                              3
#define   PM_STATUS_MASK                         0x00000004
#define   PM_STATUS_SHIFT                                 2
#define   WAKE_MASK                              0x00000002
#define   WAKE_SHIFT                                      1
#define   PW_CLK_REQ_N_MASK                      0x00000001
#define   PW_CLK_REQ_N_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 pw_clk_req_n:1;
        u32 wake:1;
        u32 pm_status:1;
        u32 cfg_l1sub_en:1;
        u32 pm_linkst_in_l1sub:1;
        u32 pm_linkst_l2_exit:1;
        u32 pm_linkst_in_l2_1c:1;
        u32 pm_linkst_in_l1_2:1;
        u32 pm_linkst_in_l1_1:1;
        u32 pm_linkst_in_l1_1c:1;
        u32 pm_linkst_in_l0s:1;
        u32 pm_pme_en:1;
        u32 aux_pm_en:1;
        u32 pm_dstate:3;
        u32 pm_curnt_state:3;
        u32 pm_xtlh_block_tlp_1c:1;
        u32 mac_phy_powerdown:4;
        u32 mac_pmu_cs:4;
        u32 l1sub_state:3;
        u32 clkreq_in_n:1;
    } b;
} pcie_powr_status_t;

#define PCIE_LTR_MESSAGE                         0x00000020
#define   APP_LTR_MSG_LATENCY_MASK               0xffffffff
#define   APP_LTR_MSG_LATENCY_SHIFT                       0

typedef union {
    u32 all;
    struct {
        u32 app_ltr_msg_latency:32;
    } b;
} pcie_ltr_message_t;

#define PCIE_FLR_DNE_SET                         0x00000024
#define   APP_FLR_PF_DONE_MASK                   0x00000001
#define   APP_FLR_PF_DONE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 app_flr_pf_done:1;
        u32 rsvd_1:31;
    } b;
} pcie_flr_dne_set_t;

#define PCIE_SAVE_ST_ACK                         0x00000028
#define   PW_SAVE_STATE_ACK_MASK                 0x00000001
#define   PW_SAVE_STATE_ACK_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 pw_save_state_ack:1;
        u32 rsvd_1:31;
    } b;
} pcie_save_st_ack_t;

#define PCIE_RSTR_ST_ACK                         0x0000002c
#define   PW_RESTORE_STATE_ACK_MASK              0x00000001
#define   PW_RESTORE_STATE_ACK_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 pw_restore_state_ack:1;
        u32 rsvd_1:31;
    } b;
} pcie_rstr_st_ack_t;

#define PCIE_APP_REQ_FLS                         0x00000030

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:32;
    } b;
} pcie_app_req_fls_t;

#define PCIE_MSI_REQ_GEN                         0x00000034
#define   VEN_MSI_REQ_PHASE_MASK                 0x80000000
#define   VEN_MSI_REQ_PHASE_SHIFT                        31
#define   VEN_MSI_FUNC_NUM_MASK                  0x00000700
#define   VEN_MSI_FUNC_NUM_SHIFT                          8
#define   VEN_MSI_TC_MASK                        0x000000e0
#define   VEN_MSI_TC_SHIFT                                5
#define   VEN_MSI_VECTOT_MASK                    0x0000001f
#define   VEN_MSI_VECTOT_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 ven_msi_vectot:5;
        u32 ven_msi_tc:3;
        u32 ven_msi_func_num:3;
        u32 rsvd_11:20;
        u32 ven_msi_req_phase:1;
    } b;
} pcie_msi_req_gen_t;

#define PCIE_PIN_DBG_SEL                         0x00000038
#define   PCIE_PIN_DBG_SEL_MASK                  0xffffffff
#define   PCIE_PIN_DBG_SEL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_pin_dbg_sel:32;
    } b;
} pcie_pin_dbg_sel_t;

#define PCIE_PIPE_STATUS                         0x0000003c
#define   PCIE_PIPE_STATUS_MASK                  0x7fffffff
#define   PCIE_PIPE_STATUS_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_pipe_status:31;
        u32 rsvd_31:1;
    } b;
} pcie_pipe_status_t;

#define PCIE_FSM_LOG_SEL                         0x00000040
#define   RXSTS_LOG_DIS_MASK                     0x00000002
#define   RXSTS_LOG_DIS_SHIFT                             1
#define   PCIE_LOG_EN_MASK                       0x00000001
#define   PCIE_LOG_EN_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 pcie_log_en:1;
        u32 rxsts_log_dis:1;
        u32 rsvd_2:30;
    } b;
} pcie_fsm_log_sel_t;

#define PCIE_PM_MASTER_0                         0x00000044
#define   PM_MASTER_LOG_REG0_MASK                0xffffffff
#define   PM_MASTER_LOG_REG0_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 pm_master_log_reg0:32;
    } b;
} pcie_pm_master_0_t;

#define PCIE_PM_MASTER_1                         0x00000048
#define   PM_MASTER_LOG_REG1_MASK                0xffffffff
#define   PM_MASTER_LOG_REG1_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 pm_master_log_reg1:32;
    } b;
} pcie_pm_master_1_t;

#define PCIE_PM_MASTER_2                         0x0000004c
#define   PM_MASTER_LOG_REG2_MASK                0xffffffff
#define   PM_MASTER_LOG_REG2_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 pm_master_log_reg2:32;
    } b;
} pcie_pm_master_2_t;

#define PCIE_MAC_PMU_CST                         0x00000050
#define   MAC_PMU_LOG_REG_MASK                   0xffffffff
#define   MAC_PMU_LOG_REG_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 mac_pmu_log_reg:32;
    } b;
} pcie_mac_pmu_cst_t;

#define PCIE_L1SUB_STATE                         0x00000054
#define   L1SUB_LOG_REG_MASK                     0xffffffff
#define   L1SUB_LOG_REG_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 l1sub_log_reg:32;
    } b;
} pcie_l1sub_state_t;

#define PCIE_LTSSM_STAT0                         0x00000058
#define   LTSSM_LOG_REG0_MASK                    0xffffffff
#define   LTSSM_LOG_REG0_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 ltssm_log_reg0:32;
    } b;
} pcie_ltssm_stat0_t;

#define PCIE_LTSSM_STAT1                         0x0000005c
#define   LTSSM_LOG_REG1_MASK                    0xffffffff
#define   LTSSM_LOG_REG1_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 ltssm_log_reg1:32;
    } b;
} pcie_ltssm_stat1_t;

#define PCIE_LTSSM_STAT2                         0x00000060
#define   LTSSM_LOG_REG2_MASK                    0xffffffff
#define   LTSSM_LOG_REG2_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 ltssm_log_reg2:32;
    } b;
} pcie_ltssm_stat2_t;

#define PCIE_PM_GLUE_LGC                         0x00000064
#define   PM_GLUE_LGC_MASK                       0xffffffff
#define   PM_GLUE_LGC_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 pm_glue_lgc:32;
    } b;
} pcie_pm_glue_lgc_t;

#define PCIE_PHY_NS_BTMP                         0x00000068
#define   PHY_NS_BTMP_MASK                       0xffffffff
#define   PHY_NS_BTMP_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 phy_ns_btmp:32;
    } b;
} pcie_phy_ns_btmp_t;

#define PCIE_EQ_PSET_RTX                         0x0000006c
#define   INT_PHY_MAC_PSET_RTX_MASK              0x0000ffff
#define   INT_PHY_MAC_PSET_RTX_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 int_phy_mac_pset_rtx:16;
        u32 rsvd_16:16;
    } b;
} pcie_eq_pset_rtx_t;

#define PCIE_FLR_VF_DNE0                         0x00000070
#define   APP_FLR_VF_DONE0_MASK                  0xffffffff
#define   APP_FLR_VF_DONE0_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 app_flr_vf_done0:32;
    } b;
} pcie_flr_vf_dne0_t;

#define PCIE_FLR_VF_DNE1                         0x00000074
#define   APP_FLR_VF_DONE1_MASK                  0xffffffff
#define   APP_FLR_VF_DONE1_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 app_flr_vf_done1:32;
    } b;
} pcie_flr_vf_dne1_t;

#define CFG_FLR_VF_ACTIVE0                       0x00000078
#define   CFG_FLR_VF_ACTIVE0_MASK                0xffffffff
#define   CFG_FLR_VF_ACTIVE0_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 cfg_flr_vf_active0:32;
    } b;
} cfg_flr_vf_active0_t;

#define CFG_FLR_VF_ACTIVE1                       0x0000007c
#define   CFG_FLR_VF_ACTIVE1_MASK                0xffffffff
#define   CFG_FLR_VF_ACTIVE1_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 cfg_flr_vf_active1:32;
    } b;
} cfg_flr_vf_active1_t;

#define PCIE_BAR0_STARTL                         0x00000080
#define   PCIE_BAR0_STARTL_MASK                  0xffffffff
#define   PCIE_BAR0_STARTL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_bar0_startl:32;
    } b;
} pcie_bar0_startl_t;

#define PCIE_BAR0_STARTH                         0x00000084
#define   PCIE_BAR0_STARTH_MASK                  0xffffffff
#define   PCIE_BAR0_STARTH_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_bar0_starth:32;
    } b;
} pcie_bar0_starth_t;

#define PCIE_BAR0_LIMITL                         0x00000088
#define   PCIE_BAR0_LIMITL_MASK                  0xffffffff
#define   PCIE_BAR0_LIMITL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_bar0_limitl:32;
    } b;
} pcie_bar0_limitl_t;

#define PCIE_BAR0_LIMITH                         0x0000008c
#define   PCIE_BAR0_LIMITH_MASK                  0xffffffff
#define   PCIE_BAR0_LIMITH_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_bar0_limith:32;
    } b;
} pcie_bar0_limith_t;

#define PCIE_BAR4_STARTL                         0x00000090
#define   PCIE_BAR4_STARTL_MASK                  0xffffffff
#define   PCIE_BAR4_STARTL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_bar4_startl:32;
    } b;
} pcie_bar4_startl_t;

#define PCIE_BAR4_STARTH                         0x00000094
#define   PCIE_BAR4_STARTH_MASK                  0xffffffff
#define   PCIE_BAR4_STARTH_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_bar4_starth:32;
    } b;
} pcie_bar4_starth_t;

#define PCIE_BAR4_LIMITL                         0x00000098
#define   PCIE_BAR4_LIMITL_MASK                  0xffffffff
#define   PCIE_BAR4_LIMITL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_bar4_limitl:32;
    } b;
} pcie_bar4_limitl_t;

#define PCIE_BAR4_LIMITH                         0x0000009c
#define   PCIE_BAR4_LIMITH_MASK                  0xffffffff
#define   PCIE_BAR4_LIMITH_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_bar4_limith:32;
    } b;
} pcie_bar4_limith_t;

#define PCIE_EPROM_START                         0x000000a0
#define   PCIE_EPROM_START_MASK                  0xffffffff
#define   PCIE_EPROM_START_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_eprom_start:32;
    } b;
} pcie_eprom_start_t;

#define PCIE_EPROM_LIMIT                         0x000000a4
#define   PCIE_EPROM_LIMIT_MASK                  0xffffffff
#define   PCIE_EPROM_LIMIT_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_eprom_limit:32;
    } b;
} pcie_eprom_limit_t;

#define PCIE_CFG_MPS_MRR                         0x000000a8
#define   PCIE_CFG_MRR_MASK                      0x00000038
#define   PCIE_CFG_MRR_SHIFT                              3
#define   PCIE_CFG_MPS_MASK                      0x00000007
#define   PCIE_CFG_MPS_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 pcie_cfg_mps:3;
        u32 pcie_cfg_mrr:3;
        u32 rsvd_6:26;
    } b;
} pcie_cfg_mps_mrr_t;

#define R_AXI_DBI_H16B                           0x000000b0
#define   R_AXI_DBI_H16B_MASK                    0xffff0000
#define   R_AXI_DBI_H16B_SHIFT                           16

typedef union {
    u32 all;
    struct {
        u32 rsvd_0:16;
        u32 r_axi_dbi_h16b:16;
    } b;
} r_axi_dbi_h16b_t;

#define PCIE_CORE_STATUS2                        0x000000b4
#define   CFG_ASLK_PMCTRL_MASK                   0x00000300
#define   CFG_ASLK_PMCTRL_SHIFT                           8
#define   NEG_LINK_SPEED_MASK                    0x000000f0
#define   NEG_LINK_SPEED_SHIFT                            4
#define   NEG_LINK_WIDTH_MASK                    0x0000000f
#define   NEG_LINK_WIDTH_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 neg_link_width:4;
        u32 neg_link_speed:4;
        u32 cfg_aslk_pmctrl:2;
        u32 rsvd_10:22;
    } b;
} pcie_core_status2_t;

#define PHY_POWER_SAVING                         0x000000b8
#define   PHY_PLL_DISABLED_MASK                  0x00000004
#define   PHY_PLL_DISABLED_SHIFT                          2
#define   DIS_PHY_TX_MASK                        0x00000002
#define   DIS_PHY_TX_SHIFT                                1
#define   DIS_PHY_PLL_MASK                       0x00000001
#define   DIS_PHY_PLL_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 dis_phy_pll:1;
        u32 dis_phy_tx:1;
        u32 phy_pll_disabled:1;
        u32 rsvd_3:29;
    } b;
} phy_power_saving_t;

#define PCIE_INTR_MASK2                          0x000000c0
#define   PCIE_INTR_MASK2_MASK                   0xffffffff
#define   PCIE_INTR_MASK2_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 pcie_intr_mask2:32;
    } b;
} pcie_intr_mask2_t;

#define PCIE_MASKD_INTR2                         0x000000c4
#define   PCIE_MASKD_INTR2_MASK                  0xffffffff
#define   PCIE_MASKD_INTR2_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_maskd_intr2:32;
    } b;
} pcie_maskd_intr2_t;

#define PCIE_INTR_MASK3                          0x000000c8
#define   PCIE_INTR_MASK3_MASK                   0xffffffff
#define   PCIE_INTR_MASK3_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 pcie_intr_mask3:32;
    } b;
} pcie_intr_mask3_t;

#define PCIE_MASKD_INTR3                         0x000000cc
#define   PCIE_MASKD_INTR3_MASK                  0xffffffff
#define   PCIE_MASKD_INTR3_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 pcie_maskd_intr3:32;
    } b;
} pcie_maskd_intr3_t;

#define PCIE_RXSTS_L0_RCVRY_LOG0                 0x000000d0
#define   RXSTS_L0_RCVRY_LOG_REG0_MASK           0xffffffff
#define   RXSTS_L0_RCVRY_LOG_REG0_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 rxsts_l0_rcvry_log_reg0:32;
    } b;
} pcie_rxsts_l0_rcvry_log0_t;

#define PCIE_RXSTS_L0_RCVRY_LOG1                 0x000000d4
#define   RXSTS_L0_RCVRY_LOG_REG1_MASK           0xffffffff
#define   RXSTS_L0_RCVRY_LOG_REG1_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 rxsts_l0_rcvry_log_reg1:32;
    } b;
} pcie_rxsts_l0_rcvry_log1_t;

#define PCIE_RXSTS_L0_RCVRY_LOG2                 0x000000d8
#define   RXSTS_L0_RCVRY_LOG_REG2_MASK           0xffffffff
#define   RXSTS_L0_RCVRY_LOG_REG2_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 rxsts_l0_rcvry_log_reg2:32;
    } b;
} pcie_rxsts_l0_rcvry_log2_t;

#define PCIE_RXSTS_L0_RCVRY_LOG3                 0x000000dc
#define   RXSTS_L0_RCVRY_LOG_REG3_MASK           0xffffffff
#define   RXSTS_L0_RCVRY_LOG_REG3_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 rxsts_l0_rcvry_log_reg3:32;
    } b;
} pcie_rxsts_l0_rcvry_log3_t;

#define PCIE_RXSTS_L0_RCVRY_LOG4                 0x000000e0
#define   RXSTS_L0_RCVRY_LOG_REG4_MASK           0xffffffff
#define   RXSTS_L0_RCVRY_LOG_REG4_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 rxsts_l0_rcvry_log_reg4:32;
    } b;
} pcie_rxsts_l0_rcvry_log4_t;

#define PCIE_RXSTS_L0_RCVRY_LOG5                 0x000000e4
#define   RXSTS_L0_RCVRY_LOG_REG5_MASK           0xffffffff
#define   RXSTS_L0_RCVRY_LOG_REG5_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 rxsts_l0_rcvry_log_reg5:32;
    } b;
} pcie_rxsts_l0_rcvry_log5_t;

#define PCIE_RXSTS_L0_RCVRY_LOG6                 0x000000e8
#define   RXSTS_L0_RCVRY_LOG_REG6_MASK           0xffffffff
#define   RXSTS_L0_RCVRY_LOG_REG6_SHIFT                   0

typedef union {
    u32 all;
    struct {
        u32 rxsts_l0_rcvry_log_reg6:32;
    } b;
} pcie_rxsts_l0_rcvry_log6_t;

#define PCIE_RXSTS_L0_RCVRY_LOG7                 0x000000ec
#define   RXSTS_L0_RCVRY_LOG_REG7_MASK           0xffffffff
#define   RXSTS_L0_RCVRY_LOG_REG7_SHIFT                   0
typedef union {
    u32 all;
    struct {
        u32 rxsts_l0_rcvry_log_reg7:32;
    } b;
} pcie_rxsts_l0_rcvry_log7_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ pcie_control_reg_t pcie_control_reg;
    /* 0x0004 */ pcie_unmsk_intr_t pcie_unmsk_intr;
    /* 0x0008 */ pcie_intr_mask0_t pcie_intr_mask0;
    /* 0x000c */ pcie_maskd_intr0_t pcie_maskd_intr0;
    /* 0x0010 */ pcie_intr_mask1_t pcie_intr_mask1;
    /* 0x0014 */ pcie_maskd_intr1_t pcie_maskd_intr1;
    /* 0x0018 */ pcie_core_status_t pcie_core_status;
    /* 0x001c */ pcie_powr_status_t pcie_powr_status;
    /* 0x0020 */ pcie_ltr_message_t pcie_ltr_message;
    /* 0x0024 */ pcie_flr_dne_set_t pcie_flr_dne_set;
    /* 0x0028 */ pcie_save_st_ack_t pcie_save_st_ack;
    /* 0x002c */ pcie_rstr_st_ack_t pcie_rstr_st_ack;
    /* 0x0030 */ pcie_app_req_fls_t pcie_app_req_fls;
    /* 0x0034 */ pcie_msi_req_gen_t pcie_msi_req_gen;
    /* 0x0038 */ pcie_pin_dbg_sel_t pcie_pin_dbg_sel;
    /* 0x003c */ pcie_pipe_status_t pcie_pipe_status;
    /* 0x0040 */ pcie_fsm_log_sel_t pcie_fsm_log_sel;
    /* 0x0044 */ pcie_pm_master_0_t pcie_pm_master_0;
    /* 0x0048 */ pcie_pm_master_1_t pcie_pm_master_1;
    /* 0x004c */ pcie_pm_master_2_t pcie_pm_master_2;
    /* 0x0050 */ pcie_mac_pmu_cst_t pcie_mac_pmu_cst;
    /* 0x0054 */ pcie_l1sub_state_t pcie_l1sub_state;
    /* 0x0058 */ pcie_ltssm_stat0_t pcie_ltssm_stat0;
    /* 0x005c */ pcie_ltssm_stat1_t pcie_ltssm_stat1;
    /* 0x0060 */ pcie_ltssm_stat2_t pcie_ltssm_stat2;
    /* 0x0064 */ pcie_pm_glue_lgc_t pcie_pm_glue_lgc;
    /* 0x0068 */ pcie_phy_ns_btmp_t pcie_phy_ns_btmp;
    /* 0x006c */ pcie_eq_pset_rtx_t pcie_eq_pset_rtx;
    /* 0x0070 */ pcie_flr_vf_dne0_t pcie_flr_vf_dne0;
    /* 0x0074 */ pcie_flr_vf_dne1_t pcie_flr_vf_dne1;
    /* 0x0078 */ cfg_flr_vf_active0_t cfg_flr_vf_active0;
    /* 0x007c */ cfg_flr_vf_active1_t cfg_flr_vf_active1;
    /* 0x0080 */ pcie_bar0_startl_t pcie_bar0_startl;
    /* 0x0084 */ pcie_bar0_starth_t pcie_bar0_starth;
    /* 0x0088 */ pcie_bar0_limitl_t pcie_bar0_limitl;
    /* 0x008c */ pcie_bar0_limith_t pcie_bar0_limith;
    /* 0x0090 */ pcie_bar4_startl_t pcie_bar4_startl;
    /* 0x0094 */ pcie_bar4_starth_t pcie_bar4_starth;
    /* 0x0098 */ pcie_bar4_limitl_t pcie_bar4_limitl;
    /* 0x009c */ pcie_bar4_limith_t pcie_bar4_limith;
    /* 0x00a0 */ pcie_eprom_start_t pcie_eprom_start;
    /* 0x00a4 */ pcie_eprom_limit_t pcie_eprom_limit;
    /* 0x00a8 */ pcie_cfg_mps_mrr_t pcie_cfg_mps_mrr;
    /* 0x00ac */ u32 rsvd_ac;
    /* 0x00b0 */ r_axi_dbi_h16b_t r_axi_dbi_h16b;
    /* 0x00b4 */ pcie_core_status2_t pcie_core_status2;
    /* 0x00b8 */ phy_power_saving_t phy_power_saving;
    /* 0x00bc */ u32 rsvd_bc;
    /* 0x00c0 */ pcie_intr_mask2_t pcie_intr_mask2;
    /* 0x00c4 */ pcie_maskd_intr2_t pcie_maskd_intr2;
    /* 0x00c8 */ pcie_intr_mask3_t pcie_intr_mask3;
    /* 0x00cc */ pcie_maskd_intr3_t pcie_maskd_intr3;
    /* 0x00d0 */ pcie_rxsts_l0_rcvry_log0_t pcie_rxsts_l0_rcvry_log0;
    /* 0x00d4 */ pcie_rxsts_l0_rcvry_log1_t pcie_rxsts_l0_rcvry_log1;
    /* 0x00d8 */ pcie_rxsts_l0_rcvry_log2_t pcie_rxsts_l0_rcvry_log2;
    /* 0x00dc */ pcie_rxsts_l0_rcvry_log3_t pcie_rxsts_l0_rcvry_log3;
    /* 0x00e0 */ pcie_rxsts_l0_rcvry_log4_t pcie_rxsts_l0_rcvry_log4;
    /* 0x00e4 */ pcie_rxsts_l0_rcvry_log5_t pcie_rxsts_l0_rcvry_log5;
    /* 0x00e8 */ pcie_rxsts_l0_rcvry_log6_t pcie_rxsts_l0_rcvry_log6;
    /* 0x00ec */ pcie_rxsts_l0_rcvry_log7_t pcie_rxsts_l0_rcvry_log7;
} pcie_wrapper_register_regs_t;


#endif /* rev 3 */