//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _SMB_REGISTERS_H_
#define _SMB_REGISTERS_H_

#define SMB_INTR_STS                             0x00000000
#define   I2C_PAUSE_STS_MASK                     0x00010000
#define   I2C_PAUSE_STS_SHIFT                            16
#define   TMP_SMBALERT_STS_MASK                  0x00008000
#define   TMP_SMBALERT_STS_SHIFT                         15
#define   NVME_INF_W_STS_MASK                    0x00004000
#define   NVME_INF_W_STS_SHIFT                           14
#define   ILL_ARP_CMD_STS_MASK                   0x00002000
#define   ILL_ARP_CMD_STS_SHIFT                          13
#define   IGN_ARP_CMD_STS_MASK                   0x00001000
#define   IGN_ARP_CMD_STS_SHIFT                          12
#define   RX_PEC_ERR_STS_MASK                    0x00000800
#define   RX_PEC_ERR_STS_SHIFT                           11
#define   RD_ACK_DONE_ERR_STS_MASK               0x00000400
#define   RD_ACK_DONE_ERR_STS_SHIFT                      10
#define   WR_ACK_DONE_ERR_STS_MASK               0x00000200
#define   WR_ACK_DONE_ERR_STS_SHIFT                       9
#define   PP_TO_STOP_STS_MASK                    0x00000100
#define   PP_TO_STOP_STS_SHIFT                            8
#define   TIMEOUT_RST_STS_MASK                   0x00000080
#define   TIMEOUT_RST_STS_SHIFT                           7
#define   ARB_LOST_STS_MASK                      0x00000040
#define   ARB_LOST_STS_SHIFT                              6
#define   SLV_TRAN_DONE_ABNML_STS_MASK           0x00000020
#define   SLV_TRAN_DONE_ABNML_STS_SHIFT                   5
#define   MAS_TRAN_DONE_ABNML_STS_MASK           0x00000010
#define   MAS_TRAN_DONE_ABNML_STS_SHIFT                   4
#define   SLV_TRAN_DONE_NML_STS_MASK             0x00000008
#define   SLV_TRAN_DONE_NML_STS_SHIFT                     3
#define   MAS_TRAN_DONE_NML_STS_MASK             0x00000004
#define   MAS_TRAN_DONE_NML_STS_SHIFT                     2
#define   SLV_TRAN_START_STS_MASK                0x00000002
#define   SLV_TRAN_START_STS_SHIFT                        1
#define   MAS_TRAN_START_STS_MASK                0x00000001
#define   MAS_TRAN_START_STS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 mas_tran_start_sts:1;
        u32 slv_tran_start_sts:1;
        u32 mas_tran_done_nml_sts:1;
        u32 slv_tran_done_nml_sts:1;
        u32 mas_tran_done_abnml_sts:1;
        u32 slv_tran_done_abnml_sts:1;
        u32 arb_lost_sts:1;
        u32 timeout_rst_sts:1;
        u32 pp_to_stop_sts:1;
        u32 wr_ack_done_err_sts:1;
        u32 rd_ack_done_err_sts:1;
        u32 rx_pec_err_sts:1;
        u32 ign_arp_cmd_sts:1;
        u32 ill_arp_cmd_sts:1;
        u32 nvme_inf_w_sts:1;
        u32 tmp_smbalert_sts:1;
        u32 i2c_pause_sts:1;
        u32 rsvd_17:15;
    } b;
} smb_intr_sts_t;

#define SMB_INTERRUPT_MASK                       0x00000004
#define   INTR_MASK16_MASK                       0x00010000
#define   INTR_MASK16_SHIFT                              16
#define   INTR_MASK15_MASK                       0x00008000
#define   INTR_MASK15_SHIFT                              15
#define   INTR_MASK14_MASK                       0x00004000
#define   INTR_MASK14_SHIFT                              14
#define   INTR_MASK13_MASK                       0x00002000
#define   INTR_MASK13_SHIFT                              13
#define   INTR_MASK12_MASK                       0x00001000
#define   INTR_MASK12_SHIFT                              12
#define   INTR_MASK11_MASK                       0x00000800
#define   INTR_MASK11_SHIFT                              11
#define   INTR_MASK10_MASK                       0x00000400
#define   INTR_MASK10_SHIFT                              10
#define   INTR_MASK9_MASK                        0x00000200
#define   INTR_MASK9_SHIFT                                9
#define   INTR_MASK8_MASK                        0x00000100
#define   INTR_MASK8_SHIFT                                8
#define   INTR_MASK7_MASK                        0x00000080
#define   INTR_MASK7_SHIFT                                7
#define   INTR_MASK6_MASK                        0x00000040
#define   INTR_MASK6_SHIFT                                6
#define   INTR_MASK5_MASK                        0x00000020
#define   INTR_MASK5_SHIFT                                5
#define   INTR_MASK4_MASK                        0x00000010
#define   INTR_MASK4_SHIFT                                4
#define   INTR_MASK3_MASK                        0x00000008
#define   INTR_MASK3_SHIFT                                3
#define   INTR_MASK2_MASK                        0x00000004
#define   INTR_MASK2_SHIFT                                2
#define   INTR_MASK1_MASK                        0x00000002
#define   INTR_MASK1_SHIFT                                1
#define   INTR_MASK0_MASK                        0x00000001
#define   INTR_MASK0_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 intr_mask0:1;
        u32 intr_mask1:1;
        u32 intr_mask2:1;
        u32 intr_mask3:1;
        u32 intr_mask4:1;
        u32 intr_mask5:1;
        u32 intr_mask6:1;
        u32 intr_mask7:1;
        u32 intr_mask8:1;
        u32 intr_mask9:1;
        u32 intr_mask10:1;
        u32 intr_mask11:1;
        u32 intr_mask12:1;
        u32 intr_mask13:1;
        u32 intr_mask14:1;
        u32 intr_mask15:1;
        u32 intr_mask16:1;
        u32 rsvd_17:15;
    } b;
} smb_interrupt_mask_t;

#define SMB_STATUS_REGISTER                      0x00000008
#define   NVME_SMB_ARB_MASK                      0x00002000
#define   NVME_SMB_ARB_SHIFT                             13
#define   EXT_SMBCLK_PERD_MASK                   0x00001000
#define   EXT_SMBCLK_PERD_SHIFT                          12
#define   SMBALERT_LEVEL_MASK                    0x00000400
#define   SMBALERT_LEVEL_SHIFT                           10
#define   SMBDAT_LEVEL_MASK                      0x00000200
#define   SMBDAT_LEVEL_SHIFT                              9
#define   SMBCLK_LEVEL_MASK                      0x00000100
#define   SMBCLK_LEVEL_SHIFT                              8
#define   SMB_BUSY_MASK                          0x00000010
#define   SMB_BUSY_SHIFT                                  4
#define   SMB_AV_FLAG_MASK                       0x00000002
#define   SMB_AV_FLAG_SHIFT                               1
#define   SMB_AR_FLAG_MASK                       0x00000001
#define   SMB_AR_FLAG_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 smb_ar_flag:1;
        u32 smb_av_flag:1;
        u32 rsvd_2:2;
        u32 smb_busy:1;
        u32 rsvd_5:3;
        u32 smbclk_level:1;
        u32 smbdat_level:1;
        u32 smbalert_level:1;
        u32 rsvd_11:1;
        u32 ext_smbclk_perd:1;
        u32 nvme_smb_arb:1;
        u32 rsvd_14:18;
    } b;
} smb_status_register_t;

#define SMB_FSM                                  0x0000000c
#define   SMB_FSM_STS_MASK                       0x1fffffff
#define   SMB_FSM_STS_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 smb_fsm_sts:29;
        u32 rsvd_29:3;
    } b;
} smb_fsm_t;

#define SMB_CONTROL_REGISTER                     0x00000010
#define   SMB_I2C_DEV_33_EN_MASK                 0x00100000
#define   SMB_I2C_DEV_33_EN_SHIFT                        20
#define   SMB_I2C_DEV_1B_EN_MASK                 0x00080000
#define   SMB_I2C_DEV_1B_EN_SHIFT                        19
#define   SMB_I2C_DEV_VPD_EN_MASK                0x00040000
#define   SMB_I2C_DEV_VPD_EN_SHIFT                       18
#define   SMB_TRAN_I2C_EN_MASK                   0x00020000
#define   SMB_TRAN_I2C_EN_SHIFT                          17
#define   SMB_SLV_TIMER_OPT_MASK                 0x00010000
#define   SMB_SLV_TIMER_OPT_SHIFT                        16
#define   SMB_PP_TO_STOP_OPT_MASK                0x00008000
#define   SMB_PP_TO_STOP_OPT_SHIFT                       15
#define   SMB_SW_ARP_RST_MASK                    0x00004000
#define   SMB_SW_ARP_RST_SHIFT                           14
#define   SMB_ALERT_TRIG_MASK                    0x00002000
#define   SMB_ALERT_TRIG_SHIFT                           13
#define   SMB_MAS_TRAN_ST_MASK                   0x00001000
#define   SMB_MAS_TRAN_ST_SHIFT                          12
#define   SMB_TRAN_TP_SEL_MASK                   0x00000f00
#define   SMB_TRAN_TP_SEL_SHIFT                           8
#define   SMB_LOW_MSEXT_EN_MASK                  0x00000080
#define   SMB_LOW_MSEXT_EN_SHIFT                          7
#define   SMB_TIMEOUT_RST_EN_MASK                0x00000040
#define   SMB_TIMEOUT_RST_EN_SHIFT                        6
#define   SMB_SLV_OE_EN_MASK                     0x00000020
#define   SMB_SLV_OE_EN_SHIFT                             5
#define   SMB_CLK_STRETCH_EN_MASK                0x00000010
#define   SMB_CLK_STRETCH_EN_SHIFT                        4
#define   SMB_PEC_EN_MASK                        0x00000008
#define   SMB_PEC_EN_SHIFT                                3
#define   SMB_PSA_DEV_MASK                       0x00000004
#define   SMB_PSA_DEV_SHIFT                               2
#define   SMB_EN_MASK                            0x00000002
#define   SMB_EN_SHIFT                                    1
#define   SMB_SW_RST_MASK                        0x00000001
#define   SMB_SW_RST_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_sw_rst:1;
        u32 smb_en:1;
        u32 smb_psa_dev:1;
        u32 smb_pec_en:1;
        u32 smb_clk_stretch_en:1;
        u32 smb_slv_oe_en:1;
        u32 smb_timeout_rst_en:1;
        u32 smb_low_msext_en:1;
        u32 smb_tran_tp_sel:4;
        u32 smb_mas_tran_st:1;
        u32 smb_alert_trig:1;
        u32 smb_sw_arp_rst:1;
        u32 smb_pp_to_stop_opt:1;
        u32 smb_slv_timer_opt:1;
        u32 smb_tran_i2c_en:1;
        u32 smb_i2c_dev_vpd_en:1;
        u32 smb_i2c_dev_1b_en:1;
        u32 smb_i2c_dev_33_en:1;
        u32 rsvd_21:11;
    } b;
} smb_control_register_t;

#define SMB_STROBE_CNT                           0x00000014
#define   SMB_STROBE_CNT_MASK                    0x000000ff
#define   SMB_STROBE_CNT_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 smb_strobe_cnt:8;
        u32 rsvd_8:24;
    } b;
} smb_strobe_cnt_t;

#define SMBCLK_TIMEOUT                           0x00000018
#define   SMBCLK_TIMEOUT_MASK                    0x000fffff
#define   SMBCLK_TIMEOUT_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 smbclk_timeout:20;
        u32 rsvd_20:12;
    } b;
} smbclk_timeout_t;

#define SMB_LOW_MEXT                             0x0000001c
#define   SMB_LOW_MEXT_MASK                      0x000fffff
#define   SMB_LOW_MEXT_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 smb_low_mext:20;
        u32 rsvd_20:12;
    } b;
} smb_low_mext_t;

#define SMB_LOW_SEXT                             0x00000020
#define   SMB_LOW_SEXT_MASK                      0x000fffff
#define   SMB_LOW_SEXT_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 smb_low_sext:20;
        u32 rsvd_20:12;
    } b;
} smb_low_sext_t;

#define SMB_TIMER_0                              0x00000024
#define   SMB_START_D_TIMER_MASK                 0xff000000
#define   SMB_START_D_TIMER_SHIFT                        24
#define   SMB_START_C_TIMER_MASK                 0x00ff0000
#define   SMB_START_C_TIMER_SHIFT                        16
#define   SMB_START_B_TIMER_MASK                 0x0000ff00
#define   SMB_START_B_TIMER_SHIFT                         8
#define   SMB_START_A_TIMER_MASK                 0x000000ff
#define   SMB_START_A_TIMER_SHIFT                         0

typedef union {
    u32 all;
    struct {
        u32 smb_start_a_timer:8;
        u32 smb_start_b_timer:8;
        u32 smb_start_c_timer:8;
        u32 smb_start_d_timer:8;
    } b;
} smb_timer_0_t;

#define SMB_TIMER_1                              0x00000028
#define   SMB_STOP_D_TIMER_MASK                  0xff000000
#define   SMB_STOP_D_TIMER_SHIFT                         24
#define   SMB_STOP_C_TIMER_MASK                  0x00ff0000
#define   SMB_STOP_C_TIMER_SHIFT                         16
#define   SMB_STOP_B_TIMER_MASK                  0x0000ff00
#define   SMB_STOP_B_TIMER_SHIFT                          8
#define   SMB_STOP_A_TIMER_MASK                  0x000000ff
#define   SMB_STOP_A_TIMER_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 smb_stop_a_timer:8;
        u32 smb_stop_b_timer:8;
        u32 smb_stop_c_timer:8;
        u32 smb_stop_d_timer:8;
    } b;
} smb_timer_1_t;

#define SMB_TIMER_2                              0x0000002c
#define   SMB_WR_D_TIMER_MASK                    0xff000000
#define   SMB_WR_D_TIMER_SHIFT                           24
#define   SMB_WR_C_TIMER_MASK                    0x00ff0000
#define   SMB_WR_C_TIMER_SHIFT                           16
#define   SMB_WR_B_TIMER_MASK                    0x0000ff00
#define   SMB_WR_B_TIMER_SHIFT                            8
#define   SMB_WR_A_TIMER_MASK                    0x000000ff
#define   SMB_WR_A_TIMER_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 smb_wr_a_timer:8;
        u32 smb_wr_b_timer:8;
        u32 smb_wr_c_timer:8;
        u32 smb_wr_d_timer:8;
    } b;
} smb_timer_2_t;

#define SMB_TIMER_3                              0x00000030
#define   SMB_RD_C_TIMER_MASK                    0xff000000
#define   SMB_RD_C_TIMER_SHIFT                           24
#define   SMB_RD_B_TIMER_MASK                    0x00ff0000
#define   SMB_RD_B_TIMER_SHIFT                           16
#define   SMB_RD_A_TIMER_MASK                    0x0000ff00
#define   SMB_RD_A_TIMER_SHIFT                            8
#define   SMB_WR_E_TIMER_MASK                    0x000000ff
#define   SMB_WR_E_TIMER_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 smb_wr_e_timer:8;
        u32 smb_rd_a_timer:8;
        u32 smb_rd_b_timer:8;
        u32 smb_rd_c_timer:8;
    } b;
} smb_timer_3_t;

#define SMB_TIMER_4                              0x00000034
#define   SMB_ACK_B_TIMER_MASK                   0xff000000
#define   SMB_ACK_B_TIMER_SHIFT                          24
#define   SMB_ACK_A_TIMER_MASK                   0x00ff0000
#define   SMB_ACK_A_TIMER_SHIFT                          16
#define   SMB_RD_E_TIMER_MASK                    0x0000ff00
#define   SMB_RD_E_TIMER_SHIFT                            8
#define   SMB_RD_D_TIMER_MASK                    0x000000ff
#define   SMB_RD_D_TIMER_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 smb_rd_d_timer:8;
        u32 smb_rd_e_timer:8;
        u32 smb_ack_a_timer:8;
        u32 smb_ack_b_timer:8;
    } b;
} smb_timer_4_t;

#define SMB_TIMER_5                              0x00000038
#define   SMB_START_R_TIMER_MASK                 0xff000000
#define   SMB_START_R_TIMER_SHIFT                        24
#define   SMB_ACK_E_TIMER_MASK                   0x00ff0000
#define   SMB_ACK_E_TIMER_SHIFT                          16
#define   SMB_ACK_D_TIMER_MASK                   0x0000ff00
#define   SMB_ACK_D_TIMER_SHIFT                           8
#define   SMB_ACK_C_TIMER_MASK                   0x000000ff
#define   SMB_ACK_C_TIMER_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 smb_ack_c_timer:8;
        u32 smb_ack_d_timer:8;
        u32 smb_ack_e_timer:8;
        u32 smb_start_r_timer:8;
    } b;
} smb_timer_5_t;

#define SMB_DEV_STS_DATA_1                       0x0000003c
#define   SMB_DEV_STS_DATA04_MASK                0xff000000
#define   SMB_DEV_STS_DATA04_SHIFT                       24
#define   SMB_DEV_STS_DATA03_MASK                0x00ff0000
#define   SMB_DEV_STS_DATA03_SHIFT                       16
#define   SMB_DEV_STS_DATA02_MASK                0x0000ff00
#define   SMB_DEV_STS_DATA02_SHIFT                        8
#define   SMB_DEV_STS_DATA01_MASK                0x000000ff
#define   SMB_DEV_STS_DATA01_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_sts_data01:8;
        u32 smb_dev_sts_data02:8;
        u32 smb_dev_sts_data03:8;
        u32 smb_dev_sts_data04:8;
    } b;
} smb_dev_sts_data_1_t;

#define SMB_DEV_STS_DATA_2                       0x00000040
#define   SMB_DEV_STS_PEC_MASK                   0x00ff0000
#define   SMB_DEV_STS_PEC_SHIFT                          16
#define   SMB_DEV_STS_DATA06_MASK                0x0000ff00
#define   SMB_DEV_STS_DATA06_SHIFT                        8
#define   SMB_DEV_STS_DATA05_MASK                0x000000ff
#define   SMB_DEV_STS_DATA05_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_sts_data05:8;
        u32 smb_dev_sts_data06:8;
        u32 smb_dev_sts_pec:8;
        u32 rsvd_24:8;
    } b;
} smb_dev_sts_data_2_t;

#define SMB_DEV_STC_DATA_1                       0x00000044
#define   SMB_DEV_STC_DATA04_MASK                0xff000000
#define   SMB_DEV_STC_DATA04_SHIFT                       24
#define   SMB_DEV_STC_DATA03_MASK                0x00ff0000
#define   SMB_DEV_STC_DATA03_SHIFT                       16
#define   SMB_DEV_STC_DATA02_MASK                0x0000ff00
#define   SMB_DEV_STC_DATA02_SHIFT                        8
#define   SMB_DEV_STC_DATA01_MASK                0x000000ff
#define   SMB_DEV_STC_DATA01_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_stc_data01:8;
        u32 smb_dev_stc_data02:8;
        u32 smb_dev_stc_data03:8;
        u32 smb_dev_stc_data04:8;
    } b;
} smb_dev_stc_data_1_t;

#define SMB_DEV_STC_DATA_2                       0x00000048
#define   SMB_DEV_STC_DATA08_MASK                0xff000000
#define   SMB_DEV_STC_DATA08_SHIFT                       24
#define   SMB_DEV_STC_DATA07_MASK                0x00ff0000
#define   SMB_DEV_STC_DATA07_SHIFT                       16
#define   SMB_DEV_STC_DATA06_MASK                0x0000ff00
#define   SMB_DEV_STC_DATA06_SHIFT                        8
#define   SMB_DEV_STC_DATA05_MASK                0x000000ff
#define   SMB_DEV_STC_DATA05_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_stc_data05:8;
        u32 smb_dev_stc_data06:8;
        u32 smb_dev_stc_data07:8;
        u32 smb_dev_stc_data08:8;
    } b;
} smb_dev_stc_data_2_t;

#define SMB_DEV_STC_DATA_3                       0x0000004c
#define   SMB_DEV_STC_DATA12_MASK                0xff000000
#define   SMB_DEV_STC_DATA12_SHIFT                       24
#define   SMB_DEV_STC_DATA11_MASK                0x00ff0000
#define   SMB_DEV_STC_DATA11_SHIFT                       16
#define   SMB_DEV_STC_DATA10_MASK                0x0000ff00
#define   SMB_DEV_STC_DATA10_SHIFT                        8
#define   SMB_DEV_STC_DATA09_MASK                0x000000ff
#define   SMB_DEV_STC_DATA09_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_stc_data09:8;
        u32 smb_dev_stc_data10:8;
        u32 smb_dev_stc_data11:8;
        u32 smb_dev_stc_data12:8;
    } b;
} smb_dev_stc_data_3_t;

#define SMB_DEV_STC_DATA_4                       0x00000050
#define   SMB_DEV_STC_DATA16_MASK                0xff000000
#define   SMB_DEV_STC_DATA16_SHIFT                       24
#define   SMB_DEV_STC_DATA15_MASK                0x00ff0000
#define   SMB_DEV_STC_DATA15_SHIFT                       16
#define   SMB_DEV_STC_DATA14_MASK                0x0000ff00
#define   SMB_DEV_STC_DATA14_SHIFT                        8
#define   SMB_DEV_STC_DATA13_MASK                0x000000ff
#define   SMB_DEV_STC_DATA13_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_stc_data13:8;
        u32 smb_dev_stc_data14:8;
        u32 smb_dev_stc_data15:8;
        u32 smb_dev_stc_data16:8;
    } b;
} smb_dev_stc_data_4_t;

#define SMB_DEV_STC_DATA_5                       0x00000054
#define   SMB_DEV_STC_DATA20_MASK                0xff000000
#define   SMB_DEV_STC_DATA20_SHIFT                       24
#define   SMB_DEV_STC_DATA19_MASK                0x00ff0000
#define   SMB_DEV_STC_DATA19_SHIFT                       16
#define   SMB_DEV_STC_DATA18_MASK                0x0000ff00
#define   SMB_DEV_STC_DATA18_SHIFT                        8
#define   SMB_DEV_STC_DATA17_MASK                0x000000ff
#define   SMB_DEV_STC_DATA17_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_stc_data17:8;
        u32 smb_dev_stc_data18:8;
        u32 smb_dev_stc_data19:8;
        u32 smb_dev_stc_data20:8;
    } b;
} smb_dev_stc_data_5_t;

#define SMB_DEV_STC_DATA_6                       0x00000058
#define   SMB_DEV_INF_RY_MASK                    0x01000000
#define   SMB_DEV_INF_RY_SHIFT                           24
#define   SMB_DEV_STC_PEC_MASK                   0x00ff0000
#define   SMB_DEV_STC_PEC_SHIFT                          16
#define   SMB_DEV_STC_DATA22_MASK                0x0000ff00
#define   SMB_DEV_STC_DATA22_SHIFT                        8
#define   SMB_DEV_STC_DATA21_MASK                0x000000ff
#define   SMB_DEV_STC_DATA21_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_stc_data21:8;
        u32 smb_dev_stc_data22:8;
        u32 smb_dev_stc_pec:8;
        u32 smb_dev_inf_ry:1;
        u32 rsvd_25:7;
    } b;
} smb_dev_stc_data_6_t;

#define SMB_DEV_UDID_0                           0x0000005c
#define   SMB_DEV_STC_DATA12_5c_MASK             0xff000000
#define   SMB_DEV_STC_DATA12_5c_SHIFT                    24
#define   SMB_DEV_STC_DATA13_5c_MASK             0x00ff0000
#define   SMB_DEV_STC_DATA13_5c_SHIFT                    16
#define   SMB_DEV_STC_DATA14_5c_MASK             0x0000ff00
#define   SMB_DEV_STC_DATA14_5c_SHIFT                     8
#define   SMB_DEV_STC_DATA15_5c_MASK             0x000000ff
#define   SMB_DEV_STC_DATA15_5c_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_stc_data15_5c:8;
        u32 smb_dev_stc_data14_5c:8;
        u32 smb_dev_stc_data13_5c:8;
        u32 smb_dev_stc_data12_5c:8;
    } b;
} smb_dev_udid_0_t;

#define SMB_DEV_UDID_1                           0x00000060
#define   SMB_DEV_STC_DATA08_60_MASK             0xff000000
#define   SMB_DEV_STC_DATA08_60_SHIFT                    24
#define   SMB_DEV_STC_DATA09_60_MASK             0x00ff0000
#define   SMB_DEV_STC_DATA09_60_SHIFT                    16
#define   SMB_DEV_STC_DATA10_60_MASK             0x0000ff00
#define   SMB_DEV_STC_DATA10_60_SHIFT                     8
#define   SMB_DEV_STC_DATA11_60_MASK             0x000000ff
#define   SMB_DEV_STC_DATA11_60_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_stc_data11_60:8;
        u32 smb_dev_stc_data10_60:8;
        u32 smb_dev_stc_data09_60:8;
        u32 smb_dev_stc_data08_60:8;
    } b;
} smb_dev_udid_1_t;

#define SMB_DEV_UDID_2                           0x00000064
#define   SMB_DEV_STC_DATA04_64_MASK             0xff000000
#define   SMB_DEV_STC_DATA04_64_SHIFT                    24
#define   SMB_DEV_STC_DATA05_64_MASK             0x00ff0000
#define   SMB_DEV_STC_DATA05_64_SHIFT                    16
#define   SMB_DEV_STC_DATA06_64_MASK             0x0000ff00
#define   SMB_DEV_STC_DATA06_64_SHIFT                     8
#define   SMB_DEV_STC_DATA07_64_MASK             0x000000ff
#define   SMB_DEV_STC_DATA07_64_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_stc_data07_64:8;
        u32 smb_dev_stc_data06_64:8;
        u32 smb_dev_stc_data05_64:8;
        u32 smb_dev_stc_data04_64:8;
    } b;
} smb_dev_udid_2_t;

#define SMB_DEV_UDID_3                           0x00000068
#define   SMB_DEV_STC_DATA00_MASK                0xff000000
#define   SMB_DEV_STC_DATA00_SHIFT                       24
#define   SMB_DEV_STC_DATA01_68_MASK             0x00ff0000
#define   SMB_DEV_STC_DATA01_68_SHIFT                    16
#define   SMB_DEV_STC_DATA02_68_MASK             0x0000ff00
#define   SMB_DEV_STC_DATA02_68_SHIFT                     8
#define   SMB_DEV_STC_DATA03_68_MASK             0x000000ff
#define   SMB_DEV_STC_DATA03_68_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_stc_data03_68:8;
        u32 smb_dev_stc_data02_68:8;
        u32 smb_dev_stc_data01_68:8;
        u32 smb_dev_stc_data00:8;
    } b;
} smb_dev_udid_3_t;

#define SMB_INIT_0                               0x0000006c
#define   SMB_INIT_WR_BLK_CNT_MASK               0xff000000
#define   SMB_INIT_WR_BLK_CNT_SHIFT                      24
#define   SMB_INIT_CMD_CODE_MASK                 0x00ff0000
#define   SMB_INIT_CMD_CODE_SHIFT                        16
#define   SMB_INIT_ADDR_R_MASK                   0x0000ff00
#define   SMB_INIT_ADDR_R_SHIFT                           8
#define   SMB_INIT_ADDR_W_MASK                   0x000000ff
#define   SMB_INIT_ADDR_W_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 smb_init_addr_w:8;
        u32 smb_init_addr_r:8;
        u32 smb_init_cmd_code:8;
        u32 smb_init_wr_blk_cnt:8;
    } b;
} smb_init_0_t;

#define SMB_INIT_WR_1                            0x00000070
#define   SMB_INIT_WR_DATA04_MASK                0xff000000
#define   SMB_INIT_WR_DATA04_SHIFT                       24
#define   SMB_INIT_WR_DATA03_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA03_SHIFT                       16
#define   SMB_INIT_WR_DATA02_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA02_SHIFT                        8
#define   SMB_INIT_WR_DATA01_MASK                0x000000ff
#define   SMB_INIT_WR_DATA01_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data01:8;
        u32 smb_init_wr_data02:8;
        u32 smb_init_wr_data03:8;
        u32 smb_init_wr_data04:8;
    } b;
} smb_init_wr_1_t;

#define SMB_INIT_WR_2                            0x00000074
#define   SMB_INIT_WR_DATA08_MASK                0xff000000
#define   SMB_INIT_WR_DATA08_SHIFT                       24
#define   SMB_INIT_WR_DATA07_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA07_SHIFT                       16
#define   SMB_INIT_WR_DATA06_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA06_SHIFT                        8
#define   SMB_INIT_WR_DATA05_MASK                0x000000ff
#define   SMB_INIT_WR_DATA05_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data05:8;
        u32 smb_init_wr_data06:8;
        u32 smb_init_wr_data07:8;
        u32 smb_init_wr_data08:8;
    } b;
} smb_init_wr_2_t;

#define SMB_INIT_WR_3                            0x00000078
#define   SMB_INIT_WR_DATA12_MASK                0xff000000
#define   SMB_INIT_WR_DATA12_SHIFT                       24
#define   SMB_INIT_WR_DATA11_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA11_SHIFT                       16
#define   SMB_INIT_WR_DATA10_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA10_SHIFT                        8
#define   SMB_INIT_WR_DATA09_MASK                0x000000ff
#define   SMB_INIT_WR_DATA09_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data09:8;
        u32 smb_init_wr_data10:8;
        u32 smb_init_wr_data11:8;
        u32 smb_init_wr_data12:8;
    } b;
} smb_init_wr_3_t;

#define SMB_INIT_WR_4                            0x0000007c
#define   SMB_INIT_WR_DATA16_MASK                0xff000000
#define   SMB_INIT_WR_DATA16_SHIFT                       24
#define   SMB_INIT_WR_DATA15_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA15_SHIFT                       16
#define   SMB_INIT_WR_DATA14_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA14_SHIFT                        8
#define   SMB_INIT_WR_DATA13_MASK                0x000000ff
#define   SMB_INIT_WR_DATA13_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data13:8;
        u32 smb_init_wr_data14:8;
        u32 smb_init_wr_data15:8;
        u32 smb_init_wr_data16:8;
    } b;
} smb_init_wr_4_t;

#define SMB_INIT_WR_5                            0x00000080
#define   SMB_INIT_WR_DATA20_MASK                0xff000000
#define   SMB_INIT_WR_DATA20_SHIFT                       24
#define   SMB_INIT_WR_DATA19_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA19_SHIFT                       16
#define   SMB_INIT_WR_DATA18_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA18_SHIFT                        8
#define   SMB_INIT_WR_DATA17_MASK                0x000000ff
#define   SMB_INIT_WR_DATA17_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data17:8;
        u32 smb_init_wr_data18:8;
        u32 smb_init_wr_data19:8;
        u32 smb_init_wr_data20:8;
    } b;
} smb_init_wr_5_t;

#define SMB_INIT_WR_6                            0x00000084
#define   SMB_INIT_WR_DATA24_MASK                0xff000000
#define   SMB_INIT_WR_DATA24_SHIFT                       24
#define   SMB_INIT_WR_DATA23_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA23_SHIFT                       16
#define   SMB_INIT_WR_DATA22_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA22_SHIFT                        8
#define   SMB_INIT_WR_DATA21_MASK                0x000000ff
#define   SMB_INIT_WR_DATA21_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data21:8;
        u32 smb_init_wr_data22:8;
        u32 smb_init_wr_data23:8;
        u32 smb_init_wr_data24:8;
    } b;
} smb_init_wr_6_t;

#define SMB_VPD_01                               0x00000088
#define   SMB_VPD_03_MASK                        0xff000000
#define   SMB_VPD_03_SHIFT                               24
#define   SMB_VPD_02_MASK                        0x00ff0000
#define   SMB_VPD_02_SHIFT                               16
#define   SMB_VPD_01_MASK                        0x0000ff00
#define   SMB_VPD_01_SHIFT                                8
#define   SMB_VPD_00_MASK                        0x000000ff
#define   SMB_VPD_00_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_00:8;
        u32 smb_vpd_01:8;
        u32 smb_vpd_02:8;
        u32 smb_vpd_03:8;
    } b;
} smb_vpd_01_t;

#define SMB_VPD_02                               0x0000008c
#define   SMB_VPD_07_MASK                        0xff000000
#define   SMB_VPD_07_SHIFT                               24
#define   SMB_VPD_06_MASK                        0x00ff0000
#define   SMB_VPD_06_SHIFT                               16
#define   SMB_VPD_05_MASK                        0x0000ff00
#define   SMB_VPD_05_SHIFT                                8
#define   SMB_VPD_04_MASK                        0x000000ff
#define   SMB_VPD_04_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_04:8;
        u32 smb_vpd_05:8;
        u32 smb_vpd_06:8;
        u32 smb_vpd_07:8;
    } b;
} smb_vpd_02_t;

#define SMB_VPD_03                               0x00000090
#define   SMB_VPD_11_MASK                        0xff000000
#define   SMB_VPD_11_SHIFT                               24
#define   SMB_VPD_10_MASK                        0x00ff0000
#define   SMB_VPD_10_SHIFT                               16
#define   SMB_VPD_09_MASK                        0x0000ff00
#define   SMB_VPD_09_SHIFT                                8
#define   SMB_VPD_08_MASK                        0x000000ff
#define   SMB_VPD_08_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_08:8;
        u32 smb_vpd_09:8;
        u32 smb_vpd_10:8;
        u32 smb_vpd_11:8;
    } b;
} smb_vpd_03_t;

#define SMB_VPD_04                               0x00000094
#define   SMB_VPD_15_MASK                        0xff000000
#define   SMB_VPD_15_SHIFT                               24
#define   SMB_VPD_14_MASK                        0x00ff0000
#define   SMB_VPD_14_SHIFT                               16
#define   SMB_VPD_13_MASK                        0x0000ff00
#define   SMB_VPD_13_SHIFT                                8
#define   SMB_VPD_12_MASK                        0x000000ff
#define   SMB_VPD_12_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_12:8;
        u32 smb_vpd_13:8;
        u32 smb_vpd_14:8;
        u32 smb_vpd_15:8;
    } b;
} smb_vpd_04_t;

#define SMB_VPD_05                               0x00000098
#define   SMB_VPD_19_MASK                        0xff000000
#define   SMB_VPD_19_SHIFT                               24
#define   SMB_VPD_18_MASK                        0x00ff0000
#define   SMB_VPD_18_SHIFT                               16
#define   SMB_VPD_17_MASK                        0x0000ff00
#define   SMB_VPD_17_SHIFT                                8
#define   SMB_VPD_16_MASK                        0x000000ff
#define   SMB_VPD_16_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_16:8;
        u32 smb_vpd_17:8;
        u32 smb_vpd_18:8;
        u32 smb_vpd_19:8;
    } b;
} smb_vpd_05_t;

#define SMB_VPD_06                               0x0000009c
#define   SMB_VPD_23_MASK                        0xff000000
#define   SMB_VPD_23_SHIFT                               24
#define   SMB_VPD_22_MASK                        0x00ff0000
#define   SMB_VPD_22_SHIFT                               16
#define   SMB_VPD_21_MASK                        0x0000ff00
#define   SMB_VPD_21_SHIFT                                8
#define   SMB_VPD_20_MASK                        0x000000ff
#define   SMB_VPD_20_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_20:8;
        u32 smb_vpd_21:8;
        u32 smb_vpd_22:8;
        u32 smb_vpd_23:8;
    } b;
} smb_vpd_06_t;

#define SMB_VPD_07                               0x000000a0
#define   SMB_VPD_27_MASK                        0xff000000
#define   SMB_VPD_27_SHIFT                               24
#define   SMB_VPD_26_MASK                        0x00ff0000
#define   SMB_VPD_26_SHIFT                               16
#define   SMB_VPD_25_MASK                        0x0000ff00
#define   SMB_VPD_25_SHIFT                                8
#define   SMB_VPD_24_MASK                        0x000000ff
#define   SMB_VPD_24_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_24:8;
        u32 smb_vpd_25:8;
        u32 smb_vpd_26:8;
        u32 smb_vpd_27:8;
    } b;
} smb_vpd_07_t;

#define SMB_VPD_08                               0x000000a4
#define   SMB_VPD_31_MASK                        0xff000000
#define   SMB_VPD_31_SHIFT                               24
#define   SMB_VPD_30_MASK                        0x00ff0000
#define   SMB_VPD_30_SHIFT                               16
#define   SMB_VPD_29_MASK                        0x0000ff00
#define   SMB_VPD_29_SHIFT                                8
#define   SMB_VPD_28_MASK                        0x000000ff
#define   SMB_VPD_28_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_28:8;
        u32 smb_vpd_29:8;
        u32 smb_vpd_30:8;
        u32 smb_vpd_31:8;
    } b;
} smb_vpd_08_t;

#define SMB_VPD_09                               0x000000a8
#define   SMB_VPD_35_MASK                        0xff000000
#define   SMB_VPD_35_SHIFT                               24
#define   SMB_VPD_34_MASK                        0x00ff0000
#define   SMB_VPD_34_SHIFT                               16
#define   SMB_VPD_33_MASK                        0x0000ff00
#define   SMB_VPD_33_SHIFT                                8
#define   SMB_VPD_32_MASK                        0x000000ff
#define   SMB_VPD_32_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_32:8;
        u32 smb_vpd_33:8;
        u32 smb_vpd_34:8;
        u32 smb_vpd_35:8;
    } b;
} smb_vpd_09_t;

#define SMB_VPD_10                               0x000000ac
#define   SMB_VPD_39_MASK                        0xff000000
#define   SMB_VPD_39_SHIFT                               24
#define   SMB_VPD_38_MASK                        0x00ff0000
#define   SMB_VPD_38_SHIFT                               16
#define   SMB_VPD_37_MASK                        0x0000ff00
#define   SMB_VPD_37_SHIFT                                8
#define   SMB_VPD_36_MASK                        0x000000ff
#define   SMB_VPD_36_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_36:8;
        u32 smb_vpd_37:8;
        u32 smb_vpd_38:8;
        u32 smb_vpd_39:8;
    } b;
} smb_vpd_10_t;

#define SMB_VPD_11                               0x000000b0
#define   SMB_VPD_43_MASK                        0xff000000
#define   SMB_VPD_43_SHIFT                               24
#define   SMB_VPD_42_MASK                        0x00ff0000
#define   SMB_VPD_42_SHIFT                               16
#define   SMB_VPD_41_MASK                        0x0000ff00
#define   SMB_VPD_41_SHIFT                                8
#define   SMB_VPD_40_MASK                        0x000000ff
#define   SMB_VPD_40_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_40:8;
        u32 smb_vpd_41:8;
        u32 smb_vpd_42:8;
        u32 smb_vpd_43:8;
    } b;
} smb_vpd_11_t;

#define SMB_VPD_12                               0x000000b4
#define   SMB_VPD_47_MASK                        0xff000000
#define   SMB_VPD_47_SHIFT                               24
#define   SMB_VPD_46_MASK                        0x00ff0000
#define   SMB_VPD_46_SHIFT                               16
#define   SMB_VPD_45_MASK                        0x0000ff00
#define   SMB_VPD_45_SHIFT                                8
#define   SMB_VPD_44_MASK                        0x000000ff
#define   SMB_VPD_44_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_44:8;
        u32 smb_vpd_45:8;
        u32 smb_vpd_46:8;
        u32 smb_vpd_47:8;
    } b;
} smb_vpd_12_t;

#define SMB_VPD_13                               0x000000b8
#define   SMB_VPD_51_MASK                        0xff000000
#define   SMB_VPD_51_SHIFT                               24
#define   SMB_VPD_50_MASK                        0x00ff0000
#define   SMB_VPD_50_SHIFT                               16
#define   SMB_VPD_49_MASK                        0x0000ff00
#define   SMB_VPD_49_SHIFT                                8
#define   SMB_VPD_48_MASK                        0x000000ff
#define   SMB_VPD_48_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_48:8;
        u32 smb_vpd_49:8;
        u32 smb_vpd_50:8;
        u32 smb_vpd_51:8;
    } b;
} smb_vpd_13_t;

#define SMB_VPD_14                               0x000000bc
#define   SMB_VPD_55_MASK                        0xff000000
#define   SMB_VPD_55_SHIFT                               24
#define   SMB_VPD_54_MASK                        0x00ff0000
#define   SMB_VPD_54_SHIFT                               16
#define   SMB_VPD_53_MASK                        0x0000ff00
#define   SMB_VPD_53_SHIFT                                8
#define   SMB_VPD_52_MASK                        0x000000ff
#define   SMB_VPD_52_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_52:8;
        u32 smb_vpd_53:8;
        u32 smb_vpd_54:8;
        u32 smb_vpd_55:8;
    } b;
} smb_vpd_14_t;

#define SMB_VPD_15                               0x000000c0
#define   SMB_VPD_59_MASK                        0xff000000
#define   SMB_VPD_59_SHIFT                               24
#define   SMB_VPD_58_MASK                        0x00ff0000
#define   SMB_VPD_58_SHIFT                               16
#define   SMB_VPD_57_MASK                        0x0000ff00
#define   SMB_VPD_57_SHIFT                                8
#define   SMB_VPD_56_MASK                        0x000000ff
#define   SMB_VPD_56_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_56:8;
        u32 smb_vpd_57:8;
        u32 smb_vpd_58:8;
        u32 smb_vpd_59:8;
    } b;
} smb_vpd_15_t;

#define SMB_VPD_16                               0x000000c4
#define   SMB_VPD_63_MASK                        0xff000000
#define   SMB_VPD_63_SHIFT                               24
#define   SMB_VPD_62_MASK                        0x00ff0000
#define   SMB_VPD_62_SHIFT                               16
#define   SMB_VPD_61_MASK                        0x0000ff00
#define   SMB_VPD_61_SHIFT                                8
#define   SMB_VPD_60_MASK                        0x000000ff
#define   SMB_VPD_60_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_60:8;
        u32 smb_vpd_61:8;
        u32 smb_vpd_62:8;
        u32 smb_vpd_63:8;
    } b;
} smb_vpd_16_t;

#define SMB_VPD_17                               0x000000c8
#define   SMB_VPD_67_MASK                        0xff000000
#define   SMB_VPD_67_SHIFT                               24
#define   SMB_VPD_66_MASK                        0x00ff0000
#define   SMB_VPD_66_SHIFT                               16
#define   SMB_VPD_65_MASK                        0x0000ff00
#define   SMB_VPD_65_SHIFT                                8
#define   SMB_VPD_64_MASK                        0x000000ff
#define   SMB_VPD_64_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_64:8;
        u32 smb_vpd_65:8;
        u32 smb_vpd_66:8;
        u32 smb_vpd_67:8;
    } b;
} smb_vpd_17_t;

#define SMB_VPD_18                               0x000000cc
#define   SMB_VPD_71_MASK                        0xff000000
#define   SMB_VPD_71_SHIFT                               24
#define   SMB_VPD_70_MASK                        0x00ff0000
#define   SMB_VPD_70_SHIFT                               16
#define   SMB_VPD_69_MASK                        0x0000ff00
#define   SMB_VPD_69_SHIFT                                8
#define   SMB_VPD_68_MASK                        0x000000ff
#define   SMB_VPD_68_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_68:8;
        u32 smb_vpd_69:8;
        u32 smb_vpd_70:8;
        u32 smb_vpd_71:8;
    } b;
} smb_vpd_18_t;

#define SMB_VPD_19                               0x000000d0
#define   SMB_VPD_75_MASK                        0xff000000
#define   SMB_VPD_75_SHIFT                               24
#define   SMB_VPD_74_MASK                        0x00ff0000
#define   SMB_VPD_74_SHIFT                               16
#define   SMB_VPD_73_MASK                        0x0000ff00
#define   SMB_VPD_73_SHIFT                                8
#define   SMB_VPD_72_MASK                        0x000000ff
#define   SMB_VPD_72_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 smb_vpd_72:8;
        u32 smb_vpd_73:8;
        u32 smb_vpd_74:8;
        u32 smb_vpd_75:8;
    } b;
} smb_vpd_19_t;

#define SMB_I2C_DET_DATA                         0x000000d4
#define   SMB_I2C_DET_33_DAT_MASK                0xff000000
#define   SMB_I2C_DET_33_DAT_SHIFT                       24
#define   SMB_I2C_DET_1B_DAT_MASK                0x00ff0000
#define   SMB_I2C_DET_1B_DAT_SHIFT                       16
#define   SMB_I2C_DET_VPD_DAT_MASK               0x0000ff00
#define   SMB_I2C_DET_VPD_DAT_SHIFT                       8
#define   SMB_I2C_DET_NVME_DAT_MASK              0x000000ff
#define   SMB_I2C_DET_NVME_DAT_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 smb_i2c_det_nvme_dat:8;
        u32 smb_i2c_det_vpd_dat:8;
        u32 smb_i2c_det_1b_dat:8;
        u32 smb_i2c_det_33_dat:8;
    } b;
} smb_i2c_det_data_t;

#define SMB_CONTROL_REGISTER_4                   0x000000d8
#define   SMB_LAST_DAT_NACK_EN_MASK              0x00000001
#define   SMB_LAST_DAT_NACK_EN_SHIFT                      0

typedef union {
    u32 all;
    struct {
        u32 smb_last_dat_nack_en:1;
        u32 rsvd_1:31;
    } b;
} smb_control_register_4_t;

#define SMB_PASV_0                               0x00000100
#define   SMB_INIT_RD_DATA00_MASK                0xff000000
#define   SMB_INIT_RD_DATA00_SHIFT                       24
#define   SMB_PASV_ADDR_R_MASK                   0x00ff0000
#define   SMB_PASV_ADDR_R_SHIFT                          16
#define   SMB_PASV_CMD_CODE_MASK                 0x0000ff00
#define   SMB_PASV_CMD_CODE_SHIFT                         8
#define   SMB_PASV_ADDR_W_MASK                   0x000000ff
#define   SMB_PASV_ADDR_W_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 smb_pasv_addr_w:8;
        u32 smb_pasv_cmd_code:8;
        u32 smb_pasv_addr_r:8;
        u32 smb_init_rd_data00:8;
    } b;
} smb_pasv_0_t;

#define SMB_INIT_RD_1                            0x00000104
#define   SMB_INIT_RD_DATA04_MASK                0xff000000
#define   SMB_INIT_RD_DATA04_SHIFT                       24
#define   SMB_INIT_RD_DATA03_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA03_SHIFT                       16
#define   SMB_INIT_RD_DATA02_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA02_SHIFT                        8
#define   SMB_INIT_RD_DATA01_MASK                0x000000ff
#define   SMB_INIT_RD_DATA01_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data01:8;
        u32 smb_init_rd_data02:8;
        u32 smb_init_rd_data03:8;
        u32 smb_init_rd_data04:8;
    } b;
} smb_init_rd_1_t;

#define SMB_INIT_RD_2                            0x00000108
#define   SMB_INIT_RD_DATA08_MASK                0xff000000
#define   SMB_INIT_RD_DATA08_SHIFT                       24
#define   SMB_INIT_RD_DATA07_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA07_SHIFT                       16
#define   SMB_INIT_RD_DATA06_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA06_SHIFT                        8
#define   SMB_INIT_RD_DATA05_MASK                0x000000ff
#define   SMB_INIT_RD_DATA05_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data05:8;
        u32 smb_init_rd_data06:8;
        u32 smb_init_rd_data07:8;
        u32 smb_init_rd_data08:8;
    } b;
} smb_init_rd_2_t;

#define SMB_INIT_RD_3                            0x0000010c
#define   SMB_INIT_RD_DATA12_MASK                0xff000000
#define   SMB_INIT_RD_DATA12_SHIFT                       24
#define   SMB_INIT_RD_DATA11_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA11_SHIFT                       16
#define   SMB_INIT_RD_DATA10_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA10_SHIFT                        8
#define   SMB_INIT_RD_DATA09_MASK                0x000000ff
#define   SMB_INIT_RD_DATA09_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data09:8;
        u32 smb_init_rd_data10:8;
        u32 smb_init_rd_data11:8;
        u32 smb_init_rd_data12:8;
    } b;
} smb_init_rd_3_t;

#define SMB_INIT_RD_4                            0x00000110
#define   SMB_INIT_RD_DATA16_MASK                0xff000000
#define   SMB_INIT_RD_DATA16_SHIFT                       24
#define   SMB_INIT_RD_DATA15_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA15_SHIFT                       16
#define   SMB_INIT_RD_DATA14_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA14_SHIFT                        8
#define   SMB_INIT_RD_DATA13_MASK                0x000000ff
#define   SMB_INIT_RD_DATA13_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data13:8;
        u32 smb_init_rd_data14:8;
        u32 smb_init_rd_data15:8;
        u32 smb_init_rd_data16:8;
    } b;
} smb_init_rd_4_t;

#define SMB_INIT_RD_5                            0x00000114
#define   SMB_INIT_RD_DATA20_MASK                0xff000000
#define   SMB_INIT_RD_DATA20_SHIFT                       24
#define   SMB_INIT_RD_DATA19_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA19_SHIFT                       16
#define   SMB_INIT_RD_DATA18_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA18_SHIFT                        8
#define   SMB_INIT_RD_DATA17_MASK                0x000000ff
#define   SMB_INIT_RD_DATA17_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data17:8;
        u32 smb_init_rd_data18:8;
        u32 smb_init_rd_data19:8;
        u32 smb_init_rd_data20:8;
    } b;
} smb_init_rd_5_t;

#define SMB_INIT_RD_6                            0x00000118
#define   SMB_INIT_RD_DATA24_MASK                0xff000000
#define   SMB_INIT_RD_DATA24_SHIFT                       24
#define   SMB_INIT_RD_DATA23_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA23_SHIFT                       16
#define   SMB_INIT_RD_DATA22_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA22_SHIFT                        8
#define   SMB_INIT_RD_DATA21_MASK                0x000000ff
#define   SMB_INIT_RD_DATA21_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data21:8;
        u32 smb_init_rd_data22:8;
        u32 smb_init_rd_data23:8;
        u32 smb_init_rd_data24:8;
    } b;
} smb_init_rd_6_t;

#define SMB_DEV_IDF_DATA_1                       0x00000120
#define   SMB_DEV_IDF_DATA04_MASK                0xff000000
#define   SMB_DEV_IDF_DATA04_SHIFT                       24
#define   SMB_DEV_IDF_DATA03_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA03_SHIFT                       16
#define   SMB_DEV_IDF_DATA02_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA02_SHIFT                        8
#define   SMB_DEV_IDF_DATA01_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA01_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data01:8;
        u32 smb_dev_idf_data02:8;
        u32 smb_dev_idf_data03:8;
        u32 smb_dev_idf_data04:8;
    } b;
} smb_dev_idf_data_1_t;

#define SMB_DEV_IDF_DATA_2                       0x00000124
#define   SMB_DEV_IDF_DATA08_MASK                0xff000000
#define   SMB_DEV_IDF_DATA08_SHIFT                       24
#define   SMB_DEV_IDF_DATA07_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA07_SHIFT                       16
#define   SMB_DEV_IDF_DATA06_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA06_SHIFT                        8
#define   SMB_DEV_IDF_DATA05_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA05_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data05:8;
        u32 smb_dev_idf_data06:8;
        u32 smb_dev_idf_data07:8;
        u32 smb_dev_idf_data08:8;
    } b;
} smb_dev_idf_data_2_t;

#define SMB_DEV_IDF_DATA_3                       0x00000128
#define   SMB_DEV_IDF_DATA12_MASK                0xff000000
#define   SMB_DEV_IDF_DATA12_SHIFT                       24
#define   SMB_DEV_IDF_DATA11_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA11_SHIFT                       16
#define   SMB_DEV_IDF_DATA10_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA10_SHIFT                        8
#define   SMB_DEV_IDF_DATA09_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA09_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data09:8;
        u32 smb_dev_idf_data10:8;
        u32 smb_dev_idf_data11:8;
        u32 smb_dev_idf_data12:8;
    } b;
} smb_dev_idf_data_3_t;

#define SMB_DEV_IDF_DATA_4                       0x0000012c
#define   SMB_DEV_IDF_DATA16_MASK                0xff000000
#define   SMB_DEV_IDF_DATA16_SHIFT                       24
#define   SMB_DEV_IDF_DATA15_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA15_SHIFT                       16
#define   SMB_DEV_IDF_DATA14_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA14_SHIFT                        8
#define   SMB_DEV_IDF_DATA13_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA13_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data13:8;
        u32 smb_dev_idf_data14:8;
        u32 smb_dev_idf_data15:8;
        u32 smb_dev_idf_data16:8;
    } b;
} smb_dev_idf_data_4_t;

#define SMB_DEV_IDF_DATA_5                       0x00000130
#define   SMB_DEV_IDF_DATA20_MASK                0xff000000
#define   SMB_DEV_IDF_DATA20_SHIFT                       24
#define   SMB_DEV_IDF_DATA19_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA19_SHIFT                       16
#define   SMB_DEV_IDF_DATA18_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA18_SHIFT                        8
#define   SMB_DEV_IDF_DATA17_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA17_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data17:8;
        u32 smb_dev_idf_data18:8;
        u32 smb_dev_idf_data19:8;
        u32 smb_dev_idf_data20:8;
    } b;
} smb_dev_idf_data_5_t;

#define SMB_DEV_IDF_DATA_6                       0x00000134
#define   SMB_DEV_IDF_DATA24_MASK                0xff000000
#define   SMB_DEV_IDF_DATA24_SHIFT                       24
#define   SMB_DEV_IDF_DATA23_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA23_SHIFT                       16
#define   SMB_DEV_IDF_DATA22_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA22_SHIFT                        8
#define   SMB_DEV_IDF_DATA21_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA21_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data21:8;
        u32 smb_dev_idf_data22:8;
        u32 smb_dev_idf_data23:8;
        u32 smb_dev_idf_data24:8;
    } b;
} smb_dev_idf_data_6_t;

#define SMB_DEV_IDF_DATA_7                       0x00000138
#define   SMB_DEV_IDF_DATA28_MASK                0xff000000
#define   SMB_DEV_IDF_DATA28_SHIFT                       24
#define   SMB_DEV_IDF_DATA27_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA27_SHIFT                       16
#define   SMB_DEV_IDF_DATA26_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA26_SHIFT                        8
#define   SMB_DEV_IDF_DATA25_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA25_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data25:8;
        u32 smb_dev_idf_data26:8;
        u32 smb_dev_idf_data27:8;
        u32 smb_dev_idf_data28:8;
    } b;
} smb_dev_idf_data_7_t;

#define SMB_DEV_IDF_DATA_8                       0x0000013c
#define   SMB_DEV_IDF_DATA32_MASK                0xff000000
#define   SMB_DEV_IDF_DATA32_SHIFT                       24
#define   SMB_DEV_IDF_DATA31_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA31_SHIFT                       16
#define   SMB_DEV_IDF_DATA30_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA30_SHIFT                        8
#define   SMB_DEV_IDF_DATA29_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA29_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data29:8;
        u32 smb_dev_idf_data30:8;
        u32 smb_dev_idf_data31:8;
        u32 smb_dev_idf_data32:8;
    } b;
} smb_dev_idf_data_8_t;

#define SMB_DEV_IDF_DATA_9                       0x00000140
#define   SMB_DEV_IDF_DATA36_MASK                0xff000000
#define   SMB_DEV_IDF_DATA36_SHIFT                       24
#define   SMB_DEV_IDF_DATA35_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA35_SHIFT                       16
#define   SMB_DEV_IDF_DATA34_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA34_SHIFT                        8
#define   SMB_DEV_IDF_DATA33_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA33_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data33:8;
        u32 smb_dev_idf_data34:8;
        u32 smb_dev_idf_data35:8;
        u32 smb_dev_idf_data36:8;
    } b;
} smb_dev_idf_data_9_t;

#define SMB_DEV_IDF_DATA_10                      0x00000144
#define   SMB_DEV_IDF_DATA40_MASK                0xff000000
#define   SMB_DEV_IDF_DATA40_SHIFT                       24
#define   SMB_DEV_IDF_DATA39_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA39_SHIFT                       16
#define   SMB_DEV_IDF_DATA38_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA38_SHIFT                        8
#define   SMB_DEV_IDF_DATA37_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA37_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data37:8;
        u32 smb_dev_idf_data38:8;
        u32 smb_dev_idf_data39:8;
        u32 smb_dev_idf_data40:8;
    } b;
} smb_dev_idf_data_10_t;

#define SMB_DEV_IDF_DATA_11                      0x00000148
#define   SMB_DEV_IDF_DATA44_MASK                0xff000000
#define   SMB_DEV_IDF_DATA44_SHIFT                       24
#define   SMB_DEV_IDF_DATA43_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA43_SHIFT                       16
#define   SMB_DEV_IDF_DATA42_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA42_SHIFT                        8
#define   SMB_DEV_IDF_DATA41_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA41_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data41:8;
        u32 smb_dev_idf_data42:8;
        u32 smb_dev_idf_data43:8;
        u32 smb_dev_idf_data44:8;
    } b;
} smb_dev_idf_data_11_t;

#define SMB_DEV_IDF_DATA_12                      0x0000014c
#define   SMB_DEV_IDF_DATA48_MASK                0xff000000
#define   SMB_DEV_IDF_DATA48_SHIFT                       24
#define   SMB_DEV_IDF_DATA47_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA47_SHIFT                       16
#define   SMB_DEV_IDF_DATA46_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA46_SHIFT                        8
#define   SMB_DEV_IDF_DATA45_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA45_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data45:8;
        u32 smb_dev_idf_data46:8;
        u32 smb_dev_idf_data47:8;
        u32 smb_dev_idf_data48:8;
    } b;
} smb_dev_idf_data_12_t;

#define SMB_DEV_IDF_DATA_13                      0x00000150
#define   SMB_DEV_IDF_DATA52_MASK                0xff000000
#define   SMB_DEV_IDF_DATA52_SHIFT                       24
#define   SMB_DEV_IDF_DATA51_MASK                0x00ff0000
#define   SMB_DEV_IDF_DATA51_SHIFT                       16
#define   SMB_DEV_IDF_DATA50_MASK                0x0000ff00
#define   SMB_DEV_IDF_DATA50_SHIFT                        8
#define   SMB_DEV_IDF_DATA49_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA49_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data49:8;
        u32 smb_dev_idf_data50:8;
        u32 smb_dev_idf_data51:8;
        u32 smb_dev_idf_data52:8;
    } b;
} smb_dev_idf_data_13_t;

#define SMB_DEV_IDF_DATA_14                      0x00000154
#define   SMB_DEV_IDF_PEC_MASK                   0x0000ff00
#define   SMB_DEV_IDF_PEC_SHIFT                           8
#define   SMB_DEV_IDF_DATA53_MASK                0x000000ff
#define   SMB_DEV_IDF_DATA53_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_idf_data53:8;
        u32 smb_dev_idf_pec:8;
        u32 rsvd_16:16;
    } b;
} smb_dev_idf_data_14_t;

#define SMB_DEV_STR_DATA_1                       0x00000158
#define   SMB_DEV_STR_DATA04_MASK                0xff000000
#define   SMB_DEV_STR_DATA04_SHIFT                       24
#define   SMB_DEV_STR_DATA03_MASK                0x00ff0000
#define   SMB_DEV_STR_DATA03_SHIFT                       16
#define   SMB_DEV_STR_DATA02_MASK                0x0000ff00
#define   SMB_DEV_STR_DATA02_SHIFT                        8
#define   SMB_DEV_STR_DATA01_MASK                0x000000ff
#define   SMB_DEV_STR_DATA01_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_str_data01:8;
        u32 smb_dev_str_data02:8;
        u32 smb_dev_str_data03:8;
        u32 smb_dev_str_data04:8;
    } b;
} smb_dev_str_data_1_t;

#define SMB_DEV_STR_DATA_2                       0x0000015c
#define   SMB_DEV_STR_PEC_MASK                   0xff000000
#define   SMB_DEV_STR_PEC_SHIFT                          24
#define   SMB_DEV_STR_DATA07_MASK                0x00ff0000
#define   SMB_DEV_STR_DATA07_SHIFT                       16
#define   SMB_DEV_STR_DATA06_MASK                0x0000ff00
#define   SMB_DEV_STR_DATA06_SHIFT                        8
#define   SMB_DEV_STR_DATA05_MASK                0x000000ff
#define   SMB_DEV_STR_DATA05_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_dev_str_data05:8;
        u32 smb_dev_str_data06:8;
        u32 smb_dev_str_data07:8;
        u32 smb_dev_str_pec:8;
    } b;
} smb_dev_str_data_2_t;

#define SMB_INIT_WR_7                            0x00000160
#define   SMB_INIT_WR_DATA28_MASK                0xff000000
#define   SMB_INIT_WR_DATA28_SHIFT                       24
#define   SMB_INIT_WR_DATA27_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA27_SHIFT                       16
#define   SMB_INIT_WR_DATA26_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA26_SHIFT                        8
#define   SMB_INIT_WR_DATA25_MASK                0x000000ff
#define   SMB_INIT_WR_DATA25_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data25:8;
        u32 smb_init_wr_data26:8;
        u32 smb_init_wr_data27:8;
        u32 smb_init_wr_data28:8;
    } b;
} smb_init_wr_7_t;

#define SMB_INIT_WR_8                            0x00000164
#define   SMB_INIT_WR_DATA32_MASK                0xff000000
#define   SMB_INIT_WR_DATA32_SHIFT                       24
#define   SMB_INIT_WR_DATA31_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA31_SHIFT                       16
#define   SMB_INIT_WR_DATA30_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA30_SHIFT                        8
#define   SMB_INIT_WR_DATA29_MASK                0x000000ff
#define   SMB_INIT_WR_DATA29_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data29:8;
        u32 smb_init_wr_data30:8;
        u32 smb_init_wr_data31:8;
        u32 smb_init_wr_data32:8;
    } b;
} smb_init_wr_8_t;

#define SMB_INIT_WR_9                            0x00000168
#define   SMB_INIT_WR_DATA36_MASK                0xff000000
#define   SMB_INIT_WR_DATA36_SHIFT                       24
#define   SMB_INIT_WR_DATA35_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA35_SHIFT                       16
#define   SMB_INIT_WR_DATA34_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA34_SHIFT                        8
#define   SMB_INIT_WR_DATA33_MASK                0x000000ff
#define   SMB_INIT_WR_DATA33_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data33:8;
        u32 smb_init_wr_data34:8;
        u32 smb_init_wr_data35:8;
        u32 smb_init_wr_data36:8;
    } b;
} smb_init_wr_9_t;

#define SMB_INIT_WR_10                           0x0000016c
#define   SMB_INIT_WR_DATA40_MASK                0xff000000
#define   SMB_INIT_WR_DATA40_SHIFT                       24
#define   SMB_INIT_WR_DATA39_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA39_SHIFT                       16
#define   SMB_INIT_WR_DATA38_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA38_SHIFT                        8
#define   SMB_INIT_WR_DATA37_MASK                0x000000ff
#define   SMB_INIT_WR_DATA37_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data37:8;
        u32 smb_init_wr_data38:8;
        u32 smb_init_wr_data39:8;
        u32 smb_init_wr_data40:8;
    } b;
} smb_init_wr_10_t;

#define SMB_INIT_WR_11                           0x00000170
#define   SMB_INIT_WR_DATA44_MASK                0xff000000
#define   SMB_INIT_WR_DATA44_SHIFT                       24
#define   SMB_INIT_WR_DATA43_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA43_SHIFT                       16
#define   SMB_INIT_WR_DATA42_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA42_SHIFT                        8
#define   SMB_INIT_WR_DATA41_MASK                0x000000ff
#define   SMB_INIT_WR_DATA41_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data41:8;
        u32 smb_init_wr_data42:8;
        u32 smb_init_wr_data43:8;
        u32 smb_init_wr_data44:8;
    } b;
} smb_init_wr_11_t;

#define SMB_INIT_WR_12                           0x00000174
#define   SMB_INIT_WR_DATA48_MASK                0xff000000
#define   SMB_INIT_WR_DATA48_SHIFT                       24
#define   SMB_INIT_WR_DATA47_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA47_SHIFT                       16
#define   SMB_INIT_WR_DATA46_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA46_SHIFT                        8
#define   SMB_INIT_WR_DATA45_MASK                0x000000ff
#define   SMB_INIT_WR_DATA45_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data45:8;
        u32 smb_init_wr_data46:8;
        u32 smb_init_wr_data47:8;
        u32 smb_init_wr_data48:8;
    } b;
} smb_init_wr_12_t;

#define SMB_INIT_WR_13                           0x00000178
#define   SMB_INIT_WR_DATA52_MASK                0xff000000
#define   SMB_INIT_WR_DATA52_SHIFT                       24
#define   SMB_INIT_WR_DATA51_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA51_SHIFT                       16
#define   SMB_INIT_WR_DATA50_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA50_SHIFT                        8
#define   SMB_INIT_WR_DATA49_MASK                0x000000ff
#define   SMB_INIT_WR_DATA49_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data49:8;
        u32 smb_init_wr_data50:8;
        u32 smb_init_wr_data51:8;
        u32 smb_init_wr_data52:8;
    } b;
} smb_init_wr_13_t;

#define SMB_INIT_WR_14                           0x0000017c
#define   SMB_INIT_WR_DATA56_MASK                0xff000000
#define   SMB_INIT_WR_DATA56_SHIFT                       24
#define   SMB_INIT_WR_DATA55_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA55_SHIFT                       16
#define   SMB_INIT_WR_DATA54_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA54_SHIFT                        8
#define   SMB_INIT_WR_DATA53_MASK                0x000000ff
#define   SMB_INIT_WR_DATA53_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data53:8;
        u32 smb_init_wr_data54:8;
        u32 smb_init_wr_data55:8;
        u32 smb_init_wr_data56:8;
    } b;
} smb_init_wr_14_t;

#define SMB_INIT_WR_15                           0x00000180
#define   SMB_INIT_WR_DATA60_MASK                0xff000000
#define   SMB_INIT_WR_DATA60_SHIFT                       24
#define   SMB_INIT_WR_DATA59_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA59_SHIFT                       16
#define   SMB_INIT_WR_DATA58_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA58_SHIFT                        8
#define   SMB_INIT_WR_DATA57_MASK                0x000000ff
#define   SMB_INIT_WR_DATA57_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data57:8;
        u32 smb_init_wr_data58:8;
        u32 smb_init_wr_data59:8;
        u32 smb_init_wr_data60:8;
    } b;
} smb_init_wr_15_t;

#define SMB_INIT_WR_16                           0x00000184
#define   SMB_INIT_WR_DATA64_MASK                0xff000000
#define   SMB_INIT_WR_DATA64_SHIFT                       24
#define   SMB_INIT_WR_DATA63_MASK                0x00ff0000
#define   SMB_INIT_WR_DATA63_SHIFT                       16
#define   SMB_INIT_WR_DATA62_MASK                0x0000ff00
#define   SMB_INIT_WR_DATA62_SHIFT                        8
#define   SMB_INIT_WR_DATA61_MASK                0x000000ff
#define   SMB_INIT_WR_DATA61_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_wr_data61:8;
        u32 smb_init_wr_data62:8;
        u32 smb_init_wr_data63:8;
        u32 smb_init_wr_data64:8;
    } b;
} smb_init_wr_16_t;

#define SMB_INIT_RD_7                            0x00000190
#define   SMB_INIT_RD_DATA28_MASK                0xff000000
#define   SMB_INIT_RD_DATA28_SHIFT                       24
#define   SMB_INIT_RD_DATA27_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA27_SHIFT                       16
#define   SMB_INIT_RD_DATA26_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA26_SHIFT                        8
#define   SMB_INIT_RD_DATA25_MASK                0x000000ff
#define   SMB_INIT_RD_DATA25_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data25:8;
        u32 smb_init_rd_data26:8;
        u32 smb_init_rd_data27:8;
        u32 smb_init_rd_data28:8;
    } b;
} smb_init_rd_7_t;

#define SMB_INIT_RD_8                            0x00000194
#define   SMB_INIT_RD_DATA32_MASK                0xff000000
#define   SMB_INIT_RD_DATA32_SHIFT                       24
#define   SMB_INIT_RD_DATA31_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA31_SHIFT                       16
#define   SMB_INIT_RD_DATA30_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA30_SHIFT                        8
#define   SMB_INIT_RD_DATA29_MASK                0x000000ff
#define   SMB_INIT_RD_DATA29_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data29:8;
        u32 smb_init_rd_data30:8;
        u32 smb_init_rd_data31:8;
        u32 smb_init_rd_data32:8;
    } b;
} smb_init_rd_8_t;

#define SMB_INIT_RD_9                            0x00000198
#define   SMB_INIT_RD_DATA36_MASK                0xff000000
#define   SMB_INIT_RD_DATA36_SHIFT                       24
#define   SMB_INIT_RD_DATA35_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA35_SHIFT                       16
#define   SMB_INIT_RD_DATA34_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA34_SHIFT                        8
#define   SMB_INIT_RD_DATA33_MASK                0x000000ff
#define   SMB_INIT_RD_DATA33_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data33:8;
        u32 smb_init_rd_data34:8;
        u32 smb_init_rd_data35:8;
        u32 smb_init_rd_data36:8;
    } b;
} smb_init_rd_9_t;

#define SMB_INIT_RD_10                           0x0000019c
#define   SMB_INIT_RD_DATA40_MASK                0xff000000
#define   SMB_INIT_RD_DATA40_SHIFT                       24
#define   SMB_INIT_RD_DATA39_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA39_SHIFT                       16
#define   SMB_INIT_RD_DATA38_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA38_SHIFT                        8
#define   SMB_INIT_RD_DATA37_MASK                0x000000ff
#define   SMB_INIT_RD_DATA37_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data37:8;
        u32 smb_init_rd_data38:8;
        u32 smb_init_rd_data39:8;
        u32 smb_init_rd_data40:8;
    } b;
} smb_init_rd_10_t;

#define SMB_INIT_RD_11                           0x000001a0
#define   SMB_INIT_RD_DATA44_MASK                0xff000000
#define   SMB_INIT_RD_DATA44_SHIFT                       24
#define   SMB_INIT_RD_DATA43_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA43_SHIFT                       16
#define   SMB_INIT_RD_DATA42_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA42_SHIFT                        8
#define   SMB_INIT_RD_DATA41_MASK                0x000000ff
#define   SMB_INIT_RD_DATA41_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data41:8;
        u32 smb_init_rd_data42:8;
        u32 smb_init_rd_data43:8;
        u32 smb_init_rd_data44:8;
    } b;
} smb_init_rd_11_t;

#define SMB_INIT_RD_12                           0x000001a4
#define   SMB_INIT_RD_DATA48_MASK                0xff000000
#define   SMB_INIT_RD_DATA48_SHIFT                       24
#define   SMB_INIT_RD_DATA47_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA47_SHIFT                       16
#define   SMB_INIT_RD_DATA46_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA46_SHIFT                        8
#define   SMB_INIT_RD_DATA45_MASK                0x000000ff
#define   SMB_INIT_RD_DATA45_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data45:8;
        u32 smb_init_rd_data46:8;
        u32 smb_init_rd_data47:8;
        u32 smb_init_rd_data48:8;
    } b;
} smb_init_rd_12_t;

#define SMB_INIT_RD_13                           0x000001a8
#define   SMB_INIT_RD_DATA52_MASK                0xff000000
#define   SMB_INIT_RD_DATA52_SHIFT                       24
#define   SMB_INIT_RD_DATA51_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA51_SHIFT                       16
#define   SMB_INIT_RD_DATA50_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA50_SHIFT                        8
#define   SMB_INIT_RD_DATA49_MASK                0x000000ff
#define   SMB_INIT_RD_DATA49_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data49:8;
        u32 smb_init_rd_data50:8;
        u32 smb_init_rd_data51:8;
        u32 smb_init_rd_data52:8;
    } b;
} smb_init_rd_13_t;

#define SMB_INIT_RD_14                           0x000001ac
#define   SMB_INIT_RD_DATA56_MASK                0xff000000
#define   SMB_INIT_RD_DATA56_SHIFT                       24
#define   SMB_INIT_RD_DATA55_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA55_SHIFT                       16
#define   SMB_INIT_RD_DATA54_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA54_SHIFT                        8
#define   SMB_INIT_RD_DATA53_MASK                0x000000ff
#define   SMB_INIT_RD_DATA53_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data53:8;
        u32 smb_init_rd_data54:8;
        u32 smb_init_rd_data55:8;
        u32 smb_init_rd_data56:8;
    } b;
} smb_init_rd_14_t;

#define SMB_INIT_RD_15                           0x000001b0
#define   SMB_INIT_RD_DATA60_MASK                0xff000000
#define   SMB_INIT_RD_DATA60_SHIFT                       24
#define   SMB_INIT_RD_DATA59_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA59_SHIFT                       16
#define   SMB_INIT_RD_DATA58_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA58_SHIFT                        8
#define   SMB_INIT_RD_DATA57_MASK                0x000000ff
#define   SMB_INIT_RD_DATA57_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data57:8;
        u32 smb_init_rd_data58:8;
        u32 smb_init_rd_data59:8;
        u32 smb_init_rd_data60:8;
    } b;
} smb_init_rd_15_t;

#define SMB_INIT_RD_16                           0x000001b4
#define   SMB_INIT_RD_DATA64_MASK                0xff000000
#define   SMB_INIT_RD_DATA64_SHIFT                       24
#define   SMB_INIT_RD_DATA63_MASK                0x00ff0000
#define   SMB_INIT_RD_DATA63_SHIFT                       16
#define   SMB_INIT_RD_DATA62_MASK                0x0000ff00
#define   SMB_INIT_RD_DATA62_SHIFT                        8
#define   SMB_INIT_RD_DATA61_MASK                0x000000ff
#define   SMB_INIT_RD_DATA61_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 smb_init_rd_data61:8;
        u32 smb_init_rd_data62:8;
        u32 smb_init_rd_data63:8;
        u32 smb_init_rd_data64:8;
    } b;
} smb_init_rd_16_t;

#define SMB_CONTROL_REGISTER_2                   0x00000200
#define   SMB_MAS_EXT_SMBCLK_MASK                0x00000700
#define   SMB_MAS_EXT_SMBCLK_SHIFT                        8
#define   SMB_SET_DEV_ADDR_MASK                  0x00000080
#define   SMB_SET_DEV_ADDR_SHIFT                          7
#define   SMB_NEW_DEV_ADDR_MASK                  0x0000007f
#define   SMB_NEW_DEV_ADDR_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 smb_new_dev_addr:7;
        u32 smb_set_dev_addr:1;
        u32 smb_mas_ext_smbclk:3;
        u32 rsvd_11:21;
    } b;
} smb_control_register_2_t;

#define SMB_CONTROL_REGISTER_3                   0x00000204
// #define   SMB_CUR_DEV_ADDR_MASK                  0x0000007f
// #define   SMB_CUR_DEV_ADDR_SHIFT                          0
typedef union {
    u32 all;
    struct {
        u32 smb_cur_dev_addr:7;
        u32 rsvd_7:25;
    } b;
} smb_control_register_3_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ smb_intr_sts_t smb_intr_sts;
    /* 0x0004 */ smb_interrupt_mask_t smb_interrupt_mask;
    /* 0x0008 */ smb_status_register_t smb_status_register;
    /* 0x000c */ smb_fsm_t smb_fsm;
    /* 0x0010 */ smb_control_register_t smb_control_register;
    /* 0x0014 */ smb_strobe_cnt_t smb_strobe_cnt;
    /* 0x0018 */ smbclk_timeout_t smbclk_timeout;
    /* 0x001c */ smb_low_mext_t smb_low_mext;
    /* 0x0020 */ smb_low_sext_t smb_low_sext;
    /* 0x0024 */ smb_timer_0_t smb_timer_0;
    /* 0x0028 */ smb_timer_1_t smb_timer_1;
    /* 0x002c */ smb_timer_2_t smb_timer_2;
    /* 0x0030 */ smb_timer_3_t smb_timer_3;
    /* 0x0034 */ smb_timer_4_t smb_timer_4;
    /* 0x0038 */ smb_timer_5_t smb_timer_5;
    /* 0x003c */ smb_dev_sts_data_1_t smb_dev_sts_data_1;
    /* 0x0040 */ smb_dev_sts_data_2_t smb_dev_sts_data_2;
    /* 0x0044 */ smb_dev_stc_data_1_t smb_dev_stc_data_1;
    /* 0x0048 */ smb_dev_stc_data_2_t smb_dev_stc_data_2;
    /* 0x004c */ smb_dev_stc_data_3_t smb_dev_stc_data_3;
    /* 0x0050 */ smb_dev_stc_data_4_t smb_dev_stc_data_4;
    /* 0x0054 */ smb_dev_stc_data_5_t smb_dev_stc_data_5;
    /* 0x0058 */ smb_dev_stc_data_6_t smb_dev_stc_data_6;
    /* 0x005c */ smb_dev_udid_0_t smb_dev_udid_0;
    /* 0x0060 */ smb_dev_udid_1_t smb_dev_udid_1;
    /* 0x0064 */ smb_dev_udid_2_t smb_dev_udid_2;
    /* 0x0068 */ smb_dev_udid_3_t smb_dev_udid_3;
    /* 0x006c */ smb_init_0_t smb_init_0;
    /* 0x0070 */ smb_init_wr_1_t smb_init_wr_1;
    /* 0x0074 */ smb_init_wr_2_t smb_init_wr_2;
    /* 0x0078 */ smb_init_wr_3_t smb_init_wr_3;
    /* 0x007c */ smb_init_wr_4_t smb_init_wr_4;
    /* 0x0080 */ smb_init_wr_5_t smb_init_wr_5;
    /* 0x0084 */ smb_init_wr_6_t smb_init_wr_6;
    /* 0x0088 */ smb_vpd_01_t smb_vpd_01;
    /* 0x008c */ smb_vpd_02_t smb_vpd_02;
    /* 0x0090 */ smb_vpd_03_t smb_vpd_03;
    /* 0x0094 */ smb_vpd_04_t smb_vpd_04;
    /* 0x0098 */ smb_vpd_05_t smb_vpd_05;
    /* 0x009c */ smb_vpd_06_t smb_vpd_06;
    /* 0x00a0 */ smb_vpd_07_t smb_vpd_07;
    /* 0x00a4 */ smb_vpd_08_t smb_vpd_08;
    /* 0x00a8 */ smb_vpd_09_t smb_vpd_09;
    /* 0x00ac */ smb_vpd_10_t smb_vpd_10;
    /* 0x00b0 */ smb_vpd_11_t smb_vpd_11;
    /* 0x00b4 */ smb_vpd_12_t smb_vpd_12;
    /* 0x00b8 */ smb_vpd_13_t smb_vpd_13;
    /* 0x00bc */ smb_vpd_14_t smb_vpd_14;
    /* 0x00c0 */ smb_vpd_15_t smb_vpd_15;
    /* 0x00c4 */ smb_vpd_16_t smb_vpd_16;
    /* 0x00c8 */ smb_vpd_17_t smb_vpd_17;
    /* 0x00cc */ smb_vpd_18_t smb_vpd_18;
    /* 0x00d0 */ smb_vpd_19_t smb_vpd_19;
    /* 0x00d4 */ smb_i2c_det_data_t smb_i2c_det_data;
    /* 0x00d8 */ smb_control_register_4_t smb_control_register_4;
    /* 0x00dc */ u32 rsvd_dc [9];
    /* 0x0100 */ smb_pasv_0_t smb_pasv_0;
    /* 0x0104 */ smb_init_rd_1_t smb_init_rd_1;
    /* 0x0108 */ smb_init_rd_2_t smb_init_rd_2;
    /* 0x010c */ smb_init_rd_3_t smb_init_rd_3;
    /* 0x0110 */ smb_init_rd_4_t smb_init_rd_4;
    /* 0x0114 */ smb_init_rd_5_t smb_init_rd_5;
    /* 0x0118 */ smb_init_rd_6_t smb_init_rd_6;
    /* 0x011c */ u32 rsvd_11c;
    /* 0x0120 */ smb_dev_idf_data_1_t smb_dev_idf_data_1;
    /* 0x0124 */ smb_dev_idf_data_2_t smb_dev_idf_data_2;
    /* 0x0128 */ smb_dev_idf_data_3_t smb_dev_idf_data_3;
    /* 0x012c */ smb_dev_idf_data_4_t smb_dev_idf_data_4;
    /* 0x0130 */ smb_dev_idf_data_5_t smb_dev_idf_data_5;
    /* 0x0134 */ smb_dev_idf_data_6_t smb_dev_idf_data_6;
    /* 0x0138 */ smb_dev_idf_data_7_t smb_dev_idf_data_7;
    /* 0x013c */ smb_dev_idf_data_8_t smb_dev_idf_data_8;
    /* 0x0140 */ smb_dev_idf_data_9_t smb_dev_idf_data_9;
    /* 0x0144 */ smb_dev_idf_data_10_t smb_dev_idf_data_10;
    /* 0x0148 */ smb_dev_idf_data_11_t smb_dev_idf_data_11;
    /* 0x014c */ smb_dev_idf_data_12_t smb_dev_idf_data_12;
    /* 0x0150 */ smb_dev_idf_data_13_t smb_dev_idf_data_13;
    /* 0x0154 */ smb_dev_idf_data_14_t smb_dev_idf_data_14;
    /* 0x0158 */ smb_dev_str_data_1_t smb_dev_str_data_1;
    /* 0x015c */ smb_dev_str_data_2_t smb_dev_str_data_2;
    /* 0x0160 */ smb_init_wr_7_t smb_init_wr_7;
    /* 0x0164 */ smb_init_wr_8_t smb_init_wr_8;
    /* 0x0168 */ smb_init_wr_9_t smb_init_wr_9;
    /* 0x016c */ smb_init_wr_10_t smb_init_wr_10;
    /* 0x0170 */ smb_init_wr_11_t smb_init_wr_11;
    /* 0x0174 */ smb_init_wr_12_t smb_init_wr_12;
    /* 0x0178 */ smb_init_wr_13_t smb_init_wr_13;
    /* 0x017c */ smb_init_wr_14_t smb_init_wr_14;
    /* 0x0180 */ smb_init_wr_15_t smb_init_wr_15;
    /* 0x0184 */ smb_init_wr_16_t smb_init_wr_16;
    /* 0x0188 */ u32 rsvd_188 [2];
    /* 0x0190 */ smb_init_rd_7_t smb_init_rd_7;
    /* 0x0194 */ smb_init_rd_8_t smb_init_rd_8;
    /* 0x0198 */ smb_init_rd_9_t smb_init_rd_9;
    /* 0x019c */ smb_init_rd_10_t smb_init_rd_10;
    /* 0x01a0 */ smb_init_rd_11_t smb_init_rd_11;
    /* 0x01a4 */ smb_init_rd_12_t smb_init_rd_12;
    /* 0x01a8 */ smb_init_rd_13_t smb_init_rd_13;
    /* 0x01ac */ smb_init_rd_14_t smb_init_rd_14;
    /* 0x01b0 */ smb_init_rd_15_t smb_init_rd_15;
    /* 0x01b4 */ smb_init_rd_16_t smb_init_rd_16;
    /* 0x01b8 */ u32 rsvd_1b8 [18];
    /* 0x0200 */ smb_control_register_2_t smb_control_register_2;
    /* 0x0204 */ smb_control_register_3_t smb_control_register_3;
} smb_registers_regs_t;


#endif /* rev 0 */