//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _CPU_TIMER_H_
#define _CPU_TIMER_H_

#define WD_TIMER                                 0x00000000
#define   WATCHDOG_TIMER_MASK                    0xffffffff
#define   WATCHDOG_TIMER_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 watchdog_timer:32;
    } b;
} wd_timer_t;

#define WDT_CTRL                                 0x00000004
#define   WATCHDOG_RESET_EN_MASK                 0x00000008
#define   WATCHDOG_RESET_EN_SHIFT                         3
#define   WATCHDOG_RELOAD_EN_MASK                0x00000004
#define   WATCHDOG_RELOAD_EN_SHIFT                        2
#define   WATCHDOG_INT_EN_MASK                   0x00000002
#define   WATCHDOG_INT_EN_SHIFT                           1
#define   WATCHDOG_EN_MASK                       0x00000001
#define   WATCHDOG_EN_SHIFT                               0

typedef union {
    u32 all;
    struct {
        u32 watchdog_en:1;
        u32 watchdog_int_en:1;
        u32 watchdog_reload_en:1;
        u32 watchdog_reset_en:1;
        u32 rsvd_4:28;
    } b;
} wdt_ctrl_t;

#define WDT_REL                                  0x00000008
#define   WATCHDOG_TIMER_RELOAD_MASK             0xffffffff
#define   WATCHDOG_TIMER_RELOAD_SHIFT                     0

typedef union {
    u32 all;
    struct {
        u32 watchdog_timer_reload:32;
    } b;
} wdt_rel_t;

#define WDT_INT                                  0x0000000c
#define   WDT_INT_MASK                           0x00000001
#define   WDT_INT_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 wdt_int:1;
        u32 rsvd_1:31;
    } b;
} wdt_int_t;

#define TIMER_INT                                0x0000001c
#define   TIMER_INT_MASK                         0x0000001f
#define   TIMER_INT_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 timer_int:5;
        u32 rsvd_5:27;
    } b;
} timer_int_t;

#define TIMER0_CTRL                              0x00000020
#define   TIMER0_PRESCALE_MASK                   0xffff0000
#define   TIMER0_PRESCALE_SHIFT                          16
#define   TIMER0_MODE_MASK                       0x00000018
#define   TIMER0_MODE_SHIFT                               3
#define   TIMER0_LOAD_MASK                       0x00000004
#define   TIMER0_LOAD_SHIFT                               2
#define   TIMER0_INT_EN_MASK                     0x00000002
#define   TIMER0_INT_EN_SHIFT                             1
#define   TIMER0_START_MASK                      0x00000001
#define   TIMER0_START_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 timer0_start:1;
        u32 timer0_int_en:1;
        u32 timer0_load:1;
        u32 timer0_mode:2;
        u32 rsvd_5:11;
        u32 timer0_prescale:16;
    } b;
} timer0_ctrl_t;

#define TIMER0_VALUE                             0x00000024
#define   TIMER0_REL_VAL_MASK                    0xffff0000
#define   TIMER0_REL_VAL_SHIFT                           16
#define   TIMER0_CUR_VAL_MASK                    0x0000ffff
#define   TIMER0_CUR_VAL_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 timer0_cur_val:16;
        u32 timer0_rel_val:16;
    } b;
} timer0_value_t;

#define TIMER1_CTRL                              0x00000028
#define   TIMER1_PRESCALE_MASK                   0xffff0000
#define   TIMER1_PRESCALE_SHIFT                          16
#define   TIMER1_MODE_MASK                       0x00000018
#define   TIMER1_MODE_SHIFT                               3
#define   TIMER1_LOAD_MASK                       0x00000004
#define   TIMER1_LOAD_SHIFT                               2
#define   TIMER1_INT_EN_MASK                     0x00000002
#define   TIMER1_INT_EN_SHIFT                             1
#define   TIMER1_START_MASK                      0x00000001
#define   TIMER1_START_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 timer1_start:1;
        u32 timer1_int_en:1;
        u32 timer1_load:1;
        u32 timer1_mode:2;
        u32 rsvd_5:11;
        u32 timer1_prescale:16;
    } b;
} timer1_ctrl_t;

#define TIMER1_VALUE                             0x0000002c
#define   TIMER1_REL_VAL_MASK                    0xffff0000
#define   TIMER1_REL_VAL_SHIFT                           16
#define   TIMER1_CUR_VAL_MASK                    0x0000ffff
#define   TIMER1_CUR_VAL_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 timer1_cur_val:16;
        u32 timer1_rel_val:16;
    } b;
} timer1_value_t;

#define TIMER2_CTRL                              0x00000030
#define   TIMER2_PRESCALE_MASK                   0xffff0000
#define   TIMER2_PRESCALE_SHIFT                          16
#define   TIMER2_MODE_MASK                       0x00000018
#define   TIMER2_MODE_SHIFT                               3
#define   TIMER2_LOAD_MASK                       0x00000004
#define   TIMER2_LOAD_SHIFT                               2
#define   TIMER2_INT_EN_MASK                     0x00000002
#define   TIMER2_INT_EN_SHIFT                             1
#define   TIMER2_START_MASK                      0x00000001
#define   TIMER2_START_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 timer2_start:1;
        u32 timer2_int_en:1;
        u32 timer2_load:1;
        u32 timer2_mode:2;
        u32 rsvd_5:11;
        u32 timer2_prescale:16;
    } b;
} timer2_ctrl_t;

#define TIMER2_VALUE                             0x00000034
#define   TIMER2_REL_VAL_MASK                    0xffff0000
#define   TIMER2_REL_VAL_SHIFT                           16
#define   TIMER2_CUR_VAL_MASK                    0x0000ffff
#define   TIMER2_CUR_VAL_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 timer2_cur_val:16;
        u32 timer2_rel_val:16;
    } b;
} timer2_value_t;

#define TIMER3_CTRL                              0x00000038
#define   TIMER3_PRESCALE_MASK                   0xffff0000
#define   TIMER3_PRESCALE_SHIFT                          16
#define   TIMER3_MODE_MASK                       0x00000018
#define   TIMER3_MODE_SHIFT                               3
#define   TIMER3_LOAD_MASK                       0x00000004
#define   TIMER3_LOAD_SHIFT                               2
#define   TIMER3_INT_EN_MASK                     0x00000002
#define   TIMER3_INT_EN_SHIFT                             1
#define   TIMER3_START_MASK                      0x00000001
#define   TIMER3_START_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 timer3_start:1;
        u32 timer3_int_en:1;
        u32 timer3_load:1;
        u32 timer3_mode:2;
        u32 rsvd_5:11;
        u32 timer3_prescale:16;
    } b;
} timer3_ctrl_t;

#define TIMER3_VALUE                             0x0000003c
#define   TIMER3_REL_VAL_MASK                    0xffff0000
#define   TIMER3_REL_VAL_SHIFT                           16
#define   TIMER3_CUR_VAL_MASK                    0x0000ffff
#define   TIMER3_CUR_VAL_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 timer3_cur_val:16;
        u32 timer3_rel_val:16;
    } b;
} timer3_value_t;

#define TIMER4_CTRL                              0x00000040
#define   TIMER4_RESET_MASK                      0x00000002
#define   TIMER4_RESET_SHIFT                              1
#define   TIMER4_START_MASK                      0x00000001
#define   TIMER4_START_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 timer4_start:1;
        u32 timer4_reset:1;
        u32 rsvd_2:30;
    } b;
} timer4_ctrl_t;

#define TIMER4_VAL_L                             0x00000044
#define   TIMER4_VAL_LOW_MASK                    0xffffffff
#define   TIMER4_VAL_LOW_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 timer4_val_low:32;
    } b;
} timer4_val_l_t;

#define TIMER4_VAL_H                             0x00000048
#define   TIMER4_VAL_H_MASK                      0xffffffff
#define   TIMER4_VAL_H_SHIFT                              0
typedef union {
    u32 all;
    struct {
        u32 timer4_val_h:32;
    } b;
} timer4_val_h_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ wd_timer_t wd_timer;
    /* 0x0004 */ wdt_ctrl_t wdt_ctrl;
    /* 0x0008 */ wdt_rel_t wdt_rel;
    /* 0x000c */ wdt_int_t wdt_int;
    /* 0x0010 */ u32 rsvd_10 [3];
    /* 0x001c */ timer_int_t timer_int;
    /* 0x0020 */ timer0_ctrl_t timer0_ctrl;
    /* 0x0024 */ timer0_value_t timer0_value;
    /* 0x0028 */ timer1_ctrl_t timer1_ctrl;
    /* 0x002c */ timer1_value_t timer1_value;
    /* 0x0030 */ timer2_ctrl_t timer2_ctrl;
    /* 0x0034 */ timer2_value_t timer2_value;
    /* 0x0038 */ timer3_ctrl_t timer3_ctrl;
    /* 0x003c */ timer3_value_t timer3_value;
    /* 0x0040 */ timer4_ctrl_t timer4_ctrl;
    /* 0x0044 */ timer4_val_l_t timer4_val_l;
    /* 0x0048 */ timer4_val_h_t timer4_val_h;
} cpu_timer_regs_t;


#endif /* rev 5 */