//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _UART_SHARE_REGISTER_H_
#define _UART_SHARE_REGISTER_H_

#define UART_INTERRUPT_STATUS                    0x00000000
#define   OVERRUN_ERR_INT_MASK                   0x00000040
#define   OVERRUN_ERR_INT_SHIFT                           6
#define   PARITY_ERR_INT_MASK                    0x00000020
#define   PARITY_ERR_INT_SHIFT                            5
#define   FRAME_ERR_INT_MASK                     0x00000010
#define   FRAME_ERR_INT_SHIFT                             4
#define   BREAK_INT_MASK                         0x00000008
#define   BREAK_INT_SHIFT                                 3
#define   RXFF_RDY_INT_MASK                      0x00000004
#define   RXFF_RDY_INT_SHIFT                              2
#define   TX_EMPTY_INT_MASK                      0x00000002
#define   TX_EMPTY_INT_SHIFT                              1
#define   TXFF_RDY_INT_MASK                      0x00000001
#define   TXFF_RDY_INT_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 txff_rdy_int:1;
        u32 tx_empty_int:1;
        u32 rxff_rdy_int:1;
        u32 break_int:1;
        u32 frame_err_int:1;
        u32 parity_err_int:1;
        u32 overrun_err_int:1;
        u32 rsvd_7:25;
    } b;
} uart_interrupt_status_t;

#define UART_INTERRUPT_MASK                      0x00000004
#define   OVERRUN_ERR_INTM_MASK                  0x00000040
#define   OVERRUN_ERR_INTM_SHIFT                          6
#define   PARITY_ERR_INTM_MASK                   0x00000020
#define   PARITY_ERR_INTM_SHIFT                           5
#define   FRAME_ERR_INTM_MASK                    0x00000010
#define   FRAME_ERR_INTM_SHIFT                            4
#define   BREAK_INTM_MASK                        0x00000008
#define   BREAK_INTM_SHIFT                                3
#define   RXFF_RDY_INTM_MASK                     0x00000004
#define   RXFF_RDY_INTM_SHIFT                             2
#define   TX_EMPTY_INTM_MASK                     0x00000002
#define   TX_EMPTY_INTM_SHIFT                             1
#define   TXFF_RDY_INTM_MASK                     0x00000001
#define   TXFF_RDY_INTM_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 txff_rdy_intm:1;
        u32 tx_empty_intm:1;
        u32 rxff_rdy_intm:1;
        u32 break_intm:1;
        u32 frame_err_intm:1;
        u32 parity_err_intm:1;
        u32 overrun_err_intm:1;
        u32 rsvd_7:25;
    } b;
} uart_interrupt_mask_t;

#define UR_TX_FIFO                               0x00000008
#define   TXFF_WPO_MASK                          0x000000ff
#define   TXFF_WPO_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 txff_wpo:8;
        u32 rsvd_8:24;
    } b;
} ur_tx_fifo_t;

#define UART_CONTROL                             0x00000010
#define   CHIPDBG_ENABLE_MASK                    0x08000000
#define   CHIPDBG_ENABLE_SHIFT                           27
#define   CHIPDBG_MODE_MASK                      0x04000000
#define   CHIPDBG_MODE_SHIFT                             26
#define   FORCE_BRK_MASK                         0x02000000
#define   FORCE_BRK_SHIFT                                25
#define   UR_ENABLE_MASK                         0x01000000
#define   UR_ENABLE_SHIFT                                24
#define   STOP_MASK                              0x00100000
#define   STOP_SHIFT                                     20
#define   RXFF_THHOLD_MASK                       0x000c0000
#define   RXFF_THHOLD_SHIFT                              18
#define   PMODE_MASK                             0x00030000
#define   PMODE_SHIFT                                    16
#define   DIVISOR_MASK                           0x0000ffff
#define   DIVISOR_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 divisor:16;
        u32 pmode:2;
        u32 rxff_thhold:2;
        u32 stop:1;
        u32 rsvd_21:3;
        u32 ur_enable:1;
        u32 force_brk:1;
        u32 chipdbg_mode:1;
        u32 chipdbg_enable:1;
        u32 rsvd_28:4;
    } b;
} uart_control_t;

#define UART_SCRATCH                             0x000000a0
#define   UR_SCRATCH_MASK                        0xffffffff
#define   UR_SCRATCH_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 ur_scratch:32;
    } b;
} uart_scratch_t;

#define URSH_RX_CPU_SEL                          0x00000100
#define   UR_SH_RX_CPU_SEL_MASK                  0x0000000f
#define   UR_SH_RX_CPU_SEL_SHIFT                          0

typedef union {
    u32 all;
    struct {
        u32 ur_sh_rx_cpu_sel:4;
        u32 rsvd_4:28;
    } b;
} ursh_rx_cpu_sel_t;

#define URSH_CPU1_TXFF_BYTE_COUNT                0x00000110
#define   CPU1_TXFF_BC_MASK                      0x000000ff
#define   CPU1_TXFF_BC_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cpu1_txff_bc:8;
        u32 rsvd_8:24;
    } b;
} ursh_cpu1_txff_byte_count_t;

#define URSH_CPU2_TXFF_BYTE_COUNT                0x00000114
#define   CPU2_TXFF_BC_MASK                      0x000000ff
#define   CPU2_TXFF_BC_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cpu2_txff_bc:8;
        u32 rsvd_8:24;
    } b;
} ursh_cpu2_txff_byte_count_t;

#define URSH_CPU3_TXFF_BYTE_COUNT                0x00000118
#define   CPU3_TXFF_BC_MASK                      0x000000ff
#define   CPU3_TXFF_BC_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cpu3_txff_bc:8;
        u32 rsvd_8:24;
    } b;
} ursh_cpu3_txff_byte_count_t;

#define URSH_CPU4_TXFF_BYTE_COUNT                0x0000011c
#define   CPU4_TXFF_BC_MASK                      0x000000ff
#define   CPU4_TXFF_BC_SHIFT                              0

typedef union {
    u32 all;
    struct {
        u32 cpu4_txff_bc:8;
        u32 rsvd_8:24;
    } b;
} ursh_cpu4_txff_byte_count_t;

#define URSH_CPU1_TX_FIFO                        0x00000140
#define   CPU1_TXFF_WPO_MASK                     0x000000ff
#define   CPU1_TXFF_WPO_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 cpu1_txff_wpo:8;
        u32 rsvd_8:24;
    } b;
} ursh_cpu1_tx_fifo_t;

#define URSH_CPU2_TX_FIFO                        0x00000144
#define   CPU2_TXFF_WPO_MASK                     0x000000ff
#define   CPU2_TXFF_WPO_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 cpu2_txff_wpo:8;
        u32 rsvd_8:24;
    } b;
} ursh_cpu2_tx_fifo_t;

#define URSH_CPU3_TX_FIFO                        0x00000148
#define   CPU3_TXFF_WPO_MASK                     0x000000ff
#define   CPU3_TXFF_WPO_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 cpu3_txff_wpo:8;
        u32 rsvd_8:24;
    } b;
} ursh_cpu3_tx_fifo_t;

#define URSH_CPU4_TX_FIFO                        0x0000014c
#define   CPU4_TXFF_WPO_MASK                     0x000000ff
#define   CPU4_TXFF_WPO_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 cpu4_txff_wpo:8;
        u32 rsvd_8:24;
    } b;
} ursh_cpu4_tx_fifo_t;

#define URSH_CPU1_INTR_STS_1                     0x00000170
#define   CPU1_RXFF_RPO_MASK                     0x000000ff
#define   CPU1_RXFF_RPO_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 cpu1_rxff_rpo:8;
        u32 rsvd_8:24;
    } b;
} ursh_cpu1_intr_sts_1_t;

#define URSH_CPU1_INTR_STS_2                     0x00000174
#define   CPU1_RXFF_CNT_MASK                     0x00001f00
#define   CPU1_RXFF_CNT_SHIFT                             8
#define   CPU1_RXFF_RDY_INTS_MASK                0x00000001
#define   CPU1_RXFF_RDY_INTS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 cpu1_rxff_rdy_ints:1;
        u32 rsvd_1:7;
        u32 cpu1_rxff_cnt:5;
        u32 rsvd_13:19;
    } b;
} ursh_cpu1_intr_sts_2_t;

#define URSH_CPU2_INTR_STS_1                     0x00000178
#define   CPU2_RXFF_RPO_MASK                     0x000000ff
#define   CPU2_RXFF_RPO_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 cpu2_rxff_rpo:8;
        u32 rsvd_8:24;
    } b;
} ursh_cpu2_intr_sts_1_t;

#define URSH_CPU2_INTR_STS_2                     0x0000017c
#define   CPU2_RXFF_CNT_MASK                     0x00001f00
#define   CPU2_RXFF_CNT_SHIFT                             8
#define   CPU2_RXFF_RDY_INTS_MASK                0x00000001
#define   CPU2_RXFF_RDY_INTS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 cpu2_rxff_rdy_ints:1;
        u32 rsvd_1:7;
        u32 cpu2_rxff_cnt:5;
        u32 rsvd_13:19;
    } b;
} ursh_cpu2_intr_sts_2_t;

#define URSH_CPU3_INTR_STS_1                     0x00000180
#define   CPU3_RXFF_RPO_MASK                     0x000000ff
#define   CPU3_RXFF_RPO_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 cpu3_rxff_rpo:8;
        u32 rsvd_8:24;
    } b;
} ursh_cpu3_intr_sts_1_t;

#define URSH_CPU3_INTR_STS_2                     0x00000184
#define   CPU3_RXFF_CNT_MASK                     0x00001f00
#define   CPU3_RXFF_CNT_SHIFT                             8
#define   CPU3_RXFF_RDY_INTS_MASK                0x00000001
#define   CPU3_RXFF_RDY_INTS_SHIFT                        0

typedef union {
    u32 all;
    struct {
        u32 cpu3_rxff_rdy_ints:1;
        u32 rsvd_1:7;
        u32 cpu3_rxff_cnt:5;
        u32 rsvd_13:19;
    } b;
} ursh_cpu3_intr_sts_2_t;

#define URSH_CPU4_INTR_STS_1                     0x00000188
#define   CPU4_RXFF_RPO_MASK                     0x000000ff
#define   CPU4_RXFF_RPO_SHIFT                             0

typedef union {
    u32 all;
    struct {
        u32 cpu4_rxff_rpo:8;
        u32 rsvd_8:24;
    } b;
} ursh_cpu4_intr_sts_1_t;

#define URSH_CPU4_INTR_STS_2                     0x0000018c
#define   CPU4_RXFF_CNT_MASK                     0x00001f00
#define   CPU4_RXFF_CNT_SHIFT                             8
#define   CPU4_RXFF_RDY_INTS_MASK                0x00000001
#define   CPU4_RXFF_RDY_INTS_SHIFT                        0
typedef union {
    u32 all;
    struct {
        u32 cpu4_rxff_rdy_ints:1;
        u32 rsvd_1:7;
        u32 cpu4_rxff_cnt:5;
        u32 rsvd_13:19;
    } b;
} ursh_cpu4_intr_sts_2_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ uart_interrupt_status_t uart_interrupt_status;
    /* 0x0004 */ uart_interrupt_mask_t uart_interrupt_mask;
    /* 0x0008 */ ur_tx_fifo_t ur_tx_fifo;
    /* 0x000c */ u32 rsvd_c;
    /* 0x0010 */ uart_control_t uart_control;
    /* 0x0014 */ u32 rsvd_14 [35];
    /* 0x00a0 */ uart_scratch_t uart_scratch;
    /* 0x00a4 */ u32 rsvd_a4 [23];
    /* 0x0100 */ ursh_rx_cpu_sel_t ursh_rx_cpu_sel;
    /* 0x0104 */ u32 rsvd_104 [3];
    /* 0x0110 */ ursh_cpu1_txff_byte_count_t ursh_cpu1_txff_byte_count;
    /* 0x0114 */ ursh_cpu2_txff_byte_count_t ursh_cpu2_txff_byte_count;
    /* 0x0118 */ ursh_cpu3_txff_byte_count_t ursh_cpu3_txff_byte_count;
    /* 0x011c */ ursh_cpu4_txff_byte_count_t ursh_cpu4_txff_byte_count;
    /* 0x0120 */ u32 rsvd_120 [8];
    /* 0x0140 */ ursh_cpu1_tx_fifo_t ursh_cpu1_tx_fifo;
    /* 0x0144 */ ursh_cpu2_tx_fifo_t ursh_cpu2_tx_fifo;
    /* 0x0148 */ ursh_cpu3_tx_fifo_t ursh_cpu3_tx_fifo;
    /* 0x014c */ ursh_cpu4_tx_fifo_t ursh_cpu4_tx_fifo;
    /* 0x0150 */ u32 rsvd_150 [8];
    /* 0x0170 */ ursh_cpu1_intr_sts_1_t ursh_cpu1_intr_sts_1;
    /* 0x0174 */ ursh_cpu1_intr_sts_2_t ursh_cpu1_intr_sts_2;
    /* 0x0178 */ ursh_cpu2_intr_sts_1_t ursh_cpu2_intr_sts_1;
    /* 0x017c */ ursh_cpu2_intr_sts_2_t ursh_cpu2_intr_sts_2;
    /* 0x0180 */ ursh_cpu3_intr_sts_1_t ursh_cpu3_intr_sts_1;
    /* 0x0184 */ ursh_cpu3_intr_sts_2_t ursh_cpu3_intr_sts_2;
    /* 0x0188 */ ursh_cpu4_intr_sts_1_t ursh_cpu4_intr_sts_1;
    /* 0x018c */ ursh_cpu4_intr_sts_2_t ursh_cpu4_intr_sts_2;
} uart_share_register_regs_t;


#endif /* rev 0 */