//-----------------------------------------------------------------------------
//
//		Copyright(c) 2016-2019 Innogrit Corporation
//			All Rights reserved.
//
// The confidential and proprietary information contained in this file may
// only be used by a person authorized under and to the extent permitted
// by a subsisting licensing agreement from Innogrit Corporation.
//
//-----------------------------------------------------------------------------

/*
 *
 * >- Project: Rainier
 *
 * >- This file is generated by the register_parser.py, please do not modify. -<
 *
 */
#ifndef _CPU_VIC_H_
#define _CPU_VIC_H_

#define IRQ_STATUS                               0x00000000
#define   IRQSTATUS_MASK                         0xffffffff
#define   IRQSTATUS_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 irqstatus:32;
    } b;
} irq_status_t;

#define FIQ_STATUS                               0x00000004
#define   FIQSTATUS_MASK                         0xffffffff
#define   FIQSTATUS_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 fiqstatus:32;
    } b;
} fiq_status_t;

#define RAW_INTERRUPT_STATUS                     0x00000008
#define   RAWINTR_MASK                           0xffffffff
#define   RAWINTR_SHIFT                                   0

typedef union {
    u32 all;
    struct {
        u32 rawintr:32;
    } b;
} raw_interrupt_status_t;

#define INTERRUPT_SELECT                         0x0000000c
#define   INTSELECT_MASK                         0xffffffff
#define   INTSELECT_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 intselect:32;
    } b;
} interrupt_select_t;

#define INTERRUPT_ENABLE                         0x00000010
#define   INTENABLE_MASK                         0xffffffff
#define   INTENABLE_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 intenable:32;
    } b;
} interrupt_enable_t;

#define INTERRUPT_ENABLE_CLEAR                   0x00000014
#define   INTENCLEAR_MASK                        0xffffffff
#define   INTENCLEAR_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 intenclear:32;
    } b;
} interrupt_enable_clear_t;

#define INTERRUPT_GROUP                          0x00000018
#define   INTGRPSEL_MASK                         0xffffffff
#define   INTGRPSEL_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 intgrpsel:32;
    } b;
} interrupt_group_t;

#define PRIORITY_WEIGHTING_OF_GROUP              0x0000001c
#define   WEIGHT_B_MASK                          0x00000700
#define   WEIGHT_B_SHIFT                                  8
#define   WEIGHT_A_MASK                          0x0000000f
#define   WEIGHT_A_SHIFT                                  0

typedef union {
    u32 all;
    struct {
        u32 weight_a:4;
        u32 rsvd_4:4;
        u32 weight_b:3;
        u32 rsvd_11:21;
    } b;
} priority_weighting_of_group_t;

#define CONTROL_AND_STATUS                       0x00000020
#define   BYPASS_IRQ_ARB_MASK                    0x00000002
#define   BYPASS_IRQ_ARB_SHIFT                            1
#define   ASSIGN_GRP_DONE_MASK                   0x00000001
#define   ASSIGN_GRP_DONE_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 assign_grp_done:1;
        u32 bypass_irq_arb:1;
        u32 rsvd_2:30;
    } b;
} control_and_status_t;

#define VECTOR_ADDRESS_0                         0x00000100
#define   VECTADDR0_MASK                         0xffffffff
#define   VECTADDR0_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 vectaddr0:32;
    } b;
} vector_address_0_t;

#define VECTOR_ADDRESS_1                         0x00000104
#define   VECTADDR1_MASK                         0xffffffff
#define   VECTADDR1_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 vectaddr1:32;
    } b;
} vector_address_1_t;

#define VECTOR_ADDRESS_2                         0x00000108
#define   VECTADDR2_MASK                         0xffffffff
#define   VECTADDR2_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 vectaddr2:32;
    } b;
} vector_address_2_t;

#define VECTOR_ADDRESS_3                         0x0000010c
#define   VECTADDR3_MASK                         0xffffffff
#define   VECTADDR3_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 vectaddr3:32;
    } b;
} vector_address_3_t;

#define VECTOR_ADDRESS_4                         0x00000110
#define   VECTADDR4_MASK                         0xffffffff
#define   VECTADDR4_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 vectaddr4:32;
    } b;
} vector_address_4_t;

#define VECTOR_ADDRESS_5                         0x00000114
#define   VECTADDR5_MASK                         0xffffffff
#define   VECTADDR5_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 vectaddr5:32;
    } b;
} vector_address_5_t;

#define VECTOR_ADDRESS_6                         0x00000118
#define   VECTADDR6_MASK                         0xffffffff
#define   VECTADDR6_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 vectaddr6:32;
    } b;
} vector_address_6_t;

#define VECTOR_ADDRESS_7                         0x0000011c
#define   VECTADDR7_MASK                         0xffffffff
#define   VECTADDR7_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 vectaddr7:32;
    } b;
} vector_address_7_t;

#define VECTOR_ADDRESS_8                         0x00000120
#define   VECTADDR8_MASK                         0xffffffff
#define   VECTADDR8_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 vectaddr8:32;
    } b;
} vector_address_8_t;

#define VECTOR_ADDRESS_9                         0x00000124
#define   VECTADDR9_MASK                         0xffffffff
#define   VECTADDR9_SHIFT                                 0

typedef union {
    u32 all;
    struct {
        u32 vectaddr9:32;
    } b;
} vector_address_9_t;

#define VECTOR_ADDRESS_10                        0x00000128
#define   VECTADDR10_MASK                        0xffffffff
#define   VECTADDR10_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr10:32;
    } b;
} vector_address_10_t;

#define VECTOR_ADDRESS_11                        0x0000012c
#define   VECTADDR11_MASK                        0xffffffff
#define   VECTADDR11_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr11:32;
    } b;
} vector_address_11_t;

#define VECTOR_ADDRESS_12                        0x00000130
#define   VECTADDR12_MASK                        0xffffffff
#define   VECTADDR12_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr12:32;
    } b;
} vector_address_12_t;

#define VECTOR_ADDRESS_13                        0x00000134
#define   VECTADDR13_MASK                        0xffffffff
#define   VECTADDR13_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr13:32;
    } b;
} vector_address_13_t;

#define VECTOR_ADDRESS_14                        0x00000138
#define   VECTADDR14_MASK                        0xffffffff
#define   VECTADDR14_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr14:32;
    } b;
} vector_address_14_t;

#define VECTOR_ADDRESS_15                        0x0000013c
#define   VECTADDR15_MASK                        0xffffffff
#define   VECTADDR15_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr15:32;
    } b;
} vector_address_15_t;

#define VECTOR_ADDRESS_16                        0x00000140
#define   VECTADDR16_MASK                        0xffffffff
#define   VECTADDR16_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr16:32;
    } b;
} vector_address_16_t;

#define VECTOR_ADDRESS_17                        0x00000144
#define   VECTADDR17_MASK                        0xffffffff
#define   VECTADDR17_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr17:32;
    } b;
} vector_address_17_t;

#define VECTOR_ADDRESS_18                        0x00000148
#define   VECTADDR18_MASK                        0xffffffff
#define   VECTADDR18_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr18:32;
    } b;
} vector_address_18_t;

#define VECTOR_ADDRESS_19                        0x0000014c
#define   VECTADDR19_MASK                        0xffffffff
#define   VECTADDR19_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr19:32;
    } b;
} vector_address_19_t;

#define VECTOR_ADDRESS_20                        0x00000150
#define   VECTADDR20_MASK                        0xffffffff
#define   VECTADDR20_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr20:32;
    } b;
} vector_address_20_t;

#define VECTOR_ADDRESS_21                        0x00000154
#define   VECTADDR21_MASK                        0xffffffff
#define   VECTADDR21_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr21:32;
    } b;
} vector_address_21_t;

#define VECTOR_ADDRESS_22                        0x00000158
#define   VECTADDR22_MASK                        0xffffffff
#define   VECTADDR22_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr22:32;
    } b;
} vector_address_22_t;

#define VECTOR_ADDRESS_23                        0x0000015c
#define   VECTADDR23_MASK                        0xffffffff
#define   VECTADDR23_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr23:32;
    } b;
} vector_address_23_t;

#define VECTOR_ADDRESS_24                        0x00000160
#define   VECTADDR24_MASK                        0xffffffff
#define   VECTADDR24_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr24:32;
    } b;
} vector_address_24_t;

#define VECTOR_ADDRESS_25                        0x00000164
#define   VECTADDR25_MASK                        0xffffffff
#define   VECTADDR25_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr25:32;
    } b;
} vector_address_25_t;

#define VECTOR_ADDRESS_26                        0x00000168
#define   VECTADDR26_MASK                        0xffffffff
#define   VECTADDR26_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr26:32;
    } b;
} vector_address_26_t;

#define VECTOR_ADDRESS_27                        0x0000016c
#define   VECTADDR27_MASK                        0xffffffff
#define   VECTADDR27_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr27:32;
    } b;
} vector_address_27_t;

#define VECTOR_ADDRESS_28                        0x00000170
#define   VECTADDR28_MASK                        0xffffffff
#define   VECTADDR28_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr28:32;
    } b;
} vector_address_28_t;

#define VECTOR_ADDRESS_29                        0x00000174
#define   VECTADDR29_MASK                        0xffffffff
#define   VECTADDR29_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr29:32;
    } b;
} vector_address_29_t;

#define VECTOR_ADDRESS_30                        0x00000178
#define   VECTADDR30_MASK                        0xffffffff
#define   VECTADDR30_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr30:32;
    } b;
} vector_address_30_t;

#define VECTOR_ADDRESS_31                        0x0000017c
#define   VECTADDR31_MASK                        0xffffffff
#define   VECTADDR31_SHIFT                                0

typedef union {
    u32 all;
    struct {
        u32 vectaddr31:32;
    } b;
} vector_address_31_t;

#define GROUP_A_VECTOR_ADDRESS_0                 0x00000200
#define   GRPA_VECTADDR0_MASK                    0xffffffff
#define   GRPA_VECTADDR0_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr0:32;
    } b;
} group_a_vector_address_0_t;

#define GROUP_A_VECTOR_ADDRESS_1                 0x00000204
#define   GRPA_VECTADDR1_MASK                    0xffffffff
#define   GRPA_VECTADDR1_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr1:32;
    } b;
} group_a_vector_address_1_t;

#define GROUP_A_VECTOR_ADDRESS_2                 0x00000208
#define   GRPA_VECTADDR2_MASK                    0xffffffff
#define   GRPA_VECTADDR2_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr2:32;
    } b;
} group_a_vector_address_2_t;

#define GROUP_A_VECTOR_ADDRESS_3                 0x0000020c
#define   GRPA_VECTADDR3_MASK                    0xffffffff
#define   GRPA_VECTADDR3_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr3:32;
    } b;
} group_a_vector_address_3_t;

#define GROUP_A_VECTOR_ADDRESS_4                 0x00000210
#define   GRPA_VECTADDR4_MASK                    0xffffffff
#define   GRPA_VECTADDR4_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr4:32;
    } b;
} group_a_vector_address_4_t;

#define GROUP_A_VECTOR_ADDRESS_5                 0x00000214
#define   GRPA_VECTADDR5_MASK                    0xffffffff
#define   GRPA_VECTADDR5_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr5:32;
    } b;
} group_a_vector_address_5_t;

#define GROUP_A_VECTOR_ADDRESS_6                 0x00000218
#define   GRPA_VECTADDR6_MASK                    0xffffffff
#define   GRPA_VECTADDR6_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr6:32;
    } b;
} group_a_vector_address_6_t;

#define GROUP_A_VECTOR_ADDRESS_7                 0x0000021c
#define   GRPA_VECTADDR7_MASK                    0xffffffff
#define   GRPA_VECTADDR7_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr7:32;
    } b;
} group_a_vector_address_7_t;

#define GROUP_A_VECTOR_ADDRESS_8                 0x00000220
#define   GRPA_VECTADDR8_MASK                    0xffffffff
#define   GRPA_VECTADDR8_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr8:32;
    } b;
} group_a_vector_address_8_t;

#define GROUP_A_VECTOR_ADDRESS_9                 0x00000224
#define   GRPA_VECTADDR9_MASK                    0xffffffff
#define   GRPA_VECTADDR9_SHIFT                            0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr9:32;
    } b;
} group_a_vector_address_9_t;

#define GROUP_A_VECTOR_ADDRESS_10                0x00000228
#define   GRPA_VECTADDR10_MASK                   0xffffffff
#define   GRPA_VECTADDR10_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr10:32;
    } b;
} group_a_vector_address_10_t;

#define GROUP_A_VECTOR_ADDRESS_11                0x0000022c
#define   GRPA_VECTADDR11_MASK                   0xffffffff
#define   GRPA_VECTADDR11_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr11:32;
    } b;
} group_a_vector_address_11_t;

#define GROUP_A_VECTOR_ADDRESS_12                0x00000230
#define   GRPA_VECTADDR12_MASK                   0xffffffff
#define   GRPA_VECTADDR12_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr12:32;
    } b;
} group_a_vector_address_12_t;

#define GROUP_A_VECTOR_ADDRESS_13                0x00000234
#define   GRPA_VECTADDR13_MASK                   0xffffffff
#define   GRPA_VECTADDR13_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr13:32;
    } b;
} group_a_vector_address_13_t;

#define GROUP_A_VECTOR_ADDRESS_14                0x00000238
#define   GRPA_VECTADDR14_MASK                   0xffffffff
#define   GRPA_VECTADDR14_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr14:32;
    } b;
} group_a_vector_address_14_t;

#define GROUP_A_VECTOR_ADDRESS_15                0x0000023c
#define   GRPA_VECTADDR15_MASK                   0xffffffff
#define   GRPA_VECTADDR15_SHIFT                           0

typedef union {
    u32 all;
    struct {
        u32 grpa_vectaddr15:32;
    } b;
} group_a_vector_address_15_t;

#define VECTOR_ADDRESS                           0x00000f00
#define   VECTADDRESS_MASK                       0xffffffff
#define   VECTADDRESS_SHIFT                               0
typedef union {
    u32 all;
    struct {
        u32 vectaddress:32;
    } b;
} vector_address_t;


#ifndef REG_GFLD
# define REG_GFLD(val, FLD) (((u32)(val) &  FLD ## _MASK) >> FLD ## _SHIFT)
# define REG_SFLD(val, FLD) (((u32)(val) << FLD ## _SHIFT) & FLD ## _MASK)
# define REG_RMW(o, n, FLD) ((((u32)(o) & ~ FLD ## _MASK)) | (((u32)(n) << FLD ## _SHIFT)))
#endif

typedef struct {
    /* 0x0000 */ irq_status_t irq_status;
    /* 0x0004 */ fiq_status_t fiq_status;
    /* 0x0008 */ raw_interrupt_status_t raw_interrupt_status;
    /* 0x000c */ interrupt_select_t interrupt_select;
    /* 0x0010 */ interrupt_enable_t interrupt_enable;
    /* 0x0014 */ interrupt_enable_clear_t interrupt_enable_clear;
    /* 0x0018 */ interrupt_group_t interrupt_group;
    /* 0x001c */ priority_weighting_of_group_t priority_weighting_of_group;
    /* 0x0020 */ control_and_status_t control_and_status;
    /* 0x0024 */ u32 rsvd_24 [55];
    /* 0x0100 */ vector_address_0_t vector_address_0;
    /* 0x0104 */ vector_address_1_t vector_address_1;
    /* 0x0108 */ vector_address_2_t vector_address_2;
    /* 0x010c */ vector_address_3_t vector_address_3;
    /* 0x0110 */ vector_address_4_t vector_address_4;
    /* 0x0114 */ vector_address_5_t vector_address_5;
    /* 0x0118 */ vector_address_6_t vector_address_6;
    /* 0x011c */ vector_address_7_t vector_address_7;
    /* 0x0120 */ vector_address_8_t vector_address_8;
    /* 0x0124 */ vector_address_9_t vector_address_9;
    /* 0x0128 */ vector_address_10_t vector_address_10;
    /* 0x012c */ vector_address_11_t vector_address_11;
    /* 0x0130 */ vector_address_12_t vector_address_12;
    /* 0x0134 */ vector_address_13_t vector_address_13;
    /* 0x0138 */ vector_address_14_t vector_address_14;
    /* 0x013c */ vector_address_15_t vector_address_15;
    /* 0x0140 */ vector_address_16_t vector_address_16;
    /* 0x0144 */ vector_address_17_t vector_address_17;
    /* 0x0148 */ vector_address_18_t vector_address_18;
    /* 0x014c */ vector_address_19_t vector_address_19;
    /* 0x0150 */ vector_address_20_t vector_address_20;
    /* 0x0154 */ vector_address_21_t vector_address_21;
    /* 0x0158 */ vector_address_22_t vector_address_22;
    /* 0x015c */ vector_address_23_t vector_address_23;
    /* 0x0160 */ vector_address_24_t vector_address_24;
    /* 0x0164 */ vector_address_25_t vector_address_25;
    /* 0x0168 */ vector_address_26_t vector_address_26;
    /* 0x016c */ vector_address_27_t vector_address_27;
    /* 0x0170 */ vector_address_28_t vector_address_28;
    /* 0x0174 */ vector_address_29_t vector_address_29;
    /* 0x0178 */ vector_address_30_t vector_address_30;
    /* 0x017c */ vector_address_31_t vector_address_31;
    /* 0x0180 */ u32 rsvd_180 [32];
    /* 0x0200 */ group_a_vector_address_0_t group_a_vector_address_0;
    /* 0x0204 */ group_a_vector_address_1_t group_a_vector_address_1;
    /* 0x0208 */ group_a_vector_address_2_t group_a_vector_address_2;
    /* 0x020c */ group_a_vector_address_3_t group_a_vector_address_3;
    /* 0x0210 */ group_a_vector_address_4_t group_a_vector_address_4;
    /* 0x0214 */ group_a_vector_address_5_t group_a_vector_address_5;
    /* 0x0218 */ group_a_vector_address_6_t group_a_vector_address_6;
    /* 0x021c */ group_a_vector_address_7_t group_a_vector_address_7;
    /* 0x0220 */ group_a_vector_address_8_t group_a_vector_address_8;
    /* 0x0224 */ group_a_vector_address_9_t group_a_vector_address_9;
    /* 0x0228 */ group_a_vector_address_10_t group_a_vector_address_10;
    /* 0x022c */ group_a_vector_address_11_t group_a_vector_address_11;
    /* 0x0230 */ group_a_vector_address_12_t group_a_vector_address_12;
    /* 0x0234 */ group_a_vector_address_13_t group_a_vector_address_13;
    /* 0x0238 */ group_a_vector_address_14_t group_a_vector_address_14;
    /* 0x023c */ group_a_vector_address_15_t group_a_vector_address_15;
    /* 0x0240 */ u32 rsvd_240 [816];
    /* 0x0f00 */ vector_address_t vector_address;
} cpu_vic_regs_t;


#endif /* rev 0 */